{"title":"John Martyn - The Church With One Bell  [1998]  [Robbie60] [FLAC","uid":6174919,"size":291325707,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:013497b4bfd05ff4f2cb9dc08129e91aa452618d&amp;dn=John+Martyn+-+The+Church+With+One+Bell++%5B1998%5D++%5BRobbie60%5D+%5BFLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robbie6ty","files":-1,"time":1297735893,"description":"John Martyn\nThe Church With One Bell\n\n\n\nLabel: Independiente\nReleased: 1998\nSource: Original CD \nSize Torrent: 277 MB\nFormat: FLAC\n\n\n\n\n\nThe eagerly awaited cover-album was released on 23rd March 1998. Uncovering a whole generation of blues classics from Portishead's Glory Box to Billy Holliday's Strange Fruit, The Church With One Bell reverberates with John's vast musical talent. John is accompanied by John Giblin (bass), Spencer Cozens (keyboards) and Arran Ahmun (drums).\n\nThe track selection was quite simple, when John and the band laughed, they chose that track - hard to imagine as many of the songs are not happy ! John's rendition of Glory Box stands out and other songs such as Small Town Talk, Strange Fruit, God's Song, Excuse Me Mister work well. On the other hand some songs just don't make the grade. This album enabled John to purchase the Church next door to his cottage where he lived.\n\nThe album was recorded in one week in Glasgow and was produced by blues producer Norman Dayron. Unlike many artists John doesn't just cover a song, he re-writes it and makes it all his own. Church received wide acclaim in the USA but unfortunately was less well received in the UK. In time people will realise what a great album this is.\n\nExcuse Me Mister was released as a CD single with additional live tracks.\n\nThe CD has a hidden bonus track after a 50 seconds break attached to the last track. It is a slower and remixed version without synthesizer of &quot;How Fortunate The Man With None&quot;.\n\n\n\n\n\n\nPersonnel\n\nJohn Martyn - vocals, guitar\nJohn Giblin - bass\nSpencer Cozens - keyboards\nArran Ahmun - drums\n\n\n\n\n\nTrack Listing\n\n1.He's Got All The Whiskey (B. Charles) 3:20 \n2.God's Song (R. Newman) 3:21 \n3.How Fortunate The Man With None (Dead Can Dance. lyrics by B. Brecht) 5:08 \n4.Small Town Talk (B. Charles, R. Danko) 2:53 \n5.Excuse Me Mister (B. Harper) 4:39\n6.Strange Fruit (L. Allen) 4:03\n7.The Sky Is Crying (E. James, M. Robinson,/ C. Lewis) 4:03\n8.Glory Box (G. Barrow, B. Gibbons, A. Utley) 5:44 \n9.Feel So Bad (S. Hopkins) 3:30\n10.Death Don't Have No Mercy (G. Davis) 5:46 \n11.How Fortunate The Man With None (alternative version) (Hidden Track) 5:00\n","torrent":{"xt":"urn:btih:013497b4bfd05ff4f2cb9dc08129e91aa452618d","amp;dn":"John+Martyn+-+The+Church+With+One+Bell++%5B1998%5D++%5BRobbie60%5D+%5BFLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"013497b4bfd05ff4f2cb9dc08129e91aa452618d","infoHashBuffer":{"type":"Buffer","data":[1,52,151,180,191,208,95,244,242,203,157,192,129,41,233,26,164,82,97,141]},"announce":[],"urlList":[]}}