{"title":"Michael Jackson 1958-2009 - The Memorial Service [HDTV 1080i][DD","uid":5028872,"size":17938092944,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:0159f2a578687f971b17b375cf0715b28fbbe15b&amp;dn=Michael+Jackson+1958-2009+-+The+Memorial+Service+%5BHDTV+1080i%5D%5BDD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"josvila","files":-1,"time":1248819859,"description":"Michael Jackson 1958-2009 - The Memorial Service [HDTV 1080i][DD 5.1][+Subs] By josvila\n &lt;a href=&quot;\nhttp://michaeljacksonfuneral.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://michaeljacksonfuneral.org/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.msnbc.msn.com/id/31666892/ns/entertainment-music/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.msnbc.msn.com/id/31666892/ns/entertainment-music/&lt;/a&gt;\n\nOriginal Source: HDTV 1080i\nRun Time: 2:43:45\nAspect Ratio: 16:9\nBitrate: 14266 kbit/s\nFramerate: 29.97fps\nAudio: AC3, 384 Kbps, 48 KHz, Dolby Digital 5.1\nSource picture resolution: 1920x1080\nFile Type: .ts\nVideo: MPEG2\nTotal Video Size: 16.7 GB\n============================\n============================\n\nThe celebration of Michael Jackson ended on an emotional note when his rarely seen daughter, Paris, 11, stepped up to the microphone in tears to remember her father.\n\nClick to watch complete Memorial Service video replay\n\n&quot;Ever since I was born, Daddy has been the best father you could ever imagine,&quot; she said, surrounded by aunts Janet and La Toya Jackson. &quot;And I just want to say I love him so much.&quot; \n\nThroughout the tribute, a single spotlight shone on Jackson's gold casket inside the Staples Center, where stars and thousands of fans gathered to celebrate the singer. \n\nJermaine Jackson thanked the crowd for attending the public memorial for his brother. \n\n&quot;As you know, I'm lost for words. I was his voice and his backbone,&quot; he said. &quot;We thank you. That's all I can say. We thank you very much.&quot; \n\nR&amp;B star Usher broke down in tears at the end of his performance of Jackson's 1991 song Gone Too Soon and hung his head as he looked over at his idol's casket. Jackson's siblings stood up to embrace the singer. \n\nBrooke Shields also struggled to keep her composure as she recalled her bond with the singer. She said that his favorite song, Smile, was appropriate for the occasion. \n\n&quot;There is a line that says, 'Smile when your heart is aching.' And though our hearts are aching, we need to look up, where (Michael) is undoubtedly perched in a crescent moon, and we need to smile,&quot; Shields said. \n\nRep. Sheila Jackson Lee (D-Texas) called Jackson a &quot;good Samaritan&quot; and revealed a resolution she introduced in the House of Representatives that would recognize the singer as &quot;an American legend and musical icon.&quot; \n\nThe Rev. Al Sharpton addressed Jackson's children in the front row - Paris, Michael Jr., 12, and Prince Michael, 7 - directly, telling them that their father was an inspiration to the African-American community. \n\n&quot;There wasn't nothing strange about your daddy. But it was strange what he had to deal with. But he dealt with it anyway. He dealt with it for us. Some came here today to say goodbye. I came here to say thank you,&quot; Sharpton said. \n\nSharpton joined John Mayer, Jennifer Hudson, Lionel Richie, Queen Latifah and Mariah Carey in celebrating the singer. Mayer, Hudson, Richie and Carey performed, while Latifah read a poem by Maya Angelou. \n\nMotown legend Smokey Robinson opened the tribute by reading statements from Diana Ross and Nelson Mandela, who were not present for the service. After a brief pause, Jackson's brothers - Jackie, Tito, Jermaine, Marlon and Randy - carried the singer's casket, adorned with a spray of red flowers, onstage while a gospel choir sang. \n\nInside the official program for the service, Jackson's family and friends offered their parting words to the singer. \n\n&quot;I watched the light in Michael's eyes fade as he faced trials and tribulations for being misunderstood,&quot; Tito Jackson wrote. &quot;Michael kept going with a smile and a grace of simply keeping what he stands for and believes in. Michael has left me and my brothers a legacy, a part of us being a part of history. I am proud to be his brother.&quot; \n\nSister La Toya recalled her brother's early frustrations in the music business. \n\n&quot;Michael, I recall you sitting on a chair in your bedroom staring at the television watching the 1980 Grammy awards show, crying to me because you had won only one Grammy award, and you said, 'Watch, La Toya. My next record I'm going to sell more records and win more Grammys than anyone in the history of music. I will be the biggest and greatest entertainer of all time,' &quot; she wrote. &quot;Mike, I love you deeply, and I can't wait to see you perform again. Keep the magic going!!!&quot; \n\nThe Jackson family's motorcade arrived at the Staples Center just before 1 p.m. ET/10 a.m. PT. A short, private memorial service for Jackson was held Tuesday morning at Forest Lawn Cemetery Memorial Park in Hollywood Hills. \n\nFans inside and outside of the Staples Center shared their memories of the star as well as tales of securing memorial tickets. \n\nActor Mickey Rooney, 88, and his wife, Jan, attended the ceremony. \n\n&quot;He was wonderful and a great entertainer. We liked everything about him,&quot; said Mickey, &quot;He used to call my wife and sing Smile.&quot; \n\nJan added, &quot;I do Smile in our show, in our two-person musical. So we have a little in common there.&quot; \n\nJoseph Lemire of Detroit was one of the lucky few to score a ticket, but a 30-hour trip from China put a wrench in his plans to pick up his tickets by the 6 p.m. deadline Monday. His flight didn't arrive in L.A. until 10 p.m., but he arranged for a colleague to get his tickets, which he shared with her. \n\nDespite being halfway around the world, Lemire said there was no way he was going to miss the Jackson celebration. \n\n&quot;They are talking about a billion people watching. ... I don't know these other people, but we are all here for the good of something,&quot; he said. &quot;I remember I was driving when I heard about Elvis. You don't remember how he died, you remember his music. It is going to be the same thing for Michael.&quot; \n\nAkiko Seno, 25, from Kanagawa, Japan, came to L.A. four days ago without a ticket. She was standing on a street corner outside the perimeter with a sign that said &quot;Spare ticket, any spare ticket.&quot; A woman walking down the street gave her a ticket and a hug. When asked why she came, she responded in broken English, &quot;It is because I am a Michael Jackson fan, a big fan.&quot; She was crying on and off and mascara was running down both cheeks. &quot;Happy cry,&quot; she said. \n\nWHO SPOKE, WHO SANG \n\nSmokey Robinson (reading letter from Diana Ross) \nAndrae Crouch Choir, We Are Going to See the King \nPastor Lucious Smith (family friend) \nMariah Carey and Trey Lorenz, I'll Be There \nQueen Latifah \nLionel Richie, Jesus Is Love \nBerry Gordy, founder, Motown Records \nStevie Wonder, Never Dreamed You'd Leave in Summer \nKobe Bryant and Earvin &quot;Magic&quot; Johnson \nJennifer Hudson, Will You Be There \nRev. Al Sharpton \nJohn Mayer, Human Nature \nBrooke Shields \nJermaine Jackson, Smile \nBernice King and Martin Luther King III \nRep. Sheila Jackson Lee (D-Texas) \nUsher, Gone Too Soon \nSmokey Robinson \nShaheen Jafargholi (Britain's Got Talent), Who's Lovin' You Now \nKenny Ortega (director of Jackson's planned London concerts) \nJackson's concert singers, We Are the World and Heal the World \nJermaine Jackson \nMarlon Jackson \nParis Michael Katherine Jackson \nPastor Lucious Smith \n\nContributing: Scott Bowles, Kelley L. Carter, Kelly Carter, Edna Gundersen, Bill Keveney, William M. Welch, Chris Woodyard and The Associated Press \n","torrent":{"xt":"urn:btih:0159f2a578687f971b17b375cf0715b28fbbe15b","amp;dn":"Michael+Jackson+1958-2009+-+The+Memorial+Service+%5BHDTV+1080i%5D%5BDD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0159f2a578687f971b17b375cf0715b28fbbe15b","infoHashBuffer":{"type":"Buffer","data":[1,89,242,165,120,104,127,151,27,23,179,117,207,7,21,178,143,187,225,91]},"announce":[],"urlList":[]}}