{"title":"Hubert Sumlin About Them Shoes(blues)(mp3@320)[rogercc]","uid":6307519,"size":131726561,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:02b731a64ac3f4c2c8f43c34ae90def82413b8af&amp;dn=Hubert+Sumlin+About+Them+Shoes%28blues%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rogercc1","files":19,"time":1302398838,"description":"HUBERT SUMLIN ABOUT THEM SHOES\nReleased : 24. January 2005\nLabel: Rykodisc/Tone Call\nFormat: Mp3@320\n\n\nOne of the key architects of the Chicago blues sound, guitar master Hubert Sumlin is probably best known for his wiry, angular phases on Howlin' Wolf classics like &quot;Smokestack Lightnin'&quot; and &quot;I Asked for Water.&quot; But Sumlin also worked with Muddy Waters, and About Them Shoes pays overt homage to Chicago's favorite blues son with a set list full of Waters's originals and tunes written for Waters by Willie Dixon (the great songwriter, bassist, and Chicago session man).\n\nAbout Them Shoes finds Sumlin brings on a distinguished roster of guests, including drummer Levon Helm, harmonica player James Cotton, vocalist David Johansen, and six-string godheads Eric Clapton and Keith Richards. Clapton, Richards, and Johansen lend some fine vocal tracks (Johansen's Wolf-like take on &quot;Walkin' Thru the Park&quot; is especially notable), but Sumlin takes the spotlight here. The veteran still throws out stinging leads, distinctive melody lines, and quick, perfectly crafted embellishments that drip with blues essence. The end result is a fine tribute to Waters, and to Sumlin's own towering contribution to the genre.\n\nTracklist:\n1. I'm Ready\n2. Still a Fool\n3. She's Into Something\n4. Iodine in My Coffee\n5. Look What You've Done\n6. Come Home Baby\n7. Evil\n8. Long Distance Call\n9. Same Thing, The\n10. Don't Go No Farther\n11. I Love the Life I Live, I Live the Life I Love\n12. Walkin' Thru the Park\n13. This Is the End, Little Girl\n\nRecording information: Showplace Studios, NJ (10/2002); Studio L, CT (10/2002).\n\n\nPersonnel: Hubert Sumlin (vocals, guitar, background vocals); Hubert Sumlin; George Receli (vocals, drums, percussion); George Recile (vocals, drums); Blondie Chaplin (vocals, percussion, background vocals); Nathaniel Peterson, Jr., Nathaniel Peterson (vocals); David Maxwell (guitar, piano); Mudcat Ward (bass guitar); Keith Richards (vocals, guitar, background vocals); Eric Clapton (vocals, guitar); Paul Oscher (vocals, slide guitar, harmonica); David Johansen (vocals); Bob Margolin (guitar); James Cotton (harmonica); Levon Helm (drums).\n\n","torrent":{"xt":"urn:btih:02b731a64ac3f4c2c8f43c34ae90def82413b8af","amp;dn":"Hubert+Sumlin+About+Them+Shoes%28blues%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02b731a64ac3f4c2c8f43c34ae90def82413b8af","infoHashBuffer":{"type":"Buffer","data":[2,183,49,166,74,195,244,194,200,244,60,52,174,144,222,248,36,19,184,175]},"announce":[],"urlList":[]}}