{"title":"Poozies...Raise Your Head; A Retrospective(200)[FLAC]","uid":6172766,"size":392856581,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:02e763d3da74d4a9237305acb4fda9728db42b4b&amp;dn=Poozies...Raise+Your+Head%3B+A+Retrospective%28200%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":18,"time":1297648788,"description":" &lt;a href=&quot;http://static.rateyourmusic.com/album_images/693cc086c60eab434d3c424ebbe4aa8a/890811.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://static.rateyourmusic.com/album_images/693cc086c60eab434d3c424ebbe4aa8a/890811.jpg&lt;/a&gt;\n\n2000 Raise Your Head (A Retrospective)    CD  Compass 7 4290 2 \n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1 The Widow   4:18 \n2 Mr Grapes   4:42 \n3 We Built Fires   6:18 \n4 The Mountaineer's Set   5:02 \n5 Honesty   6:17 \n6 Willie's Old Trousers   5:24 \n7 Another Train   3:39 \n8 Hey How My Johnny Lad   4:28 \n9 The Bay Tree Set   6:05 \n10 The Company of Women   3:44 \n11 Poncho and Lefty   5:39 \n12 Ma Plaid/Freya Dances   7:07 \n13 Maid of Llanwellyn/Emma and Jamie's Wedding   5:48 \n14 In Another Life \n\n\nThis somewhat premature (three albums and one EP to make up a greatest-hits set) retrospective confirms what I've felt about The Poozies all along since I discovered them in early 1999. Up until 1998, The Poozies have been more interesting than great. The Tweed-Macmaster-Seddon lineup of harps and accordions is impeccable instrumentally, and they are all excellent harmony singers, but they sorely needed that little bit of magic to make them truly great instead of merely good. Sally Barker (guitarist and lead singer for the first two Poozies albums, Chantoozies and Dansoozies) was pleasant, but her generic folk voice just didn't ignite any sparks.\nKate Rusby was that little bit of magic the group needed. Her exuberant vocal style, with a sensual, husky low end and a beautiful, joyful high register, provided The Poozies with much-needed fire. And the Rusby-Tweed-Macmaster-Seddon lineup became that rarity -- a completely equal partnership, Rusby offering up vocal prowess and personality while The Poozies provided Rusby with the best songs, vocal harmonies, and instrumental accompaniment Rusby had had up to that point.\n\nIt's a shame that this lineup only produced one album, 1998's Infinite Blue (as superlative as it is), and Raise Your Head only culls two tracks from this album. Not surprising, though, because it appears that Raise Your Head aims to supplement The Poozies American catalogue. Since Infinite Blue is still in print but Chantoozies is only available as an import (and I have yet to spot Dansoozies anywhere), Raise Your Head serves as a kind of &quot;Poozies with Sally Barker&quot; overview.\n\nOn the pre-Rusby tracks, the instrumental work is always nice, but once again the gruop was hurt by Barker's somewhat bland lead-vocal work. Raise Your Head's attraction to me are the two tracks pulled from an EP never released on these shores. &quot;The Widow&quot; is the best vocal arrangement this group has done yet, Rusby's beautiful, low voice accompanied by the intricately woven voices of the other Poozies. In a word, stunning. And the instrumental &quot;Mr. Grapes&quot; is another one of those dizzyingly delicious Poozie instrumentals, a swirl of harps and accordion, sonically beautiful, further aided by this group's unique attention to rhythm, which makes even its folksy instrumentals groove as much as any guitar anthem.\n\nRusby has now departed the group, and it's too bad this collection doesn't include any new material from the new Poozies lineup, Mary Macmaster, Patsy Seddon and Karen Tweed with new member Eilidh Shaw. I await the next step with interest. For now, Raise Your Head is a good introduction to the group for people who have yet to get a taste of The Poozies. The two EP tracks really were worth the whole price (and my rating). I'd say that if you have this and Infinite Blue, you've already heard the group's best output so far. \n\n\ncd ripped by dBpoweramp\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2011/02/12/the-poozies/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2011/02/12/the-poozies/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:02e763d3da74d4a9237305acb4fda9728db42b4b","amp;dn":"Poozies...Raise+Your+Head%3B+A+Retrospective%28200%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02e763d3da74d4a9237305acb4fda9728db42b4b","infoHashBuffer":{"type":"Buffer","data":[2,231,99,211,218,116,212,169,35,115,5,172,180,253,169,114,141,180,43,75]},"announce":[],"urlList":[]}}