{"title":"pamas kidstime 27 4 kinderfilms op 1 dvd only dutch spoken","uid":4994954,"size":4543320180,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:04c3d5970b44d69ef1869ade17e4ddaf735b7f60&amp;dn=pamas+kidstime+27+4+kinderfilms+op+1+dvd+only+dutch+spoken&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SkywalkerNL","files":-1,"time":1247234150,"description":"Kung Fu Panda (2008) \nPo is een luie panda die de Uitverkorene blijkt te zijn om de vallei te redden van het gemene luipaard Tai Lung. Hij moet daarom in de leer bij Kung Fu master Shifu. Po zet de wereld van de Kung Fu compleet op zijn kop! Hij wordt een held door te leren dat als hij in zichzelf gelooft, hij alles kan bereiken. \n\nBolt (2008) \nBolt is een superhond. Althans, dat is hij wekelijks in zijn eigen TV-serie &quot;American Dog&quot;. Al denkt hij daar zelf heel anders over. Want als hij pardoes van Hollywood in New York terechtkomt, kan hij ineens niet meer op z'n superkrachten terugvallen. Samen met de zielige huiskat Mittens en Rhino, een aan TV verslaafde hamster in een plastic bal, moet Bolt zijn weg terug naar Hollywood proberen te vinden. \n\nMadagascar: Escape 2 Africa (2008) Een giraffe, een leeuw, een nijlpaard en een zebra verlaten het eiland Madagascar en komen terecht in Afrika. Hier ontmoet Alex de leeuw zijn familie, maar al snel komt hij tot de ontdekking dat hij het communiceren verleerd is in de dierentuin van New York. \n\nSpace Chimps (2008) Chimpansee Ham III, kleinzoon van Ham, de beroemde aap die als eerste de ruimte in ging, gaat samen met zijn maatje met een ruimteschip de ruimte in. Ze komen terecht op een vreemde planeet waar ze een avontuur beleven om de inwoners te redden van een wrede leider. \n","torrent":{"xt":"urn:btih:04c3d5970b44d69ef1869ade17e4ddaf735b7f60","amp;dn":"pamas+kidstime+27+4+kinderfilms+op+1+dvd+only+dutch+spoken","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04c3d5970b44d69ef1869ade17e4ddaf735b7f60","infoHashBuffer":{"type":"Buffer","data":[4,195,213,151,11,68,214,158,241,134,154,222,23,228,221,175,115,91,127,96]},"announce":[],"urlList":[]}}