{"title":"Stratovarius - Stratovarius (2005) WMA320","uid":6132791,"size":124208615,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:04d0547cf155b47c20735e164d944cf037d8c8a5&amp;dn=Stratovarius+-+Stratovarius+%282005%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1296196039,"description":"First off I would like to say that I own every studio album by Stratovarius including Intermission and Visions from Europe. I also own the Infinite Visions DVD and I have a shirt and a hoodie (Elements 2). Needless to say, I love this band. \n\nA few things that I'd like to mention next for the picky metal fan: 1) There are no songs faster than an up-tempo song (like Hunting High and Low or Eagleheart's speed). 2) Several of the songs aren't anything new for the band; its as if they copied themselves for several songs. 3) This is not on the Nuclear Blast label. Its on Sanctuary Records, I believe. \n\nThere's a video for Maniac Dance on this enhanced digipak version. It was done by the same people who did Wish I Had an Angel and Nemo (both by Nightwish) and also a few of the major American mainstream bands. That surprised the daylights out of me; I was expecting an awesome video, something along the lines of Infra Galaxia by Samael, When the Eagle Cries by Iced Earth, or At the Mountains of Madness by Orphanage. Nope - there's not really a &quot;story&quot; acted out by actual characters; its just watching the band play and ...if my memory's correct, a girl getting into an old tub wearing a bikini. Correct me if I'm wrong. \n\nI was happy with the opener (Maniac Dance), but it wasn't as good as most of the Stratovarius singles, such as Hunting High and Low, SOS, I Walk to My Own Song, and Eagleheart. Timo sings surprisingly low often during this song. Certainly a switch from the title track on Elements 1. \n\nGoing back to the title of the review, many of the songs are longer (3 in the 7 minute range) and sound like the Babylon-style song from the Episode album. BUT - this isn't &quot;Episode 2&quot;; the band took what they learned from their experiment with the 2 Elements albums and combined it with their old style to obtain yet an even newer style. Its now a unique sound that sounds as if this was a classic rock band releasing their 15th studio album (here in the year 2005). Well, Stratovarius HAS been around since the 80's and certainly must have a lot of influences from the classic rock, progressive rock, and neoclassical bands. \n\nThe songs on here are often positive (Back to Madness certainly isn't; its got a doom-metal like dialogue that ends the song) and easy to listen to. If you want more challenging music, look at bands like Time Requiem and Spiral Architect. \n\nIf you're one of those people who listens to HIM, Mnemic, Soilwork, In Flames, Messhugah, and Children of Bodom and claim to be a euro metal fan, think again - Stratovarius has once again defined an important component in European metal as a whole. \n\nSome of you are probably scared about what I said about the music sounding unoriginal. Straight up - not all of the songs are. &quot;Fight!!!&quot; is a really happy but unoriginal song. In other words, they seemed to copy bands who once copied Stratovarius. Same story with &quot;Just Carry On.&quot; Then we get to the good songs. (I don't quite get it myself, but tracks 2 and 3 just angered me in the unoriginality, especially looking back at previous songs the same songwriter has written.) &quot;Back to Madness&quot; is saved by the dialogue at the end; its lyrics are a bit vague, but that's good sometimes. I like this one a bit more, but I don't LOVE it. \n\nNow we get to the songs you can have fun with. &quot;Gypsy in Me&quot; has an Egyptian feeling to it and is a bit more of an epic metal kind of song. Anyone who enjoys &quot;taking off with&quot; or &quot;diving into&quot; a song will love this one. I'm having a hard time figuring out what to think of &quot;Zenith of Power&quot;; its not a bad or unoriginal song, but I just can't seem to get into it. \n\n&quot;The Land of Ice and Snow&quot; is a phenomenal near-vocal-solo &quot;ballad&quot; that's very original and enjoyable. &quot;Leave the Tribe&quot; sounds like a &quot;part II&quot; to Edguy's &quot;King of Fools.&quot; \n\nI'm under the impression that several people think &quot;United&quot; is the best song, yes? I agree! Musically, it's a lot like &quot;Liberty&quot;, but lyrically, its more of a &quot;Mother Gaia&quot;, &quot;Infinity&quot;, or &quot;Anthem of the World&quot; song. \n\nAh! I almost forgot solos! Maniac Dance has a great solo, but for the most part, like I said - they're slow, Babylon-like / Soul of a Vengabond-like / Awaken the Giant-like songs. Jens doesn't do nearly as much on the keyboards as he did back in the Visions and Destiny era, but he's there when he's needed, like what you hear with the band Brainstorm and Trail of Tears' new album. \n\nOverall, I recommend this to just about anyone. Now that I've heard it, I realize I shouldn't have been DYING to hear this album - I only felt that way cause it was my favorite band releasing a comeback album. This is no Visions or Episode; there's several 8.9 / 10 songs, but no like 99999/10 songs like Black Diamond or Father Time. \n\nAlso, anyone interested in whatever happened with that female singer &quot;Miss K&quot; that the band signed right after Timo Kotipelto left before the band broke up? I can say that she does not appear on this album. \n\nby Matt Stoessel\n\nTRACKLIST:\n\n01 - Maniac Dance.wma                                       \n02 - Fight!!!.wma                                           \n03 - Just Carry On.wma                                      \n04 - Back To Madness.wma                                    \n05 - Gypsy In Me.wma                                        \n06 - GÃƒÂ¶tterdÃƒÂ¤mmerung (Zenith Of Power).wma                  \n07 - The Land Of Ice And Snow.wma                           \n08 - Leave The Tribe.wma                                    \n09 - United.wma   \n\nWMA 320Kbps 44100Hz STEREO\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;44090016031e04080d12016a070b09&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:04d0547cf155b47c20735e164d944cf037d8c8a5","amp;dn":"Stratovarius+-+Stratovarius+%282005%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04d0547cf155b47c20735e164d944cf037d8c8a5","infoHashBuffer":{"type":"Buffer","data":[4,208,84,124,241,85,180,124,32,115,94,22,77,148,76,240,55,216,200,165]},"announce":[],"urlList":[]}}