{"title":"Espias Psiquicos.(Docu.SATRip.Spanish).","uid":6228553,"size":524519424,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:0560dbe2b5d4caba806f333b97a288f2db18cbce&amp;dn=Espias+Psiquicos.%28Docu.SATRip.Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cholo24","files":1,"time":1299612005,"description":"Espias psÃƒÂ­quicos\n\nEntre 1976 y 1995, el gobierno de los EE UU destinÃƒÂ³ 20 millones de dÃƒÂ³lares a la investigaciÃƒÂ³n paranormal, en un esfuerzo por reforzar la seguridad nacional. En plena Guerra Fria, los militares habian tenido conocimiento de los avances de la UniÃƒÂ³n SoviÃƒÂ©tica en el campo de la investigaciÃƒÂ³n psÃƒÂ­quica. Temiendo una posible amenaza, los estadounidenses entrenaron a militares que podrian espiar hasta los lugares mÃƒÂ¡s remotos, peligrosos e inexpulnables mediante visiÃƒÂ³n remota. Este documental cuenta la historia del oficial Joseph McMoneagle, el sargento Melvin Riley y el capitÃƒÂ¡n Paul Smith, tres psÃƒÂ­quicos que utilizan sus poderes al servicio del PentÃƒÂ¡gono, la CIA y otras agencias de inteligencia en la contienda mÃƒÂ¡s extraÃƒÂ±a de la Guerra Fria. Bajo un proyecto gubernamental clasificado, los videntes del gobierno de EEUU realizaron misiones de espionaje psÃƒÂ­quico en todo el mundo... y recibieron apoyo al mas alto nivel.\nEn 1995, la CIA anunciÃƒÂ³ que la informaciÃƒÂ³n proporcionada por la unidad psÃƒÂ­quica, entonces llamada Puerta de las Estrellas, no era fiable. Se realizÃƒÂ³ un anÃƒÂ¡lisis independiente para determinar si habia evidencias cientÃƒÂ­ficas que respaldaran la validez de la visiÃƒÂ³n remota.\nEn noviembre de 1995, la unidad psÃƒÂ­quica fuÃƒÂ© desmantelada. A pesar de que la estadÃƒÂ­stica demuestra que la visiÃƒÂ³n remota es real, escÃƒÂ©pticos y neurocientÃƒÂ­ficos la rechazan como un engaÃƒÂ±o. McMoneagle, Rile, Smith y otros compaÃƒÂ±eros suyos, siguen investigando el fenÃƒÂ³meno. Para estos hombres, el espionaje psÃƒÂ­quico es una realidad. Para el resto de nosotros, la visiÃƒÂ³n remota es un misterio que sigue sin explicaciÃƒÂ³n...\n","torrent":{"xt":"urn:btih:0560dbe2b5d4caba806f333b97a288f2db18cbce","amp;dn":"Espias+Psiquicos.%28Docu.SATRip.Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0560dbe2b5d4caba806f333b97a288f2db18cbce","infoHashBuffer":{"type":"Buffer","data":[5,96,219,226,181,212,202,186,128,111,51,59,151,162,136,242,219,24,203,206]},"announce":[],"urlList":[]}}