{"title":"Chaka Khan - What Cha' Gonna Do For Me [1981, 320 kbps]","uid":4996802,"size":102644916,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:05c8e84e45fe64b668eb240d0a4567f26da18e49&amp;dn=Chaka+Khan+-+What+Cha%5C%27+Gonna+Do+For+Me+%5B1981%2C+320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"musicalibera","files":24,"time":1247324461,"description":"CHAKA KHAN - What Cha' Gonna Do For Me (1981)\n\nCodec: mp3.\nDescription: MPEG-1 Audio Layer 3.\nBit rate: 320 kbps.\nSample rate: 44100 Hz joint stereo.\nTags: ID3V1 &amp; ID3V2.\nSource format: CD (AAD)\nNumber of tracks 11.\n\n\nAllmusic review of 'What Cha' Gonna Do For Me':\n\n&quot;As a vocalist, Chaka Khan is the one of the very few who often doesn't need great material to prosper. Thankfully, on What Cha' Gonna Do for Me that isn't the case. Teaming again with Arif Mardin, slowly but surely the two began to craft an even more successful and innovative sound. This effort not only bests the work before it, but it is Mardin's most fulfilling production since 1974's Average White Band. The cover of &quot;We Can Work It Out&quot; gets a brash and funky Stevie Wonder-style arrangement, with Gregory Phillanganes doing great synth work. The biggest hit here is the melodic title track and has Khan's patented mix of sexiness and intelligent phrasing. The best song here, &quot;I Know You, I Live You,&quot; displays the brilliant bass and drum team of Anthony Jackson and Steve Ferrone, whose innovation all but rendered Rufus obsolete. Their pounding yet refined sound is also on &quot;We've Got Each Other,&quot; a hooky and propulsive duet with Khan's brother Mark Stevens. The ambitious and much loved &quot;And the Melody Still Lingers On (Night in Tunisia)&quot; had Mardin and Khan creating pithy lyrics that paid homage to '40s jazz legends as well as all other subsequent musical geniuses. The track features a clavitar solo from Herbie Hancock, Dizzy Gillespie, and an &quot;excerpted&quot; solo break from Charlie Parker. Throughout What Cha' Gonna Do for Me, Mardin seems to get amazing vocals from Khan and has he certainly had fun playing with her voice. What Cha' Gonna Do for Me is arguably the best effort of their partnership.&quot; \n\nTRACKLIST\n\nWhat Cha' Gonna Do For Me\n=========================\n01. We Can Work It Out \n02. What Cha' Gonna Do For Me \n03. I Know You, I Live You \n04. Any Old Sunday \n05. We Got Each Other \n06. And The Melody Still Lingers On (Night In Tunisia) \n07. Night Moods\n08. Heed The Warning \n09. Father He Said \n10. Fate \n11. I Know You, I Live You (Reprise)\n\n\nEnjoy - and thanks in advance for seeding.\n","torrent":{"xt":"urn:btih:05c8e84e45fe64b668eb240d0a4567f26da18e49","amp;dn":"Chaka+Khan+-+What+Cha%5C%27+Gonna+Do+For+Me+%5B1981%2C+320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05c8e84e45fe64b668eb240d0a4567f26da18e49","infoHashBuffer":{"type":"Buffer","data":[5,200,232,78,69,254,100,182,104,235,36,13,10,69,103,242,109,161,142,73]},"announce":[],"urlList":[]}}