{"title":"Afghan_Massacre-The_Convoy_of_Death_DVD","uid":5175389,"size":2813757114,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:06547284a40ab9a8d0ce725f134c033a3c7865e4&amp;dn=Afghan_Massacre-The_Convoy_of_Death_DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1258938469,"description":"Afghan Massacre: The Convoy of Death\n\nAFGHAN MASSACRE tells of the horrific forced journey undertaken by thousands of prisoners who surrendered to America?s Afghan allies after the siege of Kunduz November 21, 2001.\n\nBundled into containers, the lucky ones were shot within minutes. The rest suffered an appalling road trip lasting up to four days, clawing at the skin of their fellow prisoners as they licked perspiration and even drank blood from open wounds.\n\nUp to 3,000 now lie buried in a mass grave, but this was NOT a simple matter of Afghans killing Afghans.\n\nAFGHAN MASSACRE tells of how American Special Forces took control of the operation, re-directed the containers carrying the living and dead into the desert and stood by as survivors were shot and buried.\n\nAnd it details how the Pentagon lied to the world in order to cover up its role in the greatest atrocity of the entire Afghan War. This is the documentary they did not want you to see.\n\nAFGHAN MASSACRE was produced over ten months in extremely dangerous circumstances: \neyewitnesses were threatened and subsequently killed, the film crew were forced into hiding and our researcher was savagely beaten to within an inch of his life. He was recently awarded the 2002 Rory Peck Award for Hard News, The SONY Award and the film has been nominated for a Royal Television Society Award for Current Affairs.\n\nDuration 50 min\t","torrent":{"xt":"urn:btih:06547284a40ab9a8d0ce725f134c033a3c7865e4","amp;dn":"Afghan_Massacre-The_Convoy_of_Death_DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06547284a40ab9a8d0ce725f134c033a3c7865e4","infoHashBuffer":{"type":"Buffer","data":[6,84,114,132,164,10,185,168,208,206,114,95,19,76,3,58,60,120,101,228]},"announce":[],"urlList":[]}}