{"title":"Kiss - Shout It Out Loud (Live)","uid":5081242,"size":118849540,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:06c06bbaf0b5ea981a67c2347906f635932b79bb&amp;dn=Kiss+-+Shout+It+Out+Loud+%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1252322579,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Shout It Out Loud&quot; is a song by the American hard rock group Kiss originally released on their 1976 album, Destroyer.\n\nReleased as a single in 1976, the band and their record company, Casablanca Records, were trying to cash in on the success of their previous single, &quot;Rock and Roll All Nite (live)&quot; by releasing another anthem. While the song would break into the American Billboard Top 40, peaking at #31, it would prove to not be as successful as its predecessor was.\n\nIn 1998, Pretty Boy Floyd covered this song for their album Porn Stars Also it's covered by Zeke on their album Kicked in the teeth.\n\nThe song is featured in the movie Detroit Rock City.\n\nThe song is also featured on the music/rhythm video game Guitar Hero 5.\n\nDestroyer is the fourth studio album and fifth album overall by hard rock band Kiss, released on March 15, 1976 in the United States. It was the second consecutive Kiss album to reach the Top 20 in the United States, as well as the first to chart in Germany and New Zealand. The album was certified gold by the RIAA on April 22, 1976. It was certified platinum on November 11, 1976, the first Kiss album to achieve that distinction.\n\nComing on the heels of the group's breakthrough album Alive!, Destroyer is easily the most ambitious studio recording of Kiss's '70s catalogue. Bob Ezrin, who had previously worked with Alice Cooper, was brought in to produce the album. Among the production flourishes Ezrin introduced to Kiss were sound effects, strings, screaming children and reversed drums (on &quot;God of Thunder&quot;) as well as a children's choir.\n\nDestroyer is the first Kiss album to prominently feature outside musicians, such as members of the New York Philharmonic-Symphony Orchestra. However, one musician was not credited: Dick Wagner, from Alice Cooper's band, replaced Ace Frehley on tracks such as &quot;Sweet Pain&quot; (as Frehley didn't want to interrupt a card game he was playing during recording sessions for the song) and even on a song that Frehley himself co-wrote, &quot;Flaming Youth&quot;. Wagner also played the acoustic guitar found on the song &quot;Beth&quot;. The success of Alive! and Destroyer enabled the band to embark on their first tour of Europe.\n\nThroughout the years, &quot;Detroit Rock City&quot;, &quot;God of Thunder&quot;, &quot;Shout It Out Loud&quot;, &quot;King of the Night Time World&quot;, and &quot;Do You Love Me?&quot; have become permanent staples on the band's concerts. &quot;Beth&quot; was last played live on the band's Dec. 20, 2003 concert at Save Mart Center in Fresno, CA the last show of the World Domination Tour; after drummer Peter Criss' final departure, the band permanently retired the song from their set list.\n\nIn 2003, the album was ranked number 496 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:06c06bbaf0b5ea981a67c2347906f635932b79bb","amp;dn":"Kiss+-+Shout+It+Out+Loud+%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06c06bbaf0b5ea981a67c2347906f635932b79bb","infoHashBuffer":{"type":"Buffer","data":[6,192,107,186,240,181,234,152,26,103,194,52,121,6,246,53,147,43,121,187]},"announce":[],"urlList":[]}}