{"title":"Lullabot Drupal Performance and Scalability","uid":6169798,"size":2858656281,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:06faa48e154ef932cff512fd5214f7df48b079b9&amp;dn=Lullabot+Drupal+Performance+and+Scalability&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":null,"files":3,"time":1297525488,"description":"\n\nWant to learn the secrets the pros use for making Drupal scale huge and perform with grace high traffic situations? In Drupal Performance &amp; Scalability, Matt Westgate and James Sansbury teach you all you need to know to get peak performance out of Drupal on the LAMP stack. They carefully walk you through both installation and customization of the entire LAMP stack. They go over the highly-optimized Pressflow distribution of Drupal. They teach you how to benchmark your site's performance, how to install many types of caching layers and how to optimize each layer of your server infrastructure. They even teach you all about things like CDN integration, APC, Varnish, Memcache and other caching layers within Drupal and MySQL. They discuss scaling strategies, looking at hardware topologies for both co-located and cloud infrastructures. They teach you how to isolate performance bottlenecks and cover strategies for monitoring. They also go over some of the changes in Drupal 7 and the next release of Pressflow. By the end of this video you'll be an old pro at creating high performance Drupal deployments!","torrent":{"xt":"urn:btih:06faa48e154ef932cff512fd5214f7df48b079b9","amp;dn":"Lullabot+Drupal+Performance+and+Scalability","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06faa48e154ef932cff512fd5214f7df48b079b9","infoHashBuffer":{"type":"Buffer","data":[6,250,164,142,21,78,249,50,207,245,18,253,82,20,247,223,72,176,121,185]},"announce":[],"urlList":[]}}