{"title":"Mongol.2007.DVDRIP.avi","uid":5078105,"size":1532436542,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:07bae78ede071cf6cd97e6c9a057fe8935768cb3&amp;dn=Mongol.2007.DVDRIP.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZhugeL","files":1,"time":1252039509,"description":"DVD Rip, High Quality, Medium Quality if you like to complain alot. Stereo sound, about 2 hours.\n\nThis movie is actually in Mongolian for the most part ( I think ), but has english subtitles and it is pretty well translated.\n\n\n=MONGOL THE MOVIE=\n\n\n&quot;Mongol, The Movie&quot; is actually a true story about Genghis Khan ( Temujin ), a great war hero similar to Napoleon or George Washington. Mongolia wasnt a country then, just roaming bands of tribes, sometimes very large ones. Nomadic life is never pleasant, so Temujin has a rough childhood and sinks to the lowest of lows only to use his will and wit to restore his family and retrieve his promised wife, and at one point, he becomes ruler of all of Mongolia. He then went on to invade China, and at one point ruled most of the world.\n\nThe movie, part of a trilogy apparently, goes into detail about his childhood, and his individual point of view. The Movie ends when he begins to unite tribes, so most likely the second movie will be about uniting mongolia and the chinese invasions, and the third movie might be about Temujin's grandson, Kublai Khan.\n\n  - ZhugeL\n\n","torrent":{"xt":"urn:btih:07bae78ede071cf6cd97e6c9a057fe8935768cb3","amp;dn":"Mongol.2007.DVDRIP.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07bae78ede071cf6cd97e6c9a057fe8935768cb3","infoHashBuffer":{"type":"Buffer","data":[7,186,231,142,222,7,28,246,205,151,230,201,160,87,254,137,53,118,140,179]},"announce":[],"urlList":[]}}