{"title":"Avril Lavigne - Goodbye Lullaby","uid":6208989,"size":99249992,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:07e3b81d69b9b8f7973671951ed7d84cf0d49ff0&amp;dn=Avril+Lavigne+-+Goodbye+Lullaby&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"speedthunder","files":15,"time":1298913294,"description":"[img]http://www.blogcdn.com/www.aolradioblog.com/media/2010/12/avrillavignegoodbyelullaby.jpg[/img]\nAvril Lavigne  hasn't released a new studio album since 2007's 'The Best Damn Thing,' however, in March, the Canadian sensation will finally return with a brand new album titled 'Goodbye Lullaby.'\n\nThe album, Lavigne's fourth, will hit stores on March 8, after a full two years of production. The artist began work on 'Goodbye Lullaby' in November 2008 at her home studio in Tarzana, Calif. Surprisingly, Lavigne originally entered the studio to lay down a song called 'Black Star' for a commercial for her own fragrance. Eventually, though, she just continued recording new tracks until she finally -- if accidentally -- put together a new album.\n\n&quot;It just happened,&quot; she told Entertainment Weekly. &quot;I made a record without even feeling like I made a record.&quot; In the studio, Lavigne collaborated with producers Butch Walker and Evan Taubenfeld, and singer/songwriter Max Martin. Also contributing to the new album is Lavigne's ex-husband and Sum 41 frontman Deryck Whibley.\n\nLavigne was originally hoping to release the album in 2009, but a series of delays held up production, as she sought to attain the perfect sound. Knowing that her fans may get impatient, Lavigne issued an open letter in November, explaining the delay and giving a sneak preview of what they can expect.\n\n&quot;Not only is this the most meaningful and special record I have written, it is sincere, honest and close to my heart,&quot; she wrote before suggesting that creative and corporate tensions may have impeded progress on the album.\n\n&quot;But for the first time, I experienced a bunch of bureaucratic BS,&quot; the post reads. &quot;People do their best work when they are doing what they want, love and is natural for them, not when you are forcing them to be something that they are not.&quot;\n\nLater on in the letter, Lavigne confirmed the album's first single, 'What The Hell,' which she described as &quot;a fun and funny anthem.&quot; She explained, &quot;It has a broad message about personal freedom. It is the most pop track on the record.&quot;\n\nThe rest of the album, according to the artist, is &quot;somewhat more raw.&quot; Other tracks on the record include 'Smile,' which her label describes as a song that &quot;expresses her gratitude for special people in her life,&quot; as well as the title track, 'Goodbye,' in which Lavigne explores how it feels &quot;to close one chapter of her life and move on to the next.&quot;\n[IMG]http://i896.photobucket.com/albums/ac169/pbf99/tr.gif[/IMG]\n\n\n1. Black Star\n2. What The Hell\n3. Push\n4. Wish You Were Here\n5. Smile\n6. Stop Standing There\n7. I Love You\n8. Everybody Hurts\n9. Not Enough\n10. 4 Real\n11. Darlin\n12. Remember When\n13. Goodbye\n14. Alice (hidden track)\n[IMG]http://i896.photobucket.com/albums/ac169/pbf99/ENJOY.gif[/IMG]\n","torrent":{"xt":"urn:btih:07e3b81d69b9b8f7973671951ed7d84cf0d49ff0","amp;dn":"Avril+Lavigne+-+Goodbye+Lullaby","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07e3b81d69b9b8f7973671951ed7d84cf0d49ff0","infoHashBuffer":{"type":"Buffer","data":[7,227,184,29,105,185,184,247,151,54,113,149,30,215,216,76,240,212,159,240]},"announce":[],"urlList":[]}}