{"title":"The Story of Mankind (2009) - (Malestrom)","uid":5095733,"size":44127962,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0869daef4a8a71a7132b6b8ccb59cb59cc249c34&amp;dn=The+Story+of+Mankind+%282009%29+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1253550551,"description":" &lt;a href=&quot;http://bayimg.com/JaeHcaaca&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/JaeHcaaca&lt;/a&gt;\n\nThe Story of Mankind\nPublisher: Book Jungle | ISBN: 1438519141 | edition 2009 | PDF | 562 pages\n\nVan Loon was a Dutch/American historian. His The Story of Mankind, a history of the world especially for children won the first Newbery Medal in 1922. Van Loon's writing style is full of antidotes and a casual delivery suited to young readers. The Amazon.com review is as follows. &quot;Anyone who can chronicle world history from 500,000 B.C. to present times--and do so in a lively, entertaining style--deserves a medal. Luckily, the best owers of the very first Newbery Medal in 1922 thought so, too. The warm, personable tone of Hendrik Willem van Loon's writing lends itself to true learning in a way that stern, dry textbooks never do. In the introduction, he describes climbing a tower in Rotterdam in his youth. Years later, the perspective at the top inspired the author to develop a metaphor of history as a &quot;mighty Tower of Experience, which Time has built amidst the endless fields of bygone ages. This genuinely enjoyable charmer, for history buffs and the historically challenged alike, covers human history from prehistoric times, when our earliest ancestors were learning to communicate with grunts, right through to the issues of the latter 20th century: gay rights, Arab-Israeli conflicts, and health and fitness. Revised and updated several times since 1921, van Loon's inviting classic is filled with stories (and witty parenthetical asides) that bring history alive. His pen-and-ink illustrations, maps, and animated chronology contribute to the cozy, round the fireplace aspect of the book. (Ages 12 and older)&quot;","torrent":{"xt":"urn:btih:0869daef4a8a71a7132b6b8ccb59cb59cc249c34","amp;dn":"The+Story+of+Mankind+%282009%29+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0869daef4a8a71a7132b6b8ccb59cb59cc249c34","infoHashBuffer":{"type":"Buffer","data":[8,105,218,239,74,138,113,167,19,43,107,140,203,89,203,89,204,36,156,52]},"announce":[],"urlList":[]}}