{"title":"Johnny Hates Jazz - The Very Best Of - (2003)[FLAC-EAC-CUE]","uid":4998683,"size":445855806,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:08c436166813fed1ab2a0abd2966c2723f58ce24&amp;dn=Johnny+Hates+Jazz+-+The+Very+Best+Of+-+%282003%29%5BFLAC-EAC-CUE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"seanprince","files":27,"time":1247413959,"description":"Johnny Hates Jazz - The Very Best Of - (2003)[FLAC-EAC-CUE]\n\nTrack list\n\nJohnny Hates Jazz - The Very Best Of\n\n01. Shattered Dreams 03:29\n02. My Secret Garden 03:19\n03. Me And My Foolish Heart 03:29\n04. Living In The Past 03:36\n05. I Don't Want To Be A Hero 03:27\n06. The Cage 04:00\n07. Turn The Tide 03:44\n08. Heart Of Gold 03:28\n09. Don't Say It's Love 03:46\n10. Let Me Change Your Mind Tonight 04:45\n11. The Last To Know 03:36\n12. Fool's Gold 04:31\n13. Shattered Dreams (12&quot; Extended Mix) 05:12\n14. Turn The Tide (Rogue Vogue Mix) 05:03\n15. Cracking Up 03:41\n16. Turn Back The Clock 04:20\n\nBiography by Michael Sutton\n\nThe British trio Johnny Hates Jazz had Spandau Ballet's striking attire, clean-cut looks, and knack for smooth, glossy pop songs that were more soulful than the critics gave them credit for. Unfortunately, like Spandau Ballet Johnny Hates Jazz were stigmatized in the U.S. by an omnipresent hit that burned out interest in the group before the rest of their discography had the chance to be heard. Johnny Hates Jazz was formed in 1986 by Clark Datchler (vocals, piano), Calvin Hayes (keyboards), and Mike Nocito (bass). Named after a friend who despised jazz, Johnny Hates Jazz released their first single, &quot;Me and My Foolish Heart,&quot; on RAK Records that year. The band searched for a major-label deal, and they were signed by Virgin Records after a gig at, ironically enough, a jazz club near the end of 1986. The group's debut single for Virgin, &quot;Shattered Dreams,&quot; rocketed them into superstardom in 1987. &quot;Shattered Dreams&quot; landed at number five on the U.K. charts and number two in America. The band's debut LP, Turn Back the Clock, appeared in 1988, going multi-platinum in England and in the U.S. While none of Johnny Hates Jazz's subsequent singles took off in America, they launched a hit parade in the U.K. as &quot;I Don't Want to Be a Hero,&quot; &quot;Turn Back the Clock,&quot; &quot;Heart of Gold,&quot; and &quot;Don't Say It's Love&quot; followed &quot;Shattered Dreams&quot; onto the airwaves. However, despite the success, Datchler departed from Johnny Hates Jazz in the summer of 1988. Datchler was angry at how the other members were reinterpreting his compositions and decided to pursue a solo career, recording Raindance in 1990. Hayes and Nocito replaced Datchler with producer Phil Thornalley on Johnny Hates Jazz's 1991 effort Tall Stories. Although it didn't sound that different from Turn Back the Clock -- &quot;Let Me Change Your Mind Tonight&quot; could've fit perfectly on that album -- Tall Stories was a bust. Johnny Hates Jazz broke up afterward.\n\nReview From Cd Universe\n\nA truly superb compilation! It doesn't get any better than this! The talented songwriting ability of Clark Datchler not only propelled Johnny Hates Jazz to stardom, but ensured their place in musical history, forever. Each and every song on this CD is a masterpiece to behold. Created by this gifted songwriter/singer, their music endures to this day on both radio and music television. Deservedly so. This CD must take nothing less than centerstage in any Johnny Hates Jazz/Clark Datchler fan's collection. Don't miss out, treat yourself to this wonderful CD. It is the best Johnny Hates Jazz compilation on the market\n.","torrent":{"xt":"urn:btih:08c436166813fed1ab2a0abd2966c2723f58ce24","amp;dn":"Johnny+Hates+Jazz+-+The+Very+Best+Of+-+%282003%29%5BFLAC-EAC-CUE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08c436166813fed1ab2a0abd2966c2723f58ce24","infoHashBuffer":{"type":"Buffer","data":[8,196,54,22,104,19,254,209,171,42,10,189,41,102,194,114,63,88,206,36]},"announce":[],"urlList":[]}}