{"title":"[Corbin Fisher]","uid":5176034,"size":468000293,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:08db8cc2b76dc75cf5d001d5fa172a294e997f85&amp;dn=%5BCorbin+Fisher%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Puzker","files":-1,"time":1258982926,"description":"Production year: 2009\nACS - Connor &amp; Kenny's Bi Tag Team.wmv\nACS-Dawson_and_Austin's_Bi_Tag_Team.wmv\n &lt;a href=&quot;\nhttp://honeyass.net/euro-teen/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://honeyass.net/euro-teen/&lt;/a&gt;\n\nThe dominant genre: Bisexual\nGenre: All Sex, Threesome, Bareback, Cumshots, Amateur\nDuration: 00:18:56\nStudio: Corbin Fisher (Amateur College Sex)\nDescription: Goryachenkaya bisexual novelty of &quot;Corbin Fisher&quot;.\nDescription from\nYou've likely noticed just how these bi vids have become a fixture of ACS by now! There are many reasons why that's the case. Firstly, they're just so hot! Secondly, the guys really enjoy them. Finally, we've been getting loads of e-mails about how much people are enjoying them! There's definitely a shortage of hot bi action out there featuring young, college guys. We're fixing that one video at a time here!\nAustin always makes for a great bi scene participant, and that's as true here as ever. As the cameras start rolling, both he and Dawson are fully into it and waste no time kissing one another and getting their hard dicks out. Indeed, their cocks are hard immediately and it's not long before there's some eager, wet sucking going on.\nWhile Dawson's getting his dick sucked by the girl, Austin stands up on the bed so that his own hard cock is right in front of Dawson, who leans forward to suck it. It's nonstop action from here\non out, each guy always finding plenty to do whenever they change positions or move around.\nAustin is the first to start fucking the girl, doing so while Dawson has her sucking his dick. Both guys' muscled bodies are flexing and tightening as they pump and thrust and go to work. Austin is fucking fast and furiously, and you can literally watch as his body begins to glisten more and more with sweat as he does so.\nNot to be outdone, Dawson is soon burying his dick in the girl to start furiously pounding her. They've fully switched positions by now, Austin at her other end getting his cock sucked. They have totally focused looks on their faces, the room filled with grunts and moans.\nAfter they've each gotten themselves fully worked up with all this fucking and sucking, they're ready to take things to the next level! Austin gets up on the bed and on his hands and knees and, in no time,\nDawson is sliding his hard dick into Austin's ass. Dawson fucks him as hard and as fast as they had each just been fucking the girl, Austin's ripped body braced against the bed as he takes it!\nThey move around to where Austin is on his back so we can see his hot chest as he jerks himself off while getting fucked, and it's not long before his grunts get louder and louder and he starts to spray his ripped abs in cum! He shoots a massive load all over himself, and Dawson then immediately pulls his own cock out of Austin's hole to start shooting cum all over, as well! Austin can't help but reach forward to grip Dawson's cock and squeeze a few more drops of cum out of him before the guys lean into kiss one another and recover from their intense orgasms!\nVideo Quality: SiteRip\nVideo Format: WMV\nVideo: Windows Media Video 9 960x540 30.00fps 1605Kbps\nAudio: Windows Media Audio 44100Hz stereo 64Kbps","torrent":{"xt":"urn:btih:08db8cc2b76dc75cf5d001d5fa172a294e997f85","amp;dn":"%5BCorbin+Fisher%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08db8cc2b76dc75cf5d001d5fa172a294e997f85","infoHashBuffer":{"type":"Buffer","data":[8,219,140,194,183,109,199,92,245,208,1,213,250,23,42,41,78,153,127,133]},"announce":[],"urlList":[]}}