{"title":"Army Of Lovers - Massive Luxury Overdose [U.S. Edition 320 kbps]","uid":5005379,"size":429670952,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:098f4555c096181074e6364a0743a047f5dea54a&amp;dn=Army+Of+Lovers+-+Massive+Luxury+Overdose+%5BU.S.+Edition+320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"musicalibera","files":43,"time":1247699877,"description":"ARMY OF LOVERS - Massive Luxury Overdose (U.S. Edition) + (1992)\n\nCodec: mp3.\nDescription: MPEG-1 Audio Layer 3.\nBit rate: 320 kbps.\nSample rate: 44100 Hz joint stereo.\nTags: ID3V1 &amp; ID3V2.\nSource format: CD.\nNumber of tracks 34.\n\nAllmusic review:\n&quot;Some album titles do nail it, and this is one of the prime candidates. From the near-cartoonishly foppish front cover photo, with the three members primed with necklaces, silk kaftans, airbrushing and more, to nearly everything on the actual disc, Overdose is just that. The most memorable number remains the band's biggest hit single, &quot;Crucified,&quot; a totally over-the-top disco anthem on all fronts that takes ABBA's winning combination of memorable hooks and harmonies as inspiration and slathers a load of glitter and make-up over the whole thing. Having ultracampy lyrical asides like &quot;I cry, I pray, mon dieu&quot; doesn't hurt the sheer giddiness at work, and neither do the &quot;I'm crucified like my saviour&quot; chorus, church organ and twangy Duane Eddy guitar. The Army's merry series of blasphemies kicks along throughout the album, with such numbers as the half-twinky, half-ominous &quot;Candyman Messiah&quot; and &quot;Say Goodbye to Babylon&quot; taking religious imagery and tweaking it for all it's worth. New singer De La Cour does a fine job in La Camilla's shoes, though the latter pops up on a song or two throughout the album. The fondness for ritzy sci-fi scenarios still runs riot, as song titles like &quot;Dynasty of Planet Chromada,&quot; &quot;The Particle Song&quot; and &quot;Walking With a Zombie&quot; make clear, while the same sticky-sweet combination of upbeat anthems and try-anything-at-least-once musical touches gets even more amped up here. Andreas Wollbeck rather than Frykberg is the main outside collaborator with Bard here, but the change isn't a notable one in comparison to the previous album, except for a general tendency towards big songs with bigger choruses. At points the Army ends up sounding like a clipped and discoed B-52s (check out &quot;We Stand United&quot;), but in general it's just them inhabiting their own little corner of dancefloor paradise, fripperies and all.&quot;\n\nUploader's comment: \n\nShortly after their international breakthrough with &quot;Crucified&quot; in 1991, La Camilla left the band - or was kicked out, depending on who you ask - and was replaced by Michaela de la Cour. The &quot;U.S. Edition&quot; of &quot;Massive Luxury Overdose&quot; - which incidentally also was released in Europe and most other parts of the world - included four previously unreleased tracks with the new formation of the group; &quot;Dynasty Of Planet Chromada&quot;, &quot;The Particle Song&quot;, &quot;Someone Somewhere&quot; and &quot;Judgment Day&quot;. &quot;Ride The Bullet&quot; from their debut album &quot;Disco Extravaganza&quot; was remixed (for the third time) and re-released as the international follow-up to &quot;Crucified&quot; in early 1992 and then became another massive seller both in Scandinavia (#1 in Finland) and the rest of Europe. In the US the new version of &quot;Ride The Bullet&quot; was released as a &quot;double A-side&quot; with &quot;Crucified&quot; and then became their biggest hit - in fact reaching #9 on Billboard's singles chart. \n\nIn 1992 the band also recorded a cover version of ABBA's &quot;Hasta MaÃƒÂ±ana&quot; for the Swedish compilation &quot;ABBA - The Tribute&quot;. In 1999 Army Of Lovers' rather unconventional take on the ABBA classic was released in the US as part of another tribute album, entitled &quot;ABBA - A Tribute - The 25th Anniversary Celebration&quot;. \n\nTRACKLIST\n\nMassive Luxury Overdose (U.S. Edition)\n======================================\n01. Dynasty Of Planet Chromada\n02. Crucified \n03. Candyman Messiah (Single Remix)\n04. Obsession\n05. We Stand United \n06. Say Goodbye To Babylon\n07. Ride The Bullet (1992 Remix) \n08. The Particle Song\n09. Someone Somewhere\n10. I Cross The Rubicon \n11. Flying High \n12. Walking With A Zombie  \n13. Judgment Day\n14. Hasta MaÃƒÂ±ana \n15. Crucified (Nuzak Remix) \n16. Crucified (Judas Mix) \n17. Crucified (Judas Mix Dubstramental) \n18. Crucified (Teknostradamus Mix) \n19. Crucified (Teknostalgia Mix) \n20. Crucified (Crucifixion Mix) \n21. Obsession (Schizoperetta Mix)\n22. Obsession (Armageddon Mix)\n23. Obsession (Hermaphrodisiac Mix)\n24. Candyman Messiah (Stalingrad Mix)\n25. Candyman Messiah (Tolstoy Farm Mix)\n26. Candyman Messian (Orthodoxicated Mix)\n27. Judgment Day (GÃƒÂ¶tterdÃƒÂ¤mmerung Mix)\n28. Judgment Day (Valkyriahalla Mix)\n29. Judgment Day (Midvinterblot Mix)\n30. Ride The Bullet (Tren De Amor Mix)\n31. Ride The Bullet (Molotov Cocktail Mix)\n32. Ride The Bullet (DNA Mix)\n33. Love Me Like A Loaded Gun (1992 Radio Edit)\n34. Love Me Like A Loaded Gun (Atomic Macho Mix)\n\nEnjoy - and thanks in advance for seeding.","torrent":{"xt":"urn:btih:098f4555c096181074e6364a0743a047f5dea54a","amp;dn":"Army+Of+Lovers+-+Massive+Luxury+Overdose+%5BU.S.+Edition+320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"098f4555c096181074e6364a0743a047f5dea54a","infoHashBuffer":{"type":"Buffer","data":[9,143,69,85,192,150,24,16,116,230,54,74,7,67,160,71,245,222,165,74]},"announce":[],"urlList":[]}}