{"title":"Wrought Ironwork -1953","uid":5000933,"size":10650630,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a0d29e2258ca405f5da4fd6cb2fd72a2d552792&amp;dn=Wrought+Ironwork+-1953&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KnifemakerC","files":-1,"time":1247512126,"description":"Wrought Ironwork: A manual of instruction for craftsmen\n\nRural Development Commission - Great Britain\n\n1953\n\nThe techniques in this book are shown by sequences of photographs with concise explanations which are intended to supplement instruction on the anvil. \nIt is hoped this clear and practical method will help the smith to achieve the highest standard of work.\n\nThe first part of the book decribes the making of the most common decorative features such as scolls, water leaves, wavy bars and twists.\nPart 2 describes step-by-step the making and assembly of a gate, which includes the same techniques as are used in all traditional decorative ironwork such as grilles, brackets and gearth furniture. \nThe final chapter discusses the problems of painting and rust proofing. \n\nA knowledge of basic smithing techniques has been assumed thoughout this book, and only those tools peculiar to decorative ironwork are mentioned.\n\n\n********************************************************\nThis info is brought to you by:   &lt;a href=&quot;\nhttp://thepiratebay.se/user/KnifemakerC/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/KnifemakerC/&lt;/a&gt;\n\nPositive comments and thanks are appreciated.  \nIt's my only payoff for all the time and money spent here.\n\n\nDemonoid members may PM related requests and interesting finds\nto account    LurkerLurker     (unable to post the link here)\n\n\n\n####    See my other knife related torrents and please seed.    ####\n####    See my other knife related torrents and please seed.    ####\n####    See my other knife related torrents and please seed.    ####\n####    See my other knife related torrents and please seed.    #### \n\n********************************************************\n\nTags\n\nforging mosaic damascus, forging, damascus, mosaic  damascus, forge welding, chad nichols, Ed Caffrey, make a knife, knife, canister weding,\n\naustenite, forging, subzero quench,  braze rod, flat grind, grit marks, hardy hole, hot chisel, grind lines, belt grinder, temper line, anvil surface, surrounding strands, carbon migration, cross peen, final grind, grip material, green coal, hollow grind, welding temperature, pattern welding, first weld, blade cool, rough grinding, weld surfaces, Heat treat\n\nSteven R. Johnson, Bob Loveless, Sub-Hilt Fighter, Sword, Blade, Blades, knifemaker, knife, Make a Knife, video, stock removal, Metalwork, Steel, Tool Steel, Craft, Hobby craft, Heat Treat, Bowie, Daggar, Dagger, tpb knifemaking, tpb knife, tpb blade, tpb knifemaker, knifemaking torrent, knife torrent, bladesmith torrent, forge torrent, make a knife torrent, torrent, blade torrent, \n","torrent":{"xt":"urn:btih:0a0d29e2258ca405f5da4fd6cb2fd72a2d552792","amp;dn":"Wrought+Ironwork+-1953","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a0d29e2258ca405f5da4fd6cb2fd72a2d552792","infoHashBuffer":{"type":"Buffer","data":[10,13,41,226,37,140,164,5,245,218,79,214,203,47,215,42,45,85,39,146]},"announce":[],"urlList":[]}}