{"title":"Aerosmith - Aerosmith (1973) WMA320","uid":6174836,"size":88441655,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0a39c03888e8933dc50918e67372c480c1d387de&amp;dn=Aerosmith+-+Aerosmith+%281973%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1297732620,"description":"Aerosmith has made great albums... Rocks, Toys in the Attic, Draw the Line, etc. They're all great... no doubt about that, but without their debut album, they might not have recieved that push they needed to be stars. This is a very raw and gritty album. If you want proof, listen to Steven Tyler's vocals. He never sounded like that again after Get Your Wings. Along with its importance, their debut album provides the listener with a barrage of catchy, bluesey rock. Aerosmith doesn't give up until you reach the end of the album. \n\n1. Make It: Great opener, period. There is truly nothing wrong with this song. It's catchy and it rocks. 8.5 stars (out of ten.) \n2. Somebody: The opening riff is original, the vocals soar above the istrumentals, and the guitar is killer. 8.5 stars. \n3. Dream On: The only song that gains enough recognition it deserves. This is the second-definitive Aerosmith song, next to Walk This Way. Perfect. 10 stars. \n4. One Way Street: An epic blues-rock bonanza. Love the guitar Love the harmonica. Love the vocals. Aw, heck, I love it all. 9 stars. \n5. Mama Kin: Some of the best riffs Joe Perry ever made are displayed on this track. I'm so glad they added it to the latest greatest hits album (Oh Yeah!) 10 stars. \n6. Write Me: One of their most underrated songs ever. The beat is rocking, and there isn't any better harmonica-wailing anywhere. It's a personal favorite of mine. 9 stars. \n7. Movin Out: This is a very moody and out-of-place song here. It's not bad by a long shot. It just doesn't fit with all of the fast paced flurries the preceed it. It's still a keeper that I think would have been better on Get Your Wings. 8 stars. \n8. Walkin' The Dog: One of their best cover songs. The only thing that falters is the odd opening, but once you get through it, it's such a great song. The guitars rock, and so do the vocals. What a way to close it. 9.5 stars. \n\nTha comes to a grand total of 9 stars.In short: What are you waiting for, an invitation? Get this if you like music PERIOD. \n\nby RCF\n\nTRACKLIST:\n\n01 - Make It.wma                                       \n02 - Somebody.wma                                      \n03 - Dream On.wma                                      \n04 - One Way Street.wma                                \n05 - Mama Kin.wma                                      \n06 - Write Me.wma                                      \n07 - Movin' Out.wma                                    \n08 - Walkin' The Dog.wma   \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:0a39c03888e8933dc50918e67372c480c1d387de","amp;dn":"Aerosmith+-+Aerosmith+%281973%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a39c03888e8933dc50918e67372c480c1d387de","infoHashBuffer":{"type":"Buffer","data":[10,57,192,56,136,232,147,61,197,9,24,230,115,114,196,128,193,211,135,222]},"announce":[],"urlList":[]}}