{"title":"Perilous Fight America's Intrepid War with Britain on the High","uid":6287371,"size":4852415,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b378f10619a3ad3a3e16fc442057ecdfa8ec959&amp;dn=Perilous+Fight+America%5C%27s+Intrepid+War+with+Britain+on+the+High+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lionzbay","files":1,"time":1301663083,"description":"\nAuthor(s): Stephen Budiansky\nPublisher: Knopf\nDate: 2011-01-18\nFormat: pdf\nLanguage: English\nISBN10: 0307270696\nPages: 448\nISBN13: 9780307270696\n\nI have read quite a few books on the Naval war portion of the War of 1812. Usually, they will concentrate upon the thrilling single ship-to-ship battles of that war, mostly rousing and surprising-for-that-time American victories. This book does cover many of those battles and does so with style and panache, but it also covers the politics behind the War of 1812, and the human stories behind the battles.\n\nFor example the author shows us many explicit examples of American sailors being taken and impressed and their horrible mistreatment and even death by torture imposed upon them. &quot;Perilous Fight: America's Intrepid War with Britain on the High Seas, 1812-1815&quot; also covers tales of British naval arrogance and the fact they simply ignored International Law and treaties is capturing American merchant vessels. This- combined with the fact that America's merchant trade was the major source of income in that period- puts a better perspective on the reason for the war.\n\nExcellent use of period sources and quotes, extensively footnoted and researched, this book is a solid scholarly work.\n\nMy one quibble is that it does take a bit long to get to the action- there's more than a hundred pages between &quot;The Shores of Tripoli&quot; and the Constitution vs the Guerriere.\n\nAnd- there's even almost enough maps!\n\nEven if you (like I) have read other books on the naval portion of the War of 1812, this book belongs in your collection.","torrent":{"xt":"urn:btih:0b378f10619a3ad3a3e16fc442057ecdfa8ec959","amp;dn":"Perilous+Fight+America%5C%27s+Intrepid+War+with+Britain+on+the+High+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b378f10619a3ad3a3e16fc442057ecdfa8ec959","infoHashBuffer":{"type":"Buffer","data":[11,55,143,16,97,154,58,211,163,225,111,196,66,5,126,205,250,142,201,89]},"announce":[],"urlList":[]}}