{"title":"Todo Sobre Jabones","uid":5603043,"size":9039725,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b47a21027007e0e10055d5cef32885f1168afc1&amp;dn=Todo+Sobre+Jabones&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chusca","files":3,"time":1275417395,"description":"La historia del jabÃƒÂ³n se remonta a la AntigÃƒÂ¼edad. Se han encontrado documentos que mencionan el uso de muchos materiales jabonosos y agentes limpiadores aunque no eran verdaderos jabones sino productos realizados ÃƒÂºnicamente con cenizas de corteza de ÃƒÂ¡rbol. En el siglo I dC. el historiador romano Plinio describiÃƒÂ³ las diversas formas de jabones duros y blandos que contenÃƒÂ­an colorantes. Eran conocidos como rutilandis copilis y utilizados por las mujeres romanas para limpiar sus cabellos y teÃƒÂ±irlos de colores brillantes. La producciÃƒÂ³n de jabÃƒÂ³n era comÃƒÂºn en Italia y en EspaÃƒÂ±a. Durante el siglo VIII, la mayorÃƒÂ­a de los jabones se producÃƒÂ­an a partir de sebo de cabra, mezclado con la ceniza de haya que proporcionaba el alcali. En 1783, en forma accidental surgiÃƒÂ³ la reacciÃƒÂ³n que se produce hoy en el proceso de hervido en la fabricaciÃƒÂ³n del jabÃƒÂ³n: cuando el aceite de oliva se hierve con el ÃƒÂ³xido de plomo. produce una sustancia de sabor dulce que en ese entonces se denominÃƒÂ³ olsÃƒÂ¼ss. pero que hoy se conoce como glicerina. La mayoria de los jabones eliminan la grasa y otras suciedades debido a que algunos de sus componentes son agentes activos que sueltan las partÃƒÂ­culas de cualquier superficie que se limpie. El jabÃƒÂ³n en polvo es una mezcla hidratada de jabÃƒÂ³n y carbonato de sodio. El jabÃƒÂ³n lÃƒÂ­quido es una disoluciÃƒÂ³n de jabÃƒÂ³n blando de potasio disuelto en agua.\n\n","torrent":{"xt":"urn:btih:0b47a21027007e0e10055d5cef32885f1168afc1","amp;dn":"Todo+Sobre+Jabones","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b47a21027007e0e10055d5cef32885f1168afc1","infoHashBuffer":{"type":"Buffer","data":[11,71,162,16,39,0,126,14,16,5,93,92,239,50,136,95,17,104,175,193]},"announce":[],"urlList":[]}}