{"title":"Warlock - All We Are","uid":5088470,"size":136708100,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0bb8c1d6017178fcbbf2110d1a36d4b049870757&amp;dn=Warlock+-+All+We+Are&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1252925100,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nWarlock was a German heavy metal band, assembled in 1982. The band gained some commercial success in the mid 1980s. By the end of the decade, singer Doro Pesch was the sole original member who remained in the band, and thus proceeded to form Doro, a band that was essentially a continuation of Warlock under a different name. Doro, the band, has several classic songs from Warlock in its repertoire.\n\nWarlock's music is always primarily described as heavy metal. Their style was more traditional in the beginning of the 1980s, as heard on the Burning the Witches album. They soon moved to a hard rock and glam metal style, starting with Hellbound. The band's influences are 1970s hard rock and heavy metal acts such as Judas Priest and Black Sabbath, N.W.O.B.H.M., as well as fellow German metal bands such as Scorpions and Accept. Other bands that had a similar sound include Keel, Judas Priest, Lizzy Borden.\n\nWarlock's third album, True As Steel, released in 1986, got a fair amount of North American radio airplay due to the hit single &quot;Fight For Rock&quot;. The band's first music video was made for the song, airing on MTV. In August that year, Warlock opened for the Monsters of Rock festival at the MaimarktgelÃƒÂ¤nde in Mannheim, West Germany when Scorpions were headlining the all day concert. Def Leppard, Ozzy, MSG and Bon Jovi were also there.\n\nAfter the tour for True As Steel ended, Frank Rittel and Peter Szigeti left the band and were replaced by Tommy Bolan, (formerly of Armed Forces), and Tommy Henriksen . With the new line-up, Warlock released their fourth and last album, Triumph And Agony, in 1987. The video for the single &quot;All We Are&quot; enjoyed heavy rotation on MTV's &quot;Headbangers' Ball&quot;.\n\nTriumph and Agony is the fourth (&amp; final) album by German heavy metal band Warlock, released on September 5, 1987.\n\nThe album was the follow-up to the 1986 band's first successful album out of Europe, True as Steel.\n\n&quot;All We Are&quot; was a hit on American Metal radios stations. Its video clip also had good rotation on MTV's Headbangers Ball. It also features Cozy Powell on some tracks.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:0bb8c1d6017178fcbbf2110d1a36d4b049870757","amp;dn":"Warlock+-+All+We+Are","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bb8c1d6017178fcbbf2110d1a36d4b049870757","infoHashBuffer":{"type":"Buffer","data":[11,184,193,214,1,113,120,252,187,242,17,13,26,54,212,176,73,135,7,87]},"announce":[],"urlList":[]}}