{"title":"Furniture - Complete Discography","uid":5133990,"size":526976972,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0bf0db1b751b99abeabb7c133e03dbe7cf0ced02&amp;dn=Furniture+-+Complete+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"white_arcades","files":64,"time":1256340679,"description":"Here's a rare one for all you 80's hounds, the complete discography of the obscure band Furniture. Best known for their only hit, the single &quot;Brilliant Mind&quot;, which featured in the John Hughes movie &quot;Some Kind Of Wonderful&quot;.\n\nThe band's tale is a rather sad one, summed up concisely by All Music Guide -\n\nThe British pop band Furniture was founded in London in 1981 by vocalist Jim Irvin, guitarist/pianist Tim Whelan and drummer Hamilton Lee. A 1983 self-financed EP, The Boom Was On, won the trio a contract with the Survival label, and after swelling to a five-piece with the additions of bassist Sally Still and keyboardist Maya Gilder, they began issuing a string of singles, later collected as the LP The Lovemongers. After jumping to Stiff Records in 1986, Furniture released &quot;Brilliant Mind,&quot; which reached the Top 25 on the UK singles chart. The group's future appeared bright, but within weeks of issuing the follow-up, &quot;Love Your Shoes,&quot; Stiff went into liquidation; Furniture's 1986 album The Wrong People was picked up by ZTT, but after only 30,000 copies were pressed the record was abruptly deleted. After a three-year court battle, the band was finally able to remove themselves from ZTT's grip; signing to Arista, they resurfaced with 1989's Food, Sex and Paranoia, but the long hiatus destroyed any chart momentum they had accrued, and the record quickly vanished. Furniture dissolved in 1991.\n","torrent":{"xt":"urn:btih:0bf0db1b751b99abeabb7c133e03dbe7cf0ced02","amp;dn":"Furniture+-+Complete+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bf0db1b751b99abeabb7c133e03dbe7cf0ced02","infoHashBuffer":{"type":"Buffer","data":[11,240,219,27,117,27,153,171,234,187,124,19,62,3,219,231,207,12,237,2]},"announce":[],"urlList":[]}}