{"title":"THE.PACIFIC.[2010.PAL.DVDR.[EN. MULTISUBS[20].DISC6. -LINDOFF","uid":6311316,"size":4084666210,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0c3904bd325fa274628b2b538ebf95b097b27892&amp;dn=THE.PACIFIC.%5B2010.PAL.DVDR.%5BEN.+MULTISUBS%5B20%5D.DISC6.+-LINDOFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Lindoffs","files":11,"time":1302548383,"description":"Description\nExecutive produced by Tom Hanks, Steven Spielberg and Gary Goetzman, The Pacific is an epic ten-part miniseries from HBO and the team that made Band of Brothers.\n\nThe Pacific tracks the intertwined real-life stories of three U.S Marines, Robert Leckie, John Basilone and Eugene Sledge across the vast canvas of the Pacific Theater during World War 2. The miniseries follows these men and their fellow Marines from their first battle with the Japanese on Guadalcanal, through the rain forests of Cape Gloucester and the strongholds of Peleliu, across the bloody sands of Iwo Jima and through the horror of Okinawa, and finally to their triumphant but uneasy return home after V-J Day.\n\nThe Pacific is primarily based on two memoirs of US Marines, Eugene Sledge's With The Old Breed: At Peleliu And Okinawa and Robert Leckie's Helmet For My Pillow. The series also draws on Eugene Sledge's China Marine and Chuck Tatum's Red Blood, Black Sand, as well as original interviews conducted by the filmmakers.\n\nSpecial Features\n\nTechnical Details\nActors Joseph Mazzello, James Badge Dale, Jon Seda, William Sadler, Ashton Holmes, Rami Malek, Akos Armont, Joshua Bitton, Jon Bernthal, Tom Budge &amp; Joshua Close\nDirector Jeremy Podeswa, Carl Franklin, David Nutter &amp; Timothy Van Patten\nCertificate 15 years and over\nYear 2010\nScreen Widescreen 1.78:1 Anamorphic\nLanguages English - Dolby Digital (5.1)\nSubtitles Bulgarian  Castilian Spanish  Croatian  Czech  Danish  Dutch  Finnish  French  Greek  Hebrew  Hungarian  Norwegian  Polish  Portuguese  Romanian  Serbian  Slovenian  Swedish Turkish \nRegion Region 2\n\n8,4/10 &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0374463/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0374463/&lt;/a&gt;\n\nPacific, The [2010 PAL DVDR][En. Multisubs[20]\n\nProducenterna Steven Spielberg och Tom Hanks fÃƒÂ¶ljer upp succÃƒÂ©n &quot;Band of brothers&quot; med ytterligare en pÃƒÂ¥kostad serie om Andra VÃƒÂ¤rldskriget - &quot;The Pacific&quot;\n\nLiksom fÃƒÂ¶regÃƒÂ¥ngaren fÃƒÂ¶ljer nya serien ett antal amerikanska soldaters ÃƒÂ¶den, men den hÃƒÂ¤r gÃƒÂ¥ngen befinner vi oss i en annan del av kriget, i Stilla havet.\n\nI tio avsnitt fÃƒÂ¥r vi fÃƒÂ¶lja marinsoldaterna Robert Leckie (James Badge Dale), Eugene Sledge (Joe Mazzello) och John Basilone (Jon Seda) under dramatiska strider pÃƒÂ¥ klassiska platser som Guadalcanal och Iwo Jima, och fram till de allierades seger. \n\nSerien inleds direkt efter japanernas attack pÃƒÂ¥ Pearl Harbor och vi delar sedan soldaternas vardag, bestÃƒÂ¥ende av allt frÃƒÂ¥n hÃƒÂ¥rd krigfÃƒÂ¶ring till kÃƒÂ¤rleksÃƒÂ¤ventyr. Robert, Eugene och John hamnar alla i fÃƒÂ¶rsta marindivisionen, &quot;The Old Breed&quot;, och dÃƒÂ¤rfÃƒÂ¶r kommer deras vÃƒÂ¤gar att korsas vid ett par tillfÃƒÂ¤llen under seriens lopp.\n\n&quot;The Pacific&quot; ÃƒÂ¤r en av de mest pÃƒÂ¥kostade tv-serier som gjorts - varje avsnitt har kostat 20 miljoner dollar och ÃƒÂ¤r till stor del baserad pÃƒÂ¥ tre verkliga soldaters berÃƒÂ¤ttelser.\n\nFormat DVD Region 2\nFÃƒÂ¤rg/svartvit FÃƒÂ¤rg\nTV-system PAL\nTextning Bulgariska Kastilianska Spanska Kroatiska Tjeckiska Danska NederlÃƒÂ¤ndska Finska Franska Grekiska Hebreiska Ungerska Norska Polska Portugisiska RumÃƒÂ¤nska Serbiska\nSlovenska Svenska Turkiska\nLjud Engelska (Dolby Digital 5.1)\nBild Widescreen (anamorfisk)\nExtra material\nÃ‚Â» Historical Backgrounds: the five-minute prologues narrated by Tom Hanks\nÃ‚Â» Making The Pacific\nÃ‚Â» Profiles of The Pacific\nÃ‚Â» Anatomy of the Pacific War\nLokal titel The Pacific\nOrginal titel The Pacific\nGenre Krigsfilm\nProduktionsland USA\nPremiÃƒÂ¤rÃƒÂ¥r 2010\nRegi Bruce McKenna\nManus Robert Leckie Steven Spielberg Tom Hanks \nSkÃƒÂ¥despelare William Sadler Alice Parkinson Isabel Lucas Joseph Mazzello Joshua Close \nRami Malek Matt Craven Jacob Pitts Nathan Corddry Jon Seda \n","torrent":{"xt":"urn:btih:0c3904bd325fa274628b2b538ebf95b097b27892","amp;dn":"THE.PACIFIC.%5B2010.PAL.DVDR.%5BEN.+MULTISUBS%5B20%5D.DISC6.+-LINDOFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c3904bd325fa274628b2b538ebf95b097b27892","infoHashBuffer":{"type":"Buffer","data":[12,57,4,189,50,95,162,116,98,139,43,83,142,191,149,176,151,178,120,146]},"announce":[],"urlList":[]}}