{"title":"Giuffria - Live At Harpos Detroit 1985","uid":5604659,"size":102714571,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0cb97006780d6a45f1e6d0a018a033d769fabc3e&amp;dn=Giuffria+-+Live+At+Harpos+Detroit+1985&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":16,"time":1275524428,"description":"Giuffria - Live At Harpos Detroit 1985\nCD To MP3 192 Kbit/s.\nIncluded CD Covers &amp; This Info.\n\nThis Is A Great Bootleg So Enjoy It.!!!\n\nPlace: Harpos, Detroit, Michigan, USA\nDate:?? /?? /1985\nQaulity: Sounboard \n\nTracklist:\n01. Do Me Right\n02. Dont Tear Me Down\n03. Lonely In Love\n04. Rock Rules\n05. Line Of Fire\n06. Out Of The Blue\n07. Craig Goldy Solo\n08. Take It Straight To The Top\n09. Call To The Heart\n10. Gregg Giuffria Solo\n11. Trouble Again\n12. Turn Me On\n\nLineup:\nDavid Glen Eisley - Lead Vocals, Harmonica\nLanny Cordola - Guitar, Backing Vocals\nDavid Sikes - Bass, Backing Vocals\nGregg Giuffria - Keyboards, Backing Vocals\nAlan Krigger - Drums, Percussion\n\nGiuffria (Band)  From Wikipedia, the free encyclopedia\nGiuffria was an American  rock  band that was formed in 1982 by Gregg Giuffria after his departure from the band Angel, a glam rock/heavy metal band from Washington, D.C..\n\nHistory of the Band\nGiuffria was composed of Gregg Giuffria (keyboards), David Glen Eisley (lead vocalist), Craig Goldy (guitar), Chuck Wright (bass), and Alan Krigger (drums). Tom Quinton played drums for several months in 1983-84 but was dumped in favor of Alan Krigger, who looked more like a hard rock drummer than did Quinton. They were signed to MCA Records in 1984. Giuffria's self-titled debut album, Giuffria, soon followed peaking at #26 on the album charts while spawning two hit singles, &quot;Call to Your Heart&quot; (Hot 100 #15) and &quot;Lonely In Love&quot; (Hot 100 #57). The band was the opening act on Deep Purple 1984 reformation US tour, and was badly treated by Ritchie Blackmore who cut the band set from 45 minutes to 25 minutes, no guitar solo and no encores. The band went to tour as the opening act on Foreigner's Agent Provocateur tour, and enjoyed considerable success. The band played a few shows in Japan in June 1985, a live VHS tape was released under the Giuffria japan tour '85 title. Giuffria, then appeared on the Gotcha! soundtrack with the songs &quot;Never Too Late&quot; And &quot;Say It Ain't True&quot;. A third track &quot;What's Your Name?&quot; featured the vocals of David Glen Eisley but was listed as Camelflage. Their next album, Silk and Steel, was released in 1986, following some lineup changes (Goldy joined Dio and was replaced by guitarist Lanny Cordola, and Wright came back to Quiet Riot and was replaced by bassist David Sikes). However, the first single &quot;I must be dreaming&quot; failed to hit the Top 40 landing at a peak position of #52 and the album managed only peak at #60 on the Billboard 200. A second single was released for &quot;Love You Forever&quot; but the proper label promotion was not in place and aside from an American Bandstand performance of the single it quickly disappeared failing to make the Hot 100. A third album was in the works from 1987-1988, but was eventually sacked in favor of the House of Lords debut album. However, nine tracks from the Giuffria III sessions can be found on David Glen Eisley's Lost Tapes release. Giuffria were soon dropped by MCA Records and soon disbanded but not prior to recording demos for what would later become the House of Lords project.\n\nSide projects\nGregg Giuffria went on to form House of Lords and signed a record deal with Simmons Records, a new record company launched by his longtime friend Gene Simmons. Gene Simmons trademarked the name House of Lords, changed the band name to House of Lords and fired vocalist David Glen Eisley. Giuffria has since left the music business and now owns a business in Las Vegas.","torrent":{"xt":"urn:btih:0cb97006780d6a45f1e6d0a018a033d769fabc3e","amp;dn":"Giuffria+-+Live+At+Harpos+Detroit+1985","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cb97006780d6a45f1e6d0a018a033d769fabc3e","infoHashBuffer":{"type":"Buffer","data":[12,185,112,6,120,13,106,69,241,230,208,160,24,160,51,215,105,250,188,62]},"announce":[],"urlList":[]}}