{"title":"Deep Purple - The Book Of Taliesyn (1968) WMA320","uid":6292022,"size":110777552,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0cfb12ba44b0ae2da4fcc58432c39c100e7a74c7&amp;dn=Deep+Purple+-+The+Book+Of+Taliesyn+%281968%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1301853986,"description":"As the author of the Jefferson Airplane book &quot;Take Me To A Circus Tent&quot; and a former radio disc-jockey, I am often asked to write and or discuss various recordings from the 60's and 70's. \n\n&quot;The Book of Taliesyn&quot; brought Deep Purple closer to the appearance of the famed and great &quot;Mark II&quot; line-up. Ian Gillan and Roger Glover would raise the bar even higher. Before they become part of the fold, there is the tremendous second album and the self-titled third. \n\n&quot;Listen, Learn, Read On&quot; leads off the second Purple release. Possibly, by design the record starts with the shortest tune and ends with their epic cover of a Motown classic. &quot;Listen, Learn, Read On&quot; Features a terrific and varied vocal by Rod Evans along with a perfect guitar solo by Blackmore. Ritchie already is finding his way and it isn't only the ability to excel with his leads and fills but the perfect tone to coincide with the song. \n\n&quot;Hard Road&quot; also known as &quot;Wring That Neck&quot; is the perfect instrumental. Blackmore is tasty with a timeless riff supported by Ian Paice's drumming and Jon Lord's in your face but not over the top keyboards. \n\n&quot;Kentucky Woman&quot; is a wonderful cover to the Neil Diamond hit. Purple does a well-rounded interpretation and deserves credit for not only pulling off a well-respected interpretation but also being open-minded in their selection of non-group recordings. \n\n&quot;Exposition&quot;/&quot;We Can Work It Out&quot; gives us two for the price of one. Starting with their own composition of high energy- merging into a slower cover of the Beatles legendary song. This is the second Beatles selection (&quot;Help&quot; was recorded on the first LP) they pulled off well. \n\n&quot;The Shield&quot; one of the best efforts from the Purple &quot;Mark I&quot; line-up is also contains a superlative singing job by Rod Evans. The lyrics are intense and the clarity and conviction only further engrave them in your mind. \n\n&quot;Anthem&quot; with a mid-evil keyboard sound and a Blackmore guitar that enhances the dark mood is the most overlooked composition on the record but not any lesser. \n\n&quot;River Deep Mountain High&quot; has been interpreted by performers from all musical avenues. The tune partially written by record producer Phil Spector has been enjoyed not only by Motown fans (Four Tops, Supremes, and Ike &amp; Tina Turner) but also by those having purchased records by the Animals, Harry Nilsson, and Bob Seger. Deep Purple's ten minute journey is the most adventurous of all the renditions. It could have been easily too long if they were anything less. With the Blackmore/Lord combination, it takes on a life of its own. Never is there a passage you call superfluous. A climatic ending to a great production. \n\nMake sure to please get the remastered version with the five bonus tracks lead by &quot;Playground.&quot; Between Blackmore's aggression, Lord's perfect keyboard, and some terrific nuances by Ian Paice it is a must listen! \n\n\nEnjoy the music and be well, \nCraig Fenton \nAuthor of the Jefferson Airplane book &quot;Take Me To A Circus Tent&quot; \n\nby Craig Fenton\n\nTRACKLIST:\n\n01 - Listen, Learn, Read On.wma                                  \n02 - Hard Road.wma                                               \n03 - Kentucky Woman.wma                                          \n04 - (A) Exposition, (B) We Can Work It Out.wma                  \n05 - The Shield.wma                                              \n06 - Anthem.wma                                                  \n07 - River Deep, Mountain High.wma     \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!","torrent":{"xt":"urn:btih:0cfb12ba44b0ae2da4fcc58432c39c100e7a74c7","amp;dn":"Deep+Purple+-+The+Book+Of+Taliesyn+%281968%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cfb12ba44b0ae2da4fcc58432c39c100e7a74c7","infoHashBuffer":{"type":"Buffer","data":[12,251,18,186,68,176,174,45,164,252,197,132,50,195,156,16,14,122,116,199]},"announce":[],"urlList":[]}}