{"title":"Das Pop - I Love","uid":6296904,"size":113797256,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0d4a5b9d26b4f84f9841743d3098b732fc3b2ea3&amp;dn=Das+Pop+-+I+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bright_eyes82","files":11,"time":1302025965,"description":"My opinion (the 100th album review!)\n\nAnecdote : The band Das Pop had a gig in the Belgian town of Eeklo a little while ago (if you don't know Das Pop, read this here bio. And if you don't know Eeklo, follow directions to &quot;Nowhere&quot; and turn right just before you get there). Unfortunately, there was something wrong with the electrical installation, so the band was given the choice either to perform with a terrible sound, or without the light-show. Das Pop chose something else: they went home.\nArrogance or healthy self-respect? Perfectionism or Das Posh? Fact is that Das Pop is quickly gathering both a loyal following and a number of anti-Das Pop's. Slick - as all pop music - they certainly are, or is it the olive oil of the video for The One or from the pictures from the very nice booklet to the cd that gave me that impression?\nAll in all, &quot;I &quot; is thÃƒÂ© album of the year, but maybe also thÃƒÂ© flop of the year.\nFor it is a really amazingly catchy bunch of songs, highly amusing also, with not a bad track in sight and not a single moment to get bored. With the finest English accent since the invention of belpop, and with a reÃƒÂ¯ncarnation of the young Bowie as the drummer/singer. Doomed is the one that's got to pick singles from this lot .. I wouldn't know which one to pick, as my favourites vary all the time, with the most constant being &quot;forever&quot;, &quot;a naked girl&quot; and certainly &quot;true&quot;.\nBut, as I was saying, it's also a bit of a flop. For &quot;the world has kept on turning as it did before the release&quot;, they have already noticed, and gathering of girls with &quot;I &quot; t-shirts are also few and far between. The Das Pop sound is made up of echo's, of Blur and Bowie, of Pink Floyd and XTC, of Pulp and the Beatles, and is so stuffed to the rim with cheezy synth sounds &amp; effects that even a collector of cheezy synth sounds &amp; effects would quickly grow weary of them. Das Pop is more British than Britpop, and who the heck is waiting for that, except for a few people at NME &amp; Q who are always on the lookout for the newest hypable hypeworthy hype. And, as my last argument, that the best song on &quot;I &quot; is &quot;the little boy&quot;, and that one dates from last year and is only in the bonus tracks (from which they even omitted &quot;A different beat&quot;, their 1st single, go figure)\nSo, Das Pop has sadly enough not made a world class album (yet), but certainly one that can travel round the world without blushing.\n\n\n\n\n\t\n\nDAS POP &quot;I &quot;\n\n\n\n\n1.The One\n2. Such a day\n3. Baby of Gold\n4. A Naked Girl\n5. The Love Program\n6. Forever\n7. Rosie\n8. Ordinary Sunset\n9. Sing Song\n10. True\n11. All For Love\n97. The Little Boy\n98. Electronica for Lovers\n99. Tonight \n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:0d4a5b9d26b4f84f9841743d3098b732fc3b2ea3","amp;dn":"Das+Pop+-+I+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d4a5b9d26b4f84f9841743d3098b732fc3b2ea3","infoHashBuffer":{"type":"Buffer","data":[13,74,91,157,38,180,248,79,152,65,116,61,48,152,183,50,252,59,46,163]},"announce":[],"urlList":[]}}