{"title":"Paul McCartney and Wings - Wild Life (Unissued DCC CD)","uid":6305492,"size":330082069,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0d6a0a3c3007b28aae9ba2b54dd302a7ffe2bd9b&amp;dn=Paul+McCartney+and+Wings+-+Wild+Life+%28Unissued+DCC+CD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Doing_It_4_The_Lulz","files":19,"time":1302313260,"description":"Paul McCartney and Wings - Wild Life (Unissued DCC CD)\n\nThis is one of the unreleased DCC titles that Steve Hoffman mastered, and that Steve took to selling CD-R's on his website of during a &quot;forum fundraiser&quot;. Most of them sold between $250-500... \n\nSee my other torrents for his Wings &quot;Wings Greatest&quot; and George Harrison &quot;All Things Must Pass&quot;.\n\nFrom the notes that I recieved with this release (much thanks to the individual who supplied them to me):\nThis is one of the CDR's that Steve Hoffman illegally sold on his website for an inflated profit - now liberated! Don't support him or his sham of a label!\n\nFrom Steve's blurb on his site (now since scrubbed):\nNew SH Forum Fundraiser-Unreleased DCC Gold CD solo Beatles' masterings, etc. by S.H.\n\nI've been holding on to these since the demise of DCC and really there is no point to me keeping them any longer. I'm more concerned at this point with raising money for the continued upgrading of these Forums. We are growing like crazy! I will give these out as gifts to the most generous contributors.\n\nThese discs are the only copies of my work of the below mentioned albums, cloned to CD-R from the old crumbling PCM 1630 master tapes (since destroyed). So this is ALL that remains of these projects. The paper files have been destroyed along with any and all artwork mock-ups, etc. I saved these &quot;OK'd&quot; test discs basically for nostalgia sake but perhaps they need a home where someone will play them and enjoy them since I never do (too depressing at what &quot;might have been&quot;).\n\nHowever, I revisited a bunch of these today after many years and I'm still very happy with the way they turned out. So it's bittersweet for me. I figured now would be a good time to place them in a good home while I am in the &quot;clearing out the old life&quot; mood.\n\n--------------------------------------------\n\nPAUL McCARTNEY &amp; WINGS - &quot;Wild Life&quot;, unissued DCC Gold Disc, mastered by SH from the original analog master tapes.\n\nContains:\n\nMumbo/Bip Bop/Love Is Strange/Wild Life/Some People Never Know/I Am Your Singer/Bip Bop Link (instrumental)/Tomorrow/Dear Friend/Mumbo Link (instrumental) and FOUR BONUS TRACKS: ANOTHER DAY/OH WOMAN, OH WHY/MARY HAD A LITTLE LAMB/LITTLE WOMAN LOVE (Yes, we made them give us &quot;Another Day&quot;!)\n\nHere is how we will work this: I will give these out as gifts to the most generous contributors. Send a message to Dave The Night Gort by clicking on CONTACT US at the bottom of any page and tell him how much you want to donate to the SH Forums and what disc(s) you want as your reward for contributing to the welfare of this place.\n\nUpdates daily on this thread will show what the highest amounts are....\n\nDave will compile a list and on Sunday night, November 6th at 11:59 PST, Dave will determine who offered the highest donations and what their choice of gift discs are.\n\nThat sounds like a fair way to do it. All money raised (after taxes) will go right into the SH Forums Kitty and be used to keep this place growing, moving quickly down the Internet and commercial free for a long time to come, hopefully years.\n\nI WILL POST DAILY UPDATES AS TO WHERE THE PRICES ARE ON EACH DISC AS SOON AS DAVE GIVES ME THE INFORMATION.\n\nGOOD LUCK TO ALL! THANK YOU FOR YOUR DONATIONS.","torrent":{"xt":"urn:btih:0d6a0a3c3007b28aae9ba2b54dd302a7ffe2bd9b","amp;dn":"Paul+McCartney+and+Wings+-+Wild+Life+%28Unissued+DCC+CD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d6a0a3c3007b28aae9ba2b54dd302a7ffe2bd9b","infoHashBuffer":{"type":"Buffer","data":[13,106,10,60,48,7,178,138,174,155,162,181,77,211,2,167,255,226,189,155]},"announce":[],"urlList":[]}}