{"title":"Call of Duty- Modern Warfare 2- The Pirate(TPR)","uid":6244124,"size":11949394063,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0d7866ff2a91cb67be53966c6ce71224932e6a2b&amp;dn=Call+of+Duty-+Modern+Warfare+2-+The+Pirate%28TPR%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"----TPR----","files":4,"time":1300180883,"description":"Call of Duty Modern Warfare 2.\n\n\n\nDespite the efforts of the United States Marine Corps and the Special Air \nService, the Ultranationalists seize control of Russia and declare Imran Zakhaev \na hero and martyr, erecting a statue of him in the heart of Red Square. \nMeanwhile, Vladimir Makarov, one of Zakhaev's former lieutenants, begins a \ncampaign against Europe by committing acts of terrorism over the course of five \nyears. In Afghanistan, U.S. Army Ranger Joseph Allen assists in the taking of a \ncity from insurgents. Impressed by Allen's abilities, Lieutenant General \nShepherd recruits him into &quot;Task Force 141&quot;, an elite, multi-national counter-\nterrorist unit under Shepherd's command. Meanwhile, two other members of 141, \nJohn MacTavish and Gary Sanderson infiltrate a Russian airbase in the Tian Shan \nmountains to retrieve an ACS (Attack Characterization System) module from a \ndowned satellite.\nIntroduction to the game\n\nAllen is later sent on an undercover mission in Russia for the CIA, joining \nMakarov in a massacre of civilians at the Zakhaev International Airport in \nMoscow. Makarov has been aware of Allen's identity and kills him during \nextraction, leaving his body to spark a war between Russia and the United States \nof America. Angered by what was believed to be an American-supported terrorist \nattack, Russia retaliates with a massive surprise invasion on the United States \nafter bypassing its early warning system, revealing that the ACS module \nMacTavish and Sanderson recovered had already been compromised before its \nretrieval. Sergeant Foley leads his squad of Army Rangers, including James \nRamirez, in defense of a suburb in northeastern Virginia against the Russian \ninvasion. They then proceed towards a war-torn Washington, D.C., where U.S. \nforces are fighting the Russians for control of the capital.\n\nMeanwhile, 141 searches for evidence that implicates Makarov as the mastermind \nbehind the airport massacre, as all proof of Makarov's involvement died with \nAllen. Intelligence leads them to a Favela, where the team investigates leads on \nMakarov's contact, weapons dealer Alejandro Rojas. They find out from Rojas that \nMakarov's worst enemy, known as Prisoner 627, is locked up in a Russian gulag. \nThe Task Force assaults the prison and manages to free 627, who turns out to be \nCaptain Price. Price agrees to aid Soap and Shepherd in tracking down Makarov. \nPrice decides that ending the war in America is their first priority. To end it, \nhe temporarily goes rogue, and leads them to raid a Russian port, where they \ngain control of a nuclear submarine. Price uses the submarine to launch a \nballistic missile towards Washington D.C. He sets the warhead to detonate in the \nupper atmosphere, which destroys the International Space Station and creates an \nelectromagnetic pulse, which cripples vehicles and electronic equipment on both \nsides, giving the Americans a slight advantage. Back on the ground, Foley and \nhis squad seek shelter from the disabled aircraft that are now literally falling \nfrom the sky, and proceed to the White House. There, they receive a transmission \ninforming them that the Air Force is preparing to carpet bomb the entire city to \ndeny the Russians a strong foothold. Foley's squad fight their way to the roof \nof the White House and set off flares in the nick of time, aborting the air \nstrike. Flares are lit on the rooftops of other landmarks, signifying that the \ncity is still in American hands.[33]\n\nNarrowing down Makarov's hiding place to two separate locations, Task Force 141 \ndecides to split up. Price and Soap travel to an aircraft bone-yard in \nAfghanistan, while Roach and Ghost raid Makarov's safe house on the Georgian-\nRussian border. At the safe house, Roach and his team obtain vital intelligence \nfrom Makarov's computer and escape with Makarov's men in pursuit. However, when \nthey reach the extraction point Shepherd betrays them, retrieving the \nintelligence and taking it with him, murdering Roach and Ghost in the process. \nPrice and MacTavish quickly learn of Shepherd's betrayal, though Price states \nthat he wasn't betrayed since he never trusted Sheperd. The duo then manage to \nescape a battle between Shepherd and Makarov's men with the help of Nikolai. \nAfter contacting Makarov and offering to kill Shepherd for him, Makarov reveals \nShepherd's location at a mountain base in Afghanistan. Price and MacTavish raid \nthe base in an attempt to take revenge on Shepherd in a suicide mission. During \nthe infiltration, Shepherd tries to escape and a long boat pursuit ensues.\n\nAt the climax of the pursuit, Shepherd boards a helicopter, only for Price to \ndisable it by shooting the helicopter's rotor, causing a crash landing. Price \nand MacTavish tumble over a waterfall in the process. After recovering from the \nfall, Soap is armed with only a knife and goes after Shepard on the brink of \ndeath, staggering to him, as he goes to knife, Shepard counters his attack with \na knife of his own. Then as Shepard goes to end the life of MacTavish (who is \nnow laying on the ground bleeding out with a tanto blade in his chest), Price \ntackles him to the ground and engages him in hand-to-hand combat. After watching \nthe two duke it out, Shepard gets the upper hand, but Soap is able to extract \nthe knife from his chest and deliver a knife directly into the eye of Sheperd, \nkilling him instantly. Price regains conciousness and inspects MacTavish's \nwounds as Nikolai arrives in a helicopter to extract them. Nikolai warns them \nthat they will be pursued, but Price insists that MacTavish receive medical \nattention; Nikolai mentions that he knows a safe place to go to, and MacTavish \nand Price are now wanted criminals globally, and go into hiding. \n\nInstructions:\n\n1. Unpack using Winrar, 7Zip etc.\n2. Play using &quot;iw4sp_nosteam.exe&quot;\n3. If dll files are missing, download them from &quot;http://www.dll-files.com/&quot;\n\n\nPacked by me, The Pirate(TPR).","torrent":{"xt":"urn:btih:0d7866ff2a91cb67be53966c6ce71224932e6a2b","amp;dn":"Call+of+Duty-+Modern+Warfare+2-+The+Pirate%28TPR%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d7866ff2a91cb67be53966c6ce71224932e6a2b","infoHashBuffer":{"type":"Buffer","data":[13,120,102,255,42,145,203,103,190,83,150,108,108,231,18,36,147,46,106,43]},"announce":[],"urlList":[]}}