{"title":"Electric Rain Swift 3D v6.0.876  [pmsyb]","uid":5054009,"size":48309193,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0d9acf1ca80bff8c9d77b22496dc96625614f524&amp;dn=Electric+Rain+Swift+3D+v6.0.876++%5Bpmsyb%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pmsyb","files":3,"time":1250312299,"description":"\n\n                             Electric Rain Swift 3D v6.0.876\n\n\nThe ultimate 3D software for graphic and rich media designers using Adobe FlashÃ‚Â® and Microsoft Expression BlendÃ‚Â®. Swift 3D is the only 3D software to directly integrate with Flash through the Swift 3D File Importer and SmartLayer Technology and exports to Microsoft XAML. Swift 3D's toolset and interface allow anyone to quickly create 3D content, while providing a full set of advanced tools to grow into. Swift 3D is a powerful, easy-to-use 3D solution that delivers high-quality results\n\nSwift 3D v6 introduces a very simple but extremely powerful Boolean primitive to our modeler, which allows you to combine or punch holes through objects using other 3D objects in your scene. It's all non-destructive, allowing easy editing and unlimited possibilities\n\nSuperior Flash Integration \n Swift 3D is the only 3D tool to offer direct integration with Adobe Flash through the Swift 3D File Importer. SmartLayer Technology offers designers ultimate control over their 3D vector renderings. All important aspects are automatically separated out into different layers when imported to Flash, reducing file size and broadening design possibilities. To learn more about SmartLayers.\n\nFeatures New to Swift 3D Version 6\n\n3D Boolean Operations\nExpand your modeling possibilities. Boolean operations allow you to combine or punch holes through objects using other 3D objects in your scene. It's all non-destructive, allowing easy editing and unlimited possibilities!\n\n5X Faster Raster Rendering Speed \nYour time is valuable, and our engineers have been hard at work trying to figure out new ways to speed up our system so you're more productive. The result is a new rendering algorithm for our ray tracer that will render raster 3D images up to 5x faster\n\nAdvanced Texture Mapper\nMapping complex textures to your 3D models just got a lot easier. By converting a viewport into a 2D representation of your model with the bitmap texture shown in the background, this new interface allows for very precise control over how your bitmap texture gets applied to your models,\n\nClones and Arrays\nSave time reproducing many of the same 3D objects. Create a clone of an object so that when one object is changed, all of the clones change in the same manner. The secondary step is an array feature that distributes the cloned objects along defined axis with adjustable positioning.\n\nBackground Image Tracing \nEasily create 3D objects within the Extrusion and Lathe Editors by tracing a bitmap image in the background. You have full control of the position and transparency level of the background image for detailed tracing. \n\nPapervision3D 2.0 and Collada Format Support \nIs Papervision3D too complex for you? Let Swift 3D v6 do the work for you by creating the PV3D project for you. Swift 3D v6 now exports to the latest Papervision3D v2.0 spec and Collada .dae format, while automatically creating the full Papervision project for you in one simple export. \n\nBump Map Textures for More Realism \nBump mapping is a technique to make a rendered surface look more realistic by modeling the interaction of a bumpy surface texture with lights in the environment. Think topo maps on globe.\n\nSoft Shadow Support\nNow you can add that extra photo realism to your raster scenes by rendering soft shadows from area lights. Just adjust how big / small your light is, and the soft shadow adjusts accordingly. \n\nExtrusion &amp; Lathe Multi-Path Support\nNow you can draw multiple unique paths in the Extrusion and Lathe editors, providing separate in-context multiple 3D object creation. Just another way Swift 3D gives you simple yet powerful modeling tools.\n\nMultiple Processor Rendering Support\nSwift 3D can exploit all of the processors available on your system and can make the work simultaneously on the same raster render to provide faster renders. \n For example, on a multiprocessing platform with 4 processors a user can expect up to a fourfold increase in render performance/speed.\n\nCross Platform Serial Numbers\nDo you have a Windows PC and a Macintosh? Your Swift 3D v6 serial number is now universal and will work on either platform, giving you the freedom to use Swift 3D on both platforms without the hassle of contacting us for an additional serial number or being forced to switch platforms.\n\nUX Improvements\nWe've expanded user preference configuration to specify viewport layout and background color, and added more Camera control allowing you to now Pan and Zoom free cameras, and Rotate and Zoom target cameras. \n\n\nSystem Requirements\nWindows 98, NT, 2K, XP, Vista \nMin: 1.2 Ghz processor \nRec: 2.0 Ghz processor \nMin: 256 MB \nRec: 2 GB RAM for XP, Vista) \n25 MB available disk space \n1024 x 768 monitor resolution\n\nMacintosh\t\nSwift 3D for Mac is Now Universal Binary \nMac OS X 10.2+ \nMin: 1 Ghz processor \nRec: 2.0 Ghz processor \nMin: 256 MB \nRec: 2 GB RAM \n25 MB available disk space \n1024 x 768 monitor resolution\n\nExtract Electric Rain Swift 3D v6.0.876.rar\nRun setup.exe\nStart program\nEnter personal info.I used home for organization\nGenerate key for Swift 3D v6 and enter.\n &lt;a href=&quot;\nhttp://www.swift3d.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swift3d.com/&lt;/a&gt;\n\n\n\n                                    !!!!!!!!!! ENJOY !!!!!!!!!!\n\n\n\n\n\n","torrent":{"xt":"urn:btih:0d9acf1ca80bff8c9d77b22496dc96625614f524","amp;dn":"Electric+Rain+Swift+3D+v6.0.876++%5Bpmsyb%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d9acf1ca80bff8c9d77b22496dc96625614f524","infoHashBuffer":{"type":"Buffer","data":[13,154,207,28,168,11,255,140,157,119,178,36,150,220,150,98,86,20,245,36]},"announce":[],"urlList":[]}}