{"title":"The House On Straw Hill UNCUT (1976) VHSRip","uid":5607524,"size":718009681,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0dce5becea406d7b8e4a53a1100f5df7f21d47f6&amp;dn=The+House+On+Straw+Hill+UNCUT+%281976%29+VHSRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thelad53","files":49,"time":1275664339,"description":"This is an &quot;uncut&quot; version. It runs 80.5 minutes @25 fps which tranlates to about 84 minutes @24 fps, so it would seem to be uncut. There was another rip around that ran  81 minutes @25 fps, but it had 38 seconds of logos before the movie that this one doesn't have. Both the Odyssey DVD and the Village Entertainment DVD releases were cut. Notable as the only British film on the &quot;Video Nasties&quot; list.\n\n&quot;Not so much a horror film, more a psychological thriller with lashings of nudity and violence, this cheapjack contribution to the 'sex-horror' subgenre of 1970's cinema stars Euro favorite Udo Kier (sporting a dubbed mid-Atlantic accent) as a successful novelist whose guilty secrets have isolated him within a picturesque cottage deep in the English countryside. Under a deadline to complete another book in the wake of his first bestseller, he hires temp secretary Linda Hayden (THE BLOOD ON SATAN'S CLAW), a ripe young sexpot given to masturbating languorously wherever the fancy takes her (in her bedroom, in the fields surrounding Kier's home) and murdering anyone who disturbs her fragile psychosis. 'Nothing, but nothing, is left to the imagination...' promised the original UK ad-mats, and - true to form - the film wears its exploitation elements like a badge of honor, casting British sex queen Fiona Richmond in her first major role (prompting acres of free publicity in contemporary skin mags) as Kier's highly-sexed girlfriend who enjoys lusty romps with her neurotic paramour before surrendering to a lesbian liaison with the lovely Linda.\n\nDirected by James Kenelm Clarke (HARDCORE, LET'S GET LAID), produced by Brian Smedley-Aston (VAMPYRES, DEADLY MANOR), and partly financed by Paul Raymond (the smut baron who launched Richmond to fame), the film slows to a crawl between the aforementioned bouts of nudity and violence, until the reasons for Hayden's murderous rampage are unveiled and she launches a merciless assault on the object of her bloody wrath. Though she (reportedly) distanced herself from the production in later interviews, Hayden is the film's trump card, a voluptuous beauty whose ample charms and faux innocence conceal a cat-like fury. Sleaze fans will certainly get their money's worth, though casual viewers may be less forgiving of the movie's many drawbacks. Also known as TRAUMA and THE HOUSE ON STRAW HILL.&quot;  -- IMDB comments by Libretio\n\nGSpot v2.70a avi file details:\n------------------------------\nFilename.........: The House On Straw Hill (1976).avi\nFilesize.....: 718,002,530 bytes\nRuntime......: 1:20:29 (120723 frames)\nVideo Codec..: DivX 4 (OpenDivX) (//)\nVideo Bitrate: 1048 kbps\nBits/Pixel: 0.136\nAspect Ratio.: 640x480 (1.333)\nFramerate....: 25.000 fps\nAudio Codec..: 0x0055 MPEG-1 Layer 3\nAudio Bitrate: 128kbps 2ch CBR 48000Hz\nLanguage.....: English","torrent":{"xt":"urn:btih:0dce5becea406d7b8e4a53a1100f5df7f21d47f6","amp;dn":"The+House+On+Straw+Hill+UNCUT+%281976%29+VHSRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dce5becea406d7b8e4a53a1100f5df7f21d47f6","infoHashBuffer":{"type":"Buffer","data":[13,206,91,236,234,64,109,123,142,74,83,161,16,15,93,247,242,29,71,246]},"announce":[],"urlList":[]}}