{"title":"Chain Reaction   (BBC Radio - Series 1 to 5)","uid":5113780,"size":752753257,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0de7f20d0085e001b8aeba9d38b090d134132673&amp;dn=Chain+Reaction+++%28BBC+Radio+-+Series+1+to+5%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eddie1969","files":-1,"time":1254951686,"description":"Chain Reaction - Series 01 to 05 - Audio Chat-Show Comedy - BBC Radio 4 and 7 via DVB-T\n\n\n28 x 30 Minute Episodes + Extras - 128Kbps - Mp3\n\n\n\nChain Reaction is a simple idea for a highly entertaining series.\n\nA well-known figure from the entertainment industry begins the series interviewing the person of their choice.\n\nThe following week the interviewee becomes interviewer and chats to their chosen guest. And so on and so on.\n\n\nChain Reaction - S01 - E01 - Jenny Eclair Interviews Jimmy Carr\nChain Reaction - S01 - E02 - Jimmy Carr Interviews Matt Lucas\nChain Reaction - S01 - E03 - Matt Lucas Interviews Johnny Vegas\nChain Reaction - S01 - E04 - Johnny Vegas Interviews Stewart Lee\nChain Reaction - S01 - E05 - Stewart Lee Interviews Alan Moore  (&lt; Extras edited into end of episode)\nChain Reaction - S01 - E06 - Alan Moore Interviews Brian Eno\n\nChain Reaction - S02 - E01 - Jo Brand Interviews Barry Cryer\nChain Reaction - S02 - E02 - Barry Cryer Interviews Mark Thomas\nChain Reaction - S02 - E03 - Mark Thomas Interviews Alexei Sayle\nChain Reaction - S02 - E04 - Alexei Sayle Interviews Lenny Henry\nChain Reaction - S02 - E05 - Lenny Henry Interviews Bill Bailey\nChain Reaction - S02 - E06 - Bill Bailey Interviews Simon Pegg\n\nChain Reaction - S03 - E01 - Marcus Brigstocke Interviews Clive Anderson\nChain Reaction - S03 - E02 - Clive Anderson Interviews John Lloyd\nChain Reaction - S03 - E03 - John Lloyd Interviews Phill Jupitus\nChain Reaction - S03 - E04 - Phill Jupitus Interviews John Hegley\nChain Reaction - S03 - E05 - John Hegley Interviews Jack Dee\nChain Reaction - S03 - E06 - Jack Dee Interviews Jeremy Hardy\n\nChain Reaction - S04 - E01 - Catherine Tate Interviews David Tennant\nChain Reaction - S04 - E02 - David Tennant Interviews Richard Wilson\nChain Reaction - S04 - E03 - Richard Wilson Interviews Arabella Weir\nChain Reaction - S04 - E04 - Arabella Weir Interviews Paul Whitehouse\n\nChain Reaction - S05 - E01 - Robert Llewellyn Interviews Dave Gorman\nChain Reaction - S05 - E02 - Dave Gorman Interviews Frank Skinner\nChain Reaction - S05 - E03 - Frank Skinner Interviews Eddie Izzard\nChain Reaction - S05 - E04 - Eddie Izzard Interviews Alastair Campbell\nChain Reaction - S05 - E05 - Alastair Campbell Interviews Alistair McGowan\nChain Reaction - S05 - E05 - Alistair McGowan Interviews Simon Callow\n\n\nAudio Format    : MP3\nDuration        : 28mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\nRipped from the audio torrent site radioarchive.cc - Registration is FREE!!\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:0de7f20d0085e001b8aeba9d38b090d134132673","amp;dn":"Chain+Reaction+++%28BBC+Radio+-+Series+1+to+5%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0de7f20d0085e001b8aeba9d38b090d134132673","infoHashBuffer":{"type":"Buffer","data":[13,231,242,13,0,133,224,1,184,174,186,157,56,176,144,209,52,19,38,115]},"announce":[],"urlList":[]}}