{"title":"Reino.de.sombras.(ebook).","uid":6212194,"size":6332835,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e4e465bc8e6297392014b1464721addae8c58ef&amp;dn=Reino.de.sombras.%28ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1299024725,"description":"ParÃƒÂ­s, 1938. Nicholas Morath, ex oficial de caballerÃƒÂ­a del ejÃƒÂ©rcito hÃƒÂºngaro, regresa a su apartamento del sÃƒÂ©ptimo distrito y a los brazos de su joven amante argentina despuÃƒÂ©s de haber realizado un trabajo en Eslovaquia por encargo de su tÃƒÂ­o, el conde Janos Polanyi.\n\nEn Viena, los nazis han tomado las calles.\n\n\n\nEl conde Janos Polanyi, diplomÃƒÂ¡tico del gobierno hÃƒÂºngaro, conspira desde su oficina parisina para evitar que su paÃƒÂ­s selle una alianza con la Alemania de Hitler. HungrÃƒÂ­a es ÃƒÂºnicamente un pequeÃƒÂ±o territorio atrapado entre potencias demasiado poderosas como para permitirse un solo paso en falso. El conde lo sabe, y para jugar las cartas de su polÃƒÂ­tica clandestina necesita a los aristÃƒÂ³cratas exiliados, a los polÃƒÂ­ticos britÃƒÂ¡nicos, a los militares alemanes renegados y, tambiÃƒÂ©n, a Morath.\n\nPorque es Morath quien hace el trabajo que Polanyi organiza desde su puesto de poder, ÃƒÂ©l quien se mueve entre las terrazas de la costa francesa y las fortalezas de Checoslovaquia, entre los jardines privados de Budapest y los restaurantes y cabarets del ParÃƒÂ­s bohemio en el que nada hace presagiar una nueva gran guerra.\n\nDespuÃƒÂ©s de Viena, las hordas nazis se adentran en Praga y amenazan Varsovia. En los cafÃƒÂ©s parisinos empiezan a acallarse las risas, y los pequeÃƒÂ±os favores que Morath hace a su tÃƒÂ­o comienzan a transformarse en misiones secretas en las que nada es lo que parece. El mundo se ha convertido en un lugar en el que la vida, su vida, estÃƒÂ¡ perdiendo valor por momentos.\n","torrent":{"xt":"urn:btih:0e4e465bc8e6297392014b1464721addae8c58ef","amp;dn":"Reino.de.sombras.%28ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e4e465bc8e6297392014b1464721addae8c58ef","infoHashBuffer":{"type":"Buffer","data":[14,78,70,91,200,230,41,115,146,1,75,20,100,114,26,221,174,140,88,239]},"announce":[],"urlList":[]}}