{"title":"Baer-Inside New Age Nightmare(expose by new age leader)(1989)","uid":5109853,"size":875338,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f1157469b52ad221361398dbc20a03cc6525bee&amp;dn=Baer-Inside+New+Age+Nightmare%28expose+by+new+age+leader%29%281989%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1254673465,"description":"This is Randall N. Baer's shocking book Inside the New Age Nightmare - A Former Top New Age Leader Takes You on a Dramatic Journey (1989) where for the first time ever, a world renowned New Age leader tells the inside story of the fast-growing New Age movement and exposes its power of seduction, from teenage dabbling in Eastern religions to a meteoric rise in New Age leadership. He details the sequence of uncanny events and bizarre experiences that led him to be an internationally recognized expert in &quot;crystal power&quot; and New Age philosophy. In the midst of a storybook career, Baer had a dramatic and horrifying encounter with the evil forces behind the New Age Movement. Discover from a former insider's perspective, penetrating insights into the underlying reasons for the New Age movement's rapid success. Experience this mysterious and often bizarre world, as Baer exposes the New Age Movement and presents many startling insights that have never been revealed before. The first-person account isn't just a scary tale meant to frighten children away from the New Age as it's someone's personal story of what happened to them. It is written honestly by a man who dove in head first searching for answers to life's deepest questions. Inside the New Age Nightmare allows you to follow the author on a quest for truth and gives the reader rare insight into what the New Age movement is all about. Find out what lies behind the multi-billion dollar New Age industry with millions of followers all around the world. 200 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:0f1157469b52ad221361398dbc20a03cc6525bee","amp;dn":"Baer-Inside+New+Age+Nightmare%28expose+by+new+age+leader%29%281989%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f1157469b52ad221361398dbc20a03cc6525bee","infoHashBuffer":{"type":"Buffer","data":[15,17,87,70,155,82,173,34,19,97,57,141,188,32,160,60,198,82,91,238]},"announce":[],"urlList":[]}}