{"title":"Lita Ford - Gotta Let Go","uid":5134347,"size":139233284,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0ffab6e6d1a6bf14b8b64c931d851ac53567f317&amp;dn=Lita+Ford+-+Gotta+Let+Go&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":1,"time":1256372972,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nLita Ford (born September 19, 1958) is a British-born, American rock musician and singer who was the lead guitarist for The Runaways and achieved popularity for her solo career during the 1980s and late 2000s.\n\nDancin' on the Edge is Lita Ford's second solo album. It features the drummer Randy Castillo, who later played for Ozzy Osbourne. It also features the bassist Hugh McDonald, who is currently the hired studio/live session bassist for Bon Jovi.\n\nIn June 2009, Lita began touring the US and Europe, with a new line-up consisting of Ron 'Bumblefoot' Thal (Guns N' Roses guitarist, 2006 - present) on guitar, Dennis Leeflang (Bumblefoot drummer) and PJ Farley on bass (Trixter, Ra) and Michael T. Ross (Angel/XYZ).\n\nFord will release a new album Wicked Wonderland on October 6, 2009 via JLRG Entertainment. The album was written and produced by Ford, husband Jim Gillette, and Greg Hampton. Lita will tour the US in the Fall and Winter of 2009, including dates on Queensryche's American Soldier Tour.\n\nLita Ford contributed her likeness and voice to the Xbox 360 and Playstation 3 video game, Brutal Legend. Lita appears as the character Queen Lita, alongside Jack Black, Tim Curry, Ozzy Osbourne, Rob Halford, and Lemmy Kilmister. Lita's song &quot;Betrayal&quot; also appears in the game, which also features songs by Black Sabbath, Judas Priest, Motorhead, Motley Crue, Kiss, Ozzy Osbourne, Marilyn Manson, Ministry, Rob Zombie, Megadeth, King Diamond, Scorpions, Slayer, Anthrax, Sanctuary, and Tenacious D.\n\nLita and her family also appear in comic book form in &quot;The Gillettes: Family Business&quot; written by Jake Tinsley and depicted by Manga artist, Jason Dube.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:0ffab6e6d1a6bf14b8b64c931d851ac53567f317","amp;dn":"Lita+Ford+-+Gotta+Let+Go","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ffab6e6d1a6bf14b8b64c931d851ac53567f317","infoHashBuffer":{"type":"Buffer","data":[15,250,182,230,209,166,191,20,184,182,76,147,29,133,26,197,53,103,243,23]},"announce":[],"urlList":[]}}