{"title":"R.E.M. - Eponymous (1988) WMA320","uid":6153646,"size":110631952,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:108d8e59fa2c616fee666e10384ee853414b6b78&amp;dn=R.E.M.+-+Eponymous+%281988%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1296962986,"description":"Eponymous was the first R.E.M. album I purchased and it turned me into a loyal fan. I soon snatched up their entire back catalog and they were a significant part of my music listening life for years to come. That is about as good a tribute to an album I can give. \n\nOf course, being a greatest hits compilation, all the songs here are great, but there are some alternative mixes here for fans who already have these songs on the studio releases. There is a different version of &quot;Radio Free Europe&quot; here although I like the one on Murmur better. The bass stands out more on the Murmur mix whereas the bass on this album's version is less prominent and seems to be covered up as well as some of the other sound details. I do prefer the different vocal mix to &quot;Gardening at Night&quot; than the one on Chronic Town. The Chronic Town version has very weak sounding vocals which had a negative effect on the song. The vocals here are a lot clearer so the song sounds much better. I disagree with the note on the record sleeve that the Eponymous version of &quot;Finest Worksong&quot; (the 12&quot; and 7&quot; version) is better than the original off Document. This mix has a horn section that I do not care for. A track that some R.E.M. fans may not have is &quot;Romance.&quot; It is a very early track that surfaced on the &quot;Made in Heaven&quot; soundtrack (a film I have never heard of but it briefly plays this track). It turns out to be one of my favorite R.E.M. songs. The intense bass really drives the song and makes it unique. Eponymous is worth picking up for that track alone. Eponymous also includes interesting comments about each track. \n\nby nwrewiew\n\nTRACKLIST:\n\n01 - Radio Free Europe (Original Hibtone Single).wma             \n02 - Gardening At Night (Different Vocal Mix).wma                \n03 - Talk About The Passion.wma                                  \n04 - So Central Rain.wma                                         \n05 - (Don't Go Back To) Rockville.wma                            \n06 - Can't Get There From Here.wma                               \n07 - Driver 8.wma                                                \n08 - Romance.wma                                                 \n09 - Fall On Me.wma                                              \n10 - The One I Love.wma                                          \n11 - Finest Worksong (Mutual Drum Horn Mix).wma                  \n12 - Its The End Of The World As We Know It (And I Feel Fine).wma\n\nWMA 320Kbps 44100Hz STEREO\n\nDEDICATED TO azza1969\n\n","torrent":{"xt":"urn:btih:108d8e59fa2c616fee666e10384ee853414b6b78","amp;dn":"R.E.M.+-+Eponymous+%281988%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"108d8e59fa2c616fee666e10384ee853414b6b78","infoHashBuffer":{"type":"Buffer","data":[16,141,142,89,250,44,97,111,238,102,110,16,56,78,232,83,65,75,107,120]},"announce":[],"urlList":[]}}