{"title":"David Pogue's Digital Photography: The Missing Manual","uid":5494790,"size":7448705,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:11ebd42c211cc16cd33202cd74dd98860184ceeb&amp;dn=David+Pogue%5C%27s+Digital+Photography%3A+The+Missing+Manual&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"artpepper","files":-1,"time":1271200442,"description":"David Pogue's Digital Photography: The Missing Manual\n\nPogue Press | 2009 | ISBN: 0596154038 | 304 pages | PDF | 6,4 MB\n\n\n\n\n\nIf you're ready to jump into digital photography or would like to increase the skills you already have, David Pogue's Digital Photography: The Missing Manual is just what you need. Bestselling author David Pogue provides a no-nonsense guide to the entire process, including how to: buy and use a digital camera; get the same photographic effects as the pros; manage the results on your Mac or PC; edit photos; and, finally, share the results with your adoring fans -- on paper, online, or on mugs, jigsaw puzzles, and blankets.\n\n\n\nAfter reviewing hundreds of digital cameras and photo services in his weekly New York Times column, David Pogue knows digital photography. With this new Missing Manual you will:\n\n\n\nGet expert advice on how to choose a digital camera, including information on the only specs that matter. (Hint: it's not about megapixels).\n\n\nLearn the basics of lighting, composition, and shooting lots of photos\nUnderstand how to choose the best camera settings for 20 different scenarios\n\n\nUnravel the problems of correcting images and storing them\n\n\nLearn David's tips and tricks for sharing and printing images\n\n\nGet a special troubleshooting section you can turn to when things go wrong\n\n\n\nDavid Pogue's witty, authoritative voice has demystified the Mac, Windows, iPods and iPhones for millions of readers. Now, he offers step-by-step instructions and plenty of friendly advice to help you join in the fun and get real satisfaction from digital photography.","torrent":{"xt":"urn:btih:11ebd42c211cc16cd33202cd74dd98860184ceeb","amp;dn":"David+Pogue%5C%27s+Digital+Photography%3A+The+Missing+Manual","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11ebd42c211cc16cd33202cd74dd98860184ceeb","infoHashBuffer":{"type":"Buffer","data":[17,235,212,44,33,28,193,108,211,50,2,205,116,221,152,134,1,132,206,235]},"announce":[],"urlList":[]}}