{"title":"Coast to Coast AM - 11.02.14 - NASA Conspiracies &amp; Secrecy","uid":6178853,"size":55092346,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:12337b3c1ff46f709d78d9efd0bc9704a4863e01&amp;dn=Coast+to+Coast+AM+-+11.02.14+-+NASA+Conspiracies+%26+Secrecy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pegasus77","files":5,"time":1297874080,"description":"NASA Conspiracies &amp; Secrecy\n---------------------------\nDate: 02-14-2011\nHost: George Noory\n\nGuests: Nick Redfern, Bill Osmunson\n \nBritish ufologist and author Nick Redfern argued that NASA has hidden from the public, evidence of UFO visitations to the Earth, and astronaut sightings of UFOs in space, as well as been involved in cover-ups such as with the Roswell Incident, and the Face on Mars. &quot;The more you look into it, the more we do find profound and fascinating stories that link NASA with UFOs, alien encounters, conspiracies...and different phenomena,&quot; he reported. One document from 1965 detailed a joint FBI/NASA effort to catch a NASA whistleblower who was leaking UFO information and photographs to NICAP. Around that time, the Gemini 4 spacecraft was said to have a UFO detection system built into it, he added.\n\nA former NASA employee, Donna Hare, revealed that NASA actively covered up and altered or airbrushed photographic evidence, said Redfern. Similarly, an employee at Langley Field, Virginia, Karl Wolfe, said there was an effort to cover-up photographic evidence of a large base on the far side of the moon. It was Donna Hare's story that inspired Gary McKinnon to hack into NASA's computer system to look for photos, and he reportedly ran across the phrase &quot;non-terrestrial officers,&quot; Redfern noted.\n\nNASA has also been interested in alien abductions. They've been clandestinely monitoring this scenario with their own think tank, said Redfern, and concluded the abductions are of a rather ominous nature. In general, NASA may be hiding the truth for a variety of reasons, including:\n\nThe implications of ET life disturbs our world view.\nThe admission that we are not in control of our skies.\nTechnology from recovered UFOs could replace or upset our current forms of energy.\n\nFluoride Update\nFirst hour guest, dentist Bill Osmunson shared an update in the fight against fluoride use. While the Federal Dept. of Health and Human Services recently recommended a slight reduction in the amount of fluoride communities add to their water, he characterized the substance as a poison that should not be in our water systems at all. Among the health problems correlated with too much fluoride are thyroid damage, kidney stones, and lowered IQ, he noted.\n\nWebsites:\nnickredfern.com\nfluoridealert.org\n\nBooks:\nThe NASA Conspiracies\nContactees: A History of Alien-human Interaction\nBody Snatchers in the Desert: The Horrible Truth at the Heart of the Roswell Story","torrent":{"xt":"urn:btih:12337b3c1ff46f709d78d9efd0bc9704a4863e01","amp;dn":"Coast+to+Coast+AM+-+11.02.14+-+NASA+Conspiracies+%26+Secrecy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12337b3c1ff46f709d78d9efd0bc9704a4863e01","infoHashBuffer":{"type":"Buffer","data":[18,51,123,60,31,244,111,112,157,120,217,239,208,188,151,4,164,134,62,1]},"announce":[],"urlList":[]}}