{"title":"Trotsky&amp;Jews Behind Russian Revolution(by russian commissar)(193","uid":5094805,"size":156494,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12da9051794340005783dbebbb505a0794460920&amp;dn=Trotsky%26Jews+Behind+Russian+Revolution%28by+russian+commissar%29%28193&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1253462602,"description":"This the shocking booklet Trotsky and the Jews Behind the Russian Revolution (1937) written by a former russian commissar and political insider which exposes the radical jewish element that completely dominated the &quot;russian revolution&quot;. It seems incredible that Trotsky, the son of a greedy Jewish landowner, who exploited his neighbors and hired help, could ever become the world's foremost radical leader and trouble maker. Yet it is still more incredible that he could concentrate international attention upon himself after he has clearly demonstrated his megalomania and unscrupulous attitude toward all human rights and every principle of justice. But Trotsky then, was not only drawing to himself the support of the more radical elements of Europe and the Americas, but was actual head and master brain of the Fourth International, a rival organization of the Communist Third International. What is more, he has also succeeded in winning the sympathies of countless so-called Liberal people, who see him as a martyr of the Stalin regime; a victim of persecution by a government which he himself established, but is now controlled by rival fellow Jews - directed by Stalin's father-in-law Kaganovitch. Find out how there was actually a dialectial rivalry between two jewish groups that both sought dominance in russian revolution, one that was financed by Jacob Schiff's interests and another by Rotschild's banking empire - the latter eventually gaining dominance. 50 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:12da9051794340005783dbebbb505a0794460920","amp;dn":"Trotsky%26Jews+Behind+Russian+Revolution%28by+russian+commissar%29%28193","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12da9051794340005783dbebbb505a0794460920","infoHashBuffer":{"type":"Buffer","data":[18,218,144,81,121,67,64,0,87,131,219,235,187,80,90,7,148,70,9,32]},"announce":[],"urlList":[]}}