{"title":"The.Undertaker.18-0.WrestleMania.Streak.Matches.Complete","uid":6278564,"size":3962079263,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:13146b411b461ec69a5c24a8299e7400beb21ad9&amp;dn=The.Undertaker.18-0.WrestleMania.Streak.Matches.Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"scene4all","files":-1,"time":1301352255,"description":"--------------------------------------------------------------------------------\n                                                                                \n           SSSSSSSSSSSSSSS       444444444                 AAA                  \n         SS:::::::::::::::S     4::::::::4                A:::A                 \n        S:::::SSSSSS::::::S    4:::::::::4               A:::::A                \n        S:::::S     SSSSSSS   4::::44::::4              A:::::::A               \n        S:::::S              4::::4 4::::4             A:::::::::A              \n        S:::::S             4::::4  4::::4            A:::::A:::::A             \n         S::::SSSS         4::::4   4::::4           A:::::A A:::::A            \n          SS::::::SSSSS   4::::444444::::444        A:::::A   A:::::A           \n            SSS::::::::SS 4::::::::::::::::4       A:::::A     A:::::A          \n               SSSSSS::::S4444444444:::::444      A:::::AAAAAAAAA:::::A         \n                    S:::::S         4::::4       A:::::::::::::::::::::A        \n                    S:::::S         4::::4      A:::::AAAAAAAAAAAAA:::::A       \n        SSSSSSS     S:::::S         4::::4     A:::::A             A:::::A      \n        S::::::SSSSSS:::::S       44::::::44  A:::::A               A:::::A     \n        S:::::::::::::::SS        4::::::::4 A:::::A                 A:::::A    \n         SSSSSSSSSSSSSSS          4444444444AAAAAAA                   AAAAAAA   \n                                                                                \n                                                                                \n---------------------------------------------------------------------------------\n\n            The Undertaker 18-0 WrestleMania Streak Matches Complete             \n\n---------------------------------------------------------------------------------\n\n01-0 Jimmy 'Superfly' Snuka\nUndertaker made his WWE debut at the 1990 Survivor Series. Four months later, he made his WrestleMania debut by defeating Jimmy &quot;Superfly&quot; Snuka at WrestleMania VII.\n\n02-0 Jake 'The Snake' Roberts\nIn 1991, Undertaker &amp; Jake &quot;The Snake&quot; Roberts were allies, terrorizing the likes of Ultimate Warrior &amp; Randy Savage. After the Deadman had a change of heart in early 1992, he was Roberts' opponent at WrestleMania VIII.\n\n03-0 Giant Gonzalez\nIn mid-1992, Undertaker began a lengthy rivalry with Harvey Wippleman. At WrestleMania IX, the crafty manager gave Undertaker his toughest challenge yet in the form of the nearly 8-foot tall Giant Gonzales.\n\n04-0 King Kong Bundy\nAfter Ted DiBiase's Corporation stole Undertaker's urn at the 1995 Royal Rumble, the Deadman was looking for revenge when he faced Corporation member King Kong Bundy at WrestleMania XI.\n\n05-0 Diesel\nIn early 1996, Undertaker &amp; Diesel each cost the other an opportunity to win the WWE Championship. At WrestleMania XII, the two big men settled their score as Undertaker looked to go 5-for-5 at WrestleMania.\n\n06-0 Sycho Sid\nAt WrestleMania 13, Undertaker looked to improve his WrestleMania record to 6-0 when he took on Sid for the WWE Championship.\n\n7-0 Kane\nIn 1997, Kane debuted in WWE, costing his brother the first-ever Hell in a Cell Match at Badd Blood. Finally, after months of torment, Undertaker agreed to fight his brother at WrestleMania XIV.\n\n08-0 Big Boss Man\nIn early 1999, Undertaker was doing everything he could to torment Mr. McMahon. So, at WrestleMania XV, the WWE Chairman sent his personal henchman, Big Boss Man, to  battle the Deadman inside Hell in a Cell.\n\n09-0 Triple H\nIn early 2001, Triple H said that he had no one left to beat. Undertaker took offense to that, challenging The Game to a match at WrestleMania X-Seven. (Sound a little familiar? Exactly the same as this WrestleMania, dont you think?)\n\n10-0 Ric Flair\nAt No Way Out 2002, Ric Flair cost Undertaker his match against The Rock. The Deadman then challenged Flair to a match at WrestleMania X8, a challenge &quot;The Nature Boy&quot; initially resisted.\n\n11-0 Big Show &amp; A-Train\nAt WrestleMania XIX, Undertaker was scheduled to team with Nathan Jones to take on Big Show &amp; A-Train. Instead, a pre-match attack by the opponents left Nathan Jones injured, forcing the Deadman to go it alone.\n\n12-0 Kane\nAt WrestleMania XX, the Deadman returned to the ring to renew his rivalry with brother Kane after the Big Red Monster buried him alive at Survivor Series 2003.\n\n13-0 Randy Orton\nAt WrestleMania 21, the legendary Deadman ran his WrestleMania record to a perfect 13-0 when he took on RAW's Legend Killer, Randy Orton.\n\n14-0 Mark Henry\nAt WrestleMania 22, Undertaker ran his perfect WrestleMania record to 14-0 by defeating Mark Henry in a Casket Match. After nailing Henry with a Tombstone, the Deadman rolled the World's Strogest Man into the casket to seal the victory.\n\n15-0 Batista\nAt WrestleMania 23, Undertaker ran his perfect WrestleMania record to 15-0 by defeating Batista. After a hard-fought battle, the Phenom put the Animal away with a Tombstone Piledriver, in the process capturing the World Heavyweight Championship.\n\n16-0 Edge\nUndertaker had never beaten Edge, so his perfect WrestleMania streak was in dire jeopardy going into WrestleMania XXIV. The Rated-R Superstar proved that he was up to the task of withstanding The Phenom's mightiest blows, including a Tombstone Piledriver and Last Ride, until Undertaker locked Edge in his mysterious submission hold. Edge finally tapped out, relinquishing both his World Heavyweight Title and unbeaten record against The Phenom.\n\n17-0 Shawn Michaels\nAt The 25th Anniversary of WrestleMania, it proved to be a battle between darkness and light when Undertaker faced off against &quot;Mr. WrestleMania&quot; Shawn Michaels to improve his legendary record to 17-0 in what many would argue was the greatest match in WWE history.\n\n18-0 Shawn Michaels\nAt WrestleMania XXVI, in a Career vs. Streak Match, The Undertaker defeated Shawn Michaels - for the second year in a row - and not only extended his legendary streak to 18-0, but also ended the storybook career of The Icon, The Showstopper, The Main Event, Mr. WrestleMania himself, Shawn Michaels.\n\n---------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:13146b411b461ec69a5c24a8299e7400beb21ad9","amp;dn":"The.Undertaker.18-0.WrestleMania.Streak.Matches.Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13146b411b461ec69a5c24a8299e7400beb21ad9","infoHashBuffer":{"type":"Buffer","data":[19,20,107,65,27,70,30,198,154,92,36,168,41,158,116,0,190,178,26,217]},"announce":[],"urlList":[]}}