{"title":"Stargate Universe S01 E12 (NL EN Subs) HDTV 2Lions-Team","uid":5498665,"size":1564986769,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:13a355fd574cbbc40ddb0c99a29efe2da974d42c&amp;dn=Stargate+Universe+S01+E12+%28NL+EN+Subs%29+HDTV+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wietseherman","files":-1,"time":1271376885,"description":"Stargate Universe S01E12 NL-SUBS HDTV 2Lions-Team  \n\nSource:HDTV\nFormat: DVD\nNL Subs by: The Thom\nSubs: NL EN instelbaar (Lossless)\nGenre: Sciencefiction\nSound: 5.1 DD\n\n\n\nDe serie geeft antwoord op de functie van de negende 'Chevron' op de Stargate, \n\nwaarvan de functie in de voorgaande series nog onbekend was.\n\nBij aanvang van de serie blijkt dat het Amerikaanse Leger in het geheim een basis \n\ngebouwd heeft op een andere planeet zodat men het geheim van deze negende chevron kan \n\nontrafelen. Wanener de basis onder vuur komt te liggen, lukt het een groep aanwezige \n\nmilitairen en wetenschappers om het enige bruikbare adres te 'draaien'. Men komt zo \n\nuit op een onbemand ruimte-vaartuig van de Ancients genaamd 'Destiny'.\n\nDit schip werd samen met andere schepen honderdduizenden jaren terug erop uitgestuurd \n\nom overal in het universum Stargates te bouwen. Om de stargate op het schip zelf te \n\nbereiken dient gebruik te worden gemaakt van de negende chevron op de Stargate.\n\nVeel van de systemen aan boord van het schip blijken echter zwaar beschadigd. Het is \n\nniet mogelijk voor de groep om naar aarde terug te keren en men zit dus vast op het \n\nschip; enkele miljarden lichtjaren van thuis. Wel legt de Destiny van tijd tot tijd \n\nautomatisch contact met stargates op planeten waar de groep materialen kan vinden om \n\nhet schip te repareren.\n\nStargate Universe is set on the Ancient ship Destiny, which was launched unmanned \n\nhundreds of thousands of years ago. Several ships were sent ahead of it to seed the \n\nuniverse with Stargates. The Ancients had planned on using the Stargate to board \n\nDestiny when it was far out enough into the universe, but learned how to ascend \n\nbefore that time. In order to reach this ship, an address would have to be dialed \n\nconsisting of nine chevrons, a possibility that had been unknown in the previous \n\nStargate series.\n\nThe series begins when a team of soldiers and scientists from present-day Earth step \n\nthrough the Stargate to find the Destiny after their base is attacked. Many of its \n\nprimary systems are damaged or failing, and they are unable to maneuver the ship or \n\neven return to Earth. However, the Destiny periodically stops to dial the Stargate to \n\nplanets with necessary supplies to repair the ship.\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1286039/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1286039/&lt;/a&gt;\n\n*****************************************\n\nBrought to you by\nBack to Basic\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum\n     &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl/index.php&lt;/a&gt;\n2Lions-Team for all your Dutch MOVIES and more\n\n*****************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\n\nDon`t quit after you finished the download, but keep seeding.\t\n\n","torrent":{"xt":"urn:btih:13a355fd574cbbc40ddb0c99a29efe2da974d42c","amp;dn":"Stargate+Universe+S01+E12+%28NL+EN+Subs%29+HDTV+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13a355fd574cbbc40ddb0c99a29efe2da974d42c","infoHashBuffer":{"type":"Buffer","data":[19,163,85,253,87,76,187,196,13,219,12,153,162,158,254,45,169,116,212,44]},"announce":[],"urlList":[]}}