{"title":"chinese healing","uid":5118108,"size":3420356,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13c4795e5bcdc883a605fa76f08f4804783565ce&amp;dn=chinese+healing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dipagra","files":1,"time":1255175619,"description":"Chinese Healing Exercises: The Tradition of Daoyin\n268 pages Publisher: University of Hawaii Press (November 30, 2008) \nLanguage: English \n\n\nProduct Description\n\nDaoyin, the traditional Chinese practice of guiding the qi and stretching the body is the forerunner of Qigong, the modern form of exercise that has swept through China and is making increasing inroads in the West. Like other Asian body practices, Daoyin focuses on the body as the main vehicle of attainment; sees health and spiritual transformation as one continuum leading to perfection or self-realization; and works intensely and consciously with the breath and with the conscious guiding of internal energies.\n\nThis book explores the different forms of Daoyin in historical sequence, beginning with the early medical manuscripts of the Han dynasty, then moving into its religious adaptation in Highest Clarity Daoism. After examining the medieval Daoyin Scripture and ways of integrating the practice into Tang Daoist immortality, the work outlines late imperial forms and describes the transformation of the practice in the modern world.\n\nPresenting a rich crop of specific exercises together with historical context and comparative insights, Chinese Healing Exercises is valuable for both specialists and general readers. It provides historical depth and opens concrete details of an important but as yet little-known health practice. \n","torrent":{"xt":"urn:btih:13c4795e5bcdc883a605fa76f08f4804783565ce","amp;dn":"chinese+healing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13c4795e5bcdc883a605fa76f08f4804783565ce","infoHashBuffer":{"type":"Buffer","data":[19,196,121,94,91,205,200,131,166,5,250,118,240,143,72,4,120,53,101,206]},"announce":[],"urlList":[]}}