{"title":"History of Britain (Monarchy) - David Starkey (Parts 12-16)","uid":5021465,"size":1834792953,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:14c98ee0f32e1b010409ae91bb3d13eacd70806a&amp;dn=History+of+Britain+%28Monarchy%29+-+David+Starkey+%28Parts+12-16%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eddie1969","files":6,"time":1248477256,"description":"Monarchy is more than the biographies of the kings and queens of England. It is an in-depth examination of what the English monarchy has meant, in terms of the expression of the individual, the Mother of Parliaments, Magna Carta, the laws of England and the land of England.\n\nIn this series Dr David Starkey, Britain's most eminent living historian and presenter brings to life powerful individuals with colourful characters using his unique and engaging gift as a communicator. The importance of the rich heritage of the Anglo-Saxon kings is underlined, and among the kings most heavily featured are: Alfred the Great, Canute, Edward the Confessor, William the Conqueror, Henry II, Richard Lionheart, Henry III and Henry VI. \n\n\n\n\n\n12. The Return of the King:\n\nStarting in 1660 with the return from exile of King Charles II. By aligning his throne with Catholic France and Protestant Parliament, Charles's reign restored the authority of the English crown and laid the foundation of the world's first modern state.\n\n\n13. The Glorious Revolution:\n\nLooking at the &quot;Bloodless Revolution&quot; of 1688, the Parliament-devised plot to overthrow England's last Roman Catholic King, James II, and replace him with his Dutch Protestant son-in-law William of Orange.\n\n\n14. Rule Britannia:\n\nIn just 25 years after the Glorious Revolution of 1688, England was transformed from an insignificant minor state to the greatest power in Europe. Along the way she became known under a new name to match her swelling status: Great Britain.\n\n\n15. Empire:\n\nIn 1714, an obscure German Prince was crowned King George I of Great Britain, signalling the beginning of a new political era that saw the rise of the new role of Prime Minister, and established the pattern of political modernity we are familiar with today.\n\n\n16. Survival:\n\nWhen, in 1789, the Bastille prison in Paris was stormed and the French Revolution began, few in Britain - least of all King George III, who was recovering from one of his bouts of madness - thought that it would lead to a cataclysmic war with France. ","torrent":{"xt":"urn:btih:14c98ee0f32e1b010409ae91bb3d13eacd70806a","amp;dn":"History+of+Britain+%28Monarchy%29+-+David+Starkey+%28Parts+12-16%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14c98ee0f32e1b010409ae91bb3d13eacd70806a","infoHashBuffer":{"type":"Buffer","data":[20,201,142,224,243,46,27,1,4,9,174,145,187,61,19,234,205,112,128,106]},"announce":[],"urlList":[]}}