{"title":"49ers - 49ers (1990)","uid":5189128,"size":97894889,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:15b328f66b1455beec0a0c1c37f404e1fd58f398&amp;dn=49ers+-+49ers+%281990%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gorkas","files":11,"time":1259601184,"description":"Critics of house music have made the same claim about house that has been made about rock, rap and swing -- that it all sounds the same -- but anyone who makes that claim is way off base. Hardly one-dimensional, house has ranged from abrasive, amelodic acid house (which usually consists of nothing more than a rhythm track and scattered sound bites or samples) to highly melodic deep house, which stresses vocal personality and is essentially late 1970s disco-soul updated. Deep house artists like Ten City, Chanelle and Jeanne Harris picked up where Gloria Gaynor, Double Exposure, Roberta Kelly and Loleatta Holloway left off, and the same can be said about the 49ers. This deep house recording is the brainchild of Italian producer Gianfranco Bortolotti, who sees to it that vocal personality is a prime ingredient of such exuberant offerings as &quot;Girl to Girl,&quot; &quot;Touch Me&quot; and a remake of Gaynor's &quot;I Will Survive.&quot; Bortolotti employs various female singers on this CD, but unfortunately, the liner notes don't tell us their names. What we do know is that most of them have big, substantial voices -- while small-voiced, girlish singers like Paula Abdul were quite popular in other areas of late 1980s and early 1990s dance music, deep house often favored wailing, belting, big-voiced divas. Having a big, Chaka Khan-ish voice was the kiss of death in Latin freestyle, but in deep house, it was welcomed with open arms. For house music enthusiasts, this good-to-excellent CD is well worth hunting for.\t\t","torrent":{"xt":"urn:btih:15b328f66b1455beec0a0c1c37f404e1fd58f398","amp;dn":"49ers+-+49ers+%281990%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15b328f66b1455beec0a0c1c37f404e1fd58f398","infoHashBuffer":{"type":"Buffer","data":[21,179,40,246,107,20,85,190,236,10,12,28,55,244,4,225,253,88,243,152]},"announce":[],"urlList":[]}}