{"title":"Jaksta_Streaming_Media_Recorder_and_Converter_Ver.3.1.0.0","uid":5073449,"size":5914625,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1625133e623030a86927150ba071734bf7fe6809&amp;dn=Jaksta_Streaming_Media_Recorder_and_Converter_Ver.3.1.0.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mrok","files":-1,"time":1251600431,"description":"Jaksta Streaming Media Recorder and Converter Editor's choice! (Shareware - $29.95/Windows) is a Flash video stream recording software (flash grabber) that can record Adobe Flash videos streaming through HTTP and RTMP protocol.\n\nDownload and convert Video and Music from your favorite video and music websites and automatically convert it into formats suitable for portable media centers such as iPods, Zunes, PSP's, MP3 and MP4 players. Record streams from popular sites such as: MySpace,Metacafe, AOL Video, AOL Music, MP3.COM, Pandora, Charle Rose, Project PlayList, Google Video, NBC, Hulu, Reuters, Yahoo! Music, Yahoo! Live, XM Radio, Sirius Radio and hundreds of others!\n\nJust click the record button and navigate to the sites containing the streaming media you wish to record. The recorder will detect and then download and/or record and then convert (if required) the stream leaving you to continue surfing!\n\nJaksta Streaming Media Recorder and Converter can even automatically import recorded media into Apple iTunes, for all you Apple iPod, fans! If you have existing media that you would like to convert for use on your portable media center then Jaksta Streaming Media Recorder and Converter can do that for you as well! Simply select the file to be converted and presto!\nSoftware Features:\n\n    * Record all kinds of streaming media including FLV, RTMP, RTSP, ICECAST, WMV, ASF and MP3\n    * Record streams from sites that use RTMP with anti-ripping technology\n    * Sniff the flash video address\n    * Free downloads from\n\nPlatform: Windows.\n\n\nLicense key inside.","torrent":{"xt":"urn:btih:1625133e623030a86927150ba071734bf7fe6809","amp;dn":"Jaksta_Streaming_Media_Recorder_and_Converter_Ver.3.1.0.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1625133e623030a86927150ba071734bf7fe6809","infoHashBuffer":{"type":"Buffer","data":[22,37,19,62,98,48,48,168,105,39,21,11,160,113,115,75,247,254,104,9]},"announce":[],"urlList":[]}}