{"title":"Ehlers-Freemasons are working for Roosevelt(masons that pushed A","uid":5173049,"size":3873054,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:166ac5cfe6bf05ee5ed5fb6153b63f8d7af4a39d&amp;dn=Ehlers-Freemasons+are+working+for+Roosevelt%28masons+that+pushed+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"red_gonzo","files":1,"time":1258762085,"description":"For english-only speaking:\nThis book is in german language. English title would be: Freemasons are working for Roosevelt - Masonic documents on cooperation between Roosevelt and Freemasonry (1993). First published in 1943 by Erich Ehlers this rare book presents some documentation that links the Grand Orient lodges of Europe to the political machinery of United States and their secret dealings that would involve America into World war 2. Although Roosevelt promised to keep America out of this war, the historic record indicated otherwise, namely that some secret circles actually wanted a war and were using all their influence for pushing all nations of the world into it. 65 pages, some documents.\n\nFur Deutschsprachige:\nIn zahlreichen Buch- und PresseverÃƒÂ¶ffentliehungen wurde die Aufmerksamkeit politisch interessierter Kreise nach dem Jahre 1933, insbesondere aber nach Ausbruch des Krieges und nach Eintritt der Vereinigten Staaten in den Krieg auf das verhÃƒÂ¤ngnisvolle Wirken der Freimaurerei in den Vereinigten Staaten sowie auf ihre weitgehende Verflechtung mit den maÃƒÅ¸gebenden politischen Kreisen in Washington gelenkt. Im Mittelpunkt solcher Betrachtungen stand vielfach der PrÃƒÂ¤sident der USA, Franklin Delano Roosevelt, ÃƒÂ¼ber dessen LogenzugehÃƒÂ¶rigkeit und enge Zusammenarbeit mit der Freimaurerei nicht nur seines eigenen Landes, sondern auch Europas berichtet wurde, ohne dass hierÃƒÂ¼ber immer hinreichend konkrete und dokumentarisch belegte Tatsachen angegeben oder dass die freimaurcrischen Umtriebe in voller Klarheit aufgezeigt werden konnten. Diese Schritt legt nun eine Reihe von Dokumenten vor, welche das politische Zusammenspiel des Freimaurer-PrÃƒÂ¤sidenten Roosevelt mit der europÃƒÂ¤ischen Freimaurerei aufzeigen und den eindeutigen Beweis fÃƒÂ¼r den engen Zusammenhang zwischen dem politischen Handeln des PrÃƒÂ¤sidenten und dem freimaurerischen Machtstreben erbringen. So stellt das hier vorgetragene Material eine wertvolle und aufschlussreiche ErgÃƒÂ¤nzung der Unterlagen dar, die schon ÃƒÂ¼ber die Zusammenarbeit des PrÃƒÂ¤sidenten Roosevelt mit dem Judentum und seine enge Verlfechtung mit jÃƒÂ¼dischen Kreisen vorgelegt wurden. 65 Seiten, einige Dokumente.\n","torrent":{"xt":"urn:btih:166ac5cfe6bf05ee5ed5fb6153b63f8d7af4a39d","amp;dn":"Ehlers-Freemasons+are+working+for+Roosevelt%28masons+that+pushed+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"166ac5cfe6bf05ee5ed5fb6153b63f8d7af4a39d","infoHashBuffer":{"type":"Buffer","data":[22,106,197,207,230,191,5,238,94,213,251,97,83,182,63,141,122,244,163,157]},"announce":[],"urlList":[]}}