{"title":"ChrisTV Online Premium Edition 5.70 Portable[ak]","uid":6149663,"size":4915264,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:16a353a424516bbc0f63fecdbb4bb57c17fca8ba&amp;dn=ChrisTV+Online+Premium+Edition+5.70+Portable%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1296834234,"description":"ChrisTV Online Premium Edition 5.70 Portable\n\nSpecial program for converting of your computer into a television set and radio receiver. CHRISTV Online! allows to look over the enormous amount of TV-channels, wireless stations and other audio-video material, translated through a network the Internet. For everything it is utillized only connection with the Internet, and it is needed no additional equipment. In the base of the program CHRISTV Online! there are more than 800 televisional channels and more than 600 wireless stations from 100 countries of the world, the list of which brushes up daily. The choice of channels can be made after a figure, to the type, category, language, name of the station. Favourite tele- and wireless stations it is possible to add to the list favourite channels which will be shown separately in a general list.\n\n\nChanges in ChrisTV Online Premium Edition 5.70:\n- Starting with version 4.00 we are proud to present you the new member of ChrisTV Online! suite: ChrisTV Online FREE Edition, coming as a FREEWARE for non-commercial use. ChrisTV Online! PREMIUM Edition is available as shareware with 14 days FREE trial period.\n- Added Premium Channels available only in ChrisTV Online Premium Edition: ITV, BBC One, BBC Two, Channel 4, E4, PRO 7, RTL, Rai 1, Sat 1, Kabel 1, ORF1, SF1, TVE, ARD, ZDF, Eurosport, Telemadrid, laSexta, Antena 3, CNN, Euronews, Discovery Channel, HBO and more.\n- Added 145 NEW TV channels from all over the world.\n- Added support for Sopcast channels and Livestream channels.\n- New major feature: adjust recording length.\n- You can now add your own channels to ChrisTV Online! channels database.\n- Multilanguage interface: English, German, Dutch, Italian, Spanish, Romanian\n- Added support for Windows 7.\n- Other small fixes and improvements.\n\nHome Page - http://www.online.chris-tv.com/\n","torrent":{"xt":"urn:btih:16a353a424516bbc0f63fecdbb4bb57c17fca8ba","amp;dn":"ChrisTV+Online+Premium+Edition+5.70+Portable%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16a353a424516bbc0f63fecdbb4bb57c17fca8ba","infoHashBuffer":{"type":"Buffer","data":[22,163,83,164,36,81,107,188,15,99,254,205,187,75,181,124,23,252,168,186]},"announce":[],"urlList":[]}}