{"title":"Diana Ross - Take Me Higher [1995, 320 kbps]","uid":5028563,"size":160049403,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:16e2563ef6a747f36cf05b95f189aa63459961bb&amp;dn=Diana+Ross+-+Take+Me+Higher+%5B1995%2C+320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"musicalibera","files":26,"time":1248809710,"description":"DIANA ROSS -  Take Me Higher (1995)\n\nCodec: mp3.\nDescription: MPEG-1 Audio Layer 3.\nBit rate: 320 kbps.\nSample rate: 44100 Hz joint stereo.\nTags: ID3V1 &amp; ID3V2.\nSource format: CD.\nNumber of tracks 13.\n\nWikipedia bio:\n\n&quot;Take Me Higher is a 1995 album by American soul singer Diana Ross released on the Motown label. The album featured production from urban adult contemporary producers such as Narada Michael Walden, Brenda Russell, Jon-John and the Boom Brothers, the latter two coming from Babyface's production company. The album yielded the UK hits &quot;Take Me Higher&quot;, &quot;Gone&quot; and her dance cover of Gloria Gaynor's gay anthem &quot;I Will Survive&quot;.&quot;\n\nAmazon.com review:\n\n&quot;Take Me Higher&quot; (1995) strikes a polished balance between contemporary soul and the glossy pop drama Ross is best known for. The invigorous title track kicks the collection off with a bubbly, retro-disco groove that is easily Ross' best dance tune of the 1990's. The second track, &quot;If You're Not Gonna Love Me Right,&quot; is a radio-friendly R&amp;B groove with an instantly catchy hook. &quot;Keep it Right There&quot; is another fine, sultry R&amp;B number, while &quot;Don't Stop&quot; is a saucy trifle featuring a cute rap interlude by the Boom Brothers. A surprisingly fresh cover of &quot;I Will Survive&quot; seems particularly resonant for this industry veteran. The ballads, however, are where Ross really shines. The shimmering &quot;Voice of the Heart&quot; contains a lovely, glistening vocal. The gentle Latin flourishes on &quot;I Never Loved a Man Before&quot; create a smooth, sexy ambience. The excellent &quot;Gone&quot; has Ross singing in a throaty lower register, and masterfully handling a wordy mouthful of lyrics. While the sentiments of &quot;Only Love Can Conquer All&quot; veer close to hokum, Ross' sincere, strong performance makes it sound convincing. The standout performance is &quot;I Thought That We Were Still in Love,&quot; set against a quiet, jazzy backdrop. Ross sings with a delicacy and nuance that has been missing from her most recent work, and her thoroughly involved reading of the lyric reminds us that she is an Oscar-nominated actress as well. The production is uniformly sophisticated and slick; it's a credit to Ross and her team that despite four separate producers (Narada Michael Walden; Nick Martinelli; Brenda Russell; and Jon-Jon), the album still creates a cohesive atmosphere and flow. Ross is still in top form here, and has produced what is easily her most enjoyable album of the decade.&quot;\n \n\nTRACK LIST\n\nTake Me Higher\n===============\n\n01. Take Me Higher\n02. If You're Not Gonna Love Me Right\n03. I Never Loved A Man Before\n04. Swing It\n05. Keep It Right There\n06. Don't Stop\n07. Gone \n08. I Thought That We Were Still In Love\n09. Voice Of The Heart\n10. Only Love Can Conquer All\n11. I Will Survive\n+\n12. Let Somebody Know (US bonus track)\n13. Voice Of The Heart (US album edit)  \n\n\nEnjoy - and thanks in advance for seeding.\n","torrent":{"xt":"urn:btih:16e2563ef6a747f36cf05b95f189aa63459961bb","amp;dn":"Diana+Ross+-+Take+Me+Higher+%5B1995%2C+320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16e2563ef6a747f36cf05b95f189aa63459961bb","infoHashBuffer":{"type":"Buffer","data":[22,226,86,62,246,167,71,243,108,240,91,149,241,137,170,99,69,153,97,187]},"announce":[],"urlList":[]}}