{"title":"Mewvies_for_Cats_Backyard_Buffet_DVDRIP_ISO","uid":5609814,"size":4065627435,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:18c359f13f5db881ebcc63c9925f49a24416e0d5&amp;dn=Mewvies_for_Cats_Backyard_Buffet_DVDRIP_ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dcomnimda","files":2,"time":1275808171,"description":"This DVD is for your cats -- put it on and let your cats watch and play! Great while you're away from home, or when you're bored and want to see your cats have some fun. Disc 1 of 3.\n &lt;a href=&quot;\nhttp://www.mewvies.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mewvies.com/&lt;/a&gt;\n\nMost Indoor Cats are Bored\n\nYour demanding job and busy lifestyle keep you away from home so much, you might not have noticed. And that's just the point. though we tend to think of them as aloof and solitary, studies show that domestic cats are actually highly dependent on us for social interaction.\nWhen we're not around to provide the attention and stimulation they need, our feline companions can suffer boredom, depression, weight gain, and neoroses manifested in destructive behaviors.\n\nPut on a Mewvie!\n\nA Mewvie features kitty-captivating action that's guaranteed to engage your cat's interest and end his boredom. What makes us so sure your cat will respond to Mewvies? Research. Before shooting a single frame, feline viewing patterns were studied for preferences and reactions.\n\nOnce a Mewvie is &quot;in the can,&quot; it is etensively tested with its primary audience, aiming for a 98 percent approval rate among viewers. Each 90-minute, feature length Mewvie plays in a continuous loop, so you can pop one in when you leave the house and let your cat watch throughout the day. No more boredom for kitty -- no more guilty feelings for you.\n\nBackyard Buffet\n\nA lip-smacking smorgasbord of on-screen &quot;quarry&quot;; This variety-packed show includes nine scenes featuring an array of scurrying squirrels, fluttering sparrows, scampering mice, scuttling bugs, a jumping chinchilla and more.\n\nDVD Run time: 90 minutes (looped)","torrent":{"xt":"urn:btih:18c359f13f5db881ebcc63c9925f49a24416e0d5","amp;dn":"Mewvies_for_Cats_Backyard_Buffet_DVDRIP_ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18c359f13f5db881ebcc63c9925f49a24416e0d5","infoHashBuffer":{"type":"Buffer","data":[24,195,89,241,63,93,184,129,235,204,99,201,146,95,73,162,68,22,224,213]},"announce":[],"urlList":[]}}