{"title":"Keith Urban - Sweet Thing   (2nafish)","uid":5195554,"size":136749060,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:191a311ad29dc3a2cd7cca0afedf1b6356c4575e&amp;dn=Keith+Urban+-+Sweet+Thing+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1259906087,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Sweet Thing&quot; is the title of a song co-written and recorded by Australian country music singer Keith Urban. The song is the first single from his 5th studio album, Defying Gravity. It was released to country radio on November 3, 2008, and it made its debut on the Hot Country Songs charts at #30, becoming Urban's nineteenth Top 40 country hit. On the chart week of March 14, 2009, it became Urban's tenth number one country hit. &quot;Sweet Thing&quot; has also been a success on the Billboard Hot 100 peaking at #30 on the chart, becoming one of his biggest hits to date.\n\nThe music video for &quot;Sweet Thing&quot; is directed by Trey Fanjoy.\n\nJim Malec, a reviewer for The 9513, gave &quot;Sweet Thing&quot; a &quot;thumbs up&quot; rating. Although he considered the song &quot;not really country&quot; he added &quot;If this is country-pop, it is hard to imagine anyone ever doing it with more passion, more intensity, and more effectiveness.&quot; Malec also noted Urban's &quot;emotionally committed&quot; vocals. It appears in the video game Tap Tap Revenge.\n\n&quot;Sweet Thing&quot; is an up-tempo country pop song. The male narrator sings of their first dates together, including meeting &quot;in the backyard under the cottonwood tree&quot; and &quot;kissin' on the porch swing&quot;, as well as the lover exiting the house through her bedroom window &quot;while the world's sleeping.&quot; The lyrics were inspired by Urban's relationship with wife Nicole Kidman. Urban recorded the song at The Castle Recording Studios in Franklin, Tennessee.\n\nDefying Gravity is the title of the fifth studio album by Australian country music artist Keith Urban. It was released on March 31, 2009 on Capitol Records. The album's lead-off single is &quot;Sweet Thing&quot;, which topped the Billboard Hot Country Songs charts in March 2009. &quot;Kiss a Girl&quot; was released on March 7, 2009 as the second single. The album became Urban's first number-one album on the Billboard 200, selling 171,000 copies in its first week of release. On December 2, 2009, the album was nominated for the Grammy Award for Best Country Album.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt; \n\n","torrent":{"xt":"urn:btih:191a311ad29dc3a2cd7cca0afedf1b6356c4575e","amp;dn":"Keith+Urban+-+Sweet+Thing+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"191a311ad29dc3a2cd7cca0afedf1b6356c4575e","infoHashBuffer":{"type":"Buffer","data":[25,26,49,26,210,157,195,162,205,124,202,10,254,223,27,99,86,196,87,94]},"announce":[],"urlList":[]}}