{"title":"Dusan Makavejev - Sweet Movie","uid":5188155,"size":1937692350,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:19922bcacb5be4ba768033ad7d6923957b1d12a6&amp;dn=Dusan+Makavejev+-+Sweet+Movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1259559828,"description":"Dusan Makavejev - Sweet Movie [+Extras] (1974)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0072235&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0072235&lt;/a&gt;\n\nLanguage\tEnglish, French, Serbo-Croatian and more\nSubtitles\tincluded: English\n &lt;a href=&quot;\nhttp://img468.imageshack.us/img468/2174/61ldp8roaluk1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img468.imageshack.us/img468/2174/61ldp8roaluk1.jpg&lt;/a&gt;\n\n\n\nBy Roger Ebert / January 1, 1975\n\nDusan Makavejev's &quot;Sweet Movie&quot; begins with what looks like a garden-variety National Lampoon function (an oil millionaire named Mr. Kapital is holding a global beauty contest to select himself a virgin bride) and develops into one of the most challenging, shocking and provocative films of recent years. Especially in its final 45 minutes, the movie presents almost pure experience. Makavejev shows us a commune where the members collectively immerse themselves in the fundamental processes of the body: eating, drinking, suckling, sex, vomiting, urinating, defecating, touching, screaming, hitting, caressing.\n\nMakavejev doesn't exploit this material -- &quot;Sweet Movie&quot; is anything but a sex film -- but uses it to confront us in a very unsettling way. The unasked questions behind his film seem to be: Well, we're all human, aren't we? This is what we are and what we do. What do you think of these people? You go to the movies to be entertained by scenes of people killing each other, you watch wars on TV -- do the basic bodily processes of these people offend you?\n\nYes, they do, in a peculiar sense. Makavejev has an aggressive sense of texture and juxtaposition, and when he shows us characters making love in tons of sugar or writhing in a vat of chocolate, our sensual reactions are short-circuited. When one of the characters is first made love to in sugar, then stabbed to death so his blood stains the sugar and makes it sticky, we're shocked and disquieted: Makavejev has made the movie violence more real, drawn our attention to the way we're experiencing it, by presenting it in such an unexpected context. This is a movie we can't be passive about. And although we can hate it, we can't walk out of it.\n\nI didn't hate it, although it affected me in bewildering and sometimes unpleasant ways. I didn't find it a success, but I found it an audacious attempt, and it's filled with images impossible to forget. Makavejev's work (&quot;Love Affair, or the Case of the Missing Switchboard Operator,&quot; &quot;Innocence Unprotected,&quot; &quot;WR -- Mysteries of the Organism&quot;) juxtaposes his subjects in such ways that they seem rotated several degrees from the real world. He considers Marxism, sex, violence, capitalism, political crimes and bizarre methods of personal contact in a way so radical and original that his movies are subversive of our everyday assumptions. He's like a Bosch, making connections through hallucinations, deciding for himself what things look like.\n\nIn &quot;Sweet Movie,&quot; there are several strands of subjects, none of them ever quite brought together (one problem is that his starring actress became so disturbed by the commune scenes that she walked out on the picture). There's material satirizing American attitudes about cleanliness, sex, money and marriage. There's a boat endlessly sailing the canals of Amsterdam, its prow a gigantic mask of Karl Marx; a man on a bicycle, dressed like a sailor from Battleship Potemkin, tries to get on board so he can seduce the boat's pretty blond figurehead. There are the scenes in the commune, &quot;roughly structured,&quot; Makavejev says, and then left to play themselves out while the camera watches. The members of the commune act in infantile ways, they seem deranged even while we're invited to consider them uninhibited but sane, and do things we don't particularly want to see on the screen.\n\nAnd what does Makavejev want to tell us with &quot;Sweet Movie&quot;? I don't know. I've seen and admired all his previous work, I heard him speak last weekend, I've read articles on &quot;Sweet Movie&quot; and I could paraphrase their comments, and his, for you. But the movie ultimately seems an unstructured descent into Makavejev's obsessions about his subjects.\n\nIt's as if he wanted to test himself; to see how far he could go with his notion that the fundamental human acts -- from elimination to procreation -- provide the ways and moments in which we're most alive, and that all the systems we lay on top of them (Marxism, fascism, any-ism) block the natural flow. &quot;Sweet Movie&quot; provides that test, and he measures up to it, but do we? I've seen the movie twice and I don't know. And if you find this review unsatisfactory, so do I: The movie defies criticism even while it seems to demand it, and I keep on thinking about it even while I know I'm not getting anywhere. \n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/s1.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/s1.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/s2.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/s2.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/s3.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/s3.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/s4.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/s4.png&lt;/a&gt;\n\n--------my rip-------\n\n~~~~~~ Sweet Movie.avi ~~~~~~                                     \n\n                                                               \n\nFile Size (in bytes):...........................1,314,328,576                     \n\n                                                                                \n\n--- Video Information ---                                                       \n\nVideo Codec Name:...............................XviD ISO MPEG-4              \n\nDuration (hh:mm:ss):............................1:38:16                \n\nFrame Count:....................................141341             \n\nFrame Width (pixels):...........................640                  \n\nFrame Height (pixels):..........................384                  \n\nAspect Ratio:...................................1.667                     \n\nFrames Per Second:..............................23.976          \n\nVideo Bitrate (kbps):...........................1582                 \n\n......MPEG-4......B-VOP........................                    \n\nQuality Factor (bits/pixel)/frame:..............0.268&quot;                     \n\n                                                                                \n\n--- Audio Information ---                                                       \n\nAudio Codec:....................................0x2000 (Dolby AC3) AC3                   \n\nAudio Sample Rate (Hz):.........................48000             \n\nAudio Bitrate(kbps):............................192                 \n\nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \n\nAudio Channel Count:............................1     \n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE       \n","torrent":{"xt":"urn:btih:19922bcacb5be4ba768033ad7d6923957b1d12a6","amp;dn":"Dusan+Makavejev+-+Sweet+Movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19922bcacb5be4ba768033ad7d6923957b1d12a6","infoHashBuffer":{"type":"Buffer","data":[25,146,43,202,203,91,228,186,118,128,51,173,125,105,35,149,123,29,18,166]},"announce":[],"urlList":[]}}