{"title":"La storia in giallo 017 - Corday &amp; Marat [Mp3 Ita] [TNTvillage]","uid":6271871,"size":40376576,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:19b6f4ede1d53bbaa5a10cc327a76d84d9107beb&amp;dn=La+storia+in+giallo+017+-+Corday+%26+Marat+%5BMp3+Ita%5D+%5BTNTvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darayava","files":1,"time":1301131832,"description":"La storia in giallo 017 - Corday &amp; Marat [Mp3 Ita] [TNTvillage]\n\nLA STORIA IN GIALLO\n\nLa Storia in giallo  ÃƒÂ¨ un programma in onda su radio3 scritto e condotto da Antonella Ferrera, con la regia di Francesco Pannofino, regia del dibattito di Manuel de Lucia, musiche originali di Alessandro Molinari, assistenza tecnica di Fiore Liborio, cura di Diana Vinci.\nRedazione: Carlo Dellonte e Roberto Ritondale Paola Veneto\nDa poco ha subito il mutamento nel nome diventando: Cuore di Tenebra\n\nLa storia e le storie di personaggi celebri, le vicende tragiche o misteriose che hanno segnato I loro destini e a volte quelli di molti altri. Uomini della politica o del malaffare, uomini di fede o vissuti nel peccato, personalitÃƒÂ  borderline, mitomani o geni maledetti. Le devianze e I turbamenti di grandi artisti di tutti I tempi che hanno riversato nella loro opera la fatica o la follia del vivere.\nLa Storia in Giallo li racconta come in un film, attraverso le voci dei migliori doppiatori italiani. Dopo lo sceneggiato che catapulta l'ascoltatore al centro di una storia, segue l'intervista ad un personaggio della cultura che ne spiega e racconta dinamiche, curiositÃƒÂ  e risvolti inediti.\n\n\nLa storia in giallo - in onda il 03/11/2002\n\nCHARLOTTE CORDAY - MARAT\n\n\nIl 13 luglio ÃƒÂ© al Palais Royal, acquista un capello nero a nastrini verdi per non dare nell'occhio e un coltello da cucina con una lama di dodici centimetri. Quando entra nella stanza, Marat ÃƒÂ¨ nel bagno, disteso in una tinozza, Charlotte gioca con lui e con la sua morbosa passione cospirativa, elencandogli una falsa lista di traditori, poi, improvvisamente si alza dalla sedia e sferra un colpo fatale sotto la clavicola, sul fianco destro della vittima squarciandogli la carotide.\nDopo la ricostruzione sceneggiata Antonella Ferrera intervista Roberto Olla, autore di documentari storici per la Rai ed il criminologo Piero Rocchini.\n\n\nAVI File Details\n========================================\nName..........: 2002 - Charlotte Corday - Marat.mp3\nFilesize......: 38Mb\n\nAudio Bitrate.: 192Kbps\nAudio Freq....: 32KHz\nAudio Channels: Mono\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:19b6f4ede1d53bbaa5a10cc327a76d84d9107beb","amp;dn":"La+storia+in+giallo+017+-+Corday+%26+Marat+%5BMp3+Ita%5D+%5BTNTvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19b6f4ede1d53bbaa5a10cc327a76d84d9107beb","infoHashBuffer":{"type":"Buffer","data":[25,182,244,237,225,213,59,186,165,161,12,195,39,167,109,132,217,16,123,235]},"announce":[],"urlList":[]}}