{"title":"Cleopatra 1963 DVD 1 (Eng FR audio)(NL ENG FR Gr subs) TBS","uid":6300577,"size":4569053350,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1a30efb1cf6c494019057197d9761ebb0d474284&amp;dn=Cleopatra+1963+DVD+1+%28Eng+FR+audio%29%28NL+ENG+FR+Gr+subs%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mad_Parrot","files":-1,"time":1302136275,"description":"\n\n\n\nCleopatra - 1963 - DVD 1 van 2 \n\n\n\n\nVerenigde Staten / Verenigd Koninkrijk / Zwitserland\nDrama\n192 minuten / 243 minuten (roadshow-versie)\n\ngeregisseerd door Joseph L. Mankiewicz\nmet Elizabeth Taylor, Richard Burton en Rex Harrison\n\nDVD 1\n\nDeze film ontving Oscars voor Cinematografie en speciale effecten. Schitterende opnamen en werkelijk verbluffende locaties complementeren de film toteen van de grootste producties aller tijden. \nIn 1963 ontving Cleopatra maar liefst 4 van de 5 Oscars!- Art Direction / Set Direction- Cinematography- Costume Design en Special Effects. Een ongekend hoge score voor die tijd. Een absolute \\'must have\\'.\n\nCleopatra is 17 jaar wanneer ze als laatste Farao van Egypte de troon bestijgt, om die vervolgens 22 jaar niet meer af te staan. \nZonder enige moeite weet ze de Romeinse keizer Julius Ceasar te verleiden en de twee krijgen zelfs een kind. De Romeinse staat is woest en beraamt een complot om Ceasar te vermoorden. \nDe opzet slaagt en Cleopatra vlucht ontzet naar Marcus Antonius, de enige Romein die ze vertrouwt en met wie ze een bondgenootschap sluit. \n\nDe film vertelt het verhaal van koningin Cleopatra VII van Egypte die haar macht wil stabiliseren door gebruik te maken van de spanningen in het Romeinse Rijk. \nCaesar bezoekt haar in Egypte, heeft een relatie met haar, en keert terug naar Rome. Ze baart zijn kind en bezoekt Rome om haar plaats aan Caesars zijde te claimen. \nHij wordt vermoord voor dit gebeurt. Vervolgens keert ze terug naar Egypte, Marcus Antonius volgt haar en wordt verliefd op haar.\n\nEngels:\n\nIn 48 B.C., Caesar pursues Pompey from Pharsalia to Egypt. Ptolemy, now supreme ruler after deposing his older sister, Cleopatra, attempts to gain favor with Caesar by presenting the conquerer with the head of Pompey, borne by his governors, Pothinos and Achillas. \nTo win Caesar's support from her brother, Cleopatra hides herself in a rug, which Apollodorus, her servant, presents to Caesar. \nThe Roman is immediately infatuated; banishing Ptolemy, he declares Cleopatra Egypt's sole ruler and takes her as his mistress. \nA son, Caesarion, is born of their union. Caesar, however, must return to Italy. \nAlthough he is briefly reunited with Cleopatra during a magnificent reception for the queen in Rome, Caesar is assassinated shortly thereafter, and Cleopatra returns to Egypt. \nWhen Mark Antony, Caesar's protÃƒÂ©gÃƒÂ©, beholds Cleopatra aboard her elaborate barge at Tarsus some years later, he is smitten and becomes both her lover and military ally... \n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : DVD5 \nBron          : Retail\nMenu          : Ja\nAudio         : Engels Frans\nExtra's       : Ja\nOndertitels   : Nederlands Engels Frans Grieks \nCover &amp; label : Ja\nGenre         : Drama\n\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/2006&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/2006&lt;/a&gt;\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0056937/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0056937/&lt;/a&gt;","torrent":{"xt":"urn:btih:1a30efb1cf6c494019057197d9761ebb0d474284","amp;dn":"Cleopatra+1963+DVD+1+%28Eng+FR+audio%29%28NL+ENG+FR+Gr+subs%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a30efb1cf6c494019057197d9761ebb0d474284","infoHashBuffer":{"type":"Buffer","data":[26,48,239,177,207,108,73,64,25,5,113,151,217,118,30,187,13,71,66,132]},"announce":[],"urlList":[]}}