{"title":"21 Black Jack.HDRip.XviD-AC3.SPANISH.","uid":5513174,"size":1886578688,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1a5ac7e86a56c1effa40824f9a1d6863984ce0b7&amp;dn=21+Black+Jack.HDRip.XviD-AC3.SPANISH.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nahla","files":1,"time":1272146261,"description":"AÃƒÂ±o: 2008\nDuraciÃƒÂ³n: 123 m.\nGÃƒÂ©nero: Thriller\nNacionalidad: USA\nDirector: Robert Luketic\nMÃƒÂºsica: David Sardy\nProducciÃƒÂ³n: Columbia Pictures\nFotografÃƒÂ­a: Russell Carpenter\nGuiÃƒÂ³n: Peter Steinfeld, Allan Loeb (Libro: Ben Mezrich)\nActores: Jim Sturgess, Kate Bosworth, Laurence Fishburne,\nKevin Spacey, Liza Lapira, Josh Gad,\nAaron Yoo, Sam Golzari\n\nInformaciÃƒÂ³n extracciÃƒÂ³n\nOrigen: .MKV 1080p\nCalidad: HDRip\n\n&quot;21&quot; sigue las andanzas de un grupo de jÃƒÂ³venes que se convirtieron en expertos en el arte de contar cartas para ganar en los casinos. Ben Campbell (Jim Sturgess) es un tÃƒÂ­mido y brillante estudiante del prestigioso Instituto TecnolÃƒÂ³gico de Massachussets (MIT) que, al no poder pagar la matrÃƒÂ­cula de la universidad, encuentra la soluciÃƒÂ³n en las cartas. Se le da la oportunidad de unirse a un grupo formado por los estudiantes mÃƒÂ¡s dotados de la escuela, que viajan a Las Vegas cada fin de semana armados con identidades falsas y con el conocimiento necesario para inclinar las probabilidades de ÃƒÂ©xito en el black-jack a su favor. Bajo la direcciÃƒÂ³n del poco ortodoxo profesor de matemÃƒÂ¡ticas y genio de la estadÃƒÂ­stica Micky Rosa (Kevin Spacey), han conseguido descifrar el cÃƒÂ³digo del ÃƒÂ©xito. Al contar las cartas y emplear un intrincado sistema de seÃƒÂ±ales, el equipo puede triunfar de forma colosal en los casinos. Seducido por el dinero, el estilo de vida de Las Vegas, y por su inteligente y atractiva compaÃƒÂ±era de equipo, Jill Taylor (Kate Bosworth), Ben empieza a cruzar los lÃƒÂ­mites. Aunque contar las cartas no es ilegal, las apuestas son altas, y el desafÃƒÂ­o consiste no sÃƒÂ³lo en llevar bien la cuenta de los nÃƒÂºmeros, sino en ir un paso por delante del amenazador policÃƒÂ­a de casinos: Cole Williams (Laurence Fishburne).","torrent":{"xt":"urn:btih:1a5ac7e86a56c1effa40824f9a1d6863984ce0b7","amp;dn":"21+Black+Jack.HDRip.XviD-AC3.SPANISH.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a5ac7e86a56c1effa40824f9a1d6863984ce0b7","infoHashBuffer":{"type":"Buffer","data":[26,90,199,232,106,86,193,239,250,64,130,79,154,29,104,99,152,76,224,183]},"announce":[],"urlList":[]}}