{"title":"Vittorio Alfieri - Vita [PDF - Ita] [Tntvillage]","uid":5177965,"size":742680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ba3541cbaedf1343e2ac0e99491a8f1db0c83d0&amp;dn=Vittorio+Alfieri+-+Vita+%5BPDF+-+Ita%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darayava","files":1,"time":1259080676,"description":"VITTORIO ALFIERI\n\nVITA\nscritta da esso\n\nVittorio Alfieri nacque il 16 gennaio 1749 ad Asti e morÃƒÂ¬ a Firenze l'8 ottobre 1803.\n\nConsiderato il maggiore poeta tragico del Settecento italiano, ebbe una vita piuttosto avventurosa, diretta conseguenza del suo carattere tormentato che lo rese, in qualche modo, precursore delle inquietudini romantiche.\n\nEgli ripercorse il suo cammino formativo in un'autobiografia intitolata Vita che cominciÃƒÂ² a scrivere intorno al 1790 (l'autobiografia era un genere di moda nel diciassettesimo secolo, valgano gli esempi delle MÃƒÂ©moires di Goldoni o delle Memorie del Casanova).\n\nLa Vita va perÃƒÂ² considerata come un racconto retrospettivo, una &quot;riscrittura&quot; a posteriori della propria esperienza esistenziale, dove quindi la realtÃƒÂ  viene a volte forzata per conformarsi al pensiero dell'Alfieri ormai poeta maturo. Non mancano infatti le componenti agiografiche, visto che il proposito latente dello scrittore ÃƒÂ¨ quello di rapportare la propria vita alle vicende tragiche dei protagonisti delle sue opere: fornire di sÃƒÂ© un ritratto eroico, quello di un uomo che ha lottato contro il destino e contro la societÃƒÂ  per poter affermare il proprio talento.\n\nTutti questi elementi debbono indurre a valutare criticamente la narrazione della Vita, e a rianalizzare le esperienze di Vittorio Alfieri in base ai dati biografici certi, in modo da non far sovrapporre le vicende reali dell'uomo alle &quot;gesta&quot; dell'eroe tragico.\n\nNato ad Asti, dunque, da famiglia nobile, dal 1758 al 1766 frequenta l'Accademia militare di Torino, considerata uno dei migliori collegi d'Europa, con risultati mediocri (nell'autobiografia di questi anni l'Alfieri parlerÃƒÂ  come di anni di &quot;ingabbiamento&quot; e di &quot;ineducazione&quot;). A conclusione degli studi viene nominato alfiere dell'esercito regio ed ÃƒÂ¨ assegnato al reggimento provinciale di Asti. Da questo momento comincia una lunga serie di viaggi: Alfieri passa da un paese all'altro (e da un amore all'altro) senza requie, visita prima l'Italia e poi l'Inghilterra, la Francia, la Prussia, l'Olanda, la Scandinavia.\n\nQuesto continuo vagabondare termina nel 1775, l'anno della &quot;conversione&quot; alla letteratura: rinnegando i dieci anni precedenti di &quot;viaggi e di dissolutezze&quot; l'Alfieri torna a Torino, completa una prima tragedia, Cleopatra, e si dedica furiosamente allo studio. Il successo della rappresentazione di Cleopatra lo sprona a dedicarsi alla carriera di scrittore tragico; negli anni successivi scriverÃƒÂ  le sue maggiori tragedie: Antigone, Filippo, Oreste, Saul, Maria Stuarda, Mirra, tra le altre.\n\nLa tragedia ÃƒÂ¨ la forma artistica da lui prescelta perchÃƒÂ© la piÃƒÂ¹ adatta a rappresentare la sua concezione della vita basata sullo scontro tra oppressi ed oppressori, tra uomini eroici e tiranni, i quali non vanno intesi come simboli del potere assolutistico o di qualsiasi altro regime realmente esistente, ma rappresentano invece tutti quei limiti che impediscono la piena realizzazione dell'individualitÃƒÂ  umana. La libertÃƒÂ , che ÃƒÂ¨ il motivo trainante delle tragedie dell'Alfieri, non ÃƒÂ¨ una libertÃƒÂ  politica, ma una libertÃƒÂ  esistenziale. Risulta perciÃƒÂ² chiaro come mai l'Alfieri scelga sempre personaggi giÃƒÂ  famosi, mitici, (Antigone, Saul, Bruto) per le sue opere e appare anche evidente la sua lontananza da quel &quot;dramma borghese&quot; che grazie a Diderot e Lessing trionfava in tutta Europa.\n\nNel 1777 avviene un incontro fondamentale per la vita dell'Alfieri, conosce infatti Luisa Stolberg, contessa d'Albany, praticamente separata dal marito Carlo Edoardo Stuart, pretendente al trono d'Inghilterra. Nasce un rapporto che Alfieri manterrÃƒÂ  sino alla morte e che mette fine alle sue irrequietezze amorose. L'anno successivo fa dono alla sorella di tutti i suoi beni, mantenendo per sÃƒÂ© solo una rendita annua e dopo vari soggiorni si trasferisce a Firenze e poi a Siena, per apprendere l'uso del toscano che, per lui piemontese e perciÃƒÂ² familiare all'uso del suo dialetto e del francese, era stata una lingua morta imparata sui libri.\n\nGli anni che vanno dal 1775 al 1790 sono i piÃƒÂ¹ operosi della sua vita: oltre alle tragedie compone trattati (Della tirannide e Del principe e delle lettere) e la gran parte delle Rime. Nel 1786 si stabilisce con la fedele contessa a Parigi, dove assiste alla rivoluzione e la celebra in un'ode alla caduta della Bastiglia, Parigi sbastigliato. Gli sviluppi della rivoluzione perÃƒÂ², probabilmente orientati verso forme troppo democratiche per l'Alfieri, lo deludono, come lo spaventano le manifestazioni della plebe, che non corrisponde certo al popolo da lui sognato nelle tragedie e nei trattati. CosÃƒÂ¬ fugge da Parigi nel 1792 e comincia, dopo la venuta dei francesi in Italia nel 1796, un'opera dai toni decisamente antifrancesi, il Misogallo.\n\nTornato a Firenze, dedica gli ultimi anni della sua vita alla composizione delle Satire, di sei commedie, della seconda parte della Vita e di traduzioni dal latino e dal greco. Nel 1803, a soli cinquantaquattro anni, muore assistito dalla Stolberg. La salma si trova nella chiesa di Santa Croce a Firenze.\n\nNote biografiche a cura di Laura Barberi.\n\n\n\nL'opera rimase incompiuta e venne pubblicata postuma nel 1804.\nIl racconto venne suddiviso dallo stesso Alfieri in quattro &quot;epoche&quot;: puerizia, adolescenza, giovinezza e maturitÃƒÂ  e puÃƒÂ² essere considerato un vero e proprio romanzo, pieno di riferimenti storici, di passioni, di tentati suicidi e di ideali e sdegno nei confronti di ogni tipo di meschinitÃƒÂ .\nC'ÃƒÂ¨ poi il riscatto morale dell'Alfieri che, dopo anni dissipati, si riabilita con una ferrea applicazione agli studi.\n\n\nAutore:  Vittorio Alfieri\nTitolo:  Vita\nCuratore:  Giampaolo Dossena\nAnno:  1790\nLingua:  Italiano \nGenere:  Autobiografia\nNumero di pagine:  168\nDimensione del file:  745 KB su disco (742.680 byte)\nFormato del file:  Pdf\n\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:1ba3541cbaedf1343e2ac0e99491a8f1db0c83d0","amp;dn":"Vittorio+Alfieri+-+Vita+%5BPDF+-+Ita%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ba3541cbaedf1343e2ac0e99491a8f1db0c83d0","infoHashBuffer":{"type":"Buffer","data":[27,163,84,28,186,237,241,52,62,42,192,233,148,145,168,241,219,12,131,208]},"announce":[],"urlList":[]}}