{"title":"Two and a Half Men, TVSeries (divx), S06E09-12, NL Subs, DMT","uid":6188670,"size":1021352788,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1bb945518aa4d8a0caf0b2f146f7b36825bd680b&amp;dn=Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S06E09-12%2C+NL+Subs%2C+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MeMar","files":-1,"time":1298208527,"description":"Two and a Half Men, TVSeries (divx), S06E09-12, NL Subs, DMT\n\n\nVerenigde Staten\nCategorie: Beeld\nFormaat: DivX\nOndertitels (ingebakken): Nederlands\nGenre: Sitcom\nBron: Retail\nDuur: ongeveer 20 minuten per aflevering\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0369179/episodes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0369179/episodes&lt;/a&gt; &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&lt;/a&gt;\n\nDe hoofdrollen worden vertolkt door Charlie Sheen, Jon Cryer en Angus T. Jones.\n\nHet begint met een man alleen (Alan gaat scheiden... alweer) en eindigt met een glimmende steen \n(de diamant die Evelyns nieuwe vriend aan de derde vinger van haar linkerhand wil schuiven). In de \ntussentijd is het hippe strandhuis van Charlie Harper in Malibu de perfecte plek voor grappen, mooie \nmeisjes, een eenoudergezin, beroemde buren, familie en nog meer grappen. Charlie (Charlie Sheen) \nkomt dicht in de buurt bij zijn al lang overleden vader. Alan (Jon Cryer) begint met online dating \nnadat hij zijn cv een beetje heeft opgeleukt. Jake (Angus T. Jones) vervangt zijn Harry Potter-posters \ndoor plaatjes van mooie meiden.\n\nAflevering 9:The Mooch At The Boo\nJake verdwijnt met de dochter van Charlie's buurman, een voormalige football-speler. \nAan Charlie om zijn hachje te redden en te verhinderen dat hij zwaar in de problemen komt. \nOndertussen slaagt Alan een date te versieren met de hulp van Charlie's Mercedes\n\nAflevering 10: He Smelled the Ham, He Got Excited\nCharlie en Alan worden door hun moeder uitgenodigd voor een etentje. Ze heeft immers groot nieuws voor hen: \nze heeft geld opzij gelegd voor Jake, zodat hij kan verder studeren. Jake is niet meteen enthousiast wanneer \nhij ontdekt dat hem nog meer schoolwerk wacht, totdat hij hoort dat zijn grootmoeder hem ook een auto \ncadeau wil doen als zijn schoolresultaten verbeteren\n\nAflevering 11: The Devil's Lube\nCharlie krijgt zijn beste vriend Andy over de vloer. Maar terwijl de twee mannen herinneringen ophalen aan \nveroveringen en avonturen uit het verleden, sterft Andy aan een hartaanval. Charlie is zwaar aangeslagen door de \ndood van zijn vriend. Hij beseft dat hij niet voor eeuwig zal leven en begint na te denken over zijn toekomst.\n\nAflevering 12: Thank God for Scoliosis\nAlan kampt met tegenstrijdige gevoelens: hij is smoorverliefd op zijn receptioniste Melissa, maar ziet een relatie \nmet een werkneemster niet zitten. Hij besluit niet toe te geven aan zijn gevoelens, maar dat blijkt makkelijker gezegd \ndan gedaan. Ondertussen strijden Charlie en Jake om de gunsten van een jonge, bevallige serveerster\n\n\n\nDeze serie wordt u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:1bb945518aa4d8a0caf0b2f146f7b36825bd680b","amp;dn":"Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S06E09-12%2C+NL+Subs%2C+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bb945518aa4d8a0caf0b2f146f7b36825bd680b","infoHashBuffer":{"type":"Buffer","data":[27,185,69,81,138,164,216,160,202,240,178,241,70,247,179,104,37,189,104,11]},"announce":[],"urlList":[]}}