{"title":"(DivX-ITA) Follia - Asylum (DVD-RIP)","uid":6212224,"size":738495860,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1c4c48ee9e865d0b03a6cf7f26302775c358adb1&amp;dn=%28DivX-ITA%29+Follia+-+Asylum+%28DVD-RIP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1299025474,"description":"(DivX-ITA) Follia - Asylum (DVD-RIP)\nAudio: Italiano &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0348505/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0348505/&lt;/a&gt; &lt;a href=&quot;\nhttp://filmup.leonardo.it/sc_follia.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://filmup.leonardo.it/sc_follia.htm&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/paeehaadd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/paeehaadd.jpg&lt;/a&gt;\n\nFollia\n\nTitolo originale:  Asylum \nNazione:  Regno Unito \nAnno:  2005 \nGenere:  Drammatico, Thriller \nDurata:  105' \nRegia:  David Mackenzie \nSito ufficiale:  www.paramountvantage.com/asylum \n\n \nCast:  Natasha Richardson, Ian McKellen, Marton Csokas, Hugh Bonneville, Gus Lewis, Joss Ackland, Wanda Ventham \nProduzione:  Mace Neufeld Productions, Samson Films, Seven Arts Pictures, Zephyr Films Ltd. \nDistribuzione:  NoShame Films \nData di uscita:  15 Giugno 2007 (cinema) \n\nTrama:\nStella Raphael, moglie di un illustre psichiatra, si ritrova a vivere con il figlio nei pressi del manicomio diretto dal dottor Peter Cleave a causa del suo nuovo incarico assunto dal consorte. Stella ÃƒÂ¨ una donna profondamente inquieta e in realtÃƒÂ  sotterraneamente insoddisfatta della propria condizione di moglie e madre. Tra i pazienti del dottor Cleave, c'ÃƒÂ¨ anche Edgar Stark, un artista tormentato e divorato da una patologica forma di gelosia psicotica che lo ha spinto anni prima a massacrare la moglie. Cleave, profondamente attratto da Stark, in quanto affascinato dalle personalitÃƒÂ  artistiche, essendo egli probabilmente un artista mancato, nota durante il ricevimento indetto per celebrare l'arrivo del dottor Raphael che tra Stella ed Edgar scatta una scintilla d'attrazione. Stella, sconvolta dal desiderio che prova per Edgar, per la sua sensuale vulnerabilitÃƒÂ  che sembra celare anche oscure minacce, prova a mettere a tacere la sua angoscia. Poi non puÃƒÂ² fare a meno di cedere. Edgar e Stella si amano furiosamente, rabbiosamente. Con un'intimitÃƒÂ  sconcertante. Come se i loro corpi si conoscessero da sempre. Cleave, che dietro la sua gelida maschera di distacco professionale cova in realtÃƒÂ  un disperato quanto impotente amore per Stella, osserva i due amanti divincolarsi nel loro desiderio proibito. Stella, schiava ormai della sua passione per Edgar, diventa imprudente. Scoppia uno scandalo feroce. Il dottor Raphael, pur di salvare l'apparenza della sua rispettabilitÃƒÂ  borghese, perdona la moglie. Stella perÃƒÂ² sa che si tratta solo di una per lei ormai inaccettabile forma di ipocrisia e decide di vivere sino in fondo il suo amore per Edgar. Stella lascia il marito e va a vivere con Edgar nel frattempo fuggito dal manicomio. Poco alla volta, perÃƒÂ², in Edgar riemergono i segni della sua folle gelosia. La donna, pur profondamente attratta dall'uomo, inizia a vivere nel terrore delle sue reazioni violente.\n","torrent":{"xt":"urn:btih:1c4c48ee9e865d0b03a6cf7f26302775c358adb1","amp;dn":"%28DivX-ITA%29+Follia+-+Asylum+%28DVD-RIP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c4c48ee9e865d0b03a6cf7f26302775c358adb1","infoHashBuffer":{"type":"Buffer","data":[28,76,72,238,158,134,93,11,3,166,207,127,38,48,39,117,195,88,173,177]},"announce":[],"urlList":[]}}