{"title":"Schroder&amp;Nellis-Constitution-Fact or Fiction(1995)","uid":6183589,"size":1597062,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d760633f80bb85fbf437d6388bb648da883208c&amp;dn=Schroder%26Nellis-Constitution-Fact+or+Fiction%281995%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"red_gonzo","files":1,"time":1298034409,"description":"This is Eugene Schroder's and Micki Nellis' explosive book Constitution - Fact or Fiction - The Story of the Nation's Descent from a Constitutional Republic through a Constitutional Dictatorship to an Unconstitutional Dictatorship (1995) which is the fascinating story of how war and emergency powers have been used to set aside the US constitution for the last 65 years. The authors have found the key to why constitutionally guaranteed rights are violated daily. It's the insidious use of &quot;emergency powers&quot; meant to be used only in time of invasion of rebellion. They prove with the government's own documents that the US constitution has been effectively set aside since 1933. Eleven presidents, both Democrat and Republican, have used emergency powers for the last 62 years to regulate daily lives of Americans without the inconvenience of congressional approval. The definition of &quot;emergencies&quot; has been stretched to include economic problems, social imbalances, and perceived threats to the US by any foreign country's actions, even those on other continents. The president can act through Executive order, Presidential proclamation, or through his many agencies, which include most of the alphabet agencies. The framers of the constitution asserted that Americans have certain inalienable, god-given rights. But under emergency rule, all these rights are declared null and void. The government charges the people for these rights by requiring licenses and excessive paperwork, with strings attached, as long as restrictive and ill-defined requirements are met. Find out how the whole trick works and why the conspirators need to maintain a constant state of threat from the world in order to have it their way. 250 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:1d760633f80bb85fbf437d6388bb648da883208c","amp;dn":"Schroder%26Nellis-Constitution-Fact+or+Fiction%281995%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d760633f80bb85fbf437d6388bb648da883208c","infoHashBuffer":{"type":"Buffer","data":[29,118,6,51,248,11,184,95,191,67,125,99,136,187,100,141,168,131,32,140]},"announce":[],"urlList":[]}}