{"title":"StarCraft [1998] [PC Classic]","uid":6298285,"size":668151821,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1d98e55421d3348d42ebdae59c28aca8cb6e798d&amp;dn=StarCraft+%5B1998%5D+%5BPC+Classic%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"graceofcod","files":2,"time":1302070333,"description":"StarCraft (SC) is a real-time strategy (RTS) computer game introduced by Blizzard Entertainment in 1998. It is similar to Blizzard's previous hit Warcraft II, except that it has a space opera setting as opposed to a high fantasy setting. StarCraft was the best selling computer and video game of 1998 and was so successful that Blizzard estimated in 2004 that 9.5 million copies of StarCraft had been sold since its release (4.5 million copies in South Korea), making it the fourth best-selling PC game in history (behind The Sims, The Sims 2 and World of Warcraft respectively). In 2009 the Guiness Book of World Records confirmed StarCraft as the best-selling RTS game ever at 9.5 million copies sold.StarCraft is praised for being a benchmark of RTS for its depth, intensity, and balanced races. \n\nThe main storyline of the game revolves around a war between three galactic species: the protoss (a race of humanoid religious warriors), the zerg (vile insect-like aliens who share a hive mind) and the terrans (initially, descendants of human prisoners from Earth). It was initially released for Windows, and later for Macintosh and Nintendo 64.","torrent":{"xt":"urn:btih:1d98e55421d3348d42ebdae59c28aca8cb6e798d","amp;dn":"StarCraft+%5B1998%5D+%5BPC+Classic%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d98e55421d3348d42ebdae59c28aca8cb6e798d","infoHashBuffer":{"type":"Buffer","data":[29,152,229,84,33,211,52,141,66,235,218,229,156,40,172,168,203,110,121,141]},"announce":[],"urlList":[]}}