{"title":"Stephen A. Zarlenga - The Lost Science of Money (2002)","uid":6191519,"size":911245686,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1d9f283f82665aed24832997742d2cee3b334baa&amp;dn=Stephen+A.+Zarlenga+-+The+Lost+Science+of+Money+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DragonKP","files":-1,"time":1298304762,"description":"Hidden History - Banks, Concept of Money.\nHow the banksters took control of money from people and society into their dirty private hands, and how they kept it secret for so long.\n\n-------\nFriendly WARNING for Audio Quality Purists:\nIt's COMPUTER GENERATED VOICE and NOT book read by human reader!\n\nIf you don't like this fact then simply DO NOT download it and complain later.\n-------\n\nAudio book and extra: Gnostic Media Interviews with Stephen A. Zarlenga - 4 Parts.\n\n\nSome info about book:\n\nWHAT'S GONE WRONG?\n\nUnheard of wealth concentrates into very few, largely undeserving hands. Americans work harder and produce more than ever but increasingly fall into debt and bankruptcy while corruption rules and predators plunder society by merely shuffling papers. Less than 1% of the population now owns about 50% of the wealth, and receives 70% of the income! The Lost Science of Money shows how a false concept of money allowed it to happen, and tells how to reverse it.\n\nSECRET POWER UNMASKED.\n\nHere are the keys that unlock the mystery of the money power - the hidden force secretly exercised by those holding society's monetary reins.\nThe Lost Science of Money exposes the mythology created to protect those who are embezzling from society, under cover of a deceptive ideology of money.\nThis group has immorally used economic theory as a tool of class war for the past three hundred years, while screaming accusations of &quot;class warfare&quot; against those who question their power!\nThe author provides the weapons needed to protect self, family, nation, and humanity from the predations of this gang, that has shrouded itself under cover of &quot;econo-speak&quot; for so long.\nThese ideas are presented accurately, but in &quot;down-to-earth&quot; language, without the confusing economic jargon that has usually served to obfuscate the subject. Historical cases with 119 illustrations help to convey the author's unique message.\n\nA GENERATION MISLED.\n\nThe gates protecting America have been left undefended. September 11th demonstrated only one aspect of this problem. Our people have been under monetary attack from within and from abroad for most of our history, and the physical, financial and psychological damage has far exceeded the terrible losses at New York's Twin Towers.\nAn entire generation has been led astray into market worship and other forms of religious fundamentalism. A dysfunctional media focuses on the elections and sex habits of politicians while the real outcomes in society are determined behind the scenes by the structure of the nation's money system.\nThis problem goes much deeper than accounting and stock fraud, and even beyond the graduate schools of business that inculcate such criminal behavior. The deeper causes lie hidden in the structurally corrupt core of our banking system and our schools of economics. It arises from the falsehoods they have spread on the nature of money, allowing their patrons to control the money power, and in turn, to dominate our society.\nThose who really want to get to the bottom of the problem will find this book's message timely and valuable.","torrent":{"xt":"urn:btih:1d9f283f82665aed24832997742d2cee3b334baa","amp;dn":"Stephen+A.+Zarlenga+-+The+Lost+Science+of+Money+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d9f283f82665aed24832997742d2cee3b334baa","infoHashBuffer":{"type":"Buffer","data":[29,159,40,63,130,102,90,237,36,131,41,151,116,45,44,238,59,51,75,170]},"announce":[],"urlList":[]}}