{"title":"Lindsey Williams - The Energy Non-Crisis (1980)","uid":6211349,"size":147496892,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1e341e19c1983152ed0e360254b9c9272e943d9a&amp;dn=Lindsey+Williams+-+The+Energy+Non-Crisis+%281980%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DragonKP","files":-1,"time":1298996852,"description":"Hidden History - NWO (New World Order), Oil, America.\n\n-------\nFriendly WARNING for Audio Quality Purists:\nIt's COMPUTER GENERATED VOICE and NOT book read by human reader!\n\nIf you don't like this fact then simply DO NOT download it and complain later.\n-------\n\nForeword.\n\n\nThe content of this manuscript is only as valuable and useful to the reader as the credibility of the authors.\nThe honesty, integrity, and therefore the credibility, of the authors of this book is unquestionable to the limit of their combined facts and knowledge.\n\nI can personally attest to many of the facts, and certainly many of the conversations quoted in the book, as I spent a week with Chaplain Lindsey on the North Slope of Alaska during the construction of the Trans-Alaska pipeline. I was privileged to talk with high officials of Alyeska Pipeline Service Company. For reasons unknown to me, I was given access to private information that apparently very few outsiders were ever given. I moved among the men at work and in the barracks. My week on the North Slope was a liberal education.\nThe motivation for this book is to bring facts to the American people as the authors know them. They do not have a political ax to grind nor any personal advantage by bringing forth these facts. Our President has stated that our energy problem is the equivalent of war. Yet he has embraced policies that have continually discouraged and hampered the development of our oil industry.\nNearly ten years ago President Nixon warned of a pending energy shortage unless our domestic production be drastically increased, but Congress insisted on restrictive price controls.\n\nCongress has been urged-and sometimes threatened-by special interest groups to take a negative stance on energy production, but they have miserably failed to take proper action to increase our domestic production. In fact, as you read this book you must come to the realization that energy production has been fiercely stifled by &quot;Government Bureaucracy, &quot; and Congress has sat on its collective hands.\nYou, the reader, will be left to make your own conclusions as to why this set of facts and circumstances conflict many times with what we have been told by the news media-which is fed its information by Government Agencies and Departments.\n\nIt is with great pride and pleasure that I endorse this manuscript and compliment the authors for taking time to do the research and make it available to all of us.\n\nMarch 19, 1980. \n\t  \t\nHugh M. Chance,\nFormer Senator of The State of Colorado.","torrent":{"xt":"urn:btih:1e341e19c1983152ed0e360254b9c9272e943d9a","amp;dn":"Lindsey+Williams+-+The+Energy+Non-Crisis+%281980%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e341e19c1983152ed0e360254b9c9272e943d9a","infoHashBuffer":{"type":"Buffer","data":[30,52,30,25,193,152,49,82,237,14,54,2,84,185,201,39,46,148,61,154]},"announce":[],"urlList":[]}}