{"title":"Librarian.3.La.maledizione.del.calice.di.Giuda.iTALiAN.SATRip.Xv","uid":4989398,"size":645264552,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1e5bc42261f0e9a1732443c17cbabc5af6257dc3&amp;dn=Librarian.3.La.maledizione.del.calice.di.Giuda.iTALiAN.SATRip.Xv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Volpebianca","files":1,"time":1246953579,"description":"Nel film tv &quot;The Librarian 3&quot; il bibliotecario Noah Wyle torna per il terzo capitolo della saga &quot;The Librarian&quot;, con una nuova partner, la suadente Stana Katic , tra musica jazz e notti vampiresche alla ricerca del misterioso &quot;Calice di Giuda&quot;.\n\nThe+Librarian+La+Maledizione+del+Calice+Di+GiudaFilm TV: The Librarian 3 - La Maledizione del Calice di Giuda\nTitolo originale: The Librarian - The Curse of the Judas Chalice\nNazionalitÃƒÂ : USA\nAnno: 2008\nDurata: 90 minuti\nGenere: Azione; Avventura; Fantastico\nRegia: Jonathan Frakes\nSceneggiatura: Marco Schnabel\nFotografia: David Connell\nMusiche: Joseph LoDuca\nScenografia: Luci Leary\nCast: Noah Wyle, Bruce Davison, Stana Katic, Bob Newhart, Jane Curtin, Dikran Tulaine, Jason Douglas, Jonathan Frakes\n\nSequel di: The Librarian 2 - Ritorno alle Miniere di re Salomone\n\n\nCINEMA. Ogni sera un grande spettacolo.\n\n\nTrama\n\nFlynn Carsen (Noah Wyle) lavora nella magica biblioteca pubblica di New York da ormai 2 anni senza sosta e senza riuscire ad instaurare una relazione sentimentale seria. Del tutto esaurito va in escandescenze davanti a Judson (Bob Newhart). Gli viene quindi prescritta una vacanza e dopo uno strano sogno Flynn sceglie di trascorrerla a New Orleans dove incontra una misteriosa fanciulla (Stana Katic) e dove capirÃƒÂ  che il destino lo ha portato lÃƒÂ¬ per trovare il Calice di Giuda. Ma anche un esponente del vecchio KGB vuole la reliquia e per riuscirci ha rapito il professor Lazlo (Bruce Davison), esperto delle leggende sui vampiri e di un certo Vlad Dracul....\n\n\n\nRecensione\n\nDice il proverbio &quot;Squadra vincente non si cambia&quot; perciÃƒÂ², di ritorno dalle miniere di Re Salomone, ritroviamo alla guida di &quot;The Librarian - La Maledizione del Calice di Giuda&quot; il regista Jonathan Frakes e lo sceneggiatore Marco Schnabel, che continuano a narrare le avventure del Librarian Flynn con tono scanzonato e parodiando film famosi per un intrattenimento televisivo da manuale.\n\nDato il rinnovato interesse verso i vampiri (&quot;Twilight&quot; in libreria e al cinema, la serie &quot;True Blood&quot; in tv) ecco un grazioso ricamino che si ispira senza mezzi termini a &quot;Dracula 2000&quot; (Dracula's Legacy - 2000 - prodotto da Wes Craven) con reminiscenze di &quot;Twilight&quot; e suggestivi flashback vampireschi per i fan di &quot;Buffy&quot; e &quot;Angel&quot;, ma senza dimenticare il suo progenitore Indiana Jones alla ricerca del Santo Graal (Indiana Jones e l'ultima Crociata) e classici come James Bond.\n\nLibrarian+3+La+Maledizione+del+Calice+Di+GiudaLa reliquia di turno ÃƒÂ¨ un Santo Graal alternativo e originale, il calice di quel Giuda Iscariota che tradÃƒÂ¬ GesÃƒÂ¹ con un bacio per trenta denari d'argento, che qui unisce credenza e leggenda in maniera scorrevole.\n\nGli attori che interpretano i personaggi principali hanno raggiunto un gradevole affiatamento e Noah Wyle , co-produttore anche di questa pellicola, imperversa con le sue espressioni tra il drammatico e la comicitÃƒÂ  alla Paperino per tutta l'ora e mezza di avventura. Da non perdere l'asta dell'incipit e la sfuriata da Oscar, gli eventi che daranno il &quot;la&quot; alla trama portando Flynn in quel di New Orleans a confrontarsi con il sogno di una vita normale e la realtÃƒÂ  della vita da bibliotecario.\n\nNiente giri del mondo come nei primi due film, stavolta una sola cittÃƒÂ  protagonista, quella capitale del jazz che regala alla colonna sonora l'opportunitÃƒÂ  di dare il meglio di sÃƒÂ© allargandosi al Dixieland e consentendo anche a Jonathan Frakes di far capolino in una comparsata con tanto di trombone. Tutto fa pensare che tra regista, sceneggiatore, compositore, attori si siano divertiti da pazzi in questa avventura.\n\nStana+KaticNella fotografia, da cartolina nelle scene di giorno e adeguatamente fumosa nelle molte scene in penombra o alla luce delle candele come nei classici film sui vampiri, spunta la partner di turno, la migliore di quelle viste nella saga, una ottima Stana KatÃƒÂ¬c a cui la sceneggiatura ha riservato un incisivo ruolo da co-protagonista coperto dalla bravura dell'attrice, che consente al film di non trasformarsi in un one man show di Noah Wyle, il quale, vista l'intesa ormai tale col personaggio del librarian , sbotta in modi esilaranti e fantasiosi per poi sciogliersi in lacrime, sempre in linea con lo sviluppo della storia fino al finale coi fiocchi.\n\nSeguita dalle romantiche note del tema d'amore, la nuova coppia si trasforma poi in un trio col bravo Bruce Davison, attore d'esperienza visto praticamente ovunque da chiunque.\n\nLe tante scene a luce fioca in ambienti ristretti e la mancanza di quegli spazi aperti a cui avevano fatto abituare i primi due capitoli di &quot;The Librarian&quot;, la commistione tra sacro e profano e la riesumazione dei vampiri potrÃƒÂ  far sbuffare alcuni, ma la storia in sÃƒÂ© gira bene, ÃƒÂ¨ una spensierata parodia con la giusta dose di humour, avventura, mistero e romanticismo su un canovaccio oliato. Il suo vero punto debole sono i personaggi russi alquanto fumettistici.\n\nConsigliato vederlo in (o anche) lingua originale, perchÃƒÂ© vocalmente tutti gli attori sono in forma e Stana Katic ha un modo gentile di porgere le frasi accompagnate da un musicale accento francese.\n\nThe_Librarian+3L'assenza del personaggio della mamma di Flynn sarÃƒÂ  notata da chi ricorda bene l'impianto delle avventure del Librarian, situazione che porta la rigida Charline a sostituirla un po', mentre per gli spettatori in disaccordo con la sparizione della body guard Nicole, che aveva &quot;battezzato&quot; l'acerbo librarian alla ricerca della lancia perduta, avranno qui la risposta, cosÃƒÂ¬ come si saprÃƒÂ  qualcosina in piÃƒÂ¹ sulla biblioteca e la sua fondazione.\n\n&quot;The Librarian - La Maledizione del Calice di Giuda&quot; puÃƒÂ² essere una degna conclusione della saga, come ognuno dei capitoli precedenti, del resto il film tv ÃƒÂ¨ uscito in America solo a dicembre 2008, le notizie sono discordi e non si sa ancora con certezza se ci sarÃƒÂ  un quarto capitolo: bisogna vedere se la saga deciderÃƒÂ  di &quot;abbracciare il suo destino&quot; o se la frase &quot;A volte dirsi addio ÃƒÂ¨ la cosa giusta da fare&quot; era rivolta al pubblico.\n\nPer la serie: Squadra che vince non si cambia.\n\nVoto personale: 7+","torrent":{"xt":"urn:btih:1e5bc42261f0e9a1732443c17cbabc5af6257dc3","amp;dn":"Librarian.3.La.maledizione.del.calice.di.Giuda.iTALiAN.SATRip.Xv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e5bc42261f0e9a1732443c17cbabc5af6257dc3","infoHashBuffer":{"type":"Buffer","data":[30,91,196,34,97,240,233,161,115,36,67,193,124,186,188,90,246,37,125,195]},"announce":[],"urlList":[]}}