{"title":"Megan Abbott - Die a Little","uid":5176359,"size":745853,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ea4186f33b2847e79320e2d0b63df10c76d3320&amp;dn=Megan+Abbott+-+Die+a+Little&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pigeye","files":1,"time":1258998185,"description":"It's 1954, and Pasadena schoolteacher Lora King has carved out a life of square contentment with her brother, Bill, an investigator in the DA's office. That changes when Bill falls hard for Alice Steele, a seamstress at a Hollywood studio. When Bill and Alice marry, Lora wants to be happy for them; she really, truly does. But she can't help sensing something dark in her brother's new bride. Even as Lora and Alice play at being sisters, bonding over thrillingly elaborate party preparations, secrets--ugly secrets!--seep out of Alice's past. Lora risks everything to uncover the truth, pocketing address books filled with cryptic code and tailing shady characters like a grown-up Nancy Drew. As Lora puts it, &quot;There is a string I am pulling together, a string of question marks so long they are beginning to clatter against each other, and loudly.&quot; While Abbott doesn't match the scope and sheer virtuosity of Ellroy's L.A. Confidential, she does nail a similarly hushed and lurid tone in a tale that smolders like the night's last, forgotten cigarette. \n--Frank Sennett\n","torrent":{"xt":"urn:btih:1ea4186f33b2847e79320e2d0b63df10c76d3320","amp;dn":"Megan+Abbott+-+Die+a+Little","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ea4186f33b2847e79320e2d0b63df10c76d3320","infoHashBuffer":{"type":"Buffer","data":[30,164,24,111,51,178,132,126,121,50,14,45,11,99,223,16,199,109,51,32]},"announce":[],"urlList":[]}}