{"title":"Saving_Private_Ryan_(1998).720p.HDTV.DTS.x264.ESiR.ShareReactor","uid":5168693,"size":8552441841,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:1ee15ea51028d40ef8334db2f0e394f28625eb4c&amp;dn=Saving_Private_Ryan_%281998%29.720p.HDTV.DTS.x264.ESiR.ShareReactor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"raider2510","files":-1,"time":1258565047,"description":"When Steven Spielberg was an adolescent, his first home movie was a backyard war film. When he toured Europe with Duel in his 20s, he saw old men crumble in front of headstones at Omaha Beach. That image became the opening scene of Saving Private Ryan, his film of a mission following the D-day invasion that many have called the most realistic--and maybe the best--war film ever. With 1998 production standards, Spielberg has been able to create a stunning, unparalleled view of war as hell. We are at Omaha Beach as troops are slaughtered by Germans yet overcome the almost insurmountable odds.\nA stalwart Tom Hanks plays Captain Miller, a soldier's soldier, who takes a small band of troops behind enemy lines to retrieve a private whose three brothers have recently been killed in action. It's a public relations move for the Army, but it has historical precedent dating back to the Civil War. Some critics of the film have labeled the central characters stereotypes. If that is so, this movie gives stereotypes a good name: Tom Sizemore as the deft sergeant, Edward Burns as the hotheaded Private Reiben, Barry Pepper as the religious sniper, Adam Goldberg as the lone Jew, Vin Diesel as the oversize Private Caparzo, Giovanni Ribisi as the soulful medic, and Jeremy Davies, who as a meek corporal gives the film its most memorable performance.\n\nThe movie is as heavy and realistic as Spielberg's Oscar-winning Schindler's List, but it's more kinetic. Spielberg and his ace technicians (the film won five Oscars: editing (Michael Kahn), cinematography (Janusz Kaminski), sound, sound effects, and directing) deliver battle sequences that wash over the eyes and hit the gut. The violence is extreme but never gratuitous. The final battle, a dizzying display of gusto, empathy, and chaos, leads to a profound repose. Saving Private Ryan touches us deeper than Schindler because it succinctly links the past with how we should feel today. It's the film Spielberg was destined to make. --Doug Thomas\n\n Video Bitrate : 6022 kbps\nAudio Specs : English DTS 5.1 @ 768 kbps\n","torrent":{"xt":"urn:btih:1ee15ea51028d40ef8334db2f0e394f28625eb4c","amp;dn":"Saving_Private_Ryan_%281998%29.720p.HDTV.DTS.x264.ESiR.ShareReactor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ee15ea51028d40ef8334db2f0e394f28625eb4c","infoHashBuffer":{"type":"Buffer","data":[30,225,94,165,16,40,212,14,248,51,77,178,240,227,148,242,134,37,235,76]},"announce":[],"urlList":[]}}