{"title":"Alexander the Great  (BBC Audio)","uid":5109968,"size":326401843,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1f5b02bdcbb07a411df6590785a28ca920445c91&amp;dn=Alexander+the+Great++%28BBC+Audio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eddie1969","files":-1,"time":1254679397,"description":"Alexander - A six-part dramatisation of the life of Alexander the Great - BBC Radio\n\n\n\nOriginally broadcast in 1993 on BBC Radio 4 under The Classic Serial banner - six episodes of approximately 1 hour each.\n\n\nPart1: The King's Son\nIt's the summer of 356 B.C. Outside the city of Pella in southern Macedonia, the spirits of Achilles and Patroclus are watching and waiting to greet the new 'Achilles'. As Olympias gives birth to Alexander, Achilles and Patroclus are jointed by the 'Fates' who foretell that Alexander will have strength, wealth, luck and everlasting fame but only a short life.\n\n\nPart 2: I am also Alexander\nEleven years have past since Alexender, the new Prince of Macedon, was born. His first teacher was Leonidas, a relative of Olympias. Leonidas instilled in Alexander his ascetic nature for which he became famous during his future campaigns; he lived simply, in a Spartan way, eating and sleeping together with his troops. Leonidas was replaced with Lysimachus, who taught Prince Alexander to play the lyre, and to appreciate the arts. He loved Homer, and always slept with a copy of the Iliad under his pillow. His motto is: 'Always to be best; eclipse all other men'.\n\nThe years have also brought Hephaestion, the new 'Patroclus', to Pella.\n\nIt is early spring 346 B.C., An embassy from Athens has come to Pella, King Philip's capital in southeren Macedonia, seeking peace with Philip, King of Macedon. Among the envoys, the orator of the poison tongue, Demosthenes.\n\n\nPart 3: Preparation of the Sacrifice\nDuring Philip's expedition against Byzantium in 340 B.C., Alexander the Prince Regent, then sixteen years old was left in Macedonia in the charge of the royal seal; at that time, he was anything but idle: he managed to subjugate the rebellious Maedi, a Thracian tribe. He took their capital town by storm, drove out the barbarous inhabitants, and created a colony of several nations in their region, calling the new town Alexandropolis.\n\n\nPart 4: The Road to Gordium\nSoon after sunrise on the summer's day in the year 336 B.C. King Philip of Macedon is about to enter the great theatre at Ege, the ancient capital of Macedonia, when he's assassinated by his officer Pausanias during the celebration of his daughter's wedding to Olympias' brother, Alexander of Epirus.\n\nAlexander was immediately presented to the army as the new king of Macedon. Alexander was not the only pretender to the vacant throne: but, recognized by the army, he soon swept all rivals from his path.\n\nAlexander prepared for his expected invasion of the Persian Empire, previously planned and initiated by Philip.\n\n\nPart 5: The Hunt of the God King\nFrom Gordium and his cutting of the Gordian knot, which could only be loosed by the man who\nwas to rule Asia, Alexander continues on the road to Syria. It is early autumn of the year 333 B.C. when Alexander is marked by a violent fever that arrested him for a while in Tarsus.\n\nWhen he recovers, Alexander come head to head with King Darius during the Battle of Issus on the north-east Mediterranean coast. He defeats Darius and send him and the relic of his army in feral flight back to the east.\n\nIt was an incident which did not modify Alexander's plan. He did not press the pursuit far, although the great king's camp with his harem fell into his hands.\n\n\nPart 6: Great Son of Ammon\nWith the Panhellenic war of revenge now over, the Thessalians and Greek allies were sent home; since then he was conducting a purely personal war. Alexander's political and ideological views on the empire were changing: He had come to new political idea of two jointly ruling people: Macedonians and Persians. That new politics created the opposition and misunderstanding between Alexander and Macedonians.\n\nIt is the summer of the year 330 B.C. Alexander with his fastest troops chased Darius for 12 days and nights and has passed over 800 km. Meanwhile Darius troop strength was reduced to 6000 foot and 3000 horse. Darius had moved to Bactria, to Bessus - the satrap of Bactria. It was an thrilling chase of king by king, in which each covered the ground by barely credible exertions, past Rhagae (Rai) and the Caspian gates, till early one morning Alexander came in sight of the broken train which still clung to the fallen king.\n\n\n\nWith:\nBarry Foster as Spirit of Achilles, Simon Ward as Spirit of Patroclus, Brian Cox as King Philip II of Macedon, Geraldine James as Queen Olympias (formally Myrtali - the Princess of Epirus), Sam Crane as Young Alexander, Michael Maloney as Alexander, Alex Jennings as Hephaestion, Gary King as Young Hephaestion, John Moffat as Aristotle, Charles Kay as Persian king, Darius III, Malcom Sinclair as Demosthenes.\n\nDirected by Glyn Dearman.\n\n\nDownloaded from the audio torrent site radioarchive.cc - Registration is FREE!!\n\n\nType : mpeg 1 layer III\nBitrate : 128\t\nMode : joint stereo\nFrequency : 44100 Hz\nEncoder : Lame 3.95\n\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:1f5b02bdcbb07a411df6590785a28ca920445c91","amp;dn":"Alexander+the+Great++%28BBC+Audio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f5b02bdcbb07a411df6590785a28ca920445c91","infoHashBuffer":{"type":"Buffer","data":[31,91,2,189,203,176,122,65,29,246,89,7,133,162,140,169,32,68,92,145]},"announce":[],"urlList":[]}}