{"title":"The Jimmy Cobb Quartet - Cobb's Corner (2007)","uid":6254758,"size":307496687,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1f896c3fe842b3703ec882e5f32440d6f0fc85b9&amp;dn=The+Jimmy+Cobb+Quartet+-+Cobb%5C%27s+Corner+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mariorg","files":-1,"time":1300534966,"description":"Chesky Records: SACD327 &lt;a href=&quot;\nhttp://www.chesky.com/core/details.cfm?productcode=SACD327&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.chesky.com/core/details.cfm?productcode=SACD327&lt;/a&gt;\n\n* Jimmy Cobb: drums\n* Roy Hargrove: trumpet, flugelhorn\n* Ronnie Mathews: piano\n* Peter Washington: bass\n\nHomepage\n~~~~~~~~ &lt;a href=&quot;\nhttp://www.jimmycobb.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jimmycobb.net/&lt;/a&gt;\n\nAbout\n~~~~~ &lt;a href=&quot;\nhttp://www.jimmycobb.net/solowork.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jimmycobb.net/solowork.html&lt;/a&gt;\n\nReview\n~~~~~~ &lt;a href=&quot;\nhttp://www.audaud.com/article.php?ArticleID=3166&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.audaud.com/article.php?ArticleID=3166&lt;/a&gt;\n\nBy John Henry\n\nIt's a kick to receive a great jazz hi-res disc; the classical genre sort of has\nthe 4000+ SACD releases so far covered. I've been listening to a lot of the RVG\nremasters recently, and while they sound the best they ever have, they're not\nhi-res. Many are just mono - deep, rich mono but still mono. So hearing the\nalmost holographic realism of Chesky's DSD recordings is a real pleasure.\n\nAnd when the playing is at this Olympian level it's even better (and contradicts\nthat old audiophile dictum of &quot;best sound, worst music&quot;). If you haven't heard\nof Jimmy Cobb you should know that he's had a six-decade career and played on\nboth Miles Davis' classic Kind of Blue as well as Sketches of Spain. He was\nrecently the drummer on Chesky's SACDs New York Time and West of 5th.\n\nThe Grammy-winning trumpeter has been described as one of the most versatile\nbrass players in the mold of Wynton Marsalis. Hargrove has a wonderfully rich\ntone and is able to stretch out some very creative solos during the generally\nlaid-back tempi of many of the tracks. Pianist Mathews played with Art Blakey\nand Johnny Griffin and is a mainstay of the NYC mainstream modern jazz piano\nstyle. Three of my favorite tunes are here: Weill's My Ship, Monk's Ruby My\nDear, and Billy Strayhorn's surpassingly lovely Lotus Blossom - done in waltz\ntime. Book's Bossa takes a bouncy uptempo pace; it honors the late bassist\nWalter Booker.\n\nChesky records in natural halls and churches rather than studios, similar to\nOpus 3 Records. The acoustic ambiance of the venue is the real thing - not\ndigital reverb. The venue was a NYC church frequently used by Chesky. They\nemploy a Soundfield Ambisonic mic and convert the Ambisonic output to 5.0\nchannel DSD. (I gather Chesky - along with DMP and Telarc - has given up on\ntheir alternate use of the center and sub channels to provide surround coverage\nmore appropriate to music than movies.) None of the instruments are therefore\nrecorded with close-up mics, not even the drums as nearly everyone else seems to\ndo. Hargrove's trumpet is on the left and the piano about the center. There's\nnot even a hint of an electronic sheen to the trumpet sound, and the piano too\nhas more natural overtones audible. It doesn't sound the least bit &quot;off mic.&quot;\nThe drums also don't overpower the other players as heard on so many jazz\nrecordings - of course at least part of that has to be blamed on the artfulness\nof Cobb's drumming.","torrent":{"xt":"urn:btih:1f896c3fe842b3703ec882e5f32440d6f0fc85b9","amp;dn":"The+Jimmy+Cobb+Quartet+-+Cobb%5C%27s+Corner+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f896c3fe842b3703ec882e5f32440d6f0fc85b9","infoHashBuffer":{"type":"Buffer","data":[31,137,108,63,232,66,179,112,62,200,130,229,243,36,64,214,240,252,133,185]},"announce":[],"urlList":[]}}