{"title":"Flikken Seizoen 6 dvd 2(Dutch) TBS","uid":6260600,"size":4519572953,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:208c0f698e1de04e0d3d7ba22db515ef089f984c&amp;dn=Flikken+Seizoen+6+dvd+2%28Dutch%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mad_Parrot","files":-1,"time":1300738195,"description":"\nFlikken Seizoen 6 dvd 2\n\n\n\nDe serie werd gecreÃƒÂ«erd door scenarioschrijver Pierre De Clercq en producent Erwin Provoost en was een coproductie van het productiehuis MMG en VRT en, seizoen 5 en 6, ook de Nederlandse TROS.\n\nDe serie Flikken heeft de Vlaamse stad Gent als achtergronddecor. Het lokale politieteam staat centraal in de serie en niet een of twee hoofdpersonages. De makers hadden bij aanvang van de serie zoveel vertrouwen in de serie, dat de opnames voor de tweede reeks in 1998 al begonnen waren, voordat de eerste aflevering uitgezonden was. \nIn de eerste reeks was er geen doorlopend verhaal tussen de verschillende afleveringen, dit volgde pas in de latere reeksen. Zo gingen de flikken, bijgestaan door de Nederlandse rechercheur Robert Nieuwman (Boudewijn de Groot), in 2004 op zoek naar de seriemoordenaar Luc Feiremans.\n\nIn april 2007 maakte de Vlaamse omroep VRT bekend dat het tiende seizoen van Flikken het laatste zou zijn. De financiÃƒÂ«n speelden hierbij een rol. De serie kostte veel geld, terwijl de VRT veel andere fictiereeksen op de rol had staan. \nHet slotseizoen, dat overigens maar tien afleveringen heeft in plaats van de gebruikelijke dertien, werd van 15 februari tot 19 april 2009 uitgezonden op ÃƒÂ©ÃƒÂ©n.[1]\n\nOm Flikken een waardige afsluiter te geven werd er op zaterdag 18 april 2009 in Gent een Flikkenparty georganiseerd. Op het einde van de dag kon in Kinepolis Gent de laatste Flikken-aflevering in avant-premiÃƒÂ¨re bekeken worden.\n\nSinds september 2007 zendt de TROS een Nederlandse versie van Flikken uit, Flikken Maastricht. Deze serie is qua cast kleinschaliger dan de originele serie.\n\n69 &quot;Geflikt&quot; 26 september 2004 6.04 \nBritt en Robert verhoren het enige bekende overlevende slachtoffer van de seriemoordenaar in Brussel. Daarnaast wordt ook een zaak opgelost van een overval op een truck met smokkelwaar.  \n\n70 &quot;Solfer&quot; 3 oktober 2004 6.05 \nDe zaak van de seriemoordenaar lijkt voorspoedig te verlopen, tot Britt thuis problemen krijgt. De problemen laat ze helaas niet thuis, waardoor de zaak gevaar loopt te mislukken.  \n\n71 &quot;De getuige&quot; 10 oktober 2004 6.06 \nBruno wint de loterij en Nick denkt mee te delen in de winst. Het team moet op zoek naar een anonieme getuige om een zaak van een verdwenen prostituee op te lossen.  \n\n72 &quot;Den Bok&quot; 17 oktober 2004 6.07 \nPasmans ziet een oude turnleraar terug. Deze is slachtoffer geworden en heeft daar steekwonden aan overgehouden. Over hoe en wie deze veroorzaakt heeft doet de leraar erg geheimzinnig. (Karin Tanghe speelt een eenmalige rol als vrouw van de leraar).  \n\n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : ISO \nBron          : Retail\nMenu          : Ja\nExtra's       : Ja\nAudio         : Nederlands\nOndertitels   : Nederlands (instelbaar)\nCover &amp; label : Ja\nGenre         : Actie\n \n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Flikken_(televisieserie)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Flikken_(televisieserie)&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.een.be/programmas/flikken&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.een.be/programmas/flikken&lt;/a&gt;\n\n\n\nBrought to you by TinkerBell @ TBS","torrent":{"xt":"urn:btih:208c0f698e1de04e0d3d7ba22db515ef089f984c","amp;dn":"Flikken+Seizoen+6+dvd+2%28Dutch%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"208c0f698e1de04e0d3d7ba22db515ef089f984c","infoHashBuffer":{"type":"Buffer","data":[32,140,15,105,142,29,224,78,13,61,123,162,45,181,21,239,8,159,152,76]},"announce":[],"urlList":[]}}