{"title":"Video Converter + Serials","uid":6185615,"size":19938171,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:20a8c04e63754bcd3e927b488c407f614ef7b2ca&amp;dn=Video+Converter+%2B+Serials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"love4959","files":-1,"time":1298102107,"description":"Free Video Converter features:\n\n    * video converter with easy and simple user interface supporting a wide range of video formats including AVI, FLV, MOV, MP4, MPG, M2TS, MTS, RM, RMVB, QT, WMV and more.\n    * Provides popular out video formats including AVI, WMV, MPG, MP4, MKV, SWF, FLV and popular audio formats including MP3, M4A, OGG, WAVE, WMA.\n    * Supports video trimming to convert any part you need of the original videos.\n    * Supports video merging to merge video clips into a single file.\n    * Includes a batch converter to quickly convert multiple movies and auto-shotdown functions for batch conversion.\n    * Completely customizable video and audio parameters.\n    * Download and convert online videos from YouTube, Google and NicoVideo in one step with YouTube video quality specifying support.\n    * Supports up to 18 languages for people around the world.\n    * Add &quot;Flatten and add faststart to mp4 files&quot; to enable mp4 streaming\n    * Absolutely free - nothing to buy!\n\n Free Video Converter: Convert any Video formats Freely\n\nThere is open source software to perform almost every task for video conversion. But if you are one of these windows users who are looking for an All-in-One video converting tool with easy-to-use graphical interface, Any Video Converter provides just that, allowing you to effortlessly convert video files for FREE!\n\n \n\nVideo Converter Free Version can convert avi, asf, mov, rm, rmvb, flv, mkv, mpg, 3gp, m4v and vob to avi, wmv, mp4, mpg (PAL or NTSC), MPEG-1 and MPEG-2, swf, flv and mp3, aac, ogg, wave, m4a and wma.\n\n \n\nVideo Converter makes batch file conversion simple. Create a batch list of any different formats and convert them all to a single selected format. The converted files will be saved to a pre-selected directory folder and the original files will remain untouched.\n\n \n\nIt can convert almost all video formats including DivX, XviD, MOV, rm, rmvb, MPEG, VOB, DVD, WMV, AVI to MPEG-I, MPEG-I, DVD NTSC , DVD PAL, Flash for Video (FLV) ,AVI Video and Customized WMV movie formats. It also supports any user defined video file formats as the output. It has an unmatchable speed and high quality.\n\n \n\nWhether you are looking for free AVI video converter, free MKV video converter, free FLV video converter, free MP4 converter, or free YouTube converter, Any Video Converter Free Version is the right application for you. Download the free video converter now to convert videos and experience better digital life.\n\n \n\nVideo Converter Free Version can also download and convert YouTube videos and Google videos.\n\n \n\nVideo formats and media that Any Video Converter Free supports:\n\nInput formats:\n\navi, asf, mov, rm, rmvb, flv, mkv, mpg, 3gp, m4v, vob, YouTube videos and more\n\nOutput formats:\n\navi, mp4, wmv, swf, flv, mkv, MPEG-1 and MPEG-2, mpg (PAL or NTSC), asf, m2ts, mp3, wma, ogg, aac, wave, m4a\n\nSupported Media:\n\nCD-R, CD-RW, DVD-RAM, DVD+R, DVD+RW, DVD+R Dual Layer, DVD-R, DVD-RW, DVD-R Dual Layer, random access writes, Blu-ray media, Blu-ray Rewritable media. \n\nThanks\n\ni hope u comment my torrents\n\nEnjoy Friends And Seed","torrent":{"xt":"urn:btih:20a8c04e63754bcd3e927b488c407f614ef7b2ca","amp;dn":"Video+Converter+%2B+Serials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20a8c04e63754bcd3e927b488c407f614ef7b2ca","infoHashBuffer":{"type":"Buffer","data":[32,168,192,78,99,117,75,205,62,146,123,72,140,64,127,97,78,247,178,202]},"announce":[],"urlList":[]}}