{"title":"Horse Soldiers (Doug Stanton) (US in Afghanistan) (6 Audio CDs)","uid":5602691,"size":182709506,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2181a02d7be046dbdf0b8de2c38afff705ec7a57&amp;dn=Horse+Soldiers+%28Doug+Stanton%29+%28US+in+Afghanistan%29+%286+Audio+CDs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1275400287,"description":"Audio Books : Action : MP3/64Kbps : English &lt;a href=&quot;\nhttp://www.amazon.com/Horse-Soldiers-Extraordinary-Victory-Afghanistan/dp/0743580818&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Horse-Soldiers-Extraordinary-Victory-Afghanistan/dp/0743580818&lt;/a&gt;\n\nAudio CD - 6\nPublisher: Simon &amp; Schuster Audio; Abridged edition (May 5, 2009)\nLanguage: English\nISBN-10: 0743580818\nISBN-13: 978-0743580816\n\nFrom The Washington Post's Book World/washingtonpost.com Reviewed by Chris Bray &quot;Horse Soldiers&quot; tells the important story of the Special Forces soldiers who first put American boots on the ground in Afghanistan in 2001. Fighting alongside the Northern Alliance, the troops, often riding on horseback, achieved several important victories against the Taliban. But their accomplishments lose significance in this account by Doug Stanton, a men's magazine writer and author of the bestseller &quot;In Harm's Way,&quot; who reduces all the players to stock types. Hollywood will not have to work hard to produce the adaptation: A &quot;hard-as-nails&quot; colonel, with &quot;hands as large as oven mitts,&quot; leads troops who do &quot;enough sit-ups and push-ups to make an Olympian god throw up.&quot; Jaws flare, muscles ripple, eyes burn like hot coals -- all that stuff. Unlike Sean Naylor's 2005 book, &quot;Not a Good Day to Die,&quot; an eyewitness report of early U.S. combat in Afghanistan that put the operations within their institutional context, &quot;Horse Soldiers&quot; is a superficial account that only appears to be that of a bystander. As Stanton explains in the author's note, the book is based on interviews, journals, &quot;previously published media accounts, contemporaneous photography, and voluminous official U.S. military logs and histories.&quot; Stanton also visited many of the sites he writes about in the book -- but not during the time the events he describes were unfolding. Nonetheless, his book is written as if he were there. So, for instance, an Afghan warlord lights a cigarette and exhales &quot;slowly at the sky,&quot; closing his eyes to listen for helicopters under a moon that &quot;hung overhead, a bleached horn driven into the flank of the night.&quot; A soldier at a base in Uzbekistan, &quot;bored out of his mind,&quot; walks outside at night and drives a golf ball off the berm at the edge of the camp: &quot;The ball soared, a white orb sinking in the dirty pond of the night sky.&quot; A medic treats a wound from a land mine, &quot;the jellied flesh dark as a ruby.&quot; White orbs, dirty ponds of the night, jellied flesh rubies -- I kept picturing Snoopy at his typewriter: &quot;It was a dark and stormy night.&quot; Prose style aside, readers should approach these kinds of details with skepticism. Those doubts should gather strength as Stanton describes the details of military operations. Special Forces soldiers walk around with &quot;fingers curled around triggers&quot; without having identified anything to shoot. Six troops ride for hours through Taliban country, trailed only by a small and indifferent group of Northern Alliance soldiers for security; then, as they prepare to enter a village, the team commander tells them for the first time to &quot;lock and load.&quot; And so on. In short, Stanton has written a book that may interest a general audience but has little to offer policymaker and military professionals.","torrent":{"xt":"urn:btih:2181a02d7be046dbdf0b8de2c38afff705ec7a57","amp;dn":"Horse+Soldiers+%28Doug+Stanton%29+%28US+in+Afghanistan%29+%286+Audio+CDs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2181a02d7be046dbdf0b8de2c38afff705ec7a57","infoHashBuffer":{"type":"Buffer","data":[33,129,160,45,123,224,70,219,223,11,141,226,195,138,255,247,5,236,122,87]},"announce":[],"urlList":[]}}