{"title":"Deep Purple - Concerto For Group And Orchestra (1970) WMA320","uid":6292999,"size":161428782,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:21da2975ab9133c23a9db02acf59bc6e31b6aa7c&amp;dn=Deep+Purple+-+Concerto+For+Group+And+Orchestra+%281970%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1301892337,"description":"Concerto for Group and Orchestra was/is a breakthrough album on many levels. Though The Moody Blues were first associated with the combination of symphony orchestras and a guitar group, they were not remotely of the same genre as Deep Purple; and the people listening to Ritchie Blackmore were not impressed with the softness of The Moodys' poetic approach to what was, nonetheless, categorized as rock &amp; roll, purely for lack of the better term that was to eventually follow, 'symphonic rock.' \n\nDeep Purple (or rather Jon Lord) used the total polarity between the band and the symphony to successfully emphasize the fact that, though complete opposites, they could all play nicely together. And play nicely they did. Having bought the vinyl on the day of its US release, it was easy to visualize Jon Lord and Malcolm Arnold almost chuckling at the way each played off of each other - cool as card sharks in a room full of suckers. It sounds as though they had rehearsed for years. Lord's passion and talent for rock and classical music is evident in every note of the composition - there are no fumbles or self-conscious moments between movements - the recording literally glides from start to finish with none of the upper-crust stuffiness one might reasonably expect when rock legend meets classical conductor. \n\nOn the subject of sound, the fidelity of the album is far above respectable for a live album of the period. CGO was recorded before all of the subsequent acoustic improvements were made to the Royal Albert Hall to accommodate all of the rock legends that would later perform there. It is an open, airy recording that perfectly balances the effects achieved by paying close attention to microphone placement, and does not play off of audience response ad nauseum to emphasize that it is a live recording. In short, the album sounds like the listener is there, occupying a really good seat. The absence of Rod Evans and Nicky Simper is regrettable; though Roger Glover and Ian Gillian delivered competent performances, they couldn't produce the sparkle and personality of the original Deep Purple line-up. This does not detract from the overall quality of the album, its concept, or its performance as a whole. Summed up, buy this album and experience an event that shines in the light of day, even after 42 years.\n\nby Kurt H. Selvig\n\nTRACKLIST:\n\n01 - Intro.wma                                                   \n02 - First Movement Moderato-Allegro.wma                         \n03 - Second Movement Andante.wma                                 \n04 - Third Movement Vivace-Presto.wma \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!","torrent":{"xt":"urn:btih:21da2975ab9133c23a9db02acf59bc6e31b6aa7c","amp;dn":"Deep+Purple+-+Concerto+For+Group+And+Orchestra+%281970%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21da2975ab9133c23a9db02acf59bc6e31b6aa7c","infoHashBuffer":{"type":"Buffer","data":[33,218,41,117,171,145,51,194,58,157,176,42,207,89,188,110,49,182,170,124]},"announce":[],"urlList":[]}}