{"title":"Carole King - Rhymes &amp; Reasons (1995) [Rock Pop][mp3 320][h33t][","uid":4990522,"size":86136550,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:221e205e4ebba739ec6a734e13ed851f9f8b3e9d&amp;dn=Carole+King+-+Rhymes+%26+Reasons+%281995%29+%5BRock+Pop%5D%5Bmp3+320%5D%5Bh33t%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"schon55","files":19,"time":1247011543,"description":"Carole King - Rhymes &amp; Reasons \nOriginal Release Date: November 1972 \nAudio CD: March 1, 1991 \nLabel: Sony \nBitrate: 320 kbps\n\nThis album plays out as the soundtrack of my life right now, for the past 7 months or so.  Times of confusion have been alleviated by knowing that Carole King could write about the same confusions, times of longing, times of friendship, pride, stepping back.  All of these are in this album, remarkable when its length is considered!\nThis album hit me much harder than tapestry has.  And that being said, i am a 24 y/o in 2002 i'll be 25, and i never listened to carole king (well besides songs i couldn't have avoided-- but i didn't know they were hers) previous to saying, hmm i will try her out, and picking up tapestry and rhymes &amp; reasons simultaneously on vinyl from the salvation army.  \nThis one just one me over in sheer emotional force, on so many levels.  \nheck it made my girlfriend at the time want to give it another shot cause i was listening to this in the background.  that says something.  hope i could help.  ~ Erik Mallinson\n\nI really love all Carole's music but this album is so special.  She sings about our lives, feelings, problems and it is so real.  The music is moving.  &quot;Been to Canaan&quot; is the most familiar song on the album for most people but once you hear the rest you will realize that each one is a treasure.  Just sit back and listen- it's incredible.  The piano in &quot;My, My She Cries&quot; is wonderful.  The medody is sweet and beautiful.  In the middle of the song Carole sings the melody with the piano it makes me smile!\n&quot;The First Day in August&quot; is another great song with Carole playing that wonderful piano.  It also has a great string arrangement.  It is a sweet love song.  &quot;Bitter with the Sweet&quot; is really upbeat.  I think Charlie Larkey is playing bass on this one and it is really good and sounds great with Carole on piano.  The horns come in the middle with Carole singing the medody.  You just gotta hear it.  You will love it.  I just love hearing Carole play piano and on this album you can hear her very clearly.  It's great.  Do yourself a favor and buy it.  ~ Beverly Dery\n\nCarole King - Rhymes &amp; Reasons Tracks:\n01  Come Down Easy\n02  My My She Cries\n03  Peace In The Valley\n04  Feeling Sad Tonight\n05  The First Day In August\n06  Bitter With the Sweet\n07  Goodbye Don't Mean I'm Gone\n08  Stand Behind Me\n09  Gotta Get Through Another Day\n10  I Think I Can Hear You\n11  Ferguson Road\n12  Been To Canaan\n\n","torrent":{"xt":"urn:btih:221e205e4ebba739ec6a734e13ed851f9f8b3e9d","amp;dn":"Carole+King+-+Rhymes+%26+Reasons+%281995%29+%5BRock+Pop%5D%5Bmp3+320%5D%5Bh33t%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"221e205e4ebba739ec6a734e13ed851f9f8b3e9d","infoHashBuffer":{"type":"Buffer","data":[34,30,32,94,78,187,167,57,236,106,115,78,19,237,133,31,159,139,62,157]},"announce":[],"urlList":[]}}