{"title":"The Wrestler - 2008","uid":5035870,"size":735772672,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:22681239fa173feb01de56b32e16b8becc1c0d2a&amp;dn=The+Wrestler+-+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EvilTSAngel","files":-1,"time":1249118868,"description":"Theatrical Release Information  |  See Details About All Versions\nHis sense of identity fading into nothingness after the spotlights dim and he experiences a close brush with mortality, a retired wrestler begins to evaluate his life while considering the comeback that could very well kill him in director Darren Aronofsky's poignant portrait of an introspective former superstar in the twilight of his career. Back in his heyday, wrestler Randy &quot;The Ram&quot; Robinson (Mickey Rourke) was an icon in the ring. His image immortalized in action figures and video games, he would headline arenas across the globe. Twenty years later, those glory days have passed, and Randy is forced to earn his keep by brawling before handfuls of fans in high school gyms and community centers around New Jersey. In the wake of a heart attack, the former icon attempts to earn a little extra cash while working in a deli and making an effort to reconnect with his estranged teenage daughter, Stephanie (Evan Rachel Wood). Yet, despite Randy's continued attempts at convincing local stripper Cassidy (Marisa Tomei) to settle down with him in his humble trailer, the ring still calls to him. Later, when the prospect of a high-profile rematch with his longtime nemesis presents itself, Randy is forced to weigh his mortality against his desire to hear the crowd roar one last time. The Wrestler snagged two Oscar nominations, one for Best Actor (Rourke) and one for Best Supporting Actress (Tomei). ~ Jason Buchanan, All Movie Guide\n\nWarning:  This product is intended for mature audiences only. It may contain violence, sexual content, drug abuse and/or strong language. You must be 17 or older to purchase it. By ordering this item you are certifying that you are at least 17 years of age.\n\n\nTheatrical Feature Running Time: 109 mins \nComplete Cast:\nMickey Rourke - Randy &quot;The Ram&quot; Robinson\nEvan Rachel Wood - Stephanie Robinson\nWass W. Stevens - Nick\nGregg Bello - Larry\nArmin Amiri - Doctor\nErnest Miller - The Ayatollah\nMarisa Tomei - Cassidy\nDonnetta Lavinia Grays - Jen\nMark Margolis - Lenny\nJudah Friedlander - Scott\nTodd Barry - Wayne\n\n\nDirector(s):Darren Aronofsky\nWriter(s):Robert Siegel\nProducer(s):Scott Franklin, Darren Aronofsky, Nicolas Cage\nTheatrical MPAA Rating: R(Violence, Drug Content, Adult Language, Adult Situations, Nudity, Sexual Situations)\nCategories:DramaClosed Captioning:Check All Versions\nSubtitles:Check All Versions\nAwards:\n2008 - The Wrestler - Alliance of Women Film Journalists - Bravest Performance Award\n2008 - The Wrestler - American Film Institute - Best Picture\n2008 - The Wrestler - Boston Society of Film Critics - Best Actor\n2008 - The Wrestler - Chicago Film Critics Association - Best Actor\n2008 - The Wrestler - Florida Film Critics - Best Supporting Actress\n2008 - The Wrestler - Florida Film Critics - Best Actor\n2008 - The Wrestler - Iowa Film Critics Association - Best Actor\n2008 - The Wrestler - Iowa Film Critics Association - Best Movie Yet to Open in Iowa\n2008 - The Wrestler - Kansas City Film Critics Association - Best Actor\n2008 - The Wrestler - Kansas City Film Critics Association - Best Director\n2008 - The Wrestler - Kansas City Film Critics Association - Best Original Screenplay\n2008 - The Wrestler - Las Vegas Film Critics Association - Best Supporting Actress\n2008 - The Wrestler - London Film Critics Association - Best Picture\n2008 - The Wrestler - Online Film Critics Association - Best Actor\n2008 - The Wrestler - Online Film Critics Association - Best Supporting Actress\n2008 - The Wrestler - Phoenix Film Critics Association - Best Supporting Actress\n2008 - The Wrestler - San Diego Film Critics Association - Best Supporting Actress\n2008 - The Wrestler - San Diego Film Critics Association - Best Actor\n2008 - The Wrestler - San Francisco Film Critics Circle - Best Actor\n2008 - The Wrestler - San Francisco Film Critics Circle - Best Supporting Actress\n2008 - The Wrestler - Toronto Film Critics Association - Best Actor\n2008 - The Wrestler - Utah Film Critics - Best Actor\n2008 - The Wrestler - Women Film Critics Circle - Best Actor\n\nBlockbuster info link: &lt;a href=&quot;\nhttp://www.blockbuster.com/browse/catalog/movieDetails/381135&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.blockbuster.com/browse/catalog/movieDetails/381135&lt;/a&gt;\n\n\nMovie Only!\n\nEnjoy and Seed!","torrent":{"xt":"urn:btih:22681239fa173feb01de56b32e16b8becc1c0d2a","amp;dn":"The+Wrestler+-+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22681239fa173feb01de56b32e16b8becc1c0d2a","infoHashBuffer":{"type":"Buffer","data":[34,104,18,57,250,23,63,235,1,222,86,179,46,22,184,190,204,28,13,42]},"announce":[],"urlList":[]}}