{"title":"Funkadelic - Let's Take It to the Stage .flac files","uid":6250203,"size":251497570,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:22e0ee7461b4ed22626165c5691f9e1acd8784fb&amp;dn=Funkadelic+-+Let%5C%27s+Take+It+to+the+Stage+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ulikes","files":16,"time":1300382897,"description":"I personally believe that Funkadelic were hitting a peak when they made 'Let's Take It To The Stage&quot;.They had certainly perfected their mix of funk and psychedelic rock and had it down to a science.And in the pure funk-rock idion\n&quot;Good To Your Earhole&quot;,&quot;Stuffs And Things&quot; and the unforgettable\n&quot;Get Off Your Ass And Jam&quot; are the real deal!The zany title track and the cryptic &quot;Better By The Pound&quot; are P-Funk basics with the latter featuring a brilliant percussion section.And the whole shabang ends off with the dirty,dirty &quot;Atmosphere&quot;,nothing but gospel organ and a filthy lyric-it so sacreligious I LOVE it!\n&quot;Be My Beach&quot; is one of those psychedelic Bootsy ballads that just punches you out (at least it does me) and &quot;No Head,No Backstage Pass&quot; is trashier then anything I've\nheard Aerosmith or Sabbath or ANY groovy hard rock band do!\n&quot;This Song Is Familiar&quot; is yet more of Funkadelic at their irreverant best-almost acapella gospel of sorts!To me this is one Funkadelic album that got pretty overlooked at first but that the years have treated VERY kindly!This is the kind of music that Digital Underground and Outkast have cut their teeth on and as it is it's still out and out FUNKY!Not to mention how it steers out of the long winded jam band style that had become a Funkadelic clishe'.I'd actually recommend this to anyone as the Funkadelic album to start with-their first album is at the\nsame level but this is somewhat easier to get into! \nAfter &quot;Atomic Dog,&quot; &quot;Get Off Your Ass And Jam&quot; is my favorite George Clinton song of all times. 2 minutes of the best rock and roll ever!\n\nIf you love Funkadelic/Parliament like I do, check my list as I have added many of their ablums and won't stop until I have done them all. So keep checking back. They are in the .flac format to preserve every sound and to give you more of what you're funkin' for.\n\nMp3 is AM radio compare to the sound quality of Flac people!\n\nLong live Flac!!!\n\nPlease send and enjoy!","torrent":{"xt":"urn:btih:22e0ee7461b4ed22626165c5691f9e1acd8784fb","amp;dn":"Funkadelic+-+Let%5C%27s+Take+It+to+the+Stage+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22e0ee7461b4ed22626165c5691f9e1acd8784fb","infoHashBuffer":{"type":"Buffer","data":[34,224,238,116,97,180,237,34,98,97,101,197,105,31,158,26,205,135,132,251]},"announce":[],"urlList":[]}}