{"title":"BLADE-2....DVDrip(vice)","uid":4996042,"size":574216632,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:23e763702a3d779bd773b5281de7cdb65339db8b&amp;dn=BLADE-2....DVDrip%28vice%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vicerock","files":-1,"time":1247288058,"description":"BLADE 2 DVDrip...THIS IS FOR THE IPOD AS I HAD TROUBLE WITH THE AUDIO WITH THE PSP\n\nResolution    : 368X208 (Wide Screen)\n              \nVideo Codec   : MPEG4\nVideo Bitrate : 600 Kbps\nAudio Codec   : AAC\nAudio Bitrate : 80 Kbps\n\n\nTwo years after the end of the previous film, Jared Nomak, dressed in rags, enters a blood bank in Prague looking to donate. A doctor leads him to a secluded chamber, where he quickly learns that the bank is run by vampires intent on draining him. They smirk when they tell him about their plan to drain him, he cries but soon he begins to laugh derisively before feeding on the vampire woman he uses superhuman strength to fight back before feeding on the rest of the vampires. Meanwhile, Blade cuts a swath through the vampire population of Prague to find his old mentor Abraham Whistler being kept in suspended animation. He rescues Whistler, who has been turned into a vampire, and administers an accelerated version of the cure that was developed in the first film. Whistler revives and learns that Blade has procured a new weaponsmith in his absence, Scud.\n\nAs Whistler and Scud begin to argue, a pair of vampires, Nyssa, and Asad invade Blade's base and deliver a truce offering. Blade accepts and visits the fortress of the ancient vampire Eli Damaskinos. There he learns that a disease spread by Nomak has created a new strain of infected vampires called Reapers that threaten to wipe out all human and vampire life on the planet. The vampires offer to ally with Blade in order to combat this mutual threat. Blade agrees and teams with the Bloodpack, an elite vampire squad that was created to battle Blade himself.\n\nBlade and the Bloodpack stake out a vampire nightclub, and their uneasy alliance quickly wears thin. When the Reapers attack, Blade pursues Nomak, and learns that he too bears a personal grudge against vampires. After the battle, the group deduces that the Reapers' only weakness is ultraviolet light. They concoct a plan to lure the Reapers into the sewers and ambush them with UV grenades. Though Blade develops an unusual connection with Nyssa, the daughter of Damaskinos, he is ultimately betrayed by the Bloodpack during the ambush. All the Reapers are killed in the UV explosion except Nomak.\n\nPLEASE SEED AND ENJOY THE MOVIE\n\nSORRY IF THERES BEEN ANY TROUBLE WITH MY OTHER UPLOADS AS IVE BEEN HAVING HAVING\nPROBLEMS WITH MY SYSTEM EVERYTHING SHOULD BE OK NOW","torrent":{"xt":"urn:btih:23e763702a3d779bd773b5281de7cdb65339db8b","amp;dn":"BLADE-2....DVDrip%28vice%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23e763702a3d779bd773b5281de7cdb65339db8b","infoHashBuffer":{"type":"Buffer","data":[35,231,99,112,42,61,119,155,215,115,181,40,29,231,205,182,83,57,219,139]},"announce":[],"urlList":[]}}