{"title":"Fun-Da-Mental All is War [OGG Rap] [TNTVillage]","uid":6158645,"size":64859205,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:254501416472d1650a1c22dc6ef171c0d28d97af&amp;dn=Fun-Da-Mental+All+is+War+%5BOGG+Rap%5D+%5BTNTVillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dedalo33","files":-1,"time":1297131569,"description":"Fun-Da-Mental - All is war\nthe benefits of G-Had\n\nUntil the philosophy that holds one superior and another inferior is finally and permanently abandoned and dismantled\nthere shall be war\n\n\n\nI Fun-Da-Mental sono una band britannica nata nel 1991 composta da figli di immigrati asiatici; suonano hip-hop, ethno, techno, world fusion in maniera molto particolare, mescolando le sonoritÃƒÂ  orientali alle forme musicali dell'Europa moderna. Ascoltando i Fun-Da-Mental si possono percepire suoni rubati dalla dance britannica cosÃƒÂ¬ come dall'hip-hop militante statunitense, ma non c'ÃƒÂ¨ un vero filone che il gruppo segue; le percussioni sono certo un elemento fondamentale, i cui tamburi riportano in India o in nord Africa. Altri pilastri sono la musica qawwali e Bhangra, cosÃƒÂ¬ come i film in Hindi campionati per le canzoni del gruppo.\n\nLa forte caratterizzazione politica della loro musica, ad orientamento antirazzista e filo-musulmana, gli ÃƒÂ¨ valso l'appellativo di Public Enemy dell'Asia.\n\nAssieme al leader del gruppo Aki &quot;Propa-Gandhi&quot; Nawaz (Haq Qureshi), suonano od hanno suonato Amir Ali, Hot Dog Dennis, Shamil Khan, Bad-Sha Lallaman, Inder &quot;Goldfinger&quot; Mantharoo, MC Mushtaq, Nad (aka &quot;Made in Britain&quot;), DJ Obeah, Nick &quot;Count Dubulah&quot; Page, Lloyd Sparkes Dave &quot;Impi-D&quot; Watts.\n\n\n[ :: Descrizione :: ]\nAll is War esce durante le occupazioni di Afghanistan ed Iraq (due paesi islamici) da parte delle forze militari occidentali nell'ambito della cosiddetta &quot;guerra al terrorismo&quot;, e dopo gli attentati di Londra del 2005, compiuti da militanti islamici britannici. In questo clima teso, il gruppo pubblica questo disco con una immagine di copertina che non lascia dubbi: al posto della statua della libertÃƒÂ  c'ÃƒÂ¨ un prigioniero incappucciato e torturato ad Abu Ghraib, che si affaccia su un mare di sangue.\n\nAnche se il gruppo era stato bersagliato dalle polemiche fin dalla nascita, l'uscita di questo disco porta il dibattito sui Fun-Da-Mental ad un altro livello, fino ad avere richieste pubbliche dell'arresto di Nawaz.\nTuttavia, un'analisi dell'album scevra da pregiudizi rivela semplicemente una presa di posizione piÃƒÂ¹ marcata rispetto ai precedenti (There Shall Be Love!, Erotic Terrorism, Seize the Time...), e che questo disco ÃƒÂ¨ il prodotto di un lavoro di studio del momento storico e del comune sentire riguardo agli eventi che stanno sconvolgendo le civiltÃƒÂ  nel 2006.\nI Reject ÃƒÂ¨ un'aperta condanna ai costumi ipocriti e immorali dell'Occidente, o perlomeno della sua classe politica che trascina le masse verso la guerra in Iraq, fortemente osteggiata dai popoli, mentre la terza traccia ripete incalzante, alienante &quot;all is war, this is what you fought for&quot;... Che Bin analizza i preconcetti occidentali di eroe e criminale, mettendo a confronto l'operato e gli ideali di Osama Bin Laden e Che Guevara, mentre Cookbook DIY ÃƒÂ¨ un testo rappato molto esplicito circa gli attentatori suicidi...\n\nQuesto disco puÃƒÂ² essere ascoltato con attenzione oppure messo come sottofondo mentre si ÃƒÂ¨ impegnati a far qualcosa; quel che ÃƒÂ¨ certo ÃƒÂ¨ che il ritmo incalzante, i contrasti tra hindi e rap, tra dub e le melodie arabe trascinano e non si accontenteranno di un solo ascolto...\n\n\n\n[ :: Tracklist &amp; Dati tecnici:: ]\nDurata totale: 57:20\nTracce totali: 13\nDimensione totale: 61.9 MB\nCodec: OGG\n\n01. I Reject - 3:59\n02. Electro G-Had (Punjab style) - 4:51\n03. 786 All is war - 4:53\n04. Cookbook DIY - 3:13\n05. Che Bin pt.2 - 4:14\n06. Parasites - 6:07\n07. Bark like a dog - 4:17\n08. B4. I leave - 4:10\n09. White tongues - 4:20\n10. 5 Prayers of Afghan women - 5:48\n11. Ya La Li - the leopard - 3:53\n12. Srebrenicia massacre - 5:03\n13. Che Bin pt.1 - 2:32\n\ncover inclusa / shipped with cover","torrent":{"xt":"urn:btih:254501416472d1650a1c22dc6ef171c0d28d97af","amp;dn":"Fun-Da-Mental+All+is+War+%5BOGG+Rap%5D+%5BTNTVillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"254501416472d1650a1c22dc6ef171c0d28d97af","infoHashBuffer":{"type":"Buffer","data":[37,69,1,65,100,114,209,101,10,28,34,220,110,241,113,192,210,141,151,175]},"announce":[],"urlList":[]}}