{"title":"Linkin Park -  Reanimation (2002) WMA320","uid":6266959,"size":151836623,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:263b59fa898a4324dd8e559294a8f90c0739f71e&amp;dn=Linkin+Park+-++Reanimation+%282002%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1300948048,"description":"Linkin Park's &quot;Reanimation&quot; is a remarkable CD. Many people I know said they wouldn't buy it because they assumed it was just a collection of extended, watered-down versions of their originals. Untrue. Each song is completely unique from it's parent, often times barely resembling it. With each song they took it to the next level, sometimes rerecording/rewriting the entire vocal or rap section to make it different from the original. &quot;Pushing Me Away&quot; comes to mind as a great example of this. So there's the first thing - this is not just a pale reflection of &quot;Hybrid Theory&quot;; it's completely fresh takes on the songs, including some previously unreleased cuts only available to LP fan club members.\nAlthough they used a dozen different producers throughout the CD it has an amazing continuity to it. The same melodic string and piano motifs appear throughout each recording, connecting it in a surreal way. There is only one production that seems out of place to me, and it's on the worst possible song - &quot;In The End.&quot; This was their biggest hit from &quot;Hybrid Theory&quot; and fans were expecting more out of it than any other cut on the record (at least I was). They destroyed it. The producers gave the song a shuffle feel and laced it with the &quot;yo-yo-yo&quot; street thing, rather than the more rapcore attitudes that permeate the rest of &quot;Reanimation.&quot; Terrible.\n\nFortunately, though, the rest of the CD shines. This may be the first record, with the exception of &quot;Hybrid Theory,&quot; that utilizes the newest technology for the good of music, not for the worse of it. Here's a brief explanation.\n\nMusic is done entirely on computers today. There is no more tape. Only hard drives. We can now work with music in a similar way that a writer works with a word processor - just cut and paste. The result has been the demise of music. We now have tools of unbelievable power, undreamt of only ten years ago, yet the quality of music has steadily gotten worse. Why? Because the tools are so powerful and simplified that unqualified musicians can now use them. Performances can always be &quot;fixed later&quot; so a good performance doesn't really matter anymore. The vocals can be tuned, the drums can be put in time - not need to waste precious studio time on perfectionism. That's if you're lucky enough to be in a studio. Most of these systems are in the producer's house, which brings us to the second reason for demise - location. We no longer need 84 channel consoles and racks upon racks of outboard gear. It's all in the computer. Anyway, I'm going off a little too much. The point is, music quality is declining because enormous power is now in the hands of people who aren't qualified to have it.\n\nLinkin Park, however, has used this power for good. They've managed to use it to produce new sounds we've never heard before and to overall improve the quality of their sounds. On &quot;Reanimation&quot; the editing is used as an instrument as much as anything else.\n\nMake sure to stick with every song because they often turn midway through into some new, amazing section. Track 7 comes to mind as a production with a less interesting first half that ends up providing the best moment on the album in the outro. If you liked &quot;Hybrid Theory&quot; I can't imagine you wouldn't love &quot;Reanimation.&quot;\n\nby Robert Graves\n\nTRACKLIST:\n\n01 - Opening.wma                                  \n02 - Pts.Of.Athrty.wma                            \n03 - Enth E Nd.wma                                \n04 - [Chali].wma                                  \n05 - Frgt10.wma                                   \n06 - P5hng Me AWy.wma                             \n07 - Plc.4 Mie HÃƒÂ¦d.wma                            \n08 - X-Ecutioner Style.wma                        \n09 - H! Vltg3.wma                                 \n10 - [Riff Raff].wma                              \n11 - WthYou.wma                                   \n12 - NtrMssion.wma                                \n13 - PPrKut.wma                                   \n14 - &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;bdefd3cafde493cad0dc&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;                                    \n15 - MyDsmbr.wma                                  \n16 - [Stef].wma                                   \n17 - By_Myslf.wma                                 \n18 - Kyur4 Th Ich.wma                             \n19 - 1stp Klosr.wma                               \n20 - Krwlng.wma     \n\nWMA 320Kbps 44100Hz STEREO\n\nFollow Me On Facebook Pages: MarcelodrgzTPB\n\n","torrent":{"xt":"urn:btih:263b59fa898a4324dd8e559294a8f90c0739f71e","amp;dn":"Linkin+Park+-++Reanimation+%282002%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"263b59fa898a4324dd8e559294a8f90c0739f71e","infoHashBuffer":{"type":"Buffer","data":[38,59,89,250,137,138,67,36,221,142,85,146,148,168,249,12,7,57,247,30]},"announce":[],"urlList":[]}}