{"title":"Japanese Kodo Drummers and Donal Lunny Irish band together (1998","uid":6175295,"size":733416944,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:272c48f867e21658ec401cf7bc2e72c8353709cd&amp;dn=Japanese+Kodo+Drummers+and+Donal+Lunny+Irish+band+together+%281998&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":-1,"time":1297751037,"description":"East Meets West - Japanese Kodo Drummers and Donal Lunny Irish band together (1998)\n\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1746kbps \nDuration.............: 52:08.957\nResolution...........: 608*464 \nFramerate............: 29.970 \nAudio Codec..........: 0x0055 MPEG-1 Layer 3 \nAudio Bitrate........: 115 kbps VBR \nAudio Channels.......: 2 \nFilesize.............: 733,386,752 \n\n &lt;a href=&quot;\nhttp://www.amazon.com/East-Meets-West-Donal-Lunny/dp/B000YKYT5I&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/East-Meets-West-Donal-Lunny/dp/B000YKYT5I&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/MaDNBAAdN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/MaDNBAAdN&lt;/a&gt;\n\n\nProduct Details\nActors: Kodo Drummers, Coolfin, Donal Lunny\nDirectors: Robert Corkey\nFormat: Color, DVD, NTSC\nLanguage: English\nRegion: Region 1 (U.S. and Canada only. Read more about DVD formats.)\nAspect Ratio: 1.33:1\nNumber of discs: 1\nStudio: KULTUR VIDEO\nDVD Release Date: January 29, 2008\nRun Time: 60 minutes\n\nProduct Description\n\nThis documentary celebrates the bringing together of two very different musical traditions: the drumming techniques of the Kodo Drummers of Sado Island, Japan, and the traditional Irish music performed by Donal Lunny and Coolfin. Having invited Donal Lunny and his band to play at the 1996 and 1997 Earth Celebrations on Sado Island, The Kodo Drummers made their first trip to Dublin, Ireland, in July 1998 to perform a series of concerts with the Donal Lunny Band. From barely audible pianissimos to earth-shattering explosions of sound, Kodo masterfully combine primal energy with virtuoso refinement.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Kodo_(taiko_group)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Kodo_(taiko_group)&lt;/a&gt;\n\nKodo is a professional taiko drumming troupe. Based on Sado Island, Japan, they have had a role in popularizing taiko drumming, both in Japan and abroad. They regularly tour Japan, Europe, and the United States.\n\nAlthough the main focus of the performance is taiko drumming, other traditional Japanese musical instruments such as fue and shamisen make an appearance on stage as do traditional dance and vocal performance. Kodo's performance include pieces based on the traditional rhythms of regional Japan, pieces composed for Kodo by contemporary songwriters, and pieces written by Kodo members themselves. The numbers that Kodo perform can change from concert to concert. Kodo's performance normally lasts for about one hour and forty minutes.\n\nIn Japanese the word &quot;Kodo&quot; conveys two meanings: &quot;heartbeat&quot; the primal source of all rhythm and, read in a different way, the word can mean &quot;children of the drum,&quot; a reflection of Kodo's desire to play their drums simply, with the heart of a child.\n\nKodo strives to both preserve and re-interpret traditional Japanese performing arts. From worldwide tours and research trips, Kodo brings back to Sado world music and experiences which now exert a strong influence on the group's performances and compositions. They also collaborate with other artists and composers.\n\nSince their debut at the Berlin Festival in 1981, Kodo have given over 3,100 performances on five continents, spending about a third of the year overseas, a third touring in Japan and a third resting and preparing new material on Sado Island.\n\n\nDÃƒÂ³nal Lunny (born 10 March 1947) is an Irish folk musician. Lunny has been at the forefront of the evolution of traditional Irish music for more than thirty-five years and has participated within the renaissance of traditional Irish music in that time period. He is the brother of musician and producer Manus Lunny.","torrent":{"xt":"urn:btih:272c48f867e21658ec401cf7bc2e72c8353709cd","amp;dn":"Japanese+Kodo+Drummers+and+Donal+Lunny+Irish+band+together+%281998","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"272c48f867e21658ec401cf7bc2e72c8353709cd","infoHashBuffer":{"type":"Buffer","data":[39,44,72,248,103,226,22,88,236,64,28,247,188,46,114,200,53,55,9,205]},"announce":[],"urlList":[]}}