{"title":"parking.wars.s03e03.VeroVenlo","uid":5125448,"size":182994944,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:27afa501217f2c7b849661f5441491da23638f6b&amp;dn=parking.wars.s03e03.VeroVenlo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"verovenlo","files":1,"time":1255590586,"description":"The first hand and playful look at what happens when Philadelphia's citizens come face-to-face with the parking \n\nenforcers. Just when you thought it was safe to park again in Philly: Parking Wars returns, more riotous than \n\never!\n\nThe people you love to hate - the men and women of the Philadelphia Parking Authority - are back, ticketing, \n\nbooting and towing the cars of problem parkers who express their outrage in furious Philly fashion.\n\nReturning faves include &quot;Gadget Man&quot; Garfield and his booting partner Sherry, hunting for scofflaws in a new \n\nhigh-tech van. And ticket writers are back to face off with irate citizens and dodge angry drivers including \n\nwise***ing Brian, short-but-tough Carmen, the trouble-attracting Danielle, male-attention-magnet Marylin, the \n\nprotective supervisor Luz and fun-loving Shawn. New faces include rookie ticket writer Mike who clashes with \n\ndrunken revelers on wild South Street, &quot;glamour gal&quot; Marlene, tough-talking Lori, and Jen who is so gung-ho to \n\nboot, she'll even scan for scofflaws on her own block.\n\nAll roads in Philly still lead to the impound lot - the &quot;car prison&quot; where tempers flare as drivers struggle to \n\nget their cars back. This season a man becomes so outraged that no one can calm him down, a religious couple \n\nlooks to the power of Jesus to help them, police are called in to investigate an alleged theft, and a teenager \n\nblames everyone but herself for being towed.\n\nOur &quot;heroes&quot; not only endure verbal abuse but they can also experience real danger. When a police officer is shot \n\nand killed, the unarmed parking officers are reminded how scary it can be to wear a uniform and walk a gritty \n\nbeat.\n\nIntense, humorous and always emotional - &quot;Parking Wars&quot;' third season is more outrageous than ever.","torrent":{"xt":"urn:btih:27afa501217f2c7b849661f5441491da23638f6b","amp;dn":"parking.wars.s03e03.VeroVenlo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27afa501217f2c7b849661f5441491da23638f6b","infoHashBuffer":{"type":"Buffer","data":[39,175,165,1,33,127,44,123,132,150,97,245,68,20,145,218,35,99,143,107]},"announce":[],"urlList":[]}}