{"title":"Lieutenant Pigeon - The Best Of Lieutenant Pigeon","uid":5515525,"size":138279921,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2807ef43caccc6ac5a77ad5d76173b1dc7320885&amp;dn=Lieutenant+Pigeon+-+The+Best+Of+Lieutenant+Pigeon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":26,"time":1272234200,"description":"Lieutenant Pigeon - The Best Of Lieutenant Pigeon\nCD (2001) To MP3 320 Kbit/s\nIncluded CD Front &amp; This Info\n\nLieutenant Pigeon was a British novelty popular music group, originating from Coventry.\n\nCareer\nLieutenant Pigeon was a British musical group popular in the early 1970s. A spin-off from an experimental music band Stavely Makepeace, it was fronted by Rob Woodward. The group's sound was dominated by a heavy ragtime-style piano played by Woodward's mother, Hilda.\n\nLieutenant Pigeon achieved two UK hits: &quot;Mouldy Old Dough&quot;, written by Rob Woodward with bandmate Nigel Fletcher, reached number one in 1972, followed by &quot;Desperate Dan&quot; (number 17 in 1973). Both tracks were largely instrumental, with the titles providing virtually the only lyrics. &quot;Mouldy Old Dough&quot; (the title being an adaptation of the 1920s jazz phrase, &quot;vo-de-o-do&quot;) became the second biggest selling UK single of the year, behind The Band of the Royal Scots Dragoon Guards' bagpipe version of &quot;Amazing Grace&quot;.\n\nLieutenant Pigeon scored a further hit, in the autumn of 1974, when it reached number 3 in the Australian charts with a cover version of &quot;I'll Take You Home Again, Kathleen&quot;.  &lt;a href=&quot; http://en.wikipedia.org/wiki/Lieutenant_Pigeon&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Lieutenant_Pigeon&lt;/a&gt;\n\n\n&quot;Lieutenant Pigeon&quot;   Biography  by Richie Unterberger\nA truly odd popular music ensemble for 1970s Britain, Lieutenant Pigeon enjoyed a fairly long and successful recording career with their offbeat, mostly instrumental music. Not exactly easy to categorize as rock, it's nonetheless hard to know what else to call their mix of martial percussion (similar to that heard in Napoleon XIV's infamous hit &quot;They're Coming to Take Me Away, Ha-Ha&quot;), century-old sounding parlor music, and weird insertions of fifes, rickety pianos, and half-buried miscellaneous vocal growls. That their debut single made it all the way to number one in the U.K. is a testament to the British tolerance and indeed encouragement of eccentricity that could be cultivated nowhere else.\n\nThe mainstays of Lieutenant Pigeon were Rob Woodward and Nigel Fletcher, both of whom had been playing in bands since the early '60s. Under the name Shel Naylor, Woodward had recorded a couple of singles for Decca in 1963-1964; one of those, &quot;One Fine Day,&quot; was a Dave Davies composition that the Kinks never officially released. By the late '60s, the pair were making home recordings in the front room of the Coventry house of Woodward's mother, Hilda Woodward. Rob Woodward and Fletcher formed a band, Stavely Makepeace, which began releasing records in 1969.\n\nLieutenant Pigeon was conceived of as sort of a novelty alter ego band of Stavely Makepeace, intended to emphasize humorous instrumental music. As further evidence that it was not as seriously aimed at the pop/rock market, Hilda Woodward, then in her late fifties, was added to the lineup on piano. The semi-joke became more successful than could have been reasonably anticipated though, when their first single, &quot;Mouldy Old Dough,&quot; came out in 1972. A characteristically zany, unclassifiable bit of instrumental madness with Joe Meek-like wobbly piano and those unavoidable marching rhythms, it became number one in Belgium after it was used as a theme for a current affairs television show. By the end of the year it was number one in their native Britain as well.\n\nLieutenant Pigeon had just one more big British hit, &quot;Desperate Dan,&quot; which made the Top Twenty after its release at the end of 1972. They continued to grind out records for most of the rest of the 1970s though, getting a number two hit in Australia in 1974 with their version of &quot;I'll Take You Home Again Kathleen.&quot; Woodward and Fletcher then established themselves as producers of jingles, voice-overs, and such for radio. They told their own story in their joint autobiography When Show Business is No Business, published in 2001. \n\n\n&quot;The Best Of Lieutenant Pigeon&quot;   Review  by Richie Unterberger\nThe highlights from their 1970s singles (including the hits &quot;Mouldy Old Dough,&quot; &quot;Desperate Dan,&quot; and &quot;I'll Take You Home Again Kathleen&quot;) are on this 18-track compilation, as well as some cuts from albums, and a couple of previously unreleased songs. Certainly this is too much of a silly booze-up to endure at once. You pretty much get the idea from a few tracks here and there. But as kind of a goofy 1970s counterpart to Joe Meek's unfathomably weird productions of the prior decade, it has its value, novelty, and otherwise. Given how much hipper and more popular vintage, off-kilter kitsch has become in the States since 1990 or so, it's rather surprising no one has picked up on this lot in the U.S.; perhaps it seems too obvious to champion a band that had a number one British single as a remarkable discovery. As far as moments that stand out, it's interesting how the wordless high female vocals on &quot;Spangles&quot; sound so eerily similar to the high female backup parts on classic 1960s Kinks records like &quot;Death of a Clown.&quot; \n\nLineup:\nRobert Woodward - Keyboards, Guitar, Tin Whistle\nHilda Woodward - Piano\nStephen Johnson - Bass Guitar, Tin Whistle\nNigel Fletcher - Drums\n\nTracklist:\n01. Mouldy Old Dough\n02. The Villain\n03. Desperate Dan\n04. Opus 300\n05. And The Fun Goes On\n06. Opus 302\n07. Oxford Bags\n08. I'll Take You Home Again Kathleen\n09. Spangles\n10. Gordon's Rainbow Wranglers\n11. Nut Rocker\n12. Have A Drink On Me\n13. If Julia Sees Her\n14. Rockabilly Hot Pot\n15. Yu Da Nu Nayba\n16. Aggravation\n17. In The Mood\n18. Those Were The Days","torrent":{"xt":"urn:btih:2807ef43caccc6ac5a77ad5d76173b1dc7320885","amp;dn":"Lieutenant+Pigeon+-+The+Best+Of+Lieutenant+Pigeon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2807ef43caccc6ac5a77ad5d76173b1dc7320885","infoHashBuffer":{"type":"Buffer","data":[40,7,239,67,202,204,198,172,90,119,173,93,118,23,59,29,199,50,8,133]},"announce":[],"urlList":[]}}