{"title":"Sinclair-Great Silence Conspiracy(Romanmasonry behind Nazism&amp;Fas","uid":5009506,"size":150978,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:285903baa54ad674793a3728773d07f481bcb5b1&amp;dn=Sinclair-Great+Silence+Conspiracy%28Romanmasonry+behind+Nazism%26Fas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1247876921,"description":"This is Andrew Sinclair's shocking booklet The Great Silence Conspiracy - Fully Documented Exposure of Romanmasonry (Catholic Action) and Fascism which exposes the secret founding of Nazism and Fascism by the priestly orders of Catholic church - Romanmasons. Considering Nazism's historical importance one would think that the basic facts about it would be well known, but nothing could be further from the truth. The force or the powerful people who spawned Nazism have made certain that the public has been kept in almost total ignorance of who gave Nazism and Fascism in general birth. In a very few words every brand of Fascism was fathered and masterminded by priestly and lay members of the Roman Church. It was a product of secret Catholic Action, hence the term Roman-masonry. As Moscow exudes Communism, Rome exudes Fascism. The post-war Cambridge pro-Communist moles were Red Moles; the pre-war Oxford pro-Fascist moles were Black Moles. The author shows that the fuhrers of Fascism everywhere in Europe were members of the Black Internationale who brought their fruits of tyranny, brutal destruction, bloody and fiendish destruction of what Democracy there was in Europe. Both Mussolini and Hitler made capital out of the post 1914-18 war conditions in Italy and Germany. Without the First World War there would have been no dictator Hitler. The Versailles Treaty, the latent anti-Semitism in Germany, and hatred of Russian Communism gave the Nazis their propaganda. Sinclair asks the important question of 'who' the captors were. It concerns the force of European organisation - indeed international organisation - behind Nazism. Hitler's aim was the restoration of a non-democratic Europe ruled by German militarism and Vatican ecclesiasticism, a modern Holy Roman Empire - that's why he spoke about &quot;a thousand years&quot; - and at the height of Fascism's power Hitler and Pope Pius XII had recreated it. Three non-Roman powers - America, Britain and Russia - exploded that Jesuit dream. 35 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:285903baa54ad674793a3728773d07f481bcb5b1","amp;dn":"Sinclair-Great+Silence+Conspiracy%28Romanmasonry+behind+Nazism%26Fas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"285903baa54ad674793a3728773d07f481bcb5b1","infoHashBuffer":{"type":"Buffer","data":[40,89,3,186,165,74,214,116,121,58,55,40,119,61,7,244,129,188,181,177]},"announce":[],"urlList":[]}}