{"title":"REPRESENTATION AND PHOTOGRAPHY [thethingy]","uid":6174223,"size":54258406,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:28bbb45b5fe00e15cdc9ae35f66dcf0bb26f18d3&amp;dn=REPRESENTATION+AND+PHOTOGRAPHY+%5Bthethingy%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"thethingy","files":-1,"time":1297706107,"description":"Representation and Photography.\n\nIn the late 1970s the fields of film and media studies were in ferment. New ideas were being imported wholesale into an area that had previously been starved of intellectual input. During this time the influential journal, Screen Education, pioneered the teaching and study of the visual image. It provided a major channel for the introduction of concepts, drawn from semiotics and linguistics, structuralism, Marxism and psychoanalysis, that were being used to energise the analysis of visual media. Representation and Photography contains twelve classic articles by important thinkers such as John Berger, Victor Burgin, Griselda Pollock, Jo Spence and John Tagg, that were first published in Screen Education between 1976 and 1981. These seminal essays contributed to the development of writing and teaching about image analysis and photography and they are collected together for the first time in this book. Over the past two decades, educational debate has moved away from the arguments raised in the 1970s, but interest is returning to them now as it becomes apparent that their significance and power has not diminished with time. The articles selected here provide rewarding insights into the continuing questions of which images are important to our society and why. They explore the political and cultural meanings of still images and their interconnections with other media and society in general. These articles have been chosen by the editors not only because they proved catalysts when first published, but because they continue to stimulate valuable questions in the analysis of visual media today.\n\n\nYou can use the free acrobat reader to view this or;\n\nAdobe Acrobat;                    &lt;a href=&quot;\nhttp://thepiratebay.se/search/Adobe%20Acrobat%20%5Bthethingy%5D/0/99/300&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/search/Adobe%20Acrobat%20%5Bthethingy%5D/0/99/300&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:28bbb45b5fe00e15cdc9ae35f66dcf0bb26f18d3","amp;dn":"REPRESENTATION+AND+PHOTOGRAPHY+%5Bthethingy%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28bbb45b5fe00e15cdc9ae35f66dcf0bb26f18d3","infoHashBuffer":{"type":"Buffer","data":[40,187,180,91,95,224,14,21,205,201,174,53,246,109,207,11,178,111,24,211]},"announce":[],"urlList":[]}}