{"title":"High-Logic FontCreator 6.0","uid":5092269,"size":8835680,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:28dc1835fc16352ecc9f019aff0bb58843f1a151&amp;dn=High-Logic+FontCreator+6.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"busaho","files":6,"time":1253241030,"description":"FontCreator has the powerful font-creation tools that typographers and graphic designers require, and an intuitive interface that even allows beginners to become productive immediately.\nThe editor lets you easily select and modify the entire character set of any TrueTypeÃ‚Â® font and fonts based on OpenTypeÃ‚Â® font technology. Features include the ability to convert (scanned) images to outlines, thus enabling you to create fonts with your own signature, logo and handwriting. The advanced validation features make the design process easy and help you avoid common mistakes.\nWhether you're a typographer or graphic designer who needs a font creation powerhouse, or a hobbyist who wants to have fun creating new fonts, FontCreator has the tools you need\n\nTorrent includes program, installation text file in english and screenshot images.\n\nAll needed cracks and serial numbers are include to run as full version.\n\nFor Vista and Windows 7 user, disabling UAC or 'Run as administrator' may be needed.\n\nTested on Windows 7 RC 7100 x32 and scanned with Microsoft Security Essentials.\n\nIf you like this program buy the latest version or upgrade, sometimes 30 days is not enough time to evaluate a program.","torrent":{"xt":"urn:btih:28dc1835fc16352ecc9f019aff0bb58843f1a151","amp;dn":"High-Logic+FontCreator+6.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28dc1835fc16352ecc9f019aff0bb58843f1a151","infoHashBuffer":{"type":"Buffer","data":[40,220,24,53,252,22,53,46,204,159,1,154,255,11,181,136,67,241,161,81]},"announce":[],"urlList":[]}}