{"title":"Frank Zappa - You Can't Do That On The Stage Anymore, Vol. 6 ","uid":5169973,"size":980780185,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:290cdc8efe9214266a1f0efeb1e49d87111e36a6&amp;dn=Frank+Zappa+-+You+Can%5C%27t+Do+That+On+The+Stage+Anymore%2C+Vol.+6+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":65,"time":1258590941,"description":"The last volume of the series You Can't Do That on Stage Anymore is one of the strongest, especially for those who prefer Frank Zappa's sex-oriented songs. There is not much complex material or instrumental pieces in this collection, but catchy humorous songs abound, along with more of that stage craziness the series tried to capture. Live incarnations of Zappa's band from 1970 up to 1988 are represented (the original Mothers had a whole disc devoted to them on Vol. 5). Most of disc one revolves around sex, starting with &quot;The M.O.I. Anti-Smut Loyalty Oath,&quot; where the 1970 Mothers solemnly swear not to show their private parts on stage. Disc two is more varied, but tracks like &quot;Catholic Girls&quot; and &quot;Crew Slut&quot; make it fit right in. &quot;The Poodle Lecture&quot; and &quot;Lonely Person Devices&quot; reveal important Conceptual Continuity Clues. The &quot;Camarillo Brillo&quot;/&quot;Muffin Man&quot; medley provides a highlight, as does the frantic rendition of &quot;Dirty Love.&quot; Lisa Popeil, who sang the 1982 track &quot;Teen-Age Prostitute,&quot; makes her only other Zappa-related appearance in &quot;Lisa's Life Story.&quot; Most of all, the music from the movie 200 Motels -- still unavailable on CD when this album came out -- was given special attention. Even today, the renditions of &quot;200 Motels Finale&quot; and &quot;Shove It Right In&quot; stand out as important tracks. This volume is less focused on the die-hard fan craving rare material. It will appeal to a wider range of casual listeners, while portraying with much fidelity the atmosphere of Zappa's concerts.\n\n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:                               &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay &quot;thank you&quot; by seeding... just seed, it is not harmful to your health :-)\t\t\t","torrent":{"xt":"urn:btih:290cdc8efe9214266a1f0efeb1e49d87111e36a6","amp;dn":"Frank+Zappa+-+You+Can%5C%27t+Do+That+On+The+Stage+Anymore%2C+Vol.+6+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"290cdc8efe9214266a1f0efeb1e49d87111e36a6","infoHashBuffer":{"type":"Buffer","data":[41,12,220,142,254,146,20,38,106,31,14,254,177,228,157,135,17,30,54,166]},"announce":[],"urlList":[]}}