{"title":"Public Enemy - Muse Sick-N-Hour Mess Age .flac files","uid":6285083,"size":687563207,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:29f0f960085c77f3d6190312758b10b315bf3cf8&amp;dn=Public+Enemy+-+Muse+Sick-N-Hour+Mess+Age+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ulikes","files":35,"time":1301582552,"description":"Of course, this Public Enemy masterpiece was dissed by critics upon its initial release, which is a shame because it is one of the fiercest statements about life in America ever made. Chuck D, Flav and Terminator X are in brilliant form on every track---and the themes are PE's most mature yet. Racism, slavery, economic slavery, inner city crime, the war on drugs, corporate government control, poverty, guns, gangsta rap---you name it, PE attacks everything about our violent country and encourages ALL PEOPLE to get together. &quot;Give it Up&quot; is an incredibly groovy anthem that was a massive hit all over the world but was not played by corporate radio in our country, too controversial and uplifting to the masses, I suppose. &quot;What Side you On?&quot; encourages people to be good, peaceful and loving---instead of hateful, evil and spiteful---all to a massive, pulsing beat. &quot;So What You Gonna Do Now&quot; is one Of Chuck D's funkiest grooves, and the furious rapper attacks the gangsta rappers who glorify violence and guns in their songs. One of PE's best cuts. &quot;Ain'tnuttin Buttersong&quot; comments on the violent nature of the National Anthem with incredible clarity and conviction, and asks the listener if he or she is aware of the meaning of the song, which glorifies the use of guns and bombs going off to win a war. Haven't we suffered enough unnecessary deaths at the hands of worthless politicians who send our poor kids off to be massacred in wars for no reason? Chuck's question is a valid one; the song questions singing a song that celebrates killing, thus condemning war in general. All in all, Public Enemy's MUSE SICK-N-HOUR MESS AGE is as grand as any hip hop album ever made. If you listened to critics who initially brushed PE off as a has been, shame on you. Listen to it and decide for yourself. This album belongs in any music lover's collection. \n\nTrack Listings\n1. Whole Lotta Love Goin On In The Middle Of Hell\n2. Theatrical Parts\n3. Give It Up\n4. What Side You On?\n5. Bedlam 13:13\n6. Stop In The Name...\n7. What Kind Of Power We Got?\n8. So Whatcha Gone Do Now?\n9. White Heaven/Black Hell\n10. Race Against Time\n11. They Used To Call It Dope\n12. Aintnuttin Buttersong\n13. Live And Undrugged Pt. 1 &amp; 2\n14. Thin Line Between Law And Rape\n15. I Ain't Mad At All\n16. Death Of A Carjacka\n17. I Stand Accused\n18. Godd Complexx\n19. Hitler Day\n20. Harry Allen's Interactive Superhighway Phone Call to Chuck D\n21. Living In A Zoo Remix \n\nDownload and decide for yourself. Enjoy and please seed!!","torrent":{"xt":"urn:btih:29f0f960085c77f3d6190312758b10b315bf3cf8","amp;dn":"Public+Enemy+-+Muse+Sick-N-Hour+Mess+Age+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29f0f960085c77f3d6190312758b10b315bf3cf8","infoHashBuffer":{"type":"Buffer","data":[41,240,249,96,8,92,119,243,214,25,3,18,117,139,16,179,21,191,60,248]},"announce":[],"urlList":[]}}