{"title":"Hamlet Gonashvili_(1928 - 1985)_Georgian Traditional Songs.","uid":4987250,"size":415852882,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2a08ea8cbb2a06c76ba03ac4a99480cc9f7aeba9&amp;dn=Hamlet+Gonashvili_%281928+-+1985%29_Georgian+Traditional+Songs.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GioDorcel","files":-1,"time":1246807016,"description":"Covers :\n &lt;a href=&quot;\nhttp://bayimg.com/laFdEaACC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/laFdEaACC&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/laFdGaACc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/laFdGaACc&lt;/a&gt;\n\nHamlet Gonashvili Katselashvili (20 June 1928 - 1985) was a Georgian singer (tenor), influential teacher and performer of traditional Georgian music. He is sometimes referred to as &quot;the voice of Georgia&quot;.\n\nGonashvili was born in eastern Georgia, and is considered the best interpreter of songs from the Kartli and Kakheti regions. He was a recipient of many national honors and prizes. The Third Symphony of the Georgian composer Giya Kancheli drew inspiration from Gonashvili Katselashvili's singing and Gonashvili Katselashvili was the soloist in the first recording of the work. (1979, Olympia Records). At the height of his fame, he died in 1985 in a fall from an apple tree. Hamlet (JARO, 1985) is a collection of his most impressive songs.\n\nHAMLET GONASHVILI was considered the voice of Georgia. He was an outstanding soloist, influential teacher and brilliant performer of traditional Georgian music. Born in the Eastern part of the country, he was know to be the best interpreter of songs from the regions of Kartli and Kakheti. He played an important role in the world-famous Rustavi choir, the first choir in Georgia to include into its programme songs from all regions of the country. At the hight of his creative powers HAMLET GONASHVILI died in a tragic accident in 1985 falling off a tree while picking apples. He had been awarded his country's most important honours and prizes.\n\nAfter a year of research JARO has managed to discover missing tapes in Russia which document GONASHVILI's solo parts, in order to produce a collection of his most impressive songs.\n\nHistory of Georgian Music\n\nAn element of the rich and diverse culture of the Georgian people, the traditional songs of Georgia are a musical chronicle of the country's history. Despite the numerous incursions of foreign invaders - Arab, Mongolian, Turkish, Persian - Georgia has preserved its language, both oral and written, its architecture, its religion and a large number of unique songs and melodies.\n\nIn the course of its historical development, Georgia has come to have many lingual and musical dialects. The song types are named after the different regions and their musical dialects differ considerably from one another in rhythm, intonation, texture and harmony. Fundamentally, Georgian songs consist of three parts, although Gurian and Adzharian work songs sometimes consist of four. A particularly interesting form of Gurian and Adzharian song is the krimanchuli - a type of yodel, a melody of a figural nature. To this day unisonous singing has survived in Hevsureti, Tusheti and other mountainous areas. Monophonic singing is common in certain types of songs of the West and East of Georgia.\n\nDeveloped over the centuries, the traditions and styles of performance have been handed down from generation to generation by outstanding singers, many of whom founded their own schools and whose memory lives on in the minds of the Georgian people.\n\n\u0018: &quot;Tape-recordings of the georgian people's polyphonic songs represent important musical impressions. They are recorded in a tradition of active reprodution of georgian folk music, the origin of which begins in ancient times. It is a wonderful discovery and can give us much more than all the modern music can...&quot;\n","torrent":{"xt":"urn:btih:2a08ea8cbb2a06c76ba03ac4a99480cc9f7aeba9","amp;dn":"Hamlet+Gonashvili_%281928+-+1985%29_Georgian+Traditional+Songs.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a08ea8cbb2a06c76ba03ac4a99480cc9f7aeba9","infoHashBuffer":{"type":"Buffer","data":[42,8,234,140,187,42,6,199,107,160,58,196,169,148,128,204,159,122,235,169]},"announce":[],"urlList":[]}}