{"title":"What A Way To Go - Life At The End of Empire - 2011","uid":6251238,"size":417610899,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2a0ab3068dde1c247879852471ee0af48a3f4227&amp;dn=What+A+Way+To+Go+-+Life+At+The+End+of+Empire+-+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"c4ll7","files":3,"time":1300415032,"description":"This is a different sort of &quot;Peak Oil movie.&quot; Rather than just focusing on the approaching decline in oil production and its likely effects on our petroleum-powered modern lifestyles, What a Way To Go: Life at the End of Empire, presents that issue merely as a symptom of a larger problem---modern society as empire. For those who thought the 20th century finally saw an end to empires, think again. The emperors only changed clothes, got new job titles, and swapped in &quot;predatory economics&quot; for slavery and overt domination. It's a Matrix-like nightmare that seems normal to us, even with all its chaos.\n\nThe film surveys the litany of collateral damage due to our entrapment in the empire:\n\n- Environmental degradation, including the approaching disaster known as global climate change.\n\n- Species facing a new mass extinction event---this one caused not by killer asteroids but by the march of &quot;human progress&quot;.\n\n- Dissociation from the details of how life's basic commodities (such as energy, water, and food) are provided to us.\n\n- Our general ignorance of the technological wonders that we depend on.\n\n- The dominant use of violence (war) as a means of overcoming obstacles and expanding influence.\n\n- Our Ponzi-inspired, never-ending-growth economic model, which logically must fail at some point.\n\nThese are all symptoms of a planet and people in serious trouble. We've been encouraged to live beyond our economic, natural, and spiritual means, and we've done quite a job of it. The film lays out the bleak truth for us in a surprisingly watchable package, nicely incorporating narration, interview clips, and strangely cool archival material. Elegant and almost poetic in tone, What a Way To Go gently takes us by the hand as it explains to us the harsh reality of how things really are, where they're likely to go, and how difficult the challenge is.\n\nIn the end, What a Way To Go leaves us with a choice: As the reach of The Powers That Be exceeds their grasp and things really begin to come unglued, will we citizens of empire shrug our shoulders and party on as the marble columns fall around us, or will we shake off the illusion and being to re-take control of what was ours to begin with?","torrent":{"xt":"urn:btih:2a0ab3068dde1c247879852471ee0af48a3f4227","amp;dn":"What+A+Way+To+Go+-+Life+At+The+End+of+Empire+-+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a0ab3068dde1c247879852471ee0af48a3f4227","infoHashBuffer":{"type":"Buffer","data":[42,10,179,6,141,222,28,36,120,121,133,36,113,238,10,244,138,63,66,39]},"announce":[],"urlList":[]}}