{"title":"BANDERAS - Ripe (This Is Your Life) [1991, 320 kbps]","uid":5099812,"size":365047558,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2a406ec35af6b7ce5ce3a29b3832c2797521ce34&amp;dn=BANDERAS+-+Ripe+%28This+Is+Your+Life%29+%5B1991%2C+320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"musicalibera","files":46,"time":1253884577,"description":"BANDERAS - Ripe (1991)\n\nCodec: mp3.\nDescription: MPEG-1 Audio Layer 3.\nBit rate: 320 kbps.\nSample rate: 44100 Hz joint stereo.\nTags: ID3V1 &amp; ID3V2.\nSource format: CD (AAD).\nNumber of tracks 28.\nOriginal label: London Records (out of print).\n\n\nAllmusic.com review:\n&quot;The 1991 debut release by the British duo Banderas has a rather misleading cover image, that of two oddly-dressed women sporting Sinead O'Connor-style crew cuts with the band's Spanish-sounding name sprawled across the top of the picture. Perhaps Ripe's failure was due to consumer confusion; is Banderas a Spanish-language punk band, or a bizarre Sinead side project? One listen to the album, however, reveals neither is true. Banderas is actually an ace pop band, and its one and only album, Ripe, is addictive ear candy. The two members (vocalist Caroline Buckley and violinist/keyboardist Sally Herbert) receive ample assistance from producer extraordinaire Stephen Hague, but the album's real star is Buckley, who sings with confidence and clarity. Her voice soars on the funky, beautifully produced album opener &quot;This Is Your Life&quot; and the eerie &quot;May This Be Your Last Sorrow.&quot; While Ripe's remanding eight tunes don't quite scale the same heights, Caroline Buckley's extraordinary pipes save the material from sinking into mediocrity. A few lackluster songs drag down the album, but this was a promising debut, and Banderas boasted an incredible vocalist in Caroline Buckley. But even with guest appearances from some of the biggest names in British pop (including Jimmy Somerville, guitarist Johnny Marr, and New Order's Bernard Sumner), the album didn't perform well in Europe and sank like a stone in the States, and they never released a second album. Ripe will almost certainly never be widely heard, and Banderas is forever shunned into pop obscurity. It's a shame this talented act never saw the success it deserved.&quot;\n\nThe Isle of Deserted Pop Stars review:\n&quot;Banderas was a British duo comprised of vocalist Caroline Buckley and violinist/musician Sally Herbert. They formed after working with Jimmy Sommerville's group the Communards. Their one and only album was produced by American Stephen Hague, who had had huge success producing British synth bands like OMD, Pet Shop Boys, New Order and Erasure, among many others. The sound was very much in the vein of those - danceable, sometimes funky synth-pop, with some trip-hoppy slower numbers. The real difference is Caroline's vocals, which are both ethereal and soulful, and the lyrics, which are very positive and uplifting. The first single &quot;This Is Your Life&quot; was a top 20 pop hit in the UK, Ireland, Sweden, Denmark, France, The Netherlands, Germany, Switzerland, Austria, Italy and several other European countries and a top 40 dance hit in the US. The follow-up singles &quot;She Sells&quot; and &quot;May This Be Your Last Sorrow&quot; did not fare nearly as well, and though the album made the British top 40, the duo was largely ignored. It's likely that their image, that of two older, shaven headed and very androgynous women, was not what the audience associated with or wanted from female dance artists at the time, the majority of which were very young and sexualized. The two continued to work with Somerville, and Sally Herbert has appeared on several albums since, both playing violin and doing string arrangements. Singer Caroline Buckley has kept a lower profile. According to one site, Sally is working with Caroline on writing some new songs, so who knows, we may hear more from them still. For now, download this lovely album.&quot;\n\nUploader's comment: \nI waited all through 1992. And '93. And '94. I waited five years. I waited ten. Fifteen. In fact, I'm still waiting and hoping for a follow-up to this wonderful album. 'Ripe' as a whole and &quot;May This Be Your Last Sorrow&quot;, &quot;It's Written All Over My Face&quot;, &quot;The Comfort of Faith&quot; and &quot;Why Aren't You In Love With Me?&quot; in particular are a significant part of the soundtrack to my life. The hit single 'This Is Your Life' still stands as one of the most beautiful pop songs ever written because it hits that rare balance between euphoric dance anthem and pensive melancholy (&quot;Where is the purpose in your life? Where is the truth? Do you remember your hopes, your dreams?&quot;) and because of the matter-of-fact way in which the lyrics summarise the very facts of life - in a mere four minutes: &quot;This is not a story. This is not a book. This is your life. And this is not a play, or some TV show you've seen. This is real life. There is no rehearsal, no second chance, no false start, no better circumstance. This is your life.....&quot; Pure pop at its very best in other words.\n\nEnjoy!\n \nPS. To my great surprise and delight this hidden/forgotten gem has apparently been discovered by a whole new generation. &quot;This Is Your Life&quot; was recently remixed by Jon Dixon &amp; Andy Wetson of British House/Club/Electro act 7th Heaven. There's hope still....\n\n\n\nTRACK LIST\n==========\n01. &quot;This Is Your Life&quot; - 4:37 \n02. &quot;The Comfort Of Faith&quot; - 4:17\n03. &quot;May This Be Your Last Sorrow&quot;  - 5:00 \n04. &quot;First Hand&quot; - 5:00 \n05. &quot;Why Aren't You In Love With Me?&quot; - 4:50 \n06. &quot;She Sells&quot; - 4:03 \n07. &quot;Too Good&quot; - 4:59\n08. &quot;Don't Let That Man&quot; - 4:17\n09. &quot;It's Written All Over My Face&quot; - 4:20 \n10. &quot;Never Too Late&quot; - 5:03\n\n+\n\n11. &quot;Bide Your Time&quot; (Non-album track, 1991)\n12. &quot;Nice to Know&quot; (Non-album track, 1991)\n13. &quot;This Is Your Life&quot; (7 Inch Mix, 1991)\n14. &quot;This Is Your Life&quot; (Less Stress 12 Inch Mix, 1991)\n15. &quot;She Sells&quot; (7 Inch Mix, 1991)\n16. &quot;She Sells&quot; (Alternative 7 Inch Mix, 1991)\n17. &quot;She Sells&quot; (Apollo 440 Mix, 1991)\n18. &quot;May This Be Your Last Sorrow&quot; (7 Inch Mix, 1991)\n19. &quot;May This Be Your Last Sorrow&quot; (Less Stress 12 Inch Mix, 1991)\n20. &quot;May This Be Your Last Sorrow&quot; (Smith &amp; Mighty - The Original Plan Mix, 1991)\n21. &quot;This Is Your Life&quot; (7th Heaven feat. Banderas - 7th Heaven Radio Edit, 2009)\n22. &quot;This Is Your Life&quot; (7th Heaven feat. Banderas - 7th Heaven Club Mix, 2009)\n23. &quot;This Is Your Life&quot; (7th Heaven feat. Banderas - Chriss Ortega's Classic Mix, 2009)\n24. &quot;This Is Your Life&quot; (7th Heaven feat. Banderas - Nicola Fasano &amp; Steve Forest Mix, 2009)\n25. &quot;This Is Your Life&quot; (7th Heaven feat. Banderas - Fish &amp; Chips Mix, 2009)\n26. &quot;This Is Your Life&quot; (7th Heaven feat. Banderas - Lissat &amp; Voltaxx Mix, 2009)\n27. &quot;This Is Your Life&quot; (7th Heaven feat. Banderas - Club Junkies Mix, 2009)\n28. &quot;This Is Your Life&quot; (7th Heaven feat. Banderas - Accapella, 2009)\n\n\n\nCredits 'Ripe':\n================\n* Arranged By [Strings], Programmed By, Violin (trks 1-12), Producer (trk: 9) - Sally Herbert \n* Backing Vocals - Stevie Lange (tracks: 4 to 6, 8) \n* Bass - Guy Pratt (tracks: 2, 5, 7, 8) \n* Drums - Simon Bishop (tracks: 2, 5 to 8) \n* Engineer (tracks: 1, 3, 9), Producer (track: 9)- Mike Dignam  \n* Engineer - Tim Weidner (tracks: 2, 4 to 8, 10) \n* Guitar - Gary Butcher (tracks: 4, 5, 8) \n* Producer - Stephen Hague (tracks: 1 to 8, 10) \n* Programmed By - Chuck Norman (tracks: 1 to 9) \n* Vocals (trks: 1-12), Producer (trk: 12)  - Caroline Buckley \n* Backing Vocals, Guitar - Bernard Sumner  (track: 1)\n* Engineer - Mike &quot;Spike&quot; Drake  (track: 1)\n* Guitar - Johnny Marr  (track: 1)\n* Arranged By [Additional] - Less Stress  (track: 3)\n* Engineer - Mike &quot;Spike&quot; Drake (track: 3)\n* Percussion - Luis Jardim  (tracks: 3, 7)\n* Bass - Dave Pollitt (track: 4)\n* Keyboards - Andy Northfield (track: 4)\n* Backing Vocals - Jimmy Somerville (track: 5)\n* Cello - Audrey Riley (track: 5) \n* Viola - Jocelyn Pook (track: 5)\n* Violin - Sonia Slany (track: 5)\n* Trombone - Adrian Lane (track: 8) \n* Trumpet - Simon Elms (track: 8) \n* Guitar - Keith Michael Osborne (track: 9)\n* Producer - Alan Moulder (track: 11)\n* Producer - Barry Sage (track: 12)\n\n","torrent":{"xt":"urn:btih:2a406ec35af6b7ce5ce3a29b3832c2797521ce34","amp;dn":"BANDERAS+-+Ripe+%28This+Is+Your+Life%29+%5B1991%2C+320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a406ec35af6b7ce5ce3a29b3832c2797521ce34","infoHashBuffer":{"type":"Buffer","data":[42,64,110,195,90,246,183,206,92,227,162,155,56,50,194,121,117,33,206,52]},"announce":[],"urlList":[]}}