{"title":"The Suffering : Ties that Bind - Pal Multi 3","uid":5005716,"size":2388878122,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:2a70c1e23e115c14e8e1c953e13aefbd9daa6951&amp;dn=The+Suffering+%3A+Ties+that+Bind+-+Pal+Multi+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"macf81","files":48,"time":1247722580,"description":"Gameplay\n\nTies That Bind features a number of gameplay changes from the original The Suffering. The player can no longer carry around xombium bottles to refill their health whenever they need to, and instead must rely on stationary pickups located throughout the level. When critically injured, the player may also heal a very small percentage of their health by hiding from the immediate battle to recover. The player is also now limited to only carrying two weapons at a time, which now adds a sense of strategy to the gameplay.\n\nStory\n\nThe game begins by revisiting Torque's stay in the Eastern Baltimore Correctional prison five years prior to the events of the first game, in which he and Miles are confronted by Blackmore, the man who orchestrated the events leading to their imprisonment, and several of his cohorts. As Torque and Miles are about to be attacked, a prison riot ensues, which leads Torque to discover that many of the creatures he encounters on Carnate five years later are attacking here as well.\n\nFive years afterward in the present day, Torque escapes Carnate Island, the site of his imprisonment, and attempts to return to his home city of Baltimore, only to be captured by a mysterious paramilitary organization known as the Foundation. The apparent leader of the Foundation is a woman named Jordan, who wants to study Torque and his connection to the malefactors, the creatures that appeared when he was sent to Carnate. Torque manages to escape from his captors and is prompted by the ghost of his dead wife Carmen to return to his apartment and investigate the death of his family, where he learns that a powerful crime lord by the name of Blackmore (for whom Torque worked) is ultimately responsible for their deaths. Much to his shock, however, it seems that the horrible Malefactors that had brought Carnate to ruin followed him to the mainland to continue their spree of murder and chaos, feeding upon the dark and ancient history of the city to grow strong. Torque makes his way through the city under the questionable guidance of Dr. Killjoy, who wants to help Torque understand his mental state and his past.\n\nAt the very end of the game it is discovered that Blackmore is actually one of Torque's alternate personalities, which surfaced when he was a child living in an orphanage called The Garvey Children's Home because of violent acts upon him (as learned from the &quot;archives&quot;). There are three possible endings depending on the morality of the player at the end of the game: Torque is completely overcome by Blackmore, who takes total control of Torque's personality (Evil); Torque and Blackmore are unable to overpower each other and remain in their current state of opposition (Neutral); Torque eliminates Blackmore's presence from his mind once and for all (Good).\n\nThe player's morality also affects certain sequences during gameplay and a level near the end of the game, where Dr. Killjoy, the slavehunter Copperfield, and the vile killer pimp Creeper forge a tribunal and look back on Torque's actions, and also decides whether the player will face Copperfield or the Creeper in the sub-boss battle.","torrent":{"xt":"urn:btih:2a70c1e23e115c14e8e1c953e13aefbd9daa6951","amp;dn":"The+Suffering+%3A+Ties+that+Bind+-+Pal+Multi+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a70c1e23e115c14e8e1c953e13aefbd9daa6951","infoHashBuffer":{"type":"Buffer","data":[42,112,193,226,62,17,92,20,232,225,201,83,225,58,239,189,157,170,105,81]},"announce":[],"urlList":[]}}