{"title":"How To Analyze People On Sight","uid":6292386,"size":1330494,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2bb90f04bf841ca8436f95f85d40fe42ba435c16&amp;dn=How+To+Analyze+People+On+Sight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"stantech","files":1,"time":1301866867,"description":"How to Analyze People on Sight\n\n\n\nPublisher: CreateSpace \nElsie Lincoln Benedict , Ralph Paine Benedict\nEnglish\n2010 \nPDF \n192 pages \nISBN: 1453756248 \n1.52 MB\n\nWhat Newspapers Have Said About Elsie Benedict and Her Work &quot;Over fifty thousand people heard Elsie Lincoln Benedict at the City Auditorium during her six weeks lecture engagement in Milwaukee.&quot;-Milwaukee Leader, April 2, 1921. &quot;Elsie Lincoln Benedict has a brilliant record. She is like a fresh breath of Colorado ozone. Her ideas are as stimulating as the health-giving breezes of the Rockies.&quot;-New York Evening Mail, April 16, 1914. &quot;Several hundred people were turned away from the Masonic Temple last night where Elsie Lincoln Benedict, famous human analyst, spoke on 'How to Analyze People on Sight.' \n\nAsked how she could draw and hold a crowd of 3,000 for a lecture, she said: 'Because I talk on the one subject on earth in which every individual is most interested-himself.'&quot;-Seattle Times, June 2, 1920. &quot;Elsie Lincoln Benedict is a woman who has studied deeply under genuine scientists and is demonstrating to thousands at the Auditorium each evening that she knows the connection between an individual's external characteristics and his inner traits.&quot;-Minneapolis News, November 7, 1920. &quot;Elsie Lincoln Benedict is known nationally, having conducted lecture courses in many of the large Eastern cities. Her work is based upon the practical methods of modern science as worked out in the world's leading laboratories where exhaustive tests are applied to determine individual types, talents, vocational bents and possibilities.&quot;-San Francisco Bulletin, January 25, 1919................\n\n\n","torrent":{"xt":"urn:btih:2bb90f04bf841ca8436f95f85d40fe42ba435c16","amp;dn":"How+To+Analyze+People+On+Sight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bb90f04bf841ca8436f95f85d40fe42ba435c16","infoHashBuffer":{"type":"Buffer","data":[43,185,15,4,191,132,28,168,67,111,149,248,93,64,254,66,186,67,92,22]},"announce":[],"urlList":[]}}