{"title":"Mek","uid":5072493,"size":21160975,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2c5b579581f038b02fdb6308da33cc9f24579dd2&amp;dn=Mek&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1251537137,"description":"Mek is set in the near future, when the old fashioned styles of body modification have become passe. The newest fad, &quot;MEK&quot; (short for Massive Enhancement Culture), involves adding cybernetic implants, such as cell phones implanted directly into the skull. The founder of the MEK movement is Sarissa Leon, who has become a celebrity of the new fad. She returns to Sky Road, the place where MEK first took off, after learning of the murder of her former lover and fellow MEK pioneer R.J. Coins. Leon discovers that Sky Road is now the center of &quot;bad MEK&quot;, which involves implanting black market weapons and stolen military technology. Leon attempts to find Coins' murderer, while trying to clean up Sky Road.\n\nWritten by Warren Ellis, pencilled by Steve Rolston and inked by Al Gordon.\n\nWhen interviewed about Mek, Warren Ellis explained that he felt that mechanical augmentation was &quot;already happening&quot;, quoting Stelarc and the work of Kevin Warwick as examples. In the same interview, he stated his opinion that &quot;What is art and experiment today will be high-end consumer goods in ten years, and cheap enough to be street goods in twenty years&quot; and that &quot;William Gibson said it smartest: the street finds its own use for things. And what is experimental, medical or military eventually finds its way down there.&quot;\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:2c5b579581f038b02fdb6308da33cc9f24579dd2","amp;dn":"Mek","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c5b579581f038b02fdb6308da33cc9f24579dd2","infoHashBuffer":{"type":"Buffer","data":[44,91,87,149,129,240,56,176,47,219,99,8,218,51,204,159,36,87,157,210]},"announce":[],"urlList":[]}}