{"title":"Crash.&amp;.Burn.S01E02.Trust.WS.XviD-err0001.avi","uid":5184316,"size":366952448,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2c7ad34dcf81971230aa1eed6653d67434df5417&amp;dn=Crash.%26.Burn.S01E02.Trust.WS.XviD-err0001.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"err0001","files":1,"time":1259401729,"description":"Crash &amp; Burn S01E02: Trust\n\nBad luck follows good when a hole-in-one celebration ends in a multi-cart explosion. Worse still, the guy held two million in life insurance that Jimmy Burn must settle. But a quick dig into the rich guy's previous insurance claims unearths one secret after another. The past haunts us all, especially Jimmy Burn.\n\nThe series airs on Showcase Canada.\n\nThe resolution is 608x352 and while the quality is not as good as a scene release due to my capture and encoding methods it is quite watchable in my opinion.\n\n\nSeries Info: Described as a cross between The Office and The Sopranos by the show's creator, Malcolm MacRury (ZOS: Zone of Separation, Deadwood), Cra$h &amp; Burn follows Jimmy Burn, a young claims adjuster for a cut-throat, bottom-line insurance corporation. Jimmy maneuvers his way around insurance scams and the criminal underworld as he tries to escape his past and make a better life on the gritty post-industrial streets of Hamilton.\n\nCra$h &amp; Burn stars Luke Kirby (Tell Me You Love Me, Slings and Arrows) as Jimmy Burn, the cocky yet charming up-and-comer looking to claim a piece of the corporate pie as an insurance adjuster. Casting also features Leela Savasta (Battlestar Galactica, Intelligence) as Lucia Silva, Jimmy's live-in girlfriend; Caroline Cave (The L Word, This Beautiful City) as Catherine Scott, a shrewd yet practical in-house insurance lawyer; Clark Johnson (The Wire, Homicide: Life on the Street, also an Emmy-nominated director on The Shield) as Walker Hearn, a veteran insurance investigator and Steve Bacic (The Guard, Andromeda) as Korkov, a conman and Mafioso hustling to scam the system.\n","torrent":{"xt":"urn:btih:2c7ad34dcf81971230aa1eed6653d67434df5417","amp;dn":"Crash.%26.Burn.S01E02.Trust.WS.XviD-err0001.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c7ad34dcf81971230aa1eed6653d67434df5417","infoHashBuffer":{"type":"Buffer","data":[44,122,211,77,207,129,151,18,48,170,30,237,102,83,214,116,52,223,84,23]},"announce":[],"urlList":[]}}