{"title":"Jeppesen Jepview v3.5 Program Disk","uid":5069076,"size":579115008,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2d033a99fb2a542a268944a3f2da9919b28f8782&amp;dn=Jeppesen+Jepview+v3.5+Program+Disk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"FSallATP","files":1,"time":1251240370,"description":"This Jeppesen Jeppview 3, is an old, tested, virus free program, which provides\ntopo-aeronautical charts for more than 8000 airports worldwide and the whole\nairway structure around the earth. It includes also all available and working\nradio nav aids, again, worldwide ! Finally provides for GPS navigation !\n\nIt is updated every two weeks by means of 2 CDs and is an essential tool\nfor an aviator, GIS or GPS enthusiast, Flight Sim enthusiast and more !\n\nTo make full use of it you must also download and install CD-1 Navdata and\nCD-2 Text pages (found elsewhere in this site). \n\n\nIt runs under 32-bit XP, Vista, win 7 and needs also acrobat reader installed.\nyou can burn the CDs or just mount on Daemon tools, Magiciso etc.\nFor Vista or win 7, i prefer as more stable approach to use a virtual machine\n(vmware - v6 also found in this site - and run it under XP sp2 or sp3). \n\n\nTo install, avoiding current security tech from Boeing - Jeppesen you must follow\nto the letter these instructions:\n\n 1.Disconnect Internet\n 2.Set computer clock for Jan 10, 2009\n 3.select both Jeppview and Flitedeck programs\n 4.use as name : PILOTS\n 5.use serial  : VNX1-IBYH-E5K1-7G8F ( this will give you Full Worldwide access )\n\nnow you need the other two CDs.\nyou MUST get version 01/2009\n\ninstall CD1 using following 2 serials:\n\nfor VFR Europe : 217AN22318\nfor Full Worldwide : 217AN22319\n\ninstall CD2 (no serial here...)\n\n 6.Do not reboot\n 7.Run Jeppview or Flitedeck\n 8.Program prompts for 30-day free use or Activation\n 9.press NEXT\n10.Select &quot;by phone&quot; option and press NEXT\n11.use the code R00D-KCAB (r-zero-zero-d) not ROOD (r-o-o-d)  !!!!\n\n12. set now the current date on computer clock !!!\n\nyou are good to go now... however this info is good till as of Jan 2009.\n\nto make it current you can browse this site and download the current CD1, CD2.\ninstructions and serial nbrs / codes usually included, but still there is a lot\nof information in relevant torrents in the comments section.\n\n\nwith a cheap 20-bucks usb gps receiver supporting NMEA 0183 protocol,\nyou can explore the full potential of these programs, specially Flitedeck installed\non a laptop. Beats the Garmin and the other big tyranos. I use a Swiss made Navilock\nwith excellent results using local VFR or IFR charts for background, moving map and all, \nday or night !!\n\nHappy trips to all !\n\n\nUPDATE 08 Jan 2010  ---------  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n\nmost of your questions are already answered in this or similar posts (try search with jepp*) in this site.\nthe new info is cause Jeppesen has upgraded security, for new installation, change first your computer clock to 31-12-2008 and use cycle 01 of 2009 so the R00D-KCAB can be validated without problems (validation code through phone) then run the program so it will alter the registry settings. Then close the program, change time and reboot. Now you can use any of the recent codes, 25 or 26 of 2009, 01 of 2010 etc. without problems ! \n\n!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n","torrent":{"xt":"urn:btih:2d033a99fb2a542a268944a3f2da9919b28f8782","amp;dn":"Jeppesen+Jepview+v3.5+Program+Disk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d033a99fb2a542a268944a3f2da9919b28f8782","infoHashBuffer":{"type":"Buffer","data":[45,3,58,153,251,42,84,42,38,137,68,163,242,218,153,25,178,143,135,130]},"announce":[],"urlList":[]}}