{"title":"Routes - Routes","uid":5056430,"size":82742392,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2ea4e6e533dc688f7e10e16104a3b3394b072ce3&amp;dn=Routes+-+Routes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Baphom3t","files":11,"time":1250446627,"description":"Routes were formed in 2001 in Chalkida. The founding members were James and Antonis. After some time of jamming with guitars and vocals they found Theodosis who was willing to fill in the drum sit. Almost a year after that, George joined the band to play the bass... \nInspired by bands like Motorhead, SOAD, Slipknot and Sepultura, Routes had a very specific vision about the type of music they wanted to play. After a period of intense rehearsals they recorded their first self-financed demo back in 2003. After the demo was released the band gave two shows, one in Odeio Fakana, in Athens and another one in Onoma tou Rodou one year later, in 2004.\n\n2005 found the band more mature and with different influences, such as Kyuss, Fu Manchu, Honcho, Monster Magnet, Saint Vitus etc. The band decided to release their 2nd self-financed demo which this time, had a heavy-stoner rock character. The release was followed by a concert in Rodeo Live Club in Athens.\n \nAfter a period full of creativity and song writting Routes started giving noumerous live shows to promote their music. It was in one of these live gigs where they were noticed and approached by Trailblazer Records, something that led to the release of a 2 track promo in January 2008 and the release of their debut album set somewhere in March 2008. \nRoutes are a very active and creative band that offers extra groovy and heavy live performances with huge amounts of respect and love for what we call stoner rock.\n \n\nCurrent line-up \nAntonis - Guitar, Vocals\nJames - Guitar\nTheodosis - Drums\nGeorge - Bass \n\nGenre = Stoner Metal\nFormat = Mp3\nBit Rate = 192 kbps\n\nTrack Listing\n1. Scum   \n2. Orange Backyard   \n3. Alien   \n4. Burnt Alone   \n5. Fly   \n6. Happy Death   \n7. Everytime of the Day   \n8. Gringo   \n9. Space Blue ","torrent":{"xt":"urn:btih:2ea4e6e533dc688f7e10e16104a3b3394b072ce3","amp;dn":"Routes+-+Routes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ea4e6e533dc688f7e10e16104a3b3394b072ce3","infoHashBuffer":{"type":"Buffer","data":[46,164,230,229,51,220,104,143,126,16,225,97,4,163,179,57,75,7,44,227]},"announce":[],"urlList":[]}}