{"title":"Shoah [1/6] Caccia all uomo [TVRip Ita] [Tntvillage]","uid":5002773,"size":633172714,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2f93c2ff17a1f6a10f84c65c011be029e3e34ad8&amp;dn=Shoah+%5B1%2F6%5D+Caccia+all+uomo+%5BTVRip+Ita%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"darayava","files":1,"time":1247592962,"description":"Visit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=La%20storia%20siamo%20noi%20-%20Shoah%20-%20Parte%201%20di%206&amp;sb=1&amp;sd=0&amp;cat=0\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=Triccotracco&amp;sb=1&amp;sd=0&amp;cat=0\n\n\n\n Visit this link: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=111976[/url]\n\n\nShoah (1/6)\n\nCaccia all'uomo\n\ndi\nMaurice Philip Remy\n\nLa storia siamo noi\n\n Visit this link: http://img8.Imageshack.us/img8/9254/auschwitzvistaaerea2qy2.jpg\nVista aerea del campo di concentramento di Auschwitz\n\n Visit this link: http://img15.Imageshack.us/img15/307/birkenau202ja2.jpg\nCampo di concentramento di Birkenau\n\n Visit this link: http://img365.Imageshack.us/img365/8469/ingressomauthausenbr9.jpg\nCampo di concentramento di Mauthausen\n\n by Tricco \n\n - Scheda del documentario - \n\nIl termine Shoah ÃƒÂ¨ voluto dagli ebrei, i quali, attualmente, rifiutano l'altra parola stilizzata, Olocausto, in quanto questo indica un sacrificio propiziatorio, il che ÃƒÂ¨ sicuramente ingannevole.\nL'espressione Shoah si riferisce al periodo che intercorre fra il 30 Gennaio 1933, quando Hitler divenne Cancelliere della Germania, e l'8 Maggio 1945, la fine della guerra in Europa: in questo periodo furono milioni le persone soppresse dalla follia razziale nei confronti non solo degli ebrei . Pur essendo impossibile accertare l'esatto numero di vittime ebree, le statistiche indicano che il totale fu di oltre 5.860.000 persone. La maggior parte delle autoritÃƒÂ  generalmente accettano la cifra approssimativa di sei milioni a cui si devono sommare 5 milioni circa di civili non ebrei uccisi. In tutto quindi, ma la cifra precisa ha ben poca importanza, oltre 10 milioni di persone furono uccise dall'odio nazionalsocialista.\nTra i gruppi assassinati e perseguitati dai nazisti e dai loro collaboratori, vi erano: zingari, serbi, membri dell'intellighentia polacca, oppositori della resistenza di tutte le nazionalitÃƒÂ , tedeschi oppositori del nazismo, omosessuali, testimoni di Geova, delinquenti abituali, o persone definite &quot;anti sociali&quot;, come, ad esempio, mendicanti, vagabondi e venditori ambulanti. La maggior parte delle persone soppresse passarono per i campi di sterminio, che erano campi di concentramento con attrezzature speciali progettate per uccidere in forma sistematica. Storicamente il partito nazista prese la decisone di dare avvio alla cosiddetta &quot;Soluzione Finale&quot; (Endl sung), in realtÃƒÂ  molti ebrei erano giÃƒÂ  morti a causa delle misure discriminatorie adottate contro di loro durante i primi anni del Terzo Reich, ma lo sterminio sistematico e scientifico degli ebrei non ebbe inizio fino all'invasione, da parte della Germania, dell'Unione Sovietica nel Giugno 1941. Per i nazisti ebreo era: chiunque, con tre o due nonni ebrei, appartenesse alla ComunitÃƒÂ  Ebraica al 15 Settembre 1935, o vi si fosse iscritto successivamente; chiunque fosse sposato con un ebreo o un'ebrea al 15 settembre 1935 o successivamente a questa data; chiunque discendesse da un matrimonio o da una relazione extraconiugale con un ebreo al o dopo il 15 settembre 1935. Vi erano poi coloro che non venivano classificati come ebrei, ma che avevano una parte di sangue ebreo e venivano classificati come Mischlinge (ibridi). I Mischlinge venivano ufficialmente esclusi dal Partito Nazista e da tutte le organizzazioni del Partito (per esempio SA, SS, etc.). BenchÃƒÂ© venissero arruolati nell'esercito tedesco, non potevano conseguire il grado di ufficiali. Era inoltre proibito loro di far parte dell'Amministrazione Pubblica e svolgere determinate professioni (alcuni Mischlinge erano, in ogni caso, esonerati in determinate circostanze). Gli ufficiali nazisti presero in considerazione la possibilitÃƒÂ  di sterilizzare i Mischlinge, ma ciÃƒÂ² non fu sempre attuato. Durante la Seconda Guerra Mondiale, i Mischlinge di primo grado rinchiusi nei campi di concentramento, furono tradotti nei campi di sterminio. Ma il Terzo Reich considerava nemici non solo gli ebrei, ma anche, zingari, oppositori politici, oppositori del nazismo, Testimoni di Geova, criminali abituali, e &quot;anti-sociali&quot; In sostanza ogni individuo che poteva essere considerato una minaccia per il nazismo correva il rischio di essere perseguitato, ma gli ebrei erano l'unico gruppo destinato ad un totale e sistematico annientamento. Per sottrarsi alla sentenza di morte imposta dai Nazisti, gli ebrei potevano solamente abbandonare l'Europa occupata dai tedeschi. Secondo il piano Nazista, ogni singolo ebreo doveva essere ucciso. Nel caso di altri &quot;criminali&quot; o nemici del Terzo Reich, le loro famiglie non venivano coinvolte. Di conseguenza, se una persona veniva eliminata o inviata in un campo di concentramento, non necessariamente tutti i membri della sua famiglia subivano la stessa sorte. Gli ebrei, al contrario, venivano perseguitati in virtÃƒÂ¹ della loro origine familiare indelebile. La spiegazione dell'odio implacabile dei nazisti contro gli ebrei nasceva dalla loro distorta visione del mondo che considerava la storia come una lotta razziale. Essi consideravano gli ebrei una razza che aveva lo scopo di dominare il mondo e, quindi, rappresentava un ostacolo per il dominio ariano. Secondo la loro opinione, la storia consisteva, quindi in uno scontro che sarebbe culminato con il trionfo della razza ariana, quella superiore: di conseguenza, essi consideravano un loro preciso obbligo morale eliminare gli ebrei, dai quali si sentivano minacciati. Inoltre, ai loro occhi, l'origine razziale degli ebrei li identificava come i delinquenti abituali, irrimediabilmente corrotti e considerati inferiori, la cui riabilitazione era ritenuta impossibile.\n\n\n\n - Scheda tecnica - \n\n[ Info sul file ]\nNome: La storia siamo noi - Shoah - Parte 1 - by Tricco [720x480 x264 AAC].mkv\nData: 2/02/2009 06:30:03\nDimensione: 633,172,714 bytes (603.841 MB)\n\n[ Dati rilevanti ]\nRisoluzione: 720 x 480\nLarghezza: multipla di 16\nAltezza: multipla di 32\n\n[ Traccia video ]\nCodec ID: V_MPEG4/ISO/AVC\nRisoluzione: 720 x 480\nFrame aspect ratio: 3:2 = 1.5\nPixel aspect ratio: 1:1 = 1\nDisplay aspect ratio: 3:2 = 1.5\nFramerate: 25 fps\n\n[ Traccia audio ]\nCodec ID: A_AAC (AAC Low complexity)\nCanali (contenitore): 2\nFrequenza: 24000 Hz\nFrequenza di output: 48000 Hz\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:2f93c2ff17a1f6a10f84c65c011be029e3e34ad8","amp;dn":"Shoah+%5B1%2F6%5D+Caccia+all+uomo+%5BTVRip+Ita%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f93c2ff17a1f6a10f84c65c011be029e3e34ad8","infoHashBuffer":{"type":"Buffer","data":[47,147,194,255,23,161,246,161,15,132,198,92,1,27,224,41,227,227,74,216]},"announce":[],"urlList":[]}}