{"title":"Two and a Half Men, TVSeries, S06E21-24, NL Subs, DMT","uid":6203533,"size":995857030,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2fc8774355f2f60ed7ceb6ebfd7432bb93ce05fd&amp;dn=Two+and+a+Half+Men%2C+TVSeries%2C+S06E21-24%2C+NL+Subs%2C+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MeMar","files":-1,"time":1298709318,"description":"Two and a Half Men, TVSeries (divx), S06E21-24, NL Subs, DMT\n\nVerenigde Staten\nCategorie: Beeld\nFormaat: DivX\nOndertitels (ingebakken): Nederlands\nGenre: Sitcom\nBron: Retail\nDuur: ongeveer 20 minuten per aflevering\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0369179/episodes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0369179/episodes&lt;/a&gt; &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&lt;/a&gt;\n\nDe hoofdrollen worden vertolkt door Charlie Sheen, Jon Cryer en Angus T. Jones.\n\nHet begint met een man alleen (Alan gaat scheiden... alweer) en eindigt met een glimmende steen \n(de diamant die Evelyns nieuwe vriend aan de derde vinger van haar linkerhand wil schuiven). In de \ntussentijd is het hippe strandhuis van Charlie Harper in Malibu de perfecte plek voor grappen, mooie \nmeisjes, een eenoudergezin, beroemde buren, familie en nog meer grappen. Charlie (Charlie Sheen) \nkomt dicht in de buurt bij zijn al lang overleden vader. Alan (Jon Cryer) begint met online dating \nnadat hij zijn cv een beetje heeft opgeleukt. Jake (Angus T. Jones) vervangt zijn Harry Potter-posters \ndoor plaatjes van mooie meiden.\n\nAflevering 21: Above Exalted Cyclops\nWanneer Alan geobsedeerd raakt door modelbouwwagentjes, acht Chelsea de tijd rijp om hem te koppelen aan ÃƒÂ©ÃƒÂ©n van \nhaar vriendinnen. Dat blijkt niemand minder dan Rose te zijn, Charlie's stalkster. Zij heeft zich een weg gebaand in\n Chelsea's vriendenkring om Charlie nauwlettend in de gaten te houden. Maar tot hun verbazing beleven ze een \ngeweldige avond en lijkt het echt te klikken...tot Alan zijn fout inziet\n\nAflevering 22: Sir Lancelot's Litter Box\nChelsea en Charlie raken verwikkeld in een fikse ruzie, wanneer zij hem voorstelt om bij haar in te trekken. \nCharlie mag dan wel verloofd zijn met haar : hij wil nog steeds zijn eigen plekje. \nAl snel beseft hij dat hij verkeerd was en als toegeving vraagt hij aan Chelsea om bij hem in te trekken. \nMaar al snel wordt duidelijk dat Chelsea allerlei veranderingen wil doorvoeren\n\nAflevering 23: Good Morning, Mrs. Butterworth\nChelsea ontdekt dat Alan in een diep dal zit en vraagt hem mee op haar afspraakje met Charlie. \nOmdat het opvallend goed klikt tussen Chelsea en Alan, ziet Charlie interessante mogelijkheden : \nAlan kan alle saaie kantjes van hun relatie van hem overnemen en hij plukt de vruchten in bed.\n\nAflevering 24: Baseball Was Better with Steroids\nWanneer Charlie's ex-vriendin Mia opduikt in Los Angeles en opnieuw vrijgezel blijkt te zijn, begint hij na te denken \nover zijn relatie met Chelsea. Hij heeft ergens wel nog gevoelens voor zijn ex, maar wil ook zijn toekomst met zijn \nverloofde niet op het spel zetten. Hij moet zijn liefdesperikelen tijdelijk aan de kant schuiven wanneer de zwangere \nJudith ontdekt dat haar water is gebroken en zijn hulp en die van zijn broer inroept\n\n\nDeze serie wordt u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:2fc8774355f2f60ed7ceb6ebfd7432bb93ce05fd","amp;dn":"Two+and+a+Half+Men%2C+TVSeries%2C+S06E21-24%2C+NL+Subs%2C+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fc8774355f2f60ed7ceb6ebfd7432bb93ce05fd","infoHashBuffer":{"type":"Buffer","data":[47,200,119,67,85,242,246,14,215,206,182,235,253,116,50,187,147,206,5,253]},"announce":[],"urlList":[]}}