{"title":"The River Dvdrip H264 Bookerdog.mp4","uid":5010035,"size":940330083,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2fd38d8094cc1d355d1e40d82db1212f2152cd3f&amp;dn=The+River+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookerdog","files":-1,"time":1247941063,"description":"Category\tDramas, Family Interaction, Tear Jerker\nStarring\tMel Gibson, Sissy Spacek, Scott Glenn, David Hart, Shane Bailey\nDirector\tMark Rydell\nComposer\tJohn Williams\nClosed Captioned; Bio/Filmographies; Soundtrack English; Director's Comments\nIn director Mark Rydell's THE RIVER, a young farm couple finds themselves at odds with the local power authority which has plans to flood their lands for a hydroelectric project.\n\nIn this powerful film about the fragility of the American dream, Mae and Tom Garvey (Sissy Spacek and Mel Gibson) are farmers at a time (the mid-1980s) when bankers, real-estate agents, and nature itself threaten to destroy their way of life. When the local river floods and nearly destroys the farms around it, hardship hits the area. The Garveys are also at odds with the local power authority and one of its chief officers, Joe Wade (Scott Glenn), who has plans to build a dam and flood the land for a hydroelectric project. Though the family stoically attempts to continue working its farm, massive debts and a poor season finally force Tom Garvey to accept a low-paying factory job as a scab. As they struggle to keep going, Wade hovers vulturelike over the Garvey farm, waiting for its demise. Director Mark Rydell's THE RIVER is a truly beautiful, subtly heartwrenching, and unique film that captures the seldom-seen pleasures of living and growing up in an endangered world--that of the family farm. When the Garveys and their children work the land and tend the animals proudly and happily, their sun-drenched farm seems like paradise.","torrent":{"xt":"urn:btih:2fd38d8094cc1d355d1e40d82db1212f2152cd3f","amp;dn":"The+River+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fd38d8094cc1d355d1e40d82db1212f2152cd3f","infoHashBuffer":{"type":"Buffer","data":[47,211,141,128,148,204,29,53,93,30,64,216,45,177,33,47,33,82,205,63]},"announce":[],"urlList":[]}}