{"title":"Megan Abbott - The Song Is You","uid":5176368,"size":1508885,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:309e0f208a3e7fa3f36facc5f76cfebc891f5149&amp;dn=Megan+Abbott+-+The+Song+Is+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"pigeye","files":1,"time":1258998400,"description":"Apply a sly feminist sensibility to postwar Hollywood noir, and you get a sordid saga in which women normally consigned to one-note victimhood turn out to be alarmingly complicit in their own downfalls. At least that's the tale Abbott delivers in this solid follow-up to 2005's lustrous Die a Little. Gil Hopkins--Hop to his friends, of which he has either a million or none, depending on your definition--is a studio fixer who helped cover up a song-and-dance team's involvement in the disappearance of an aspiring actress. When a gal pal shows up years later demanding help, Hop tries coming to grips with the conscience he never knew he had. A fevered, schizophrenic exploration of L.A.'s darkest corners follows as Hop opens cans of worms only to work desperately to keep any from wriggling free. It's Hollywood as meat grinder for Midwesterners too eager to swap snow for stardust, a place that can leave one &quot;uncomfortable, disgusted, and vaguely aroused at the same time.&quot; And although it wallows in third-act melodrama, it's tasty stuff. \n--Frank Sennett\n","torrent":{"xt":"urn:btih:309e0f208a3e7fa3f36facc5f76cfebc891f5149","amp;dn":"Megan+Abbott+-+The+Song+Is+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"309e0f208a3e7fa3f36facc5f76cfebc891f5149","infoHashBuffer":{"type":"Buffer","data":[48,158,15,32,138,62,127,163,243,111,172,197,247,108,254,188,137,31,81,73]},"announce":[],"urlList":[]}}