{"title":"The Execution of Willie Francis (2008) - (Malestrom)","uid":4993477,"size":2532311,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:30b147a3daf62743d06c0413f8dec0514c3243d4&amp;dn=The+Execution+of+Willie+Francis+%282008%29+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":2,"time":1247161723,"description":" &lt;a href=&quot;http://bayimg.com/hAcMnAAce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/hAcMnAAce&lt;/a&gt;\n\nGilbert King, &quot;The Execution of Willie Francis: Race, Murder, and the Search for Justice in the American South&quot;\nPublisher: Basic Civitas Books | ISBN: 046500265X | edition: 2008 | PDF | 384 Pages \n\nOn May 3, 1946, a seventeen-year-old boy was scheduled to die by the electric chair inside of a tiny red brick jail in picturesque St. Martinsville, Louisiana. Young Willie Francis had been charged with the murder of a mysterious bachelor pharmacist. The electric chair-three hundred pounds of oak and metal- had been dubbed &quot;Gruesome Gertie&quot; and was moved from one jailhouse to another throughout the state of Louisiana. The switch would be thrown at 12:08 P.M., but Willie Francis did not die. Miraculously, having survived this less than cordial encounter with death at the hands of his drunken executioners, Willie was soon informed that the state would try to kill him again in six days. Letters began pouring into St. Martinsville from across the country-Americans of all colors and classes were transfixed by the fate of this young man. A Cajun lawyer just returned from WWII, Bertrand DeBlanc would take on Willie's case-in the face of overwhelming local resistance. DeBlanc would argue the case all the way from the Bayou to the U.S. Supreme Court.\nGilbert King offers a powerful and haunting murder mystery, exposing the secrets and lies in St. Martinville that should have sent Willie Francis to his death. A gripping and provocative legal thriller set against Louisiana's rich and complex history of race and culture, The Execution of Willie Francis is an epic tale of an unlikely bond between two young men, born to widely different worlds that lay just blocks apart.","torrent":{"xt":"urn:btih:30b147a3daf62743d06c0413f8dec0514c3243d4","amp;dn":"The+Execution+of+Willie+Francis+%282008%29+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30b147a3daf62743d06c0413f8dec0514c3243d4","infoHashBuffer":{"type":"Buffer","data":[48,177,71,163,218,246,39,67,208,108,4,19,248,222,192,81,76,50,67,212]},"announce":[],"urlList":[]}}