{"title":"Earl Scruggs &amp; Friends - Earl Scruggs &amp; Friends  [2001]  [Robbie","uid":6171057,"size":340075023,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:30f9ef9057b6c28684621a2ba4218a4d2c991f61&amp;dn=Earl+Scruggs+%26+Friends+-+Earl+Scruggs+%26+Friends++%5B2001%5D++%5BRobbie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robbie6ty","files":-1,"time":1297580455,"description":"Earl Scruggs &amp; Friends\nEarl Scruggs &amp; Friends\n\n\n\nLabel: MCA\nReleased: 2001\nSource: Original CD \nSize Torrent: 324 MB\nFormat: FLAC\n\n\n\n\nEarl Eugene Scruggs (born January 6, 1924) is a musician noted for perfecting and popularizing a 3-finger style (now called Scruggs style) on the 5-string banjo that is a defining characteristic of bluegrass music. Although other musicians had played in 3-finger style before him, Scruggs shot to prominence when he was hired by Bill Monroe to fill the banjo slot in the &quot;Blue Grass Boys&quot;. Scruggs built on earlier styles to develop a truly new and readily identifiable style, involving: unprecedented smoothness, syncopation, and uninterrupted flow; a large vocabulary of unique and original licks; blues and jazz phrases, evident in backup and in solos such as &quot;Foggy Mountain Special;&quot; and an overall coherency and polish that other stylists lacked, which inspired imitation by newer generations of banjo pickers.\n\n\nScruggs was born in Shelby, North Carolina, to Georgia Lula Ruppe and George Elam Scruggs. Scruggs joined Bill Monroe's Blue Grass Boys in late 1945 and his syncopated, three-finger picking style quickly became a sensation. In 1948 Scruggs and guitarist Lester Flatt left Monroe's band and formed the Foggy Mountain Boys. In 1969, Flatt and Scruggs broke up and Scruggs started a new band, the Earl Scruggs Revue, featuring several of his sons.\n\nOn September 24, 1962 singer Jerry Scoggins, Flatt, and Scruggs recorded &quot;The Ballad of Jed Clampett&quot; for the TV show The Beverly Hillbillies which was released October 12, 1962. The theme song became an immediate country music hit and was played at the beginning and end of each episode. Flatt and Scruggs appeared in several episodes as family friends of the Clampetts in the following years. In their first appearance, season 1 episode 20, they portray themselves in the show and perform both the theme song and &quot;Pearl Pearl Pearl&quot;.\n\nFlatt and Scruggs won a Grammy Award in 1969 for Scruggs' instrumental &quot;Foggy Mountain Breakdown&quot;. They were inducted together into the Country Music Hall of Fame in 1985. In 1989, Scruggs was awarded a National Heritage Fellowship. He was an inaugural inductee into the International Bluegrass Music Hall of Honor in 1991. In 1992, he was awarded the National Medal of Arts.\n\nIn 2002 Scruggs won a second Grammy award for the 2001 recording of &quot;Foggy Mountain Breakdown&quot;, which featured artists such as Steve Martin on 2nd banjo solo (Martin played the banjo tune on his 1970s stand-up comic acts), Vince Gill and Albert Lee on electric guitar solos, Paul Shaffer on piano, Leon Russell on organ, and Marty Stuart on mandolin. The album, Earl Scruggs and Friends, also featured artists such as John Fogerty, Elton John, Sting, Johnny Cash, Don Henley, Travis Tritt, Steve Martin and Billy Bob Thornton. Earl Scruggs and Friends (MCA Nashville, 2001).\n\nOn February 13, 2003, Scruggs received a star on the Hollywood Walk of Fame. That same year, he and Flatt were ranked #24 on CMT's 40 Greatest Men of Country Music.\n\nScruggs' wife and manager Louise Scruggs died on February 2, 2006 at the age of 78 at Nashville, Tennessee's Baptist Hospital following a lengthy illness.\n\nOn September 13, 2006, Scruggs was honored at Turner Field in Atlanta as part of the pre-game show for an Atlanta Braves home game. Organizers (Banjo.com) set a world record for the most banjo players (239) playing one tune together (Scruggs' &quot;Foggy Mountain Breakdown&quot;).\n\nOn February 10, 2008, Scruggs was awarded the Lifetime Achievement Award at the 50th Annual Grammy Awards.\n\n\n\n\n\nTrack Listing &amp; Personnel\n\n\n1. Country Comfort - Earl Scruggs with Elton John\n\nWritten by Elton John, Bernie Taupin\n\nEarl Scruggs, banjo - Elton John, vocal, piano - Randy Scruggs, acoustic guitar - Glen Duncan, fiddle - John Jorgenson, electric guitar - Jay Dee Maness, steel guitar - Dave Pomeroy, bass - Harry Stinson, drums - Harmony Vocals: Elton John and John Jorgenson - Harmony Choir: Earl Scruggs, Harry Stinson, Dave Pomeroy, Glen Duncan, Randy Scruggs\n\n  \n2. Borrowed Love - Earl Scruggs with Dwight Yoakam\n\nLyrics by Dwight Yoakam, Music by Dwight Yoakam, Earl Scruggs, Randy Scruggs\n\nEarl Scruggs, banjo - Dwight Yoakam, vocal, acoustic guitar - Carl Jackson, harmony vocal - Randy Scruggs, acoustic guitar - Glen Duncan, fiddle - Jim Cox, synth dobro - Leland Sklar, bass - Michael Baird, drums\n\n \n3. Ring of Fire - Earl Scruggs with Billy Bob Thornton\n\nWritten by June Carter, Merle Kilgore\n\nEarl Scruggs, banjo - Billy Bob Thornton, vocal - Randy Scruggs, acoustic guitar - Glen Duncan, fiddle - Pat Buchanan, electric guitar - Reese Wynans, keyboards - Glenn Worf, bass - Harry Stinson, drums\n\n \n4. True Love Never Dies - Earl Scruggs with Gary Scruggs and Travis Tritt\n\nWritten by Gary Scruggs and Kevin Welch\n\nEarl Scruggs, banjo - Gary Scruggs, vocal - Travis Tritt, vocal - Randy Scruggs, acoustic guitar - Glen Duncan, fiddle - John Jorgenson, electric guitar - Pete Wasner, keyboards - Leland Sklar, bass - Greg Morrow, drums, percussion\n\n  \n5. The Angels - Earl Scruggs with Melissa Etheridge\n\nWritten by Melissa Etheridge\n\nEarl Scruggs, banjo - Melissa Etheridge, vocal, 12 string acoustic guitar - Randy Scruggs, acoustic guitar - Glen Duncan, fiddle - John Jorgenson, electric guitar - Jim Cox, synth - Leland Sklar, bass - Kenny Aronoff, drums, percussion\n\n \n6. Fill Her Up - Earl Scruggs with Sting\n\nWritten by Sting\n\nEarl Scruggs, banjo - Sting, vocal, bass - Randy Scruggs, acoustic guitar - Glen Duncan, fiddle - John Jorgenson, electric guitar - Dan Dugmore, dobro - Kipper, synth - Reese Wynans, keyboards - Dave Pomeroy, bass - Harry Stinson, drums - Harmony Vocals: Sting, Trudie Sumner, Joe Sumner \n\n  \n7. Foggy Mountain Breakdown - Earl Scruggs with Glen Duncan, Randy Scruggs, Steve Martin, Vince Gill, Marty Stuart, Gary Scruggs, Albert Lee, Paul Shaffer, Jerry Douglas, and Leon Russell\n\nWritten by Earl Scruggs\n\nEarl Scruggs, banjo - Glen Duncan, fiddle - Randy Scruggs, acoustic guitar - Steve Martin, 2nd banjo solo - Vince Gill, 1st electric guitar solo - Marty Stuart, mandolin - Gary Scruggs, harmonica - Albert Lee, 2nd electric guitar solo - Paul Shaffer, piano - Jerry Douglas, dobro - Leon Russell, organ - Glenn Worf, bass - Harry Stinson, drums \n\n \n8. Somethin' Just Ain't Right - Earl Scruggs with Randy Scruggs\n\nWritten by Randy Scruggs\n\nEarl Scruggs, banjo - Randy Scruggs, vocal, acoustic and electric guitars - Glen Duncan, fiddle, mandolin - Pat Buchanan, electric guitar - Reese Wynans, organ, Wurlitzer - David Hungate, bass - Harry Stinson, drums, harmony vocal\n\n  \n9. I Found Love - Earl Scruggs with Vince Gill and Rosanne Cash\n\nWritten by Randy Scruggs, Vince Gill, Earl Scruggs\n\nEarl Scruggs, banjo - Vince Gill, vocal - Rosanne Cash, vocal - Randy Scruggs, acoustic guitar - Glen Duncan, fiddle - George Marinelli, electric guitar - Michael Omartian, piano, synth - Willie Weeks, bass - Harry Stinson, drums - Backround &quot;Oohs&quot;: Harry Stinson, Dennis Wilson\n\n \n10. Blue Ridge Mountain Blues - Earl Scruggs with John Fogerty\n\nTraditional, Arranged by John Fogerty\n\nEarl Scruggs, banjo - John Fogerty, vocal - Randy Scruggs, acoustic guitar - Glen Duncan, fiddle - Jerry Douglas, dobro - Glenn Worf, upright bass - Chad Cromwell, drums\n\n \n11. Passin' Thru - Earl Scruggs with Don Henley and Johnny Cash\n\nWritten by John R. Cash, Randy Scruggs\n\nEarl Scruggs, banjo - Don Henley, vocal - Johnny Cash, end vocal - Randy Scruggs, acoustic guitar - Glen Duncan, fiddle - John Jorgenson, electric guitar - Dan Dugmore, dobro - Reese Wynans, keyboards - Dave Pomeroy, bass - Harry Stinson, drums - Harmony Vocals: Ashley Cleveland, Harry Stinson\n\n \n12. Foggy Mountain Rock/Foggy Mountain Special - Earl Scruggs with Marty Stuart \n\nWritten by Louise Certain, Gladys Stacey, Burkett Graves/Written by Louise Certain, Gladys Stacey\n\nEarl Scruggs, banjo - Marty Stuart, acoustic guitar \n","torrent":{"xt":"urn:btih:30f9ef9057b6c28684621a2ba4218a4d2c991f61","amp;dn":"Earl+Scruggs+%26+Friends+-+Earl+Scruggs+%26+Friends++%5B2001%5D++%5BRobbie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30f9ef9057b6c28684621a2ba4218a4d2c991f61","infoHashBuffer":{"type":"Buffer","data":[48,249,239,144,87,182,194,134,132,98,26,43,164,33,138,77,44,153,31,97]},"announce":[],"urlList":[]}}