{"title":"The Mars Volta - Frances The Mute [Vinyl] [FLAC]","uid":6138749,"size":1660082972,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:31f78d71429afe264c1f22ff6f2890882d45f5b1&amp;dn=The+Mars+Volta+-+Frances+The+Mute+%5BVinyl%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"insinuendo","files":16,"time":1296413095,"description":"The Mars Volta\nFrances The Mute\nOut-of-Print Vinyl Rip\n\n4.5 Stars /5 Allmusic\n\n\n  &lt;a href=&quot; http://www.allmusic.com/album/frances-the-mute-r726240/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/frances-the-mute-r726240/&lt;/a&gt;\n\n\n  &lt;a href=&quot; http://www.amazon.ca/Frances-Mute-Vinyl-Mars-Volta/dp/B00070Q8MM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.ca/Frances-Mute-Vinyl-Mars-Volta/dp/B00070Q8MM&lt;/a&gt;\n\n\n\nFrom Amazon.com:\n\nIf one needed further proof of the contemporary revival/reassessment of the ambitiously overwrought sensibilities once so reviled in 70's rock, this aggressively mind-bending second album by The Mars Volta offers it up in spades. Band mainstays Omar Rodriguez-Lopez and Cedric Baxter-Zavala insist that labels like &quot;prog&quot; don't interest them, and that this is emphatically not a &quot;sequel&quot; to 2003's De-Loused in the Comatorium. What it is was thematically inspired by a stranger's diary allegedly found by late bandmate Jeremy Ward, the basis for an expansive, often amorphous musical head-trip that brews psychedelia, trance, hard-rock and free-jazz into a daunting new whole. The dozen tracks here represent but five &quot;songs&quot; proper, though the band's disdain for conventional track banding inspire it to sound more like a stream-of-consciousness soundscape from Can--or a dark, lyrically inventive, if decidedly troubled corner of their ids. On the &quot;Umbilical Syllables&quot; portion of &quot;Cygnus..&quot; and &quot;The Widow&quot; Bixter-Zavala invokes the wailing, Zeppelin II &amp; III spirit of Robert Plant set against a feverish, swirling melange that's anything but the blues. The vocalist coaxes &quot;L' Via l'Viaquez&quot; en Espanol, while his band indulges its space-mambo conceits with an evocative spirit that recalls Latin Playboys at their most mischievous. It's an album that loops back on itself in a haunting ellipse--and one whose boundless ambition makes Pink Floyd sound like three-chord bar punters by comparison. --Jerry McCulley\n\n\n\n\n\n\nAllmusic Review\n\nby Johnny Loftus\n\nThe Mars Volta's 2003 debut was a dense, experimental run-on sentence of science fiction and musical exploration. But though it ultimately rewarded patience with stretches of unbuckled rock &amp; roll genius, De-Loused in the Comatorium was also a maze-like and obtuse migraine dealer that made people frustrated and crazy. For 2005's Frances the Mute, Omar Rodriguez-Lopez and Cedric Bixler-Zavala worked principally with their touring band, but &quot;joining the band for selected moments&quot; are strings, horns, electronic programming, pals Flea and John Frusciante, and the coqui frogs of Puerto Rico. There are no song breaks, making the track listing more of an outline. But Mute's printed lyrics are a helpful guide, a map of Mars that's meant to both direct and fascinate. &quot;She was a mink handjob in sarcophagus heels&quot;; &quot;Don't be afraid when all the worms come crawlin out of your head&quot;; &quot;they were scaling through an ice pick of abscess reckoning and when Miranda sang everyone turned away....&quot; -- perhaps the only match for the cerebral weirdness and eventual beauty of Mars Volta's lyrics is their music itself. The roar of Rodriguez-Lopez and Bixler-Zavala's post-hardcore past is fully locked away, replaced by an equally powerful flair for expressive percussion, intricate vocal harmonies, and extended solos for electric guitar (as on the initial part of &quot;Cygnus...Vismund Cygnus&quot;). Sure, there are moments on Mute that reach the grandiose heights of heavy music -- &quot;L'Via l'Viaquez&quot;'s ear-splitting changes will blow back your hair. But the same song is sung half in Spanish, half in English, and its flashes of heaviness fall between stretches of Afro-Cuban rhythm. Other portions of Frances the Mute are murky and distant, like field recordings from the ocean floor, while still others shift drastically between brittle acoustics and a stuttering, guitar-led volatility that threatens to crack open the earth. Its constant shifts mean the record is claustrophobic and even dizzying; it demands perseverance. But it's great when a blast of a trumpet cuts through a gloomy moment, and Bixler-Zavala's vocals are a thread to reality. For example, while his lyrics for &quot;Miranda That Ghost Just Isn't Holy Anymore&quot; and &quot;Widow&quot; are mysterious poems, he sings them with a fervor that's immediately identifiable. That passion is evident throughout Frances the Mute; it's the organic fever that was buried on Comatorium.\n\n\n\n\n\n\n\n\n\nAbout the Vinyl Pressing:\nThis was a tough one to rip because of the track layout! Each side ends with a 'locked groove' that repeats endlessly. Normally on CD, these tracks continue into one another; on the vinyl you have to flip the LP.\n\nSo what to do? I simply faded-out each side. The next track begins are the start of the next side. It's really the only solution. Also, the vinyl track names better match the traditional CD naming scheme, which incorrectly named the last half of the album! For continuity, I split and tagged my rip to match the CD scheme, but have provided the Vinyl listing below.\n\nFrom Wikipedia regarding Vinyl edition:\nOn vinyl, &quot;Cassandra Gemini&quot; was split among two sides, in the middle of &quot;Faminepulse&quot;. Each side of vinyl (save the final one) ends with a locked groove, repeating either a sound effect or a bar of music endlessly until the needle is lifted. The third side, containing &quot;Miranda That Ghost Just Isn't Holy Anymore&quot;, opens by repeating the 39 seconds of coquÃƒÂ­ noises that conclude &quot;L'Via L'Viaquez&quot;; this small portion is indexed separately from &quot;Miranda&quot;.\n\n\n\nVinyl Tracklisting:\n\n\n\nSide One\n\n1.&quot;Cygnus....Vismund Cygnus&quot; (Sarcophagi / Umbilical Syllables / Facilis Descenus Averni2 / Con Safo)\n\n2.&quot;The Widow&quot;\n\nSide Two\n\n1.&quot;L'Via L'Viaquez&quot;\n\nSide Three\n\n1.&quot;[unlisted coquÃƒÂ­ noises]&quot;\n\n2.&quot;Miranda That Ghost Just Isn't Holy Anymore&quot; (Vade Mecum4 / Pour Another Icepick / Pisacis (Phra-Men-Ma) / Con Safo)\n\nSide Four\n\n1.&quot;Cassandra Gemini&quot; (Tarantism / Plant a Nail in the Navel Stream / Faminepulse)\n\nSide Five\n\n1. &quot;Cassandra Gemini&quot; (Faminepulse / Multiple Spouse Wounds / Sarcophagi)\n\n\n\nRipping notes:\nTechnics SL1200 - Audio Technica 440mla - Musical Fidelity V-LPS - Creative Audigy @24/96 - Audacity&amp;Audition to normalize then split - ClickRepair (manual mode, 10~30, Rev, Pitch Protection, x.2) &gt; iZotope RX Advanced 2.0 for Redbook conversion\n\nYou will notice on first listen/comparison that this rip appears to be very low volume. This is because there are WAY more dynamic headroom on the vinyl, and no compression has been used, unlike the CD. This allows for 'louder' loud parts and 'quieter' quiet parts, unlike the CD which has been 'brickwalled' to be loud at all times. It's exactly what came out of the needle.\n\nAlso, the album itself has a very long fade-up. The songs gradually get louder as the album progresses to build tension (?). This is also present on the CD. Very interesting.\n\n\n\nEnjoy!\n\n\n\n\nPLAY LOUD!!!","torrent":{"xt":"urn:btih:31f78d71429afe264c1f22ff6f2890882d45f5b1","amp;dn":"The+Mars+Volta+-+Frances+The+Mute+%5BVinyl%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31f78d71429afe264c1f22ff6f2890882d45f5b1","infoHashBuffer":{"type":"Buffer","data":[49,247,141,113,66,154,254,38,76,31,34,255,111,40,144,136,45,69,245,177]},"announce":[],"urlList":[]}}