{"title":"ohn Nunn's Chess Puzzle Book","uid":6288223,"size":6060251,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:324cebe796421d92a0d0fc4c1b061c54264a5e04&amp;dn=ohn+Nunn%5C%27s+Chess+Puzzle+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1301694842,"description":"Product Description\nMost chess puzzle books put you in an artificial situation: you are told a combination exists, what the theme is and what you are required to achieve. This one is different. In a real game, a player may sometimes need to find a combination. On the other hand he may have to reject a tactical idea and simply find a good positional move. His task is to find the right move, whatever it may be. The 300 puzzles in this book put you precisely in that situation. Spectacular ideas abound in these positions, but it is for you to decide whether to go in for them, or whether you would be falling into a trap. If you need them, there are hints to help you on your way. The book ends with a series of tests to measure your skills against those of other players.\n\nFor this new edition, John Nunn, a top-class grandmaster and a solving world champion, has added 50 new puzzles (with hints and detailed solutions) to test your skills to the full. For ease of following, extra diagrams have been added to the solutions throughout. Overall the book is 60 per cent bigger than the first edition.\nAbout the Author\nDr John Nunn is one of the best-respected figures in world chess. He was among the world's leading grandmasters for nearly twenty years, winning four gold medals in chess Olympiads and finishing sixth overall in the World Cup in 1989. He is a much-acclaimed writer, whose works have won 'Book of the Year' awards in several countries. In both 2004 and 2007 Nunn was crowned World Chess Solving Champion, ahead of many former champions. \n &lt;a href=&quot;\nhttp://www.amazon.com/John-Nunns-Chess-Puzzle-Book/dp/1906454035/ref=sr_1_1?ie=UTF8&amp;qid=1301687287&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/John-Nunns-Chess-Puzzle-Book/dp/1906454035/ref=sr_1_1?ie=UTF8&amp;qid=1301687287&amp;sr=8-1&lt;/a&gt;","torrent":{"xt":"urn:btih:324cebe796421d92a0d0fc4c1b061c54264a5e04","amp;dn":"ohn+Nunn%5C%27s+Chess+Puzzle+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"324cebe796421d92a0d0fc4c1b061c54264a5e04","infoHashBuffer":{"type":"Buffer","data":[50,76,235,231,150,66,29,146,160,208,252,76,27,6,28,84,38,74,94,4]},"announce":[],"urlList":[]}}