{"title":"Anne.of.Green.Gables.A.New.Beginning.HDTV.XviD-2HD","uid":5599445,"size":1468319742,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:34130a4ae25fa4bff0edaa95724b777e1b163176&amp;dn=Anne.of.Green.Gables.A.New.Beginning.HDTV.XviD-2HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"thelad53","files":102,"time":1275219283,"description":"Description\n\nRelease Name----- Anne.of.Green.Gables.A.New.Beginning.HDTV.XviD-2HD\nRelease Date----- 12/15/2008\nRelease Size----- 1400Mb - CD1-699mb  CD2-700mb\nSource----------- HDTV\nPlay Time-------- 02:19:11\nResolution------- 624x352\nFrame Rate------- 23.98\nVideo Bitrate---- 1225kbps\nVideo Codec------ XVID\nAudio ----------- 48000 Hz 2ch, 131kbps\nAudio Codec------ MP3\n\nAnne Shirley is one of the world's most heartwarming iconic characters - but\nwhat happened before her surprising arrival at Green Gables in Prince Edward\nIsland? This expansive new movie, which is both a prequel and a sequel to the\noriginal films, answers that question.\n\nAudiences will learn about the foundations of Anne's childhood that shaped her\nlife and haunted her in later years: the origins of her carpet bag; the source\nof her expression, &quot;kindred spirits&quot;; the development of her intense\nimagination as a means of survival; and most profoundly, many of the\nrelationships with adults and peers that structured her character so\ndistinctively, prior to her arrival at Green Gables.\n\n&quot;Based on details from Lucy Maud Montgomery's own diary and descriptions from\nthe original novel, Kevin Sullivan has fashioned a moving and complex glimpse\ninto the circumstances that created one of the most beloved fictional\ncharacters of our time,&quot; said Susanne Boyce, President, Creative, Content and\nChannels, CTV Inc.\n\n&quot;I wanted to create a film that would offer a rare insight into Anne Shirley's\npersonality,&quot; said Kevin Sullivan, President, Sullivan Entertainment. &quot;I tried\nto imagine what Anne would have become if she had grown up to be an author like\nMontgomery herself; a gifted storyteller who was haunted by her childhood her\nwhole life.&quot;\n\nProduced, written and directed by Sullivan, Anne of Green Gables: A New Beginning\nis set as the Second World War is winding down. Anne Shirley (played by Barbara\nHershey, Beaches, Portrait of a Lady) is now a successful, middle-aged writer who\nhas returned to Prince Edward Island for an extended visit. While writing a play\nfor the summer theatre season, she discovers a long-hidden secret under the\nfloorboards at Green Gables.\n\nAs Anne struggles to complete her play, she delves into long-buried and long-\nforgotten memories, reliving her troubled years before she arrived as an orphan\nat the Cuthbert farmhouse. Over the course of one remarkable summer, Anne\ndiscovers the truth about her parents, the origins of her quest for &quot;kindred\nspirits&quot; and the genesis of her brilliant, magical imagination.\n\nAs the movie flows between present-day discoveries and past memories, Hannah\nEndicott-Douglas (THE GOOD WITCH, SAMANTHA: AN AMERICAN GIRL HOLIDAY) portrays\nthe young Anne Shirley alongside Rachel Blanchard (Where the Truth Lies,\n7TH HEAVEN, CLUELESS) as Louisa Thomas, Shirley MacLaine (In Her Shoes, Terms of\nEndearment, Bewitched) as Amelia Thomas, and Ron Lea (RACE TO MARS, THIS IS\nWONDERLAND) as Gene Armstrong.\n\nCasting for the young Anne Shirley involved an expansive search to find an actress\nwho could play the role made famous by Megan Follows. The quest for the ideal actress\ninvolved a cross-Canada audition tour and an open casting call onMore than\n1,000 young girls from Canada, the United States, England and Australia auditioned\nfor the coveted role in the film. After three months of searching, 12-year-old Hannah\nEndicott-Douglas from Toronto was chosen to carry on the legacy of Anne Shirley.\n\nFilmed in studio in Toronto, ON and on location in Dundas, ON, and Rockwood, ON,\nAnne of Green Gables: A New Beginning recreates, with vivid detail, the setting for\nAnne Shirley's tumultuous childhood. The production crew and special effects team were\nable to re-construct a number of locations made famous in the previous films, including\nsome of the more well-known locations from the original Anne of Green Gables trilogy. ","torrent":{"xt":"urn:btih:34130a4ae25fa4bff0edaa95724b777e1b163176","amp;dn":"Anne.of.Green.Gables.A.New.Beginning.HDTV.XviD-2HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34130a4ae25fa4bff0edaa95724b777e1b163176","infoHashBuffer":{"type":"Buffer","data":[52,19,10,74,226,95,164,191,240,237,170,149,114,75,119,126,27,22,49,118]},"announce":[],"urlList":[]}}