{"title":"Ralf-Uwe Hill - Das Deutschland-Protokoll","uid":5132593,"size":4113184,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34374b57197ca132c07721cf48c769a5da3309c4&amp;dn=Ralf-Uwe+Hill+-+Das+Deutschland-Protokoll&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1256160764,"description":"Dieses Buch offenbart Ihnen erstmals, dass die BRD kein souverÃƒÂ¤ner Staat, sondern ein weiterhin fortbestehendes besatzungsrechtliches Mittel der Alliierten ist; warum sich die bundesdeutsche Politik weiterhin nach US-Vorgaben auszurichten hat; oder warum seit 1990 keine gesamtdeutschen Wahlen stattfinden! Sie finden hier erstmals alle Beweise und Fakten die es ihnen selbst ermÃƒÂ¶glichen, die in diesem Buch vorgetragenen Behauptungen selbst zu ÃƒÂ¼berprÃƒÂ¼fen. Das Traurige an diesem Buch ist die Wahrheit darin. Derzeit sitzen wir nach offiziellen bundesdeutschen Angaben auf rund zwei Billionen, also 2.000 Milliarden Euro Schulden, die niemals getilgt werden kÃƒÂ¶nnen, sondern stetig wachsen.\n\nWie setzt sich dieser Betrag zusammen? Wie wirkt sich das auf unsere Zukunft aus? Hier erfahren Sie es.\nSie sind vielleicht der Meinung, das sei alles weit hergeholt? Dann wissen Sie sicher auch, weshalb Sie einen Personalausweis und keinen Personenausweis besitzen! Aber wessen Personal sind Sie? Und sicher haben Sie auf Ihrem Bundespersonalausweis schon lange den gehÃƒÂ¶rnten Teufel den Baphomet entdeckt und kennen seine Bedeutung. Vielleicht sind Sie sich auch wirklich ganz sicher, daÃƒÅ¸ Deutschland mit dem 2plus4-Vertrag von 1990 einen Friedensvertrag hat. SelbstverstÃƒÂ¤ndlich ist auch das Grundgesetz fÃƒÂ¼r die Bundesrepublik\nDeutschland unsere Verfassung - auch das wird sogar in Schulen so gelehrt. Sie kÃƒÂ¶nnen hoffentlich mit diesen und mehr EnttÃƒÂ¤uschungen umgehen, denn genau dies wird dieses Buch mit Ihnen tun: Es wird Sie Ent-TÃƒÂ¤uschen und Ihnen ungeschminkt die verschwiegenen Fakten prÃƒÂ¤sentieren, vor denen sich die Bundespolitiker aller Fraktionen so sehr fÃƒÂ¼rchten. Die USamerikanische American Free Press schrieb am 7. Oktober 2002: Ironischerweise ist Deutschland keine souverÃƒÂ¤ne Nation, ohne Friedensvertrag und mit ÃƒÂ¼ber 70.000 USamerikanischer Besatzungstruppen noch immer auf seinem Boden: Die USA und GroÃƒÅ¸britannien kÃƒÂ¶nnten die Bundestagswahl annullieren unter Deutschlands tatsÃƒÂ¤chlicher Verfassung, dem Londoner Abkommen vom 8. August 1945.\n\nDies ist nur ein kleiner Vorgeschmack auf weitere EnthÃƒÂ¼llungen und Fakten dieses Buches. Unter anderem erfahren Sie - warum die BRD kein Staat, sondern eine private Organisationsform ist - warum die BRD keine Rechtsgrundlage fÃƒÂ¼r Ihr Handeln besitzt - warum die bundesdeutschen Regierungen und alle Wahlen seit 1990 illegal sind - weshalb Berlin kein Bundesland der BRD sein kann - weshalb jeder Bundesdeutsche staatenlos ist - wieso es keine StaatsangehÃƒÂ¶rigkeit Deutsch gibt - wieso Sie einen roten und keinen blauen Reisepass besitzen - wofÃƒÂ¼r und fÃƒÂ¼r wen Sie hohe Steuern zahlen - warum Deutschland weiterhin von den USA besetzt ist - was das Grundgesetz fÃƒÂ¼r die Bundesrepublik Deutschland wirklich ist - warum Deutschland keinen Friedensvertrag hat, den die BRD nicht abschlieÃƒÅ¸en kann - warum Deutschland noch immer unter mittelbarem Kriegsrecht steht - weshalb der Euro keine legale Banknote ist und keinen Bestand haben wird - warum undeswehrsoldaten SÃƒÂ¶ldner und keine Soldaten im Sinne des VÃƒÂ¶lkerrechts sind - warum sich die BRD nicht an das VÃƒÂ¶lkerrecht hÃƒÂ¤lt und vieles mehr!\n\nVergessen Sie die freie Presse! Vergessen Sie die freien Medien! Vergessen Sie die frei gewÃƒÂ¤hlten Politiker! Vergessen Sie alles, was man Ihnen bisher erzÃƒÂ¤hlte und prÃƒÂ¼fen Sie den Inhalt des Buches auf seinen Tatsachengehalt selbst nach! Aber Vorsicht: Sie werden kÃƒÂ¼nftig die Welt mit ganz anderen Augen sehen!\n","torrent":{"xt":"urn:btih:34374b57197ca132c07721cf48c769a5da3309c4","amp;dn":"Ralf-Uwe+Hill+-+Das+Deutschland-Protokoll","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34374b57197ca132c07721cf48c769a5da3309c4","infoHashBuffer":{"type":"Buffer","data":[52,55,75,87,25,124,161,50,192,119,33,207,72,199,105,165,218,51,9,196]},"announce":[],"urlList":[]}}