{"title":"Dark Buddha Rising - Abyssolute Transfinite (2011)","uid":6280395,"size":173541023,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3473532b3265df9088deb4b5a42b02d73f9f73d9&amp;dn=Dark+Buddha+Rising+-+Abyssolute+Transfinite+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Baphom3t","files":5,"time":1301410501,"description":"\nDARK BUDDHA RISING is a three-piece Finnish heavy-psychedelic-stoner progressive rock outfit and their history, private life have been still shrouded in mystery. Or rather, they must be mysterious for 'The Black Arts of Psychedelia' as they advocate. In 2007 DARK BUDDHA RISING released the album 'I' on their own, about which is very little information now. \n\nShooting their debut double LP 'Ritual IX' from a Finnish independent label Post-RBMM in 2008, they went on a tour called 'Live Rituals' around Finland till the following year. In February 2009 they stood on stage of Psychotropic Caravan at Nosturi (a versatile live music venue located close to downtown Helsinki) to bump their doomy psychedelia into the audience with Circle, Lord Vicar, or Vibravoid. The second double LP 'Entheomorphosis', heavier than previous one, was released in November 2009.\n\nAs the dust of centuries has settled on pages unwritten, the gates are opened only within.\nIn ascension rites of introvert spirits, the signature of passing flesh is inscribed in the memorial garden\nas a note of entrance. Succeeding this initiation, all levels are accessible through death transpired\nas severance of the flesh and the spirit immortal.\n\nAs the remnants of flesh dance to the endless pulses of the multiverse, the underlying directives\nin biorhythms to which these pulses are synchronised (from ego to the universe on the left hand\nand no ego in the void beneath the veil) are to be followed like a call of nature. Nature withholds\nthe void that exists to the unaided eye of the celestials, and the rhythms transpire as keys.\n\nAs the innerspace traveler is aligned with the order of the nine, disarray in the processes is\nsuddenly reversible, and the liberated shall walk the brightened path that is not treaded afoot.\n\n&quot;I exhaled and the skies cleared, revealing the stars. And then, from a distant event horizon arose\nthe black sun. Rays of black light illuminated pyramid structures in the desert, as I watched\nhovering above. Carved in the monolithic stones were alien symbols that became decrypted\nbefore my eyes. And the I became the eye, the self dissolved in the light.\n\nSun worshippers emerged from the sands shifting in the solar wind that carried their voice.&quot;\n\nCurrent line-up\nV.A. - Guitar, Vocals\nP.R. - Bass, Percussion (Mother Susurrus)\nJ.R. - Drums, Keyboards\n\nGenre = Sludge / Doom Metal\nFormat = mp3\nBitrate = 320 kbps\nFile Size = 165.50 MB\n\nTracklist\n1. Ashtakra I\n2. Ashtakra II \n3. Chonyidt 45 \n4. Sol'Yata","torrent":{"xt":"urn:btih:3473532b3265df9088deb4b5a42b02d73f9f73d9","amp;dn":"Dark+Buddha+Rising+-+Abyssolute+Transfinite+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3473532b3265df9088deb4b5a42b02d73f9f73d9","infoHashBuffer":{"type":"Buffer","data":[52,115,83,43,50,101,223,144,136,222,180,181,164,43,2,215,63,159,115,217]},"announce":[],"urlList":[]}}