{"title":"Boombox","uid":5125348,"size":467295133,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:35e9423b252d8001bf0ac3ec15b8482270a15848&amp;dn=Boombox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jeeby","files":40,"time":1255582691,"description":"For those of us who grew up in the 80's, listened to the Breakin' 2: Electric Boogaloo soundtrack, wore Moonpants, and danced on pieces of old cardboard and linoleum, well, we know what boom boxes are. Or at least what they were. How about a new BoomBox, especially one that takes old school styles and combines them with Beck, Gorillaz, St. Germain, AND delivers live performances that have the entire Southeast turning their heads. Would you check it out?\n\nFormed about three years ago, BoomBox is not your traditional group. It only has two members - a guitar player/vocalist and a DJ - that combine live instruments with multi-track sequencing, turntables, and samplers for a unique brand of infectious music. Zion Godchaux and Russ Randolph came together while working on an album that Zion was collaborating on with his mother, former Grateful Dead member Donna Jean Godchaux. Russ was engineering the record and the two connected immediately.\n\n\nZion Godchaux - BoomBox\nAfter forming in late 2003, BoomBox spent most of 2004 in the studio developing both their sound and their unique approach to live performance. Since then, they've been refining that sound, which has stirred up a nice buzz with promoters, media, and other bands.","torrent":{"xt":"urn:btih:35e9423b252d8001bf0ac3ec15b8482270a15848","amp;dn":"Boombox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35e9423b252d8001bf0ac3ec15b8482270a15848","infoHashBuffer":{"type":"Buffer","data":[53,233,66,59,37,45,128,1,191,10,195,236,21,184,72,34,112,161,88,72]},"announce":[],"urlList":[]}}