{"title":"Autorun.Virus.Remover.v3.0.Build.201","uid":6228306,"size":3177352,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:361b2f558dd05f02d9ced659a125c0241067b011&amp;dn=Autorun.Virus.Remover.v3.0.Build.201&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"do_not_delete_me_blindly","files":1,"time":1299600779,"description":"\nWhat's new in this version: Version 3.0 build 0201 includes a new interface and more autorun viruses including recycler virus, autorun exe virus,vbs virus can be detected and removed now.\n\n\n\nAutorun Virus Remover is an autorun removal tool which provides protection against any threats trying to infect PC via USB flash drive. \n\n\n\nWhen USB storage device is inserted into your computer, Autorun Virus Remover will automatically scan it, block and remove autorun virus, trojans, and malware in USB. Also, it can delete autorun.inf and new folder exe virus in your computer.\n\n\nAutorun Virus Remover can also solves the problem of unable to open hard disk or \nUSB drive by double clicking caused by autorun.inf worm. Autorun Remover antivirus tool permanently protects online &amp; offline computer against any autorun virus without the need for frequent signature updates. This light and easy to use solution is compatible with other antivirus software and doesn't slow down your computer at all.\n\n\nAutorun Virus Remover supports all kinds of USB storage device: pen drive, USB sticks, USB disk, Mp3, flash key, etc.\n\n\n","torrent":{"xt":"urn:btih:361b2f558dd05f02d9ced659a125c0241067b011","amp;dn":"Autorun.Virus.Remover.v3.0.Build.201","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"361b2f558dd05f02d9ced659a125c0241067b011","infoHashBuffer":{"type":"Buffer","data":[54,27,47,85,141,208,95,2,217,206,214,89,161,37,192,36,16,103,176,17]},"announce":[],"urlList":[]}}