{"title":"Morrissey - 2002-10-17 - Adelaide","uid":5118612,"size":89804782,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:36256fc03e50626e797543fdf3a5f2c057170ff9&amp;dn=Morrissey+-+2002-10-17+-+Adelaide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flot29","files":19,"time":1255194168,"description":"17 October 2002\nThebarton Theatre, Adelaide, Australia\n\nI Want The One I Can't Have\nSuedehead\nLittle Man, What Now?\nHairdresser On Fire\nThe First Of The Gang To Die\nJack The Ripper\nI Like You\nAlsatian Cousin\nEveryday Is Like Sunday\nSister I'm A Poet\nThe World Is Full Of Crashing Bores\nMeat Is Murder\nIrish Blood, English Heart\nNovember Spawned A Monster\nSpeedway\n/There Is A Light That Never Goes Out\n\nThe Adelaide date was a good and uneventful affair. Morrissey was at his usual best. Fans were into the concert without being too rowdy. There were two attempts by fans to make it on stage, one of which being a set up (perhaps for the cameras?). Professional cameras were present, shooting before, during and after the concert for an upcoming documentary on UK's Channel 4 (broadcast in 2003 as &quot;The Importance Of Being Morrissey&quot;).\n\nMorrissey greeted this fans &quot;Welcome to a night to forget!&quot; and said he was happy to be in Adelaide after &quot;72 years&quot;. One line in &quot;Suedehead&quot; was adapted to &quot;It was a good lay, good lay, here in Adelaide, Adelaide&quot;. Soon after Morrissey thanked fanzine editor Julia Riley for recommending a vegetarian restaurant to him. He returned to the topic when he said that Borderers was the best restaurant in Australia. When &quot;The First In The Gang To Die&quot; didn't get the expected reaction, Morrissey commented &quot;not every song can be a zinger&quot;. Morrissey still chatted quite a lot with fans in the front rows. He would apologise &quot;for being me&quot; or for using the spotlight so much that the lighting guy would wear out the bulb.\n\nAt some point Morrissey said &quot;All requests will be... ignored&quot;. When someone in the audience shouted for &quot;Pregnant For The Last Time&quot; Morrissey replied &quot;'Pregnant For The Last Time'? If ever there was a career-ender...&quot;. So then Alain decided to play the opening chords to that particular song, which prompted Morrissey to threaten (jokingly) to sack his band: &quot;Tomorrow night I'll be using tapes&quot;. When Alain replied &quot;We already are!&quot;, Morrissey added &quot;Alain cracks a joke and in the usual way...&quot;.\n\nFor some reason, Morrissey joked that he smelled like Qantas Airways or airplanes. When he threw his shirt into the audience, there was the expected fight for scraps of it. Introducing &quot;Meat Is Murder&quot;, Morrissey ranted against Bush Munchies, food for people living in the Australian Outback: &quot;You know how people go out in the bush and eat things&quot;. But he meant to talk about Bush Tucker, not Bush Munchies. Many people in the audience didn't understand what he was ranting about. He was finally corrected when Morrissey realised he wasn't being understood: &quot;Are there any Australians in the audience? (...) Tucker? T-U-C-K-E-R.... as I was saying, this song in a roundabout way is about Bush Tucker...&quot;. At the end, Morrissey thanked his fans and said that they would never forget Adelaide.\n\ninfo from passions just like mine","torrent":{"xt":"urn:btih:36256fc03e50626e797543fdf3a5f2c057170ff9","amp;dn":"Morrissey+-+2002-10-17+-+Adelaide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36256fc03e50626e797543fdf3a5f2c057170ff9","infoHashBuffer":{"type":"Buffer","data":[54,37,111,192,62,80,98,110,121,117,67,253,243,165,242,192,87,23,15,249]},"announce":[],"urlList":[]}}