{"title":"Diana_Ross-The_Complete_Collection-2CD-2009-SSR","uid":5015382,"size":210196551,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:365f7806a073ba8aa3183d8fb80c82744495175b&amp;dn=Diana_Ross-The_Complete_Collection-2CD-2009-SSR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1248199654,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\n\nDiana Ross (born Diana Ernestine Ross; March 26, 1944) is an American singer and actress. During the 1960s, she helped shape the Motown Sound as lead singer of The Supremes, before leaving the group for a solo career on January 15, 1970. Since the beginning of her career with The Supremes and as a solo artist, Ross has sold more than 100 million records.\nDuring the 1970s and through the mid 1980s, Ross was one of the most successful female artists, crossing over into film, television and Broadway. She received an Best Actress Academy Award nomination for her 1972 role as Billie Holiday in Lady Sings the Blues. She won a Golden Globe award for Lady Sings the Blues. She won American Music Awards, garnered twelve Grammy Award nominations, and won a Tony Award for her one-woman show, An Evening with Diana Ross in 1977.\nIn 1976, Billboard magazine named her the &quot;Female Entertainer of the Century.&quot; In 1993, the Guinness Book Of World Records declared Diana Ross the most successful female music artist in history with a total of eighteen American number-one singles: twelve as lead singer of The Supremes and six as a soloist (she was later surpassed by Mariah Carey). Ross was the first female solo artist to score six number-ones. This feat puts her in a tie for fifth place among solo female artists with the most No. 1s on the Hot 100. [2] She is also one of the few recording artists to have two stars on the Hollywood Walk of Fame--one as a solo artist and the other as a member of The Supremes. In December 2007, she received a John F. Kennedy Center for the Performing Arts Honors Award.\nIncluding her work with The Supremes, Ross has recorded 61 studio albums. Ross is a lyric soprano.\n\n","torrent":{"xt":"urn:btih:365f7806a073ba8aa3183d8fb80c82744495175b","amp;dn":"Diana_Ross-The_Complete_Collection-2CD-2009-SSR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"365f7806a073ba8aa3183d8fb80c82744495175b","infoHashBuffer":{"type":"Buffer","data":[54,95,120,6,160,115,186,138,163,24,61,143,184,12,130,116,68,149,23,91]},"announce":[],"urlList":[]}}