{"title":"Brad.Meltzer's.Decoded.S01E02.Secret.Presidential.Codes","uid":6130990,"size":368620429,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:36ccd00454be0762f9c1f3c0fdf615f4226f55cb&amp;dn=Brad.Meltzer%5C%27s.Decoded.S01E02.Secret.Presidential.Codes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"k3nd00d","files":-1,"time":1296087741,"description":"\n\n            Brad Meltzer's Decoded (S01E02) Secret Presidential Codes\n\n              &lt;a href=&quot; http://www.history.com/shows/brad-meltzers-decoded&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.history.com/shows/brad-meltzers-decoded&lt;/a&gt;\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n                     Video: Xvid 624x352 29.97fps 1003kbps\n                Audio: MPEG Audio Layer 3 44100Hz stereo 96kbps\n\n                                Duration: 44:05\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n                             Season 1 Episode List\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n\nEp. 1\t&quot;The White House&quot;\tDecember 2, 2010\nThe team gets to the bottom--literally--of a mystery concerning the cornerstones\nof our democracy. Laid by the ultra secretive Freemasons, this landmark piece of\nstone vanished. The search for the White House cornerstone has been on for over\n200 years, everyone from Harry Truman to Barbara Bush have looked for it. Is it\na coincidence...or is there a secret conspiracy tied to these stones and the\nbuildings they were meant to support?\n\nEp. 2\t&quot;Secret Presidential Codes&quot;\tDecember 9, 2010\nThe team investigates the secret presidential codes of Thomas Jefferson and how\nthey may be partially responsible for the death of one of the world's greatest\nexplorers, Meriwether Lewis, of Lewis and Clark fame. Meltzer discovers that\nalthough the Lewis family has been working for 15 years to exhume his body, the\nNational Parks is preventing the exhumation. This episode attempts to answer why\nthe federal government would want to keep the body buried against the family's\nwishes and what really happened to the man who more than 200 years after his\ndeath remains our most iconic explorer.\n\nEp. 3\t&quot;Statue of Liberty&quot;\tDecember 16, 2010\nBrad Meltzer and his team thought they knew what the Statue of Liberty stood\nfor. But now they learn that America's most powerful icon of freedom might\nactually be loaded with secret symbols put there by a sinister group bent on\nworld domination. They investigate claims that the Illuminati, a secret European\nsociety loosely affiliated with the freemasons, turned every inch of the statue\ninto a coded message, from the torch Liberty holds high, to the rays emanating\nfrom the crown, even to the precise height of the statue itself. Things get even\nstranger when a highly regarded numerologist shows the team why he believes the\nstatue is really a monument to the all-powerful number 7. As they evaluate these\nunsettling claims, Brad and the team are forced to reconsider whether one of\nAmerica's most enduring symbols is really who she appears to be.\n\nEp. 4\t&quot;The Lincoln Assassination&quot;\tDecember 23, 2010\nBrad Meltzer and his Decoded team examine claims that John Wilkes Booth actually\nescaped to freedom after murdering President Abraham Lincoln in 1865. The\n&quot;official&quot; version of events says federal agents cornered Booth and killed him\njust days after the assassination. But Brad and the team uncover glaring\ninconsistencies in that 150-year-old account: Why did the authorities hide\nBooth's body from public view? Why was Booth autopsy's conducted in complete\nsecrecy in the cramped confines of an ironclad gunboat? Searching for answers to\nthese and other troubling questions, the team finds startling evidence that\nstrongly suggests Booth may indeed have lived into old age without ever facing\npunishment for his crime.\n\nEp. 5\t&quot;Confederate Gold&quot;\tDecember 30, 2010\nBrad Meltzer and his team dig into one of the Civil War's most enduring legends:\nthat millions of dollars' worth of missing gold and silver from the Confederate\ntreasury are still buried in secret hiding places across America. According the\nlegend, the only way to find that buried treasure is to decode cryptic signs and\nsymbols left behind by a shadowy Confederate group known as the Knights of the\nGolden Circle. Brad and the Decoded team join veteran treasure hunter Bob\nBrewer, whose lifetime effort to understand the KGC's secret code paid off when\nhe uncovered a small fortune in buried Confederate coins. Bob soon shows just\nhow well he understands those codes as he and the team follow KGC clues to the\nlocation of another possible treasure trove.\n\nEp. 6\t&quot;D.B. Cooper&quot;\tJanuary 6, 2011\nBrad Meltzer and the team jump at the chance to take on one of the FBI's most\npuzzling unsolved crimes: the 1971 disappearance of airline skyjacker D.B.\nCooper, who bailed out of a jetliner at ten thousand feet over Washington state\nwith two parachutes and two hundred thousand dollars in ransom money strapped to\nhis body. Working closely with the former FBI agent who headed up the\nunsuccessful search for Cooper, Brad and the team examine new evidence that\npoints to a former airline employee named Kenny Christiansen, whose own brother\nsuspects he was actually the skyjacker who called himself D.B. Cooper. This sets\nup a climactic meeting between the Decoded team and Christensen's possible\naccomplice, the man who may have helped D.B. Cooper and his two hundred thousand\ndollar ransom vanish into thin air.\n\nEp. 7\t&quot;2012&quot;\tJanuary 13, 2011\nWikipedia.com\nBrad and team work to decipher the meanings behind numerous ancient prophecies,\nfrom Christian to Jewish texts, to Muslim and Native American legends, even\npredictions made by a supercomputer, that supposedly warn of worldwide\ndestruction in the year 2012.\n\nEp. 8\t&quot;The President's Inner Circle&quot;\tJanuary 20, 2011\nWhat if the United States was saved by the most covert spy ring in US History,\nmade up almost entirely of ordinary people? They were called: The Culper Spy\nRing. This group of code-named spies worked stealthily to steal secrets from the\nBritish, giving the Americans a heads up on surprise attacks and enemy troop\nmovements. The Decoded team will uncover if this small circle of shopkeepers,\ntavern owners and housewives may have played the most important role in\ndefeating the British in the Revolutionary War more than 200 years ago.\n\nEp. 9\t&quot;Secret Societies&quot;\tJanuary 27, 2011\nBrad Meltzer and his team try to penetrate Bohemian Grove, one of America's most\ntightly guarded gatherings of the rich and powerful. The Decoded team converges\non the group's hideaway in a northern California redwood forest to pursue rumors\nof ritual sacrifice and secret agreements that control the lives of everyday\nAmericans. Brad soon finds out just how difficult it is to uncover Bohemian\nGrove's secrets. He knew sending the team into the Grove would be risky, but he\nnever expected they'd be calling him for bail money.\n\nEp. 10\t&quot;Apocalypse in Georgia&quot;\tFebruary 3, 2011\nBrad Meltzer and the team search for the true meaning of the mysterious Georgia\nGuidestones. Often called America's Stonehenge, this granite monument is located\non a remote hilltop outside Atlanta. Brad and the team examine the multilingual\nmessages carved into the stones for any clues to the monument's anonymous\ncreator, who's known only by the pseudonym -- J.C. Christian. The Decoded team\nchecks out rumors that the Guidestones are really the work of a secretive\nreligious sect called the Rosicrucians, who've been accused of practicing\nalchemy and mind control.\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n","torrent":{"xt":"urn:btih:36ccd00454be0762f9c1f3c0fdf615f4226f55cb","amp;dn":"Brad.Meltzer%5C%27s.Decoded.S01E02.Secret.Presidential.Codes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36ccd00454be0762f9c1f3c0fdf615f4226f55cb","infoHashBuffer":{"type":"Buffer","data":[54,204,208,4,84,190,7,98,249,193,243,192,253,246,21,244,34,111,85,203]},"announce":[],"urlList":[]}}