{"title":"The Cars - You Might Think [promo].VOB","uid":6166626,"size":229201920,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:36fb6c3fc723957d19058f1172698707f15a3478&amp;dn=The+Cars+-+You+Might+Think+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1297412679,"description":"The Cars - You Might Think [promo].VOB\n\n\nVery HQ rare promo music video. &quot;You Might Think&quot; is a single by The Cars from their fifth studio album, Heartbeat City, which came out in 1984. The track was written by Ric Ocasek, and produced by Mutt Lange and The Cars. Ocasek sang lead vocals.\n\nThe track was the first single to be released off Heartbeat City. Thanks in part to a striking video, &quot;You Might Think&quot; became a substantial hit in the US (peaking at #7) and in Canada (peaking at #8). It also peaked at #1 on the Mainstream Rock Tracks chart in the US, the first song by the band to do so. In the UK, however, the track only made it to #88 on the pop charts.\n\nThis music video is one of the first videos to use computer graphics. The video features band leader Ric Ocasek and model Susan Gallagher in a series of encounters. Ocasek appears in her bathroom mirror, in her mouth, as a fly, and as the Robot Monster, among other incarnations.\n\n&quot;You Might Think&quot; won the first MTV Video Music Award for Video of the Year and was nominated for five more awards (best special effects, best art direction, viewer's choice, best concept video, and most experimental video) at the 1984 MTV Video Music Awards. The video also won five awards (best overall, best conceptual, most innovative, best editing, and best special effects) at Billboard's 1984 Video Music Awards and four awards (best achievement in music video, best editor in music video, best engineer in music video, and best camera in music video) at the Videotape Production Association's 1985 Monitor Awards.\n\nJeff Stein and partners/founders at/of production/VFX company Charlex, Alex Weil and Charlie Levi, directed and produced the video. Danny Rosenberg and Bill Weber served both as editors and video engineers, Kevin Jones was the lighting director, Danny Ducovny the cinematographer and Bob Ryzner the art director. This video cost $80,000 to make which was almost triple the average music video budget of the time.\n\nThe model in this video is often mistaken with Ocasek's future wife, Paulina Porizkova, although there is little resemblance. Porizkova appears in the video of &quot;Drive&quot;.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/You_Might_Think&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/You_Might_Think&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/AADnPaADM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/AADnPaADM&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8250kbps\n   Audio: PCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:03\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated September 7, 2010!\n\n*Media Player Classic Home Cinema*        &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n","torrent":{"xt":"urn:btih:36fb6c3fc723957d19058f1172698707f15a3478","amp;dn":"The+Cars+-+You+Might+Think+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36fb6c3fc723957d19058f1172698707f15a3478","infoHashBuffer":{"type":"Buffer","data":[54,251,108,63,199,35,149,125,25,5,143,17,114,105,135,7,241,90,52,120]},"announce":[],"urlList":[]}}