{"title":"LFO - Summer Girls","uid":5005706,"size":150648836,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:370208ad72c8dc68dabacc42ecb9f57149d6f7b9&amp;dn=LFO+-+Summer+Girls&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1247721479,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Summer Girls&quot; is a song by the pop group LFO that reached the Top 30 in the US on July 13, 1999 and peaked at #3 on August 17, 1999.\n\nThe song was writen by Rich Cronin, Dow Brain, and Brad Young. Cronin said that the song included numerous inside jokes, and that he never anticipated its success. He claims this is due to the fact that the song was made strictly for a demo tape, but was leaked to a radio station. Many of the song's rhyming lines appear to be randomly inserted. It is considered the most popular song of the boy band.\n\n&quot;Summer Girls&quot; is often identified by one of the lines in the chorus: &quot;I like girls that wear Abercrombie and Fitch&quot; and &quot;You look like a girl from Abercrombie and Fitch.&quot; The song was also featured in the movie Longshot, in which LFO appeared.\n\nCultural references in the song include: Cherry Coke, Home Alone, Macaulay Culkin, Alex P. Keaton, New Edition, Footloose, New Kids on the Block, Beastie Boys, Larry Bird, William Shakespeare, Abercrombie and Fitch, Michael J Fox, Cherry Pez, Paul Revere, Kevin Bacon, Mr. Limpet, Chinese Food, pogo sticks, Candy Girl, The Color Purple and Fun Dip.\n\nRapper Eminem parodied the song's chorus in his track, &quot;Marshall Mathers&quot;, from his 2000 album The Marshall Mathers LP.\n\nLyte Funky Ones (LFO) is an American three-man pop/rap group consisting of Rich Cronin, Devin Lima (born Harold Lima, March 18, 1977), and Brad Fischetti (born September 11, 1975). Before Lima joined the group in 1999, the third member was Brian Gillis, known as &quot;Brizz-ly Bear&quot;, who was with the group from its start in 1995. The band is best known for their hit songs &quot;Summer Girls&quot; and &quot;Girl on TV&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:370208ad72c8dc68dabacc42ecb9f57149d6f7b9","amp;dn":"LFO+-+Summer+Girls","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"370208ad72c8dc68dabacc42ecb9f57149d6f7b9","infoHashBuffer":{"type":"Buffer","data":[55,2,8,173,114,200,220,104,218,186,204,66,236,185,245,113,73,214,247,185]},"announce":[],"urlList":[]}}