{"title":"Kim Larsen &amp; Bellami-4 album","uid":4991370,"size":235909699,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:385c6e1a3140af2008a056bb1ecfc6afaa324aa3&amp;dn=Kim+Larsen+%26+Bellami-4+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1247062148,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\n\nVA-The Motown Story-25 Years Of Great Original Hits-cd 1-6\n\nKim Larsen (born October 23, 1945 in Copenhagen) is a Danish rock musician.\nInspired by The Beatles and rock and roll, Larsen began as a songwriter and guitarist. In 1969 he met Franz Beckerlee and Wili JÃƒÂ¸nsson, and the three founded Gasolin' which, later joined by drummer SÃƒÂ¸ren Berlev, became one of the most successful Danish rock bands. The band dissolved in the late 1970s and has always refused to reform although they remain very popular decades after their seventies heyday, which has contributed to their myth and magic. In 2006, the documentary movie Gasolin' directed by Anders ÃƒËœstergaard, gave the history of the band and became a big hit in Denmark.\nIn the 1970s, following trends found in North America and the United Kingdom, Danish popular music styles began to diverge and audiences fragment. Many rock musicians in Denmark began to compose music and texts that reflected more realistic Danish social settings and ideals. Danish musicologist Charlotte RÃƒÂ¸rdam Larsen states that in the 1970s, Danish groups such as Kim Larsen's Gasolin' gave Danish music a special Danish rhythm and significance, linguistically, if not wholly distinct musically from international styles.\nKim Larsen released a number of solo albums in the eighties, topping in 1983 with the album Midt om natten (In the Middle of the Night), which became the most sold Danish music album in history, with more than 532,000 copies sold. In 1986, he founded the band Kim Larsen &amp; Bellami and released four albums until 1992, when the band broke up. He then released another solo album, Hvem kan sige nej til en engel (Who Can Say No To An Angel). In 1995, Larsen moved to Odense, the main city of the island of Funen, and found new success with his new band, Kim Larsen &amp; Kjukken and the Swedish producer Max Lorentz.\nKim Larsen has had a number of successful album releases throughout the 80s, 90s and 00s and is possibly the most successful artist in Danish popular music history. As a solo artist, Larsen has sold approximately 3 million records, a remarkable feat considering Denmark's total population of approximately 5.4 million people (as of 2005). In the 2000s Larsen remains a top concert draw and continues to be very popular in Denmark and elsewhere in Scandinavia.\n\n","torrent":{"xt":"urn:btih:385c6e1a3140af2008a056bb1ecfc6afaa324aa3","amp;dn":"Kim+Larsen+%26+Bellami-4+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"385c6e1a3140af2008a056bb1ecfc6afaa324aa3","infoHashBuffer":{"type":"Buffer","data":[56,92,110,26,49,64,175,32,8,160,86,187,30,207,198,175,170,50,74,163]},"announce":[],"urlList":[]}}