{"title":"Wimbledon el Amor esta en Juego[DVDRip][Spanish].avi","uid":6145290,"size":735606784,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3885af38cc760b4ff222f4f3b561b30c122a8524&amp;dn=Wimbledon+el+Amor+esta+en+Juego%5BDVDRip%5D%5BSpanish%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"erato99","files":1,"time":1296651957,"description":"Calidad de video: DVD RIP\nPeso: 701 mb\nIdioma del audio: espaÃƒÂ±ol \n\nPeter Colt (Paul Bettany) es un jugador de tenis britÃƒÂ¡nico que nunca consiguiÃƒÂ³ realizar su sueÃƒÂ±o, llegar a la cumbre y ser una gran estrella internacional. AlcanzÃƒÂ³ el puesto undÃƒÂ©cimo de la clasificaciÃƒÂ³n mundial, pero el veterano profesional empezÃƒÂ³ a perder la confianza en sÃƒÂ­ mismo y bajÃƒÂ³ hasta quedarse en el puesto 119. EstÃƒÂ¡ a punto de retirarse cuando el destino le da un comodÃƒÂ­n: podrÃƒÂ¡ participar en el torneo de Wimbledon por ÃƒÂºltima vez. Dicho sea de paso, tambiÃƒÂ©n serÃƒÂ¡ su ÃƒÂºltimo torneo. Peter Colt estÃƒÂ¡ a punto de dejar el tenis profesional y de irse a trabajar a uno de esos clubes donde un montÃƒÂ³n de mujeres maduras dan clases de tenis entre limpiezas de cutis y cÃƒÂ³cteles. La estadounidense Lizzie Bradbury (Kirsten Dunst) es la joven estrella, la nueva chica mala de las pistas internacionales que pisa Wimbledon por primera vez. Concentrada, decidida, controlada y entrenada al mÃƒÂ¡ximo por Dennis (Sam Neill), su padre y entrenador, Lizzie no permite que nada se interponga en su camino, ni una equivocaciÃƒÂ³n de un juez de lÃƒÂ­nea, ni una pelota inesperada y menos aÃƒÂºn un romance sin importancia con otro campeÃƒÂ³n en alza, el americano Jake Hammond (Austin Nichols). El futuro de Lizzie ya estÃƒÂ¡ escrito: serÃƒÂ¡ la mejor tenista del mundo, una campeona del Grand Slam. No tiene mÃƒÂ¡s sueÃƒÂ±o que ÃƒÂ©se, y ganar Wimbledon serÃƒÂ­a el comienzo ideal. Los planes de Peter para un retiro tranquilo se quedan en suspenso cuando llega a las sacrosantas canchas del Club de tenis sobre hierba y croquet de Wimbledon. Lizzie y Peter se cono-cen por casualidad, acaban teniendo una aventura y ÃƒÂ©l hace lo im-pensable, gana su primer partido. Empujado por una mezcla de suerte, amor y habilidad con la raqueta, Peter sigue ganando partidos mientras sus seguidores y los periodistas deportivos redescubren a la vieja gloria...\n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:3885af38cc760b4ff222f4f3b561b30c122a8524","amp;dn":"Wimbledon+el+Amor+esta+en+Juego%5BDVDRip%5D%5BSpanish%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3885af38cc760b4ff222f4f3b561b30c122a8524","infoHashBuffer":{"type":"Buffer","data":[56,133,175,56,204,118,11,79,242,34,244,243,181,97,179,12,18,42,133,36]},"announce":[],"urlList":[]}}