{"title":"Corbin Fisher - - - Gabe Fucks TJ ((MictrmbL))","uid":5029069,"size":280223035,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:394d96ab8f5addca039b60af0e7a09396bfd56b1&amp;dn=Corbin+Fisher+-+-+-+Gabe+Fucks+TJ+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mictrmbl","files":48,"time":1248827104,"description":"From the vaults of Corbin Fisher:\n\n\nI wish I could set the website to play some grand, triumphant orchestral music as this video comes online. It'd be a fitting accompaniment for the video that's being unleashed here!\n\nMany believed it would never happen (hell, I didn't for quite the longest time!), but it's finally here! Gabe fucks another guy! And boy, does he ever fuck him!\n\nWhen Gabe engaged in his first ever guy/guy sexual contact with Dawson in their bi and blowjob videos, I had mixed feelings. Firstly, I was thrilled and overwhelmed. At the same time, however, I was freaking out! What if that was as far as it went?! What if a BJ from a guy was all we'd ever see Gabe do with another man?! What if that video ended up teasing and leading us all on more than anything else?! Certainly, seeing a stud like Gabe get his first ever BJ from a guy after being on the site for so long, while tremendous and insanely exciting, has the capacity to be insanely frustrating if that's as far as it ever goes!\n\nBut, as we see here, it wasn't as far as it'd go! It took a good long while to get Gabe to agree to the next step, but things finally started looking good for precisely that scenario and when it came time for us to take a trip up to the rural farm with a bunch of the guys, I asked Gabe if he'd join us and give topping a try while there. My winning smile (and checkbook!) made it happen, and I couldn't be more excited!\n\nWe finally get to see that big, thick dick of Gabe's plowing another guy's hole! We finally get to see Gabe going at it in some hardcore man-on-man action! I knew I had to pair him up with a fellow straight stud that had proven himself not only able to bottom and bottom well, but also bottom for a big dick! TJ was the perfect candidate, as few guys look as hot as he does while getting fucked. Further, TJ just looks hotter and hotter every time he appears in a new video! He's obviously been hitting the gym and has one of the tightest, most toned, perfectly-proportioned bodies on the site - a body that would look fantastic all tensed up and bent over, taking Gabe's big dick!\n\nThese guys compliment each other wonderfully, both having dark features, amazing bods, thick cocks, and being proven studs.\n\nYou can tell Gabe's a bit nervous in this video, but he's also quite the trooper and once he gets into just how great a man's tight ass feels wrapped around that thick dick, he's fully into fucking away! I also think that Gabe found himself pretty astonished another man was handling that dick of his in their ass!\n\nBut I suspect, as with any video of this magnitude, you stopped reading this intro long ago and went right to viewing it. I can't blame ya! So I'll shut up and now, to those of you still reading... enjoy this landmark CF video!","torrent":{"xt":"urn:btih:394d96ab8f5addca039b60af0e7a09396bfd56b1","amp;dn":"Corbin+Fisher+-+-+-+Gabe+Fucks+TJ+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"394d96ab8f5addca039b60af0e7a09396bfd56b1","infoHashBuffer":{"type":"Buffer","data":[57,77,150,171,143,90,221,202,3,155,96,175,14,122,9,57,107,253,86,177]},"announce":[],"urlList":[]}}