{"title":"zeitgeist.I.&amp;.II-RC","uid":6141270,"size":1470280604,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:39690eabe70fc6fca93a4e8a986a463eaa42eb2b&amp;dn=zeitgeist.I.%26.II-RC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cable.guy","files":2,"time":1296507230,"description":"Zeitgeist (2007)\n\nDocumentary about\na) the origin of christian faith\nb) how american banks have seized worldpower at the beginning of the 20th century\nc) how these 2 items are related to the wars fought in the 20th and 21st century.\n\n\n\n\n\nZeitgeist: Addendum(2008)\n\nThere were too many mistakes and (il)logical jumps in the first movie that it deservedly was attacked by critical thinkers worldwide. This one is not without it\\\\\\'s flaws either, but it is less dogmatic, there are more interviews and the message you get out of it is a clearer one.\n\nThe movie is divided into four parts: Part 1 deals with the current monetary system and its flaws. In my opinion it presents things in an oversimplified manner and occasionally grossly misinterprets socio-economic principles. Still, it is interesting food for thought. 2/5\n\nPart 2 continues from the first part with an interview with John Perkins, in which he reflects on his role as a self-described economic hit-man. Again, not so challenging. More scare-mongering than substance. 2/5\n\nPart 3 introduces The Venus Project, a proposal created by Jacque Fresco for a sustainable future. This is a lot more interesting and thought-provoking although a lot of its principles appear rather weak upon closer examination. Regardless of that, the issues that are raised are very real and the message is that they should be thought about and something should be done about them fast. 4/5\n\nPart 4 examines the emergent and symbiotic aspects of natural law and what it means for humans. Again, quite an interesting treatment of an important subject. 5/5","torrent":{"xt":"urn:btih:39690eabe70fc6fca93a4e8a986a463eaa42eb2b","amp;dn":"zeitgeist.I.%26.II-RC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39690eabe70fc6fca93a4e8a986a463eaa42eb2b","infoHashBuffer":{"type":"Buffer","data":[57,105,14,171,231,15,198,252,169,58,78,138,152,106,70,62,170,66,235,43]},"announce":[],"urlList":[]}}