{"title":"Leaving The Cult (aka Join Us)","uid":5604318,"size":799982465,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3a2c8df1c1586b39bed0476a50ccc016927b4801&amp;dn=Leaving+The+Cult+%28aka+Join+Us%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Porkster","files":1,"time":1275502071,"description":"From the makers of 'Dig' and 'We Live In Public', comes Join-Us.\n\nGiven their pathological religiosity and curiously durable naivety, it's no wonder Americans have made their country the world capital of cults. There are now more than 5000 cult groups in the US, their members numbering between 10 million and 15 million. This powerful documentary looks at just one group, the Mountain Rock Church, and the chaos it wreaks in the lives of four families.\n\nBased in South Carolina, the church is run by Pastor Raimund Melz, a whip-thin, German-born preacher who, with his wife Deborah, exerts almost complete control over followers. Melz bills himself as an apostle, prophet, evangelist, pastor and teacher, the only source of truth and the sole road to salvation.\n\nBut he has also become the centre of his acolytes' temporal world. Having built their homes in the church compound, called The Heritage, church members hand them over to Melz (on orders from the Lord, naturally), from whom they must then rent them back. Emptied out by fear and filled back up with guilt, church members are, in effect, reduced to infantilism, unable to think or act for themselves. You have to have him [Melz] point out the sin, former follower Tonya Rogers says, because you're a dumb baby, you're a dumb sheep . . . so he has to be the one, 'cause he hears from God.\n\nBreaking away is akin to getting off heroin; a long, wrenchingly painful journey that has been captured artfully by filmmaker Ondi Timoner. (Interestingly, Timoner's 2004 rock'n'roll doco, DiG!, dealt in part with singer Anton Newcombe and the seemingly maniacal control he had over his band members in the Brian Jonestown Massacre.) The film also points out the changing dynamic of cults, from the huge, Moonie-type groups of the 1970s to smaller units led and supported by ostensibly 'normal' people.\n &lt;a href=&quot;\nhttp://www.joinusthemovie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.joinusthemovie.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.interloperfilms.com/about.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.interloperfilms.com/about.htm&lt;/a&gt;\n\nWARNING: this is a nasty piece of propaganda trying to get Christians to think being normal is being in the matrix. Don't you get the picture they always attack Christian groups!  If you're not yoked to the TV and Brittany Spears news, then you're in a cult!!!\n\n\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED TO PASS ON THE MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Get The Message Out, Openly!\n* Copy Our Torrents To All Open Trackers!!!\n","torrent":{"xt":"urn:btih:3a2c8df1c1586b39bed0476a50ccc016927b4801","amp;dn":"Leaving+The+Cult+%28aka+Join+Us%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a2c8df1c1586b39bed0476a50ccc016927b4801","infoHashBuffer":{"type":"Buffer","data":[58,44,141,241,193,88,107,57,190,208,71,106,80,204,192,22,146,123,72,1]},"announce":[],"urlList":[]}}