{"title":"Reba McEntire - Reba Duets (2007) [Country][mp3 320][schon55]","uid":5104191,"size":106707947,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3a9d604de57c61a5d4a656075d8d3b855708ca7f&amp;dn=Reba+McEntire+-+Reba+Duets+%282007%29+%5BCountry%5D%5Bmp3+320%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":16,"time":1254240073,"description":"Reba McEntire - Reba Duets \nLabel: MCA Nashville \nOrig Year: 2007 \nStreet Date: Sep 18, 2007 \nQuality: 320 kbps\n\nCountry stalwart Reba McEntire teams up with a host of great singers for her first new full-length release since 2003, enlisting luminaries from both pop (Don Henley, Carole King, Kelly Clarkson) and country (Trisha Yearwood, Faith Hill, Kenny Chesney). \n\nFrom the moment you hear the voice, you know it: fierce and powerful, clear and passionate, a voice that has sold 49 million records, a voice that could belong to no one else but the woman millions of fans the world over know only as Reba.  So what do you do when you're the owner of that iconic voice -- and the embodiment of a genre-bending artistic presence that spans the worlds of music, screen and stage? If you're Reba McEntire, you find creative soul mates in 11 other amazing voices and produce a groundbreaking collection of music simply titled Reba Duets.  Or, as McEntire herself might describe it, you gather up some friends old and new, and have a party - oh, and make an amazing new album at the same time.  &quot;It was like a family reunion.  It was just so much fun!&quot; says the easygoing superstar.  And the results? &quot;Well, I'm just so tickled!&quot; she says with her trademark Southern charm.  &quot;I can't wait for everyone to hear it. &quot; Duets was a long time coming, says McEntire.  &quot;You have to keep creating things, thinking about what's next and how to keep it fresh for your fans,&quot; she says.  &quot;I've always thought a duets album would be a great thing to get to do, and the timing was finally right to make it happen.&quot; \n\nFrom the Artist\nAs McEntire sees it, amazing songs have little to do with genre, and everything to do with emotion and nuance.  &quot;I've been a fan of different kinds of music all my life,&quot; she says.  &quot;I really don't like to categorize music.  To me, there's only two categories: good and bad.  And I try to sing the good songs, and listen to good music.  When it touches my heart, and I can deliver it with all my heart and soul, then it's a good Reba McEntire song.  In the end, I want all the songs to touch my listener's hearts. &quot; It's that devotion to making quality music that brings her audience back to Reba again and again.  &quot;The great thing about it is, my fans have always continued to go along with me on these journeys I take, whether it's television, music, Broadway or movies.  They really hang in there with me, and I sure do appreciate that.  It's been a good journey. &quot; The next chapter on that journey is about to begin, with Duets - and the amazing music created when Reba's signature voice finds new harmony with a few stellar friends.  &quot;I hope people are going to be caught up in the moment of listening to this music,&quot; says McEntire.  &quot;There's a lot of love in this record, because I love these people that I get to sing with.  And I think people are going to love it, too.  I honestly do.&quot;\n\nI guarantee you that this is an album you will want in your collection. Reba, one of the leading female country vocalists of our time, has teamed with 11 of the greatest voices in music today to produce an amazing new CD. I don't think I have ever been more excited for a CD release...Reba has chosen not only 11 excellent duet partners, but 11 superb songs...songs about divorce ( &quot;Every Other Weekend&quot; ), dealing with an alcoholic spouse ( &quot;She Can't Save Him&quot; ), blame and accusation ( &quot;Because of You&quot; ), heartbreak ( &quot;Break Each Other's Hearts Again&quot; ) and even maintaing your romantic ideals despite challenges ( &quot;Faith in Love&quot; ). I got my new CD today and absolutely love it! There is not, in my opinion, a bad song on it. Each song can somehow touch SOMEBODY...and there's sure to be a huge appreciation for not only Reba herself, but how well she blends with other her duet partners. The first single with Kelly Clarkson, &quot;Because of You,&quot; has made a huge impression at country radio...their voices blend together perfectly and the orchestral arrangment soars as they effortlessly deliver this cover of Clarkson's self-penned 2005 pop hit. It would be impossible for me to list my favorites, however...seeing as I truly do love each one! But I am especially partial to &quot;Every Other Weekend&quot; and &quot;Sleeping with the Telephone.&quot; So get this CD, listen to it, enjoy it, and share it. As Reba herself says in the editorial section, there is a lot of love on this record, because she really loves everyone she got to sing with. You will, too!!! ~ Patrick Gilchriest\n\nReba McEntire - Reba Duets Tracks:\n01  When You Love Someone Like That (with LeAnn Rimes) \n02  Does The Wind Still Blow In Oklahoma (with Ronnie Dunn) \n03  Because Of You (with Kelly Clarkson) \n04  Faith In Love (with Rascal Flatts) \n05  She Can't Save Him (with Trisha Yearwood) \n06  Everyday People (with Carole King) \n07  Every Other Weekend (with Kenny Chesney) \n08  These Broken Hearts (with Vince Gill) \n09  Sleeping With The Telephone (with Faith Hill) \n10  Only Promise That Remains, The (with Justin Timberlake) \n11  Break Each Others Hearts Again (with Don Henley)","torrent":{"xt":"urn:btih:3a9d604de57c61a5d4a656075d8d3b855708ca7f","amp;dn":"Reba+McEntire+-+Reba+Duets+%282007%29+%5BCountry%5D%5Bmp3+320%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a9d604de57c61a5d4a656075d8d3b855708ca7f","infoHashBuffer":{"type":"Buffer","data":[58,157,96,77,229,124,97,165,212,166,86,7,93,141,59,133,87,8,202,127]},"announce":[],"urlList":[]}}