{"title":"Escape Pod, Podcastle, Pseudopod - Complete Short Fiction Podcas","uid":6275922,"size":17913895327,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3aea2c397e7c0f9dd66aaf7f490c13f715e31b16&amp;dn=Escape+Pod%2C+Podcastle%2C+Pseudopod+-+Complete+Short+Fiction+Podcas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"leonster","files":813,"time":1301253032,"description":"This is the NEW, updated, and CORRECT complete archives until March 27, 2011, of the three short fiction podcasts produced by Escape Artists.\n\nThe three podcasts are:\nESCAPE POD - for Science Fiction short stories.\nPODCASTLE - for Fantasy short stories.\nPSEUDOPOD - for Horror short stories.\n\nThere's some excellent, excellent stories available on them.  Episodes are complete stories each, and vary from about 20 minutes to about 40 minutes, usually.  Quite impressively, they pay the authors for the stories, so they tend to get very high quality stories.  Some of the most famous authors whose work is represented include Heinlein, Asimov, Resnick, Doctorow, Silverberg, Nix, Beagle, Poe, and Lovecraft.  There are also tons of new names getting published here with stories just as good.\n\nThe files are separated into folders so, if you wish, you can choose to download only the genre of podcasts you want.\n\nFeel free to load these up on your MP3 player/iPod! These files are legal to download, as they were released under a Creative Commons license making them free to redistribute (although not to make derivative works from them).  I think the site would actually appreciate the increased exposure this torrent could bring, and also appreciate the fact it would be taking a load off their servers for back episodes.  (Note: I am in no way personally connected with the site, merely a happy new listener.)\n\nYou can visit the main website for these podcasts at:  &lt;a href=&quot;\nhttp://escapepod.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://escapepod.org/&lt;/a&gt;  &lt;a href=&quot;\nhttp://podcastle.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://podcastle.org/&lt;/a&gt;  &lt;a href=&quot;\nhttp://pseudopod.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pseudopod.org/&lt;/a&gt;\n\nPlease subscribe to them and support them if you appreciate the great work they're doing!\n\n\n\n\nVery sorry if you tried to get this earlier.  This is my first torrent to upload (rather than download and seed), so I had some kinks to work out.  It's been corrected now though with this file! :)","torrent":{"xt":"urn:btih:3aea2c397e7c0f9dd66aaf7f490c13f715e31b16","amp;dn":"Escape+Pod%2C+Podcastle%2C+Pseudopod+-+Complete+Short+Fiction+Podcas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aea2c397e7c0f9dd66aaf7f490c13f715e31b16","infoHashBuffer":{"type":"Buffer","data":[58,234,44,57,126,124,15,157,214,106,175,127,73,12,19,247,21,227,27,22]},"announce":[],"urlList":[]}}