{"title":"Allen-Your Home(government socialist control of housing)","uid":5094716,"size":1197540,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3b28871c9d8a323117792f170ad46b6162fb81c2&amp;dn=Allen-Your+Home%28government+socialist+control+of+housing%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1253457286,"description":"This Gary Allen's shocking booklet Your Home which examines US government's socialist program at controlling housing, mortgages and housing credit. The concept of every family having the opportunity to own a home has been a cornerstone of American tradition since colonial days. Home ownership has been basic both to free enterprise system and family life. For generations young families have dreamed and planned and saved to acquire their own house. But today those young couples are facing obstacles that threaten to make home ownership impossible for them. Propelled by inflation and the added cost of meeting requirements imposed by environmentalists and land planners, the price of housing is spiraling upward like a Fourth of July rocket. Millions of would-be homeowners have already been priced out of the home market, and soon only the wealthy may be able to afford to purchase a new house. Not long ago, American families could allot twenty-five percent of their income for housing, but now the figure has escalated to over one-third. And if the planners and bureaucrats have their way the whole character of our housing will soon be changed so that the typical American family will be shoved into a high-density dwelling in the style of the New York ant heap. Communal-apartment housing is the goal the planners have set for you and your family, and for as much of Middle America as can be driven into it. 15 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:3b28871c9d8a323117792f170ad46b6162fb81c2","amp;dn":"Allen-Your+Home%28government+socialist+control+of+housing%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b28871c9d8a323117792f170ad46b6162fb81c2","infoHashBuffer":{"type":"Buffer","data":[59,40,135,28,157,138,50,49,23,121,47,23,10,212,107,97,98,251,129,194]},"announce":[],"urlList":[]}}