{"title":"The Romantics - Talking In Your Sleep  (2nafish)","uid":5622092,"size":137691140,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3b9b26047db5c9a2c8fce7332627acda059dfde5&amp;dn=The+Romantics+-+Talking+In+Your+Sleep++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1276318461,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Talking in Your Sleep&quot; is a popular song by The Romantics. It was a US hit in 1983 and became a UK hit the following year for British band Bucks Fizz.\n\nThe song appeared on the Romantics' 1983 album In Heat and was the Romantics' biggest chart hit, garnering substantial radio airplay and sales. The song reached #3 on the Billboard Hot 100 in February 1984. It also went to #1 on the Hot Dance Club Play chart in the U.S., where it remained on top for two weeks. In Australia, Talking in Your Sleep climbed to #14 on the Australian Singles Chart (Kent Music Report). The song's music video, widely aired at the time on MTV and elsewhere, featured the band performing while surrounded by standing, but seemingly sleeping women who were dressed in lingerie, pajamas, and other sleepwear.\n\nThe single was unsuccessful in the UK, but a year later, the song became famous when pop group Bucks Fizz covered it and reached No.15 on the UK singles chart. Their version was produced by Andy Hill and featured on their fourth album, I Hear Talk. It was also released as a limited-edition EP, which included the live tracks &quot;Twentieth Century Hero&quot; and a cover of &quot;Don't Pay the Ferryman&quot;.\n\nThe Romantics are an American rock  band from Detroit, Michigan, formed in 1977. The band adopted the name &quot;The Romantics&quot; because they formed on Valentine's Day, 1977. The Romantics achieved moderate popularity in the United States, Canada, parts of Asia, Australia, Europe, and Latin America during the first half of the 1980s on the strength of the band's catchy, energetic songs and stylish, memorable music videos. Influenced by 1960s British Invasion rock (most notably the music of the Kinks, the Who, the Beatles, the Hollies, and the Rolling Stones), 1970s Detroit garage rock and hard rock (as represented by such performers as Iggy Pop, the Stooges, the MC5, and the Rationals), and the punk rock of the Ramones, The Romantics play a more pop-oriented variation of punk rock known as power pop. The band is also commonly classified into the category of &quot;New Wave&quot; (probably due more to the band's image and era than the sound of its music) by pop music historians.\n\nIn Heat is the fourth album by The Romantics. It was released in 1983 on Nemperor Records. It was the Romantics' most commercially successful album, and featured two Top Ten hit singles: &quot;Talking in Your Sleep&quot; and &quot;One in a Million&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:3b9b26047db5c9a2c8fce7332627acda059dfde5","amp;dn":"The+Romantics+-+Talking+In+Your+Sleep++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b9b26047db5c9a2c8fce7332627acda059dfde5","infoHashBuffer":{"type":"Buffer","data":[59,155,38,4,125,181,201,162,200,252,231,51,38,39,172,218,5,157,253,229]},"announce":[],"urlList":[]}}