{"title":"Discovery-Discovering Ardi (2009).WS-PDTV.XviD.Ekolb","uid":5121716,"size":732369514,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3c324b65d689634832d6e1279834bf46176c9ea8&amp;dn=Discovery-Discovering+Ardi+%282009%29.WS-PDTV.XviD.Ekolb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ekolb","files":2,"time":1255382407,"description":"DISCOVERING ARDI (2009)\nChanging Our Understanding of Human Origins\nAir Date: Sunday, October 11 at 9 PM (ET/PT)\n\nFor those who've managed to avoid the news, paleontologists uncovered a 4.4-million-year-old find that represents &quot;the fossil evidence Darwin could only have dreamed of,&quot; as the narrator puts it -- an early transitional biped, nicknamed &quot;Ardi&quot; (short for Ardipithecus), predating the previous benchmark, the Australopithecus Lucy, by 1.2 million years.\n\nArdi walked on two feet, but also had an enlarged toe that helped her clamber into trees -- essentially blowing up much of what we thought we knew about the evolutionary rungs between chimps or similar primates and homo sapiens.\n\nPaleontologist Tim White and other members of the international research team -- who have been at the project for more than 15 years -- are interviewed, and they sound like kids in a candy store discussing the oldest hominid skeleton ever unearthed. But some of the most striking material involves digital recreations that show not only how Ardi looked, but speculate as to how she moved -- and what that might mean for human evolution.\n\nThe scientific investigation began in the Ethiopian desert 17 years ago, and now opens a new chapter on human evolution, revealing the first evolutionary steps our ancestors took after we diverged from a common ancestor we once shared with living chimpanzees. &quot;Ardi's&quot; centerpiece skeleton, the other hominids she lived with, and the rocks, soils, plants and animals that made up her world were analyzed in laboratories around the world, and the scientists have now published their findings in the prestigious journal Science.\n\n&quot;Ardi&quot; is now the oldest skeleton from our (hominid) branch of the primate family tree. These Ethiopian discoveries reveal an early grade of human evolution in Africa that predated the famous Australopithecus nicknamed &quot;Lucy.&quot; Ardipithecus was a woodland creature with a small brain, long arms, and short legs. The pelvis and feet show a primitive form of two-legged walking on the ground, but Ardipithecus was also a capable tree climber, with long fingers and big toes that allowed their feet to grasp like an ape's. The discoveries answer old questions about how hominids became bipedal.\n\nFormat            : AVI\nLength            : 698 MiB for 1h 27mn 58s 278ms\nCodec             : XviD\nSource            : PDTV\nLanguage          : English\nSubtitles         : None\n\nVideo #0          : MPEG-4 Visual at 967 Kbps\nAspect            : 576 x 336 (1.714) at 29.970 fps\n\nAudio #0          : MPEG Audio at 129 Kbps\nInfos             : 2 channels, 48.0 KHz\n\nEnjoy!\nEkolb","torrent":{"xt":"urn:btih:3c324b65d689634832d6e1279834bf46176c9ea8","amp;dn":"Discovery-Discovering+Ardi+%282009%29.WS-PDTV.XviD.Ekolb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c324b65d689634832d6e1279834bf46176c9ea8","infoHashBuffer":{"type":"Buffer","data":[60,50,75,101,214,137,99,72,50,214,225,39,152,52,191,70,23,108,158,168]},"announce":[],"urlList":[]}}