{"title":"The Joy of Teen Sex S01E02    EoD","uid":6138076,"size":209550386,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3de709285f2c52fd29189919c37efccf1f2cc2d9&amp;dn=The+Joy+of+Teen+Sex+S01E02++++EoD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"5150EOD","files":-1,"time":1296348376,"description":"             The Joy of Teen Sex\n\n\n2011\n\n\nA bold, informative look at the love lives and sex lives of teenagers that tells it like it really is, and is definitely not just for teens\n\n\n\nSeason 1  Episode 2\n\n\n\n\nTwo teens who hate their boobs pay a visit to Dr Rachael. Ruth meets a young man with a phobia of vaginas. And Billie investigates the glamour industry.\n\nMelissa (20) has inverted nipples, while Jamie (16) worries that her nipples are too big. Rachael tries to allay their fears, and offer Melissa advice on how she can have her inverted nipples corrected.\n\nIn the Sex Advice Shop, Ruth meets Michaela (20) and her boyfriend Luke (22). The pair are engaged to be married, but there's one problem threatening to create a wedge in their relationship, Luke cannot bring himself to perform oral sex on his fiancÃƒÂ©e as he has a phobia of vaginas. Desperate to make Michaela happy, Lukes takes a masterclass in female anatomy from sex coach Joanna, and visits a sculptor who helps him get to grips with Michaela's vagina in a whole new way.\n\nChloe (19) and Louis (20) face an altogether different kind of obstacle. They've been together for three years and have an active sex life everywhere (including up trees!). But not at Louis' house - his parents can't come to terms with the fact that the couple are sexually active, and Chloe has to sleep on the sofa. They want to broach the subject with Louis' parents, but have no idea how to do so without upsetting them. Ruth is on hand to offer some practical advice on how to have a frank discussion with them.\n\nAlso in the programme, 19-year-old Luke gets some tips on bondage from Joanna to help spice up his sex life; Mo talks to Dr Rachael about premature ejaculation and how he can overcome it; and Harriet wants to know just how painful it's going to be when she loses her virginity.\n\nBillie JD Porter investigates the glamour industry to see why teenage girls are so ready to bare their assets and perhaps even to pay their way through higher education with a stint as a lap dancer.\n\n\n\n\n\n\n\n\n                                 ****EOD****\n\n                         Even Firefighters need Heroes\n","torrent":{"xt":"urn:btih:3de709285f2c52fd29189919c37efccf1f2cc2d9","amp;dn":"The+Joy+of+Teen+Sex+S01E02++++EoD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3de709285f2c52fd29189919c37efccf1f2cc2d9","infoHashBuffer":{"type":"Buffer","data":[61,231,9,40,95,44,82,253,41,24,153,25,195,126,252,207,31,44,194,217]},"announce":[],"urlList":[]}}