{"title":"Gungrave Overdose [Ntsc], Ps2","uid":5113991,"size":2288915783,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:3e360ee2dba7817296a0488e9e42d54e02b1aa87&amp;dn=Gungrave+Overdose+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Big_dude","files":-1,"time":1254960518,"description":"Gungrave Overdose for the Ps2                                   Rel. 09/15/2004\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        Action/Anime\nRating:        M (Mature)\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with WinRar, Game was tested and work. \nTry 7zip its free google it, if don't have WinRar.\n\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n           \nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n         &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n         &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n        &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n        &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Tayio yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\n\nGame Description:\n\nIn my opinion this game is awesome, great anime fmv, graphics, &amp; action to boot.\n\nThree years after the events that took place in the original Gungrave, the Corsione family has unleashed the deadly drug SEED upon the populace. Now it's up to Grave, Spike and Mika to follow the trail of SEED back to its source and eradicate it once and for all.\n\nMuch like its predecessor, Gungrave: Overdose offers up several action-packed levels that simply don't allow the player to let up on the fire button. This sequel ups the ante with even larger hordes of enemies to blast through along with a slew of destructible environments to wreak havoc in. Along the way, Grave will team up with newcomers Juji and Billy. Juji fights using a unique combination of close-range guns and swordplay, while Billy defeats his enemies with the sheer power of his electric guitar.\n\nGungrave: Overdose features character designs by Yasuhiro Nightow (creator of the anime/manga Trigun) and Kosuke Fujishima (known for his work on Sakura Wars, Ah My Goddess, and the Tales series), and soundtrack composition by Tsuneo Imahori (composer for Trigun, Hajime no Ippo and the Gungrave anime series). This game was released by Mastiff as a budget-priced title.\n\nFeatures:\n\n* High-energy anime environment: Wreak havoc with guns, swords or a guitar that \n  shoots electricity - all set against a glorious, fully-destructible, cell-shaded \n  environment.\n\n* Three playable characters: Juji Kabane, a wrathful swordsman with incredibly  \n  deady close-up attack and Rocket Billy RedCadillac, a leath-clad rock star with \n  his electric shooting guitar join undead GunGrave hero Beyond the Grave.\n\n* Artistic points: Gain valuable points and unlock hidden moves by killing with \n  elegance.\n\n* The Beat Counter: Boost your destructive arsenal by using the Beat Counter to \n  monitor your rate of destruction, clear enemies quickly and replenish your \n  health.\n\n* Nine stages and 43 minutes of movies: the plot thickens, the stakes are higher \n  and the volume is more impressive than ever.\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x speed.\n\nUse Verbatim or Tayio Yuden DVD Media for best quality, or if other media\nisn't working.\n\n\nIf using DVD+R then booktype to DVD-ROM \n(If your mod-chip, or Ps2 doesn't support DVD+R).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\nEnjoy!\t","torrent":{"xt":"urn:btih:3e360ee2dba7817296a0488e9e42d54e02b1aa87","amp;dn":"Gungrave+Overdose+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e360ee2dba7817296a0488e9e42d54e02b1aa87","infoHashBuffer":{"type":"Buffer","data":[62,54,14,226,219,167,129,114,150,160,72,142,158,66,213,78,2,177,170,135]},"announce":[],"urlList":[]}}