{"title":"Codigos de guerra","uid":6183709,"size":733377489,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3e64c7b92caf9ee4546074fd8d7da281d654dae4&amp;dn=Codigos+de+guerra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fanclubt","files":2,"time":1298046639,"description":"Codigos de guerra.2002\n\nTÃƒÂ­tulo original: Windtalkers\n\nDuraciÃƒÂ³n: 135 minutos\n\nReparto: Nicolas Cage, Adam Beach, Christian Slater, Peter Stormare, Noah Emmerich, Mark Ruffalo, Brian Van Holt, Martin Henderson, Roger Willie\n\nProductora: Metro-Goldwyn-Mayer\n\nGÃƒÂ©nero: BÃƒÂ©lica\n\nSinopsis\n      8 de diciembre de 1941, Estados Unidos declara la guerra a JapÃƒÂ³n. Durante los siguientes aÃƒÂ±os las fuerzas americanas estaban totalmente concentradas en la batalla en el PacÃƒÂ­fico, tomando las islas una por una de forma lenta y con direcciÃƒÂ³n hacia las costas de JapÃƒÂ³n. Durante esta campaÃƒÂ±a brutal, el ejÃƒÂ©rcito japonÃƒÂ©s lograba romper constantemente las comunicaciones militares codificadas, lo que retrasaba el avance de las tropas estadounidenses. En 1942, se reclutaron cientos de indios navajos para que emplearan su idioma con el fin de que sus emisiones no pudieran ser descifradas por el enemigo japonÃƒÂ©s. Al marine Joe Enders se le asigna proteger a Ben Yahzee y a su CÃƒÂ³digo Navajo 'TalkerTM', una nueva arma confidencial de los marines. Las ÃƒÂ³rdenes de Enders son proteger el cÃƒÂ³digo y a su portador, pero si Yahzee es hecho prisionero por el enemigo, debe &quot;proteger el cÃƒÂ³digo a toda costa&quot;. Esta estrategia cumpliÃƒÂ³ una funciÃƒÂ³n determinante en la Batalla de Saipan cuando los marines tuvieron que proteger el cÃƒÂ³digo       y a sus portadores a cualquier precio.\n ","torrent":{"xt":"urn:btih:3e64c7b92caf9ee4546074fd8d7da281d654dae4","amp;dn":"Codigos+de+guerra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e64c7b92caf9ee4546074fd8d7da281d654dae4","infoHashBuffer":{"type":"Buffer","data":[62,100,199,185,44,175,158,228,84,96,116,253,141,125,162,129,214,84,218,228]},"announce":[],"urlList":[]}}