{"title":"La storia in giallo 003 - Jack lo Squartatore [Mp3 Ita] [TNTvill","uid":6249439,"size":45392096,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3ed58502485c8a8e805b39f8fb3b54780d54fc48&amp;dn=La+storia+in+giallo+003+-+Jack+lo+Squartatore+%5BMp3+Ita%5D+%5BTNTvill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darayava","files":1,"time":1300355736,"description":"La storia in giallo 003 - Jack lo Squartatore [Mp3 Ita] [TNTvillage]\n\n LA STORIA IN GIALLO\n\n\nLa Storia in giallo  ÃƒÂ¨ un programma in onda su radio3 scritto e condotto da Antonella Ferrera, con la regia di Francesco Pannofino, regia del dibattito di Manuel de Lucia, musiche originali di Alessandro Molinari, assistenza tecnica di Fiore Liborio, cura di Diana Vinci.\nRedazione: Carlo Dellonte e Roberto Ritondale Paola Veneto\nDa poco ha subito il mutamento nel nome diventando: Cuore di Tenebra\n\nLa storia e le storie di personaggi celebri, le vicende tragiche o misteriose che hanno segnato I loro destini e a volte quelli di molti altri. Uomini della politica o del malaffare, uomini di fede o vissuti nel peccato, personalita' borderline, mitomani o geni maledetti. Le devianze e I turbamenti di grandi artisti di tutti I tempi che hanno riversato nella loro opera la fatica o la follia del vivere.\nLa Storia in Giallo li racconta come in un film, attraverso le voci dei migliori doppiatori italiani. Dopo lo sceneggiato che catapulta l'ascoltatore al centro di una storia, segue l'intervista ad un personaggio della cultura che ne spiega e racconta dinamiche, curiositÃƒÂ  e risvolti inediti.\n\n\nLa storia in giallo - in onda il 05/05/2002\n\nJack lo Squartatore\n\n\nAll'alba di venerdÃƒÂ¬ 31 agosto 1888, a Whitechapel, Londra, una donna viene trucidata. Era una prostituta di 41 anni. Con questa morte ha inizio un periodo di terrore in tutta la cittÃƒÂ  quello di Jack the Ripper, ovvero Jack lo Squartatore. Per molto tempo, voci mai confermate attribuirono i delitti al duca di Clarence, nipote della regina Vittoria, che venne ad un certo punto internato in un manicomio. Comunque, a tutt'oggi, Jack non ha un nome e tutte le domeniche viene organizzato, alle 19.30 in punto, un giro turistico per l'East End, per visitare i luoghi del delitto e - chissÃƒÂ  - anche nella vaga speranza di trovarlo. La drammatica vicenda ebbe comunque il merito di portare l'attenzione di filantropi e politici su questa zona degradata della cittÃƒÂ  e di migliorarne considerevolmente le condizioni.\nLa trasmissione ricostruisce con un breve sceneggiato - arricchito dai giornali d'epoca e dalle lettere di Jack alla polizia -la vicenda, ed ÃƒÂ¨ seguita da un dibattito in cui l'autrice del programma Antonella Ferrera analizza il caso con la giallista Danila Comastri Montanari e lo psichiatra Piero Rocchini.\nLa voce di Jack ÃƒÂ¨ di Cesare Barbetti, accanto a lui Paolo Ferrari ed Alfredo Pea.\n\n\nAVI File Details\n========================================\nName..........: La storia in giallo 003 - Jack lo Squartatore.mp3\nFilesize......: 17.8Mb\n\nAudio Bitrate.: 192Kbps(VBR)\nAudio Freq....: 22KHz\nAudio Channels: Stereo\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:3ed58502485c8a8e805b39f8fb3b54780d54fc48","amp;dn":"La+storia+in+giallo+003+-+Jack+lo+Squartatore+%5BMp3+Ita%5D+%5BTNTvill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ed58502485c8a8e805b39f8fb3b54780d54fc48","infoHashBuffer":{"type":"Buffer","data":[62,213,133,2,72,92,138,142,128,91,57,248,251,59,84,120,13,84,252,72]},"announce":[],"urlList":[]}}