{"title":"Broken Arrow(1996)DVDRip.AC3(ENG)-DROCK","uid":6141592,"size":733917184,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3f4d1e6ef689c97a1322213b68a7ed364c578875&amp;dn=Broken+Arrow%281996%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1296519787,"description":"Hong Kong director John Woo's second U.S. film (his first was Hard Target) delivers a number of exciting action sequences but is let down by a credibility-straining plot. John Travolta plays Vic Deakins, an Air Force pilot on what is supposed to be a routine night flight mission with his co-pilot, the younger Riley Hale (Christian Slater), whom Deakins constantly kids for lacking the &quot;will to win.&quot; Deakins is actually a traitor who crashlands their Stealth Bomber in Death Valley so that he can steal two nuclear warheads onboard and sell them to terrorists who plan to blackmail the government. Deakins meets up with his cohorts, who have been waiting in the park, while Hale survives and teams up with a young, attractive park ranger (Samantha Mathis) to foil Deakins's plans. Plenty of action ensues, with car chases, collapsing mine shafts, fights on burning trains, and even the underground detonation of a nuclear device. Despite the script's implausibilities and inconsistencies, Woo amply displays the expertise with action sequences and man-to-man conflict that has made his Hong Kong films cult favorites.\n\nRipped with DVD Decrypter and Autogk.","torrent":{"xt":"urn:btih:3f4d1e6ef689c97a1322213b68a7ed364c578875","amp;dn":"Broken+Arrow%281996%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f4d1e6ef689c97a1322213b68a7ed364c578875","infoHashBuffer":{"type":"Buffer","data":[63,77,30,110,246,137,201,122,19,34,33,59,104,167,237,54,76,87,136,117]},"announce":[],"urlList":[]}}