{"title":"Die Unberuehrbare AKA No Place To Go","uid":4998870,"size":1415460044,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3f682317f177f099a777459ab3bcd09ce577838c&amp;dn=Die+Unberuehrbare+AKA+No+Place+To+Go&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"construction","files":3,"time":1247420144,"description":"Die UnberÃƒÂ¼hrbare (No Place To Go, 2000) by Oskar Roehler\n\nIs a hard-hitting tragedy. The type of film that the Hollywood money men wouldn't dream of ever making\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0235841/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0235841/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.allmovie.com/work/die-unberhrbare-201830&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmovie.com/work/die-unberhrbare-201830&lt;/a&gt;\n\nAwarded with/at:\nAdolf Grimme Award\nBavarian Film Award\nChicago International Film Festival\nCinequest San Jose Film Festival\nGerman Film Award\nGerman Film Critics Association Award\nIstanbul International Film Festival\nMiami Film Festival\nRotterdam International Film Festival\nOurense Independent Film Festival\nKarlovy Vary International Film Festival\n\nA portrait of an author at the end of her life and career, based on the life of German writer Gisela Elsner. Hanna Flanders is a writer living in Munich who travels to Berlin just as the Berlin Wall is coming down. An admirer of East Germany and Communism, Hanna is saddened by the fall, and upset at the casual attitude her East German friends take towards their former society. Returning to Munich, Hanna encounters her former husband along the way and the two have a short liaison. Still unhappy and drinking heavily, Hanna arrives home and eventually commits suicide.\n\nDie UnberÃƒÂ¼hrbare documents the final days of the writer Gisela Elsner, who took her life at the age of 56.\nAs a young writer, her early success with her first novel makes her a &quot;shooting star&quot; of the literary scene in the 60s. But her inability to rise to the challenge of her own success leaves her entrapped in a conflict with the demands placed upon her. In touch with the events of the day, rebellious and extroverted, but in effect unpolitical, she finds her spiritual foundation in the DKP (German Communist Party), which celebrated both her and her work, most of all in the East Block.\nThe course of her private life, its complicated and misunderstood relationships influenced by her earliest experiences, an assortment of disappointments, and heightened by an addiction to pills and alcohol, has led to an inner loneliness.\nIn the last stage of her life portrayed in this film, she puts her hope in finding a new beginning in an old love. In this brief space of documented time, her past is recognized by way of various points of contact, and conflict, with people who carry varying degrees of weight.\nThe film is set in the time immediately following the tearing down of the Berlin Wall. A time of beginning and ending, a time of hope and disappointment which also dictates daily life.\n\nThe third feature from much feted young German director Oskar Roehler is a confident and partly autobiographical work - the central character was based on Roehler's own mother, the writer Gisela Elsner - that has already won its young director numerous prizes, including German Film Prize.\n\nDriven by a tour-de-force performance from Hannelore Elsner, who is quite simply mesmerising, &quot;No Place To Go&quot; is certainly one of the strongest films to come out of Germany in recent years. Reminiscent of the works of such iconoclasts as Fassbinder and Von Trotta in its intelligent depiction of a troubled female protagonist and its capacity to deal with politics in social and human terms, Roehler's film - complemented by sumptuous black and white photography by Hagen Bogdanski - is by turns honest, beautiful, and undeniably moving.\n\n35 mm / 1.85 / N&amp;B / Dolby\n1999 / Allemagne / 1h43\nScript: Oskar Roehler\nImage: Hagen Bogdanski\nSound: Manfred Banach\nMusic: Martin Todsharow\nDesign: Birgit Kniep\nEditing: Isabel Meier\n\n\nCast : Hannelore Elsner, Vadim Glowna, Jasmin Tabatabai, Michael Gwisdek, Tonio Arango, Lars Rudolph, Nina Petri, Helga GÃƒÂ¶hring, Charles Regnier, Catherine Flemming","torrent":{"xt":"urn:btih:3f682317f177f099a777459ab3bcd09ce577838c","amp;dn":"Die+Unberuehrbare+AKA+No+Place+To+Go","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f682317f177f099a777459ab3bcd09ce577838c","infoHashBuffer":{"type":"Buffer","data":[63,104,35,23,241,119,240,153,167,119,69,154,179,188,208,156,229,119,131,140]},"announce":[],"urlList":[]}}