{"title":"Judgment at Nuremberg (1961) AVI Complete ALL Extras","uid":6130499,"size":2633969231,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3fa6d713a413f225c4c22f4aaa98b1fce9ff903c&amp;dn=Judgment+at+Nuremberg+%281961%29+AVI+Complete+ALL+Extras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1296110050,"description":"Judgment at Nuremberg\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1126kbps \nDuration.............: 3:06:33\nResolution...........: 600*366 \nFramerate............: 23.976 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 448 kbps CBR \nAudio Channels.......: 6 \nFilesize.............: 2,211,698,062 \nSubtitles............: English, French, Spanish\n\n\nTorrent Contents (all DVD extras included):\n1 - Judgment at Nuremberg Film (avi)\n2 - Writer Abby Mann discuss the film with Actor Max Schell\n3 - A Tribute to Stanley Kramer\n4 - Brief comments by writer Abby Mann\n5 - Movie Poster\n6 - French, English, Spanish Subtitles (ripped by DVDFab)\n\n &lt;a href=&quot;\nhttp://bayimg.com/FADjcaaDi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/FADjcaaDi&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0055031/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0055031/&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Judgment_at_Nuremberg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Judgment_at_Nuremberg&lt;/a&gt;\n\n\nCAST\n\nStanley Kramer \t\t- DIRECTOR\n\nSpencer Tracy \t\t- Judge Dan Haywood\nBurt Lancaster \t\t- Ernst Janning\nRichard Widmark \t- Col. Tad Lawson\nMarlene Dietrich \t- Mme. Bertholt\nMaximilian Schell \t- Hans Rolfe\nJudy Garland \t\t- Irene Hoffman\nMontgomery Clift \t- Rudolph Petersen\nWerner Klemperer \t- Emil Hahn\nEdward Binns \t\t- Sen. Burkette\nWilliam Shatner \t- Capt. Harrison Byers\nKenneth MacKenna \t- Judge Kenneth Norris\nTorben Meyer \t\t- Werner Lammpe\nRay Teal \t\t- Judge Curtiss Ives\nMartin Brandt \t\t- Friedrich Hofstetter\nVirginia Christine \t- Mrs. Halbestadt\nBen Wright \t\t- Halbestadt\nJoseph E. Bernard \t- Maj. Abe Radnitz\nJohn Wengraf \t\t- Dr. Wieck\n\n\nJudgment at Nuremberg is a 1961 fictionalized film account of the post-World War II Nuremberg Trials. It was written by Abby Mann, directed by Stanley Kramer, and starred Spencer Tracy, Burt Lancaster, Richard Widmark, Maximilian Schell, Werner Klemperer, Marlene Dietrich, Judy Garland, William Shatner and Montgomery Clift. An earlier adaptation had been broadcast as a television movie. It was among the first films to be made about the Holocaust.\n\nThe film depicts the trial of certain judges who served during the Nazi regime in Germany. The film was inspired by the Judges' Trial before the Nuremberg Military Tribunal in 1947, where four of the defendants were sentenced to life in prison. A key thread in the film's plot involves a &quot;race defilement&quot; trial known as the &quot;Feldenstein case&quot;. In this fictionalized case, based on the real life Katzenberger Trial, an elderly Jewish man was tried for an improper relationship with an &quot;Aryan&quot; woman, and put to death in 1942.\n\nSynopsis\n\nJudgment at Nuremberg centers around a military tribunal in which four judges are accused of crimes against humanity for their actions during the Nazi regime. Judge Dan Haywood (Spencer Tracy), the chief justice in the case, attempts to understand how defendant Ernst Janning (Burt Lancaster) could have passed sentences resulting in genocide, and by extension how the German people could have turned blind eyes and deaf ears to the Holocaust. Doing so, he befriends the widow (Marlene Dietrich) of a German general and talks with a number of Germans with different perspectives on the war. Other characters the Judge meets are U.S. Army Captain Byers (William Shatner), who is assigned to the American party hearing the cases, and Irene Wallner (Judy Garland), who is afraid to bring testimony that may turn the case against the judges in favor of the prosecution.\n\nThe film examines the questions of individual complicity in crimes committed by the state. For example, defense attorney Hans Rolfe (Maximilian Schell) raises such issues as the support of U.S. Supreme Court justice Oliver Wendell Holmes Jr. for eugenics practices, the Hitler-Vatican Reichskonkordat in 1933, the Nazi-Soviet Pact in 1939 that allowed Hitler to start World War II and Winston Churchill's praising of Adolf Hitler. In the end, Janning makes a statement condemning himself and his fellow defendants for &quot;going along&quot; with the Third Reich and all four are found guilty and sentenced to life in prison.\n\nThe film is notable for showing actual historical footage filmed by American soldiers after the liberation of the Nazi concentration camps. Shown in court by prosecuting attorney Colonel Tad Lawson (Richard Widmark), the footage of huge piles of naked corpses laid out in rows and bulldozed into large pits was exceptionally gruesome for a mainstream film of its day.\n\nThe film ends with Haywood's having to choose between patriotism and justice. He rejects the call to let the Nazi judges off lightly to gain Germany's support in the Cold War against the Soviet Union.","torrent":{"xt":"urn:btih:3fa6d713a413f225c4c22f4aaa98b1fce9ff903c","amp;dn":"Judgment+at+Nuremberg+%281961%29+AVI+Complete+ALL+Extras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fa6d713a413f225c4c22f4aaa98b1fce9ff903c","infoHashBuffer":{"type":"Buffer","data":[63,166,215,19,164,19,242,37,196,194,47,74,170,152,177,252,233,255,144,60]},"announce":[],"urlList":[]}}