{"title":"Classic Doom Anthology ISO (ppGames Edition)","uid":5023541,"size":51576832,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3fc600cec3d0adec6606aade1ce9a531e9c9e6e5&amp;dn=Classic+Doom+Anthology+ISO+%28ppGames+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheFreezerBox","files":1,"time":1248589345,"description":"Classic Doom Anthology (ppGames Edition)\n\nDoom is a 1993 computer game by id Software that is a landmark title in the first-person shooter (FPS) genre. It has a science fiction/horror theme, and a simple plot. The background of which is only given in the game's manual, and the in-game story is mainly advanced with short messages displayed between the game's episodes. The player takes on the role of a nameless space marine (referred to as &quot;Doomguy&quot; by many fans), &quot;one of Earth's toughest, hardened in combat and trained for action&quot;. Suddenly, something goes wrong and creatures from Hell come out of the teleportation gates, or &quot;Gateways&quot;. Defensive responses fails to halt the invasion; all personnel are killed or turned into zombies and only one human is left alive - the player, whose task is to make it out as such.\n\nDoom is widely recognized for pioneering immersive 3D graphics, networked multiplayer gaming on the PC platform, and support for custom expansions (WADs). Distributed as shareware, Doom was downloaded by an estimated 10 million people within two years, popularizing the mode of gameplay and spawning a gaming subculture; as a sign of its effect on the industry, the game's success had created an artificial need for similar games, and for almost 10 years, the phrase &quot;Doom clone&quot; became a part of the gaming lexicon to denote the first-person shooter genre.\n\nAnd while it wasn't the first game in the genre, it was certainly the most famous. Its graphic and interactive violence made Doom a cultural phenomenon and the subject of much controversy reaching outside the gaming world with a new wave of criticism decrying the dangers of violence in video games. Bill Gates has said there were more copies of Doom installed on computers worldwide at the time than Microsoft's Windows Operating System. It is continually voted one of the most successful and innovative FPS games of all time and according to GameSpy in 2004, Doom was voted by industry insiders to be the greatest game of all time.\n\nDoom was ported to numerous platforms, inspired many knock-offs and was eventually followed by the technically similar Doom II: Hell on Earth (1994) and numerous expansion packs, including The Ultimate Doom (1995), Master Levels for Doom II (1995), and Final Doom (1996). Originally released for PC/DOS, these games have later been ported to many other platforms, including nine different game consoles, and even PDAs. The series lost mainstream appeal as the technology of the Doom game engine was surpassed in the mid-1990s, although fans have continued making WADs, speedruns, and modifications to the source code released in 1997. The franchise again received popular attention in 2004 with the release of Doom 3, a retelling of the original game using new technology, and an associated 2005 Doom motion picture. \n\nNow -- transformed into ppGames -- this cult favorite of yesterday can once again be easily &amp; conveniently enjoyed (and obsessed upon) all over again. And because they are ppGames, you know they'll install great on just about any Windows OS you prefer (XP, Vista, NT/2000, LastXP, LastV, etc.)\n\nNote: All DOOM games in this pack use the Chocolate-Doom emulator and as such only the files required by Chocolate-Doom are contained herein. Chocolate-Doom was chosen because it is a Doom source port which aims to behave as closely as possible to the original DOS Doom executables. This includes being compatible with all demos, configuration files, and savegames that works with the original executables. Thus, it provides the same &quot;feel&quot; as DOS Doom (display and input should behave the same), and as far as possible, provides all the same features that are available using the DOS version. \n\nThis pack also contains, wherever possible, any source-code used for installing, launching, or playing the games. And be sure to check out some of the goodies in the games' startmenus.\n\n'Built on LXP technology' ... With many thanks going out to RON, AKA ReturnOfNights/Nightwolf81 (SetupS, ssWPI Installer/Launcher), AnneAardvark (Linkluster, ppApps/ppGamesMaker), Soporific (WinBorgXP, Silent Installs), and everyone else on the LastXP Team who helped create the highly useful - and brilliant - concept of SetupS.\n\nAnd of course, feel free to visit any of these awesome sites:\n &lt;a href=&quot; http://SharingIsThePoint.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://SharingIsThePoint.net/&lt;/a&gt; (formally known as AppzPoint.net)\n &lt;a href=&quot; http://www.BeyondRevolution.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.BeyondRevolution.net/&lt;/a&gt;\n___________________________________________________\n^Glossary of some TeamLastXP terminology:\n     ssApp  = (s)ilent (s)etup (App)lication\n     ppApp  = (p)ermanent &amp; (p)ortable (App)lication\n     ppGame = (p)ermanent &amp; (p)ortable (Game)\n     ssTweak= (s)ilent (s)etup (Tweak) - No application to install\n     SetupS = Setup(S)iletly\n\n******** GAMES INCLUDED ********\n\nDoom (1993)\n\tDOOM is the first release of the Doom series, and one of the games that consolidated the first-person shooter genre. With a science fiction and horror style, it gives the players the role of marines who find themselves in the focal point of an invasion from hell. The game introduced deathmatch and cooperative play in the explicit sense, and helped further the practice of allowing and encouraging fan-made modifications of commercial video games. First released as shareware in 1993 with 3 episodes: &quot;Knee-Deep in the Dead&quot;, &quot;The Shores of Hell &quot;, and &quot;Inferno&quot; and later as an expanded retail version called &quot;Ultimate Doom&quot; in 1995 with a fourth episode &quot;Thy Flesh Consumed&quot;. Ultimate Doom is the version included in this pack.\n\nDoom II: Hell on Earth (1994)\n\tIn this sequel to the original  Doom, you play the same hero - the last remaining space marine. After having single-handedly saved Mars and its moons from demonic threat, you return to Earth, only to find out that the demons have already invaded it, killed all its inhabitants or turned them into demons. It's your task to kill all the demons and to save the Earth. &quot;Doom II&quot; looks and plays very similarly to its predecessor, utilizing the same 3D graphical engine with 2D sprites for enemies. The gameplay once again consists entirely of navigating the hero from first-person view through 3D environments and shooting at the demons. You have the same weapons as in the first &quot;Doom&quot;, plus a new one. There are also some new demons in this sequel.\n\nFinal Doom: TNT/EVILUTION (1996)\n\tA spaceship from Hell invades the UAC base on Io, one of the moons of Jupiter, which had been conducting dimensional gateway technology experiments. Part 1 of &quot;Final Doom&quot;, consisting of a 32-level Doom II megawad (level files) by TeamTNT. The &quot;TNT&quot; in the title stands for &quot;The New Technology&quot; and is also the name of the mapping team who created Evilution. \n\nFinal Doom: The Plutonia Experiment (1996)\n\tAfter Hell's catastrophic invasion of Earth, the global governments decide to develop tools that would prevent demonic invasions using quantum accelerator devices intended to close interdimensional gates and stop possible invasions. But before all the gates are successfully closed, a secret research complex, with a stationed detachment of marines, is overrun. Everyone is slain, or zombified. The last gate of Hell remains open, manned and guarded by a demon Gatekeeper who is obviously working on some awful climax. Part 2 of &quot;Final Doom&quot;, consisting of a 32-level Doom II megawad (level files) by Brothers Dario and Milo Casali, who had contributed four levels each to TNT: Evilution.\n\nMaster Levels for Doom II (1995)\n\tThe Master Levels for DOOM II is an expansion pack that includes 21 never-before-seen levels. Each was created by independent designers and supervised by the demented minds of id Software. They're easily on par with DOOM II's most evil levels.\n\n******** SCREENSHOTS ******** &lt;a href=&quot;\nhttp://picasaweb.google.com/TheFreezerBox/ClassicDoomAnthologyPpGamesEdition#slideshow&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://picasaweb.google.com/TheFreezerBox/ClassicDoomAnthologyPpGamesEdition#slideshow&lt;/a&gt;\n\n******** DOWNLOADS ********\n\nISO Size: 49.19 MB\nInstalled Size: 94.0 MB\n\n  File: Classic.Doom.Anthology_ppGames.Edition.iso\nCRC-32: 050f7280\n   MD4: 7092c9bc35719e12cf31412372befdfc\n   MD5: 826db8832ee52e936f7bf6763f685e47\n SHA-1: c7c1bb32fd3568f4350a9822a76dfc6cb04d0ab9\n  ED2K: 2dc519077cfc432e2c8749bac2ce091e\n\nTorrent Info Hash: 3FC600CE C3D0ADEC 6606AADE 1CE9A531 E9C9E6E5","torrent":{"xt":"urn:btih:3fc600cec3d0adec6606aade1ce9a531e9c9e6e5","amp;dn":"Classic+Doom+Anthology+ISO+%28ppGames+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fc600cec3d0adec6606aade1ce9a531e9c9e6e5","infoHashBuffer":{"type":"Buffer","data":[63,198,0,206,195,208,173,236,102,6,170,222,28,233,165,49,233,201,230,229]},"announce":[],"urlList":[]}}