{"title":"Install XP From USB Drive Toolkit (Perfect for Asus EEE)","uid":5001736,"size":773699581,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:402ffe69e7406dad06c91e2f53a2e2f5b5e3dd47&amp;dn=Install+XP+From+USB+Drive+Toolkit+%28Perfect+for+Asus+EEE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"issox","files":41,"time":1247557238,"description":"This is a COMPLETE toolkit for installing XP on a computer via a USB Drive.\n\nIt is customisied for the Asus EEE 701 - Including Drivers and an 'Nlited' / stripped down copy of xp. I managed to get xp and Norton on to the EEE's 4gb HD with 2 Gigs to spare. \n\nIt contains EVERYTHING you need, and is much simpler then the BARTPE process. \n\nIt comes with EXTREMELY detailed instructions for the entire process with logically constructed folders for added clarity.\n\nIt took me about 4 weeks of mind-boggling research to figure all this stuff out, as all the guides i found were lacking. \n\nI did not give much attention to spelling as I was up all night making this, and wanted to get it out there. \n\nBefore Writing this guide I formated both my EEE and PC, so it follows the logic of an ACTUAL successful installation. I am 99% sure that i have not forgotten any software / instruction for this toolkit. \n\nPlease read the instructions carefully before asking questions, as most blogs on this area are overly dense and repative. \n\nIf you find this helpful, please comment. It took a lot of work to put this together so id appreciate if people were friendly and continued seeding.\n\nEnjoy.\n\n________________\n\nContains:\n\n\n1. Virtual Floppy Drive Emulator; for creating an ms-dos start up disk\n\n2. HP Format Tool; used with the above to make the usb bootable\n\n3. XPSP3, Nlite, Winrar, and PowerIso for mounting my or your customised xp\n\n4. WinSetupFromUSB to put xp on the usb from the virtual D:\n\n5. Instructions for installing xp from the usb\n\n6. Post Installation Tweeks: zune theme, dotnetfix, and EEE 701 drivers\n\n7. Norton 360 with keygen activation method \n\n\nEach stage is contained within a separate folder with detailed instructions.","torrent":{"xt":"urn:btih:402ffe69e7406dad06c91e2f53a2e2f5b5e3dd47","amp;dn":"Install+XP+From+USB+Drive+Toolkit+%28Perfect+for+Asus+EEE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"402ffe69e7406dad06c91e2f53a2e2f5b5e3dd47","infoHashBuffer":{"type":"Buffer","data":[64,47,254,105,231,64,109,173,6,201,30,47,83,162,226,245,181,227,221,71]},"announce":[],"urlList":[]}}