{"title":"CBTNuggets 70-623 Windows Vista","uid":5063592,"size":888557615,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4099bb1df6e3399bdc24523d5f52a449625706e6&amp;dn=CBTNuggets+70-623+Windows+Vista&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"computechswe","files":2,"time":1250818502,"description":" &lt;a href=&quot;http://www.cbtnuggets.com/webapp/product?id=449&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.cbtnuggets.com/webapp/product?id=449&lt;/a&gt;\n\n\nVideo 1 - &quot; - &quot;Series Introduction&quot;\n\nVideo 2 - &quot; - &quot;Install and Upgrade Windows Vista, Part 1&quot; - Evaluate potential upgrade environments, prepare to install Windows Vista, Troubleshoot and resolve installation issues, User State Migration Tool, Windows Easy Transfer, Home, Home Basic, Business, Enterprise, Ultimate, upgrade considerations, hardware requirements, vista capable, vista premium.\n\nVideo 3 &quot; - &quot;Install and Upgrade Windows Vista, Part 2&quot; - Evaluate potential upgrade environments, prepare to install Windows Vista, Troubleshoot and resolve installation issues, User State Migration Tool, Windows Easy Transfer, hard disks, partitions, upgrade, migrate, clean install, Troubleshoot and resolve installation issues. Windows Vista Upgrade Advisor.\n\nVideo 4 - &quot; - &quot;Post Installation Tasks&quot; - Troubleshoot and resolve post-installation issues, program compatibility tools, program compatibiity assistant, program compatibility wizard, compatibility tab, compatibility alternatives, virtual server, application virtualization, softgrid, dual-boot, system restore, system protection, configure windows aero, display settings, resolution, hardware, uninstall, hardware acceleration, dual-monitor, direct-X, refresh rate, color management\n\nVideo 5 - &quot; - &quot;Post-Installation: Windows Applications, Part 1&quot; - Customize and Configure Settings, Evaluate user requirements and recommend, set up, and configure appropriate applications,configure Sidebar, Windows Media Player, Windows Media Center, Windows Media Extender, XBOX 360, evaluate user requirements and recommend, set up, and configure applications.\n\nVideo 6 - &quot; - &quot;Post-Installation: Windows Applications, Part 2&quot; - Customize and Configure Settings, Evaluate user requirements and recommend, set up, and configure appropriate applications, Install, configure, and troubleshoot digital cameras and camcorders, Install, configure, and troubleshoot media devices, Windows Photo Gallery, Windows Movie Maker, Windows Live Messenger, Windows Meeting Space, Windows Firewall, People Near Me, webcam, video, digital photography, .wmv, .jpg\n\nVideo 7 - &quot; - &quot;Performance Analysis&quot; - Evaluate user's system and recommend appropriate settings to optimize performance, task manager, taskman, resource monitor, performance monitor, reliability monitor, 3\n\nVideo 8 - &quot; - &quot;Optimizing Performance&quot; - Evaluate user's system and recommend appropriate settings to optimize performance, startup programs, windows defender, visual effects, disk performance, disk management, extend disk, shrink disk, readyboost, RAID-0, RAID-1, RAID-5, msconfig, system configuration, registry, startup group, software explorer, NTFS, indexing, disk defragmenter, diskkeeper, stripe set, mirroring, stripe set with parity. collector sets, system information, windows experience index, hard disk, processor, memory, solid state circuits\n\nVideo 9 - &quot; - &quot;User Accounts and Accounts Control&quot; - Customize and configure user accounts, Configure user account control, local policy, elevate privileges, user profile, user files.\nVideo 10 - &quot; - &quot;Windows Security Part 1: Windows Security Center&quot; - Configure Windows Vista Security, Configure Windows Security Center, configure firewalls, configure windows updates, configure windows defender, configure user account control, remove malware from a client system.\n\nVideo 11 - &quot; - &quot;Windows Security Part 2: Parental Controls, IE 7+&quot; - Configure Windows Vista Security, Configure Parental Controls, configure Internet Explorer 7+, certificate authority, trusted parties, pop-up blocker, content advisor, password reset disk,\nVideo 12 - &quot; - &quot;Windows Security Part 3: File and Printer Sharing&quot; - Configure Windows Vista Security, protect data, file sharing, folder sharing, printer sharing, share permissions, ntfs permissions, printer driver, co-owner, contributor.\nVideo 13 - &quot; - &quot;Windows Security Part 4: Protecting Data&quot; - Configure Windows Vista Security, Protect Data, bitlocker, backup status and configuration, complete pc backup, backup files, restore files\nVideo 14 - &quot; - &quot;Networking Part 1: Network and Sharing Center, File and Printer Sharing&quot; - Configure and Troubleshoot Windows Vista by using the Network and Sharing Center, Troubleshoot File and Print Sharing, password protected, network discovery, printer drivers, user accounts, print queue.\nVideo 15 - &quot; - &quot;Networking Part 2: Network Protocols and Services&quot; - Configure and Troubleshoot Network Protocols, Configure and Troubleshoot Network Services at the Client, TCP/IP V4, TCP/IP V6, Domain Name System, DNS, Dynamic Host Configuration Protocol, DHCP, IP Address, default gateway, WINS, Automatic Private IP Address, APIPA, HOSTS file\n\nVideo 16 - &quot; - &quot;Networking Part 3: Wireless Networking&quot; - Install, Configure, and Troubleshoot Devices, Configure and Troubleshoot Wireless Networking, temporal key integrity protocol, TKIP, advanced encryption standard, AES, ad-hoc network, service set identifier, SSID, encryption, wired equivalency protocol, WEP, Wi-Fi Protected Access, WPA, radio frequency, Linksys, Cisco, administrator password, diagnose and repair.\n\nVideo 17 - &quot; - &quot;Devices Part 1: Mobile Devices, Digital Cameras, Media Devices, Peripherals&quot; - Connect periphals to windows vista, install, configure, and troubleshoot mobile devices, install, configure, and troubleshoot digital cameras and camcorders, install, configure, and troubleshootmedia devices, USB, mobile phone, pocket PC, bluetooth, synchronizing\n\nVideo 18 - &quot; - &quot;Devices Part 2: Printers, Fax Machines, and Copy Devices&quot; - Install, Configure, and Troubleshoot Printers, Fax Machines, and Copy Devices, USB, Toner, Ink, inkjet, laser, color laser, facsimile.\n\nVideo 19 - &quot; - &quot;Troubleshooting Windows Vista&quot; - Diagnose a specified issue, repair a corrupted operating system, startup repair, bcdedit.exe, last known good, system restore, system file checker, SFC, event viewer, collector set, windows memory diagnostics, safe mode, safe mode with networking, safe mode with command prompt.","torrent":{"xt":"urn:btih:4099bb1df6e3399bdc24523d5f52a449625706e6","amp;dn":"CBTNuggets+70-623+Windows+Vista","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4099bb1df6e3399bdc24523d5f52a449625706e6","infoHashBuffer":{"type":"Buffer","data":[64,153,187,29,246,227,57,155,220,36,82,61,95,82,164,73,98,87,6,230]},"announce":[],"urlList":[]}}