{"title":"Rain Man(Multi-Subs)(2Lions-Team)","uid":5514061,"size":4681787870,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:411d6951f21662ba9e0f483eede434a06100b133&amp;dn=Rain+Man%28Multi-Subs%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JUULTJE","files":-1,"time":1272189202,"description":"Rain Man  1988\n\nVerenigde Staten\nDrama / Komedie\n133 minuten\n\ngeregisseerd door Barry Levinson\nmet Tom Cruise, Dustin Hoffman en Valeria Golino\n\nAls de vader van de yuppie Charlie overlijdt, erft hij een oldtimer en een rozentuin. Hij komt tevens tot de ontdekking dat hij nog een broer heeft. Raymond is autistisch, maar is wel in staat om ingewikkelde wiskundige vraagstukken op te lossen. Hun vader heeft al zijn geld achter gelaten aan Raymond, terwijl die totaal geen idee heeft waar geld voor dient. Charlie is woedend en ontvoert Raymond uit zijn verzorgtehuis. Hij wil hem meenemen naar Los Angeles, maar Raymond weigert te reizen met een vliegtuig en dus zijn ze gedwongen om per auto te reizen. Wat volgt is een lange rit waarbij de twee elkaar leren te waarderen.\n\nEngels\n\nCharles Sanford &quot;Charlie&quot; Babbit is a self-centered Los Angeles-based automobile dealer/hustler/bookie who is at war with his own life. Charlie, as a young teenager, used his father's 1948 Buick convertible without permission and as a result, he went to jail for two days on account that his father reported it stolen. It is then that Charlie learns that his estranged father died and left him from his last will and testament a huge bed of roses and the car while the remainder will of $3 Million goes into a trust fund to be distributed to someone. Charlie seemed pretty angry by this and decides to look into this matter. It seems as if that &quot;someone&quot; is Raymond, Charlie's unknown brother, an autistic savant who lives in a world of his own, resides at the Walbrook Institute. Charlie then kidnaps Raymond and decides to take him on a lust for life trip to the west coast as a threat to get the $3 Million inheritance. Raymond's acts and nagging, including repeated talks of &quot;Abbott &amp; Costello&quot;, &quot;Four minutes till Wapner&quot; and refusal to fly on an airline except Quantas drives Charlie insane... and out of his selfish world into a cross-country trek of pure love and understanding that these two both have. \n\nWeblink http://www.imdb.com/title/tt0095953/\nWeblink http://www.moviemeter.nl/film/400\n\nVideo                : DVD Rip Trailer\nAudio                : Engels Duits Spaans Frans Italiaans\nSubs                 : Engels,Duits,Spaans,Nederlands,Frans,Italiaans,Fins,Zweeds,Noors,Deens,Portugees\nID                   : 0xE0\nFormat               : MPEG Video\nFormat version       : Version 2\nBit rate mode        : Variable\nWidth                : 720 pixels\nHeight               : 576 pixels\nDisplay aspect ratio : 16:9\nFrame rate           : 25.000 fps\nStandard             : PAL\nCover                : Yes\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n\n","torrent":{"xt":"urn:btih:411d6951f21662ba9e0f483eede434a06100b133","amp;dn":"Rain+Man%28Multi-Subs%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"411d6951f21662ba9e0f483eede434a06100b133","infoHashBuffer":{"type":"Buffer","data":[65,29,105,81,242,22,98,186,158,15,72,62,237,228,52,160,97,0,177,51]},"announce":[],"urlList":[]}}