{"title":"Wilbur Smith - Taita og den 7. gÃƒÂ¥te","uid":5077971,"size":1210112404,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:414c1aed8436775651f5ba69210f61ea45dd49f3&amp;dn=Wilbur+Smith+-+Taita+og+den+7.+g%C3%83%C2%A5te&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schneide240","files":42,"time":1252027261,"description":"Omtale\nFor fire tusen ÃƒÂ¥r siden begravet slaven Taita sin herskerinne, dronning Lostris. I veggene i gravkammeret gjemmer han ti skriftruller. Duraid Al Simmu og hans hustru klarer ÃƒÂ¥ tyde rullene, men den syvende bestÃƒÂ¥r av gÃƒÂ¥ter og rebuser. Like etter dette funnet, myrdes Duraid og rullen ÃƒÂ¸delegges. Hustruen Royan reiser til England og fortsetter ÃƒÂ¥ sÃƒÂ¸ke i Taitas gÃƒÂ¥ter. Men ukjente forfÃƒÂ¸lgere gir ikke slipp pÃƒÂ¥ henne og intensiverer jakten nÃƒÂ¥r hun sammen med Egypt-kjenneren Nicholas Quenton-Harper, tar seg inn i Etiopias ukjente fjell- og ÃƒÂ¸rkenlandskap. Dette er den andre boken om Taita.\n\nFra bokomslaget\nDen 7. gÃƒÂ¥ten. En fire tusen ÃƒÂ¥r gammel hemmelighet. En falmet arv fra bortenfor graven. Innenfor ligger sporene som leder til en fantastisk skatt fra en nesten glemt fortid Taita dronning Lostris trofaste og intelligente slave begravde sin herskerinne for fire tusen ÃƒÂ¥r siden. I gravkammerets vegger gjemte han ti skriftruller. Duraid Al Simmu og hans engelsk-egyptiske hustru Royan oppdager graven og klarer langt pÃƒÂ¥ vei ÃƒÂ¥ tyde rullenes budskap. Men pÃƒÂ¥ den syvende rullen har den slu Taita lagt ut gÃƒÂ¥ter og rebuser som pirrer forskernes nysgjerrighet. Finnes det en rik og ukjent faraograv i Etiopia? Noen mÃƒÂ¥ kjenne gÃƒÂ¥tens svar og ÃƒÂ¸nske at det skal bevares som en hemmelighet, for like etter de fÃƒÂ¸rste funnene myrdes Duraid ... Den 7. gÃƒÂ¥ten er lagt til dagens Afrika, men er likevel tett knyttet til det gamle Egypts som beskrevet i Hapi - Elvegudinnen. I Den 7. gÃƒÂ¥ten, som alle Wilbur Smiths bÃƒÂ¸ker, vrir og vender handlingen seg med nye overraskelser hele tiden Dette er en god gammeldags eventyrlig historie som fengsler leseren hele veien fram til den nervepirrende slutten. The Washington Post Book World Wilbur Smith har skrevet fire bÃƒÂ¸ker med handling fra det gamle Egypt: Hapi - Elvegudinnen Taita og den 7. gÃƒÂ¥ten Vismannen Taita Nilens hemmelighet.","torrent":{"xt":"urn:btih:414c1aed8436775651f5ba69210f61ea45dd49f3","amp;dn":"Wilbur+Smith+-+Taita+og+den+7.+g%C3%83%C2%A5te","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"414c1aed8436775651f5ba69210f61ea45dd49f3","infoHashBuffer":{"type":"Buffer","data":[65,76,26,237,132,54,119,86,81,245,186,105,33,15,97,234,69,221,73,243]},"announce":[],"urlList":[]}}