{"title":"Carl Perkins-the ultimate collection cd [flac] by winker@kidzcor","uid":6175576,"size":181415860,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:416a2df26286079cc0e3b2e092a8581620c334c3&amp;dn=Carl+Perkins-the+ultimate+collection+cd+%5Bflac%5D+by+winker%40kidzcor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alanwatson","files":-1,"time":1297760204,"description":"carl perkins-the ultimate collection cd 2004]\n\nCarl Lee Perkins was born near Tiptonville, Tennessee in 1932. At 7, he began playing a guitar that his father had made from a cigar box, broomstick and baling wire. He listened to country music, gospel, and blues, and began to write some of his own compositions. At age 13 he performed a song that he had written, Movie Magg, at a local talent show and won. He formed a group with Jay and Clayton called the Perkins Brothers which began to perform at a local honky tonk known as the El Rancho Club in 1947 and 1948. W. B. Holland joined the group as a drummer. They appeared on WDXT radio in his hometown of Jackson, Tennessee from 1950 to 1952. Meanwhile, Carl spent many years working during the day at Colonial Baking Company in Jackson Tennessee as a baker.\nCarl signed a recording contract with Flip Records, a subsidiary of Sun in Memphis, in 1954. His first release was Movie Magg the following year, and it was followed by other songs such as Gone, Gone, Gone, Let The Juke Box Keep On Playing, and Blue Suede Shoes. He wrote &quot;Blue Suede Shoes&quot; after hearing a boy telling his prom date not to step on his blue suede shoes. Perkins went back to his home in a housing project and wrote the song on a brown potato sack. He recorded the song at Sun in December, 1955, was released on the Sun label and took off nationally. It reached number two on the pop and country charts in 1956.\n\nThat song put 23-year old Carl Perkins in the national spotlight. Appearances were arranged on the Ed Sullivan and Perry Como TV shows, but while traveling to New York for those engagements he was involved in a terrible automobile accident that hospitalized him. Another up-and-coming Sun artist, Elvis Presley, covered Blue Suede Shoes, which became Elvis' third top forty hit. These events served to steal some of the thunder from Carl Perkins' rise, and Carl never quite recovered his momentum in the world of pop, although his place in music history was assured.\n\n1.Blue Suede Shoes\n2.Matchbox\n3.Honey Don't\n4.Movie Magg\n5.Boppin' the Blues\n6.Dixie Fried\n7.Honky Tonk Gal\n8.Gone, Gone, Gone\n9.Tennessee\n10.Your True Love\n11.Glad All Over\n12.That's Right\n13.Put Your Cat Clothes On\n14.Everybody's Trying to Be My Baby\n","torrent":{"xt":"urn:btih:416a2df26286079cc0e3b2e092a8581620c334c3","amp;dn":"Carl+Perkins-the+ultimate+collection+cd+%5Bflac%5D+by+winker%40kidzcor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"416a2df26286079cc0e3b2e092a8581620c334c3","infoHashBuffer":{"type":"Buffer","data":[65,106,45,242,98,134,7,156,192,227,178,224,146,168,88,22,32,195,52,195]},"announce":[],"urlList":[]}}