{"title":"The Rolling Stones - December's Children (1965) WMA320","uid":6301601,"size":89502276,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:419ecc64dd39237d0b10bdce50aef96aa80b56b8&amp;dn=The+Rolling+Stones+-+December%5C%27s+Children+%281965%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1302170237,"description":"With the release of the remastered super audio CDs (SACD) of the Stones ABCKO catalog (which includes all the early Decca/London material), there is now mass confusion about the Out Of Our Heads releases, which includes the December's Children release. Allow me to clarify for you:\nThere are 3 Out Of Our Heads Releases (all were released with lower case titles):\nJuly 30, 1965 - U.S. London Records vinyl out of our heads\n(the heads cover with Keith at center)\nSeptember 24, 1965 - U.K. Decca Records vinyl out of our heads\n(the hallway cover with Brain at front)\nDecember 3, 1965 - U.S. London Records vinyl december's children (and everybody's)\n(the hallway cover with Brain at front)\n\nThis new remastered SACD is the December 3, 1965 U.S. London Records vinyl december's children (and everybody's) release. \n\nNote: ABCKO acquired the Stones' catalog when Allen Klein became their manager in the 70s. The resulting legal battles produced releases that the Stones opposed (they took out full page adds asking fans not to buy them), including the controversial Metamorphosis releases (which are now available on CD for the 1st time ever). But the sad fact is that the Stones lost control of their great early material. With these remastered SACD releases, we at last have some idea of what they really sounded like in the studio. I guess if we had these 40 years ago they would have ended up Greatest Rock And Roll Band in the Universe instead of just our tiny little World.\n\nYou must buy all 3 releases to get all the tracks, although if you bought the 2 U.S. releases + the earlier U.S. release The Rolling Stones, Now! you would get everything that is included on the U.K. Out Of Our Heads release.\n\nHere is a listing of which tracks are on which release:\nU.S. Out Of Our Heads tracks\n.....The Last Time\n.....I'm All Right\n.....Satisfaction\n.....Play With Fire\n.....The Spider And The Fly\n.....One More Try\nU.S. Out Of Our Heads &amp; U.K. Out Of Our Heads tracks\n.....Mercy Mercy\n.....Hitch Hike\n.....That's How Strong My Love Is\n.....Good Times\n.....Cry To Me\n.....The Under Assistant West Coast Promotion Man\nU.K. Out Of Our Heads tracks\n.....Oh, Baby (we got a good thing going)\n.....Heart Of Stone\nU.K. Out Of Our Heads &amp; U.S. December's Children tracks\n.....She Said Yeah\n.....Gotta Get Away\n.....Talkin' `Bout You\nU.S. December's Children tracks\n.....I'm Free\n.....You Better Move On\n.....Look What You've Done\n.....The Singer Not The Song\n.....Route 66\n.....Get Off Of My Cloud\n.....As Tears Go By\n.....Blue Turns To Grey\n.....I'm Moving On\n\nU.S. London Records vinyl December's Children (And Everybody's) (the hallway cover with Brain at front) was released December 3, 1965. It used the U.K. Out Of Our Heads cover. This is an odd one for the Stones, released only in the U.S. on Dec 3, 1965 (their 3rd album release that year). It was a compilation of 2 hit singles (Get Off Of My Cloud released 7-24-65 and As Tears Go By released 12-17-65) along with other tracks that had not been released in\nthe States.\n\nThis was the last album where the record execs had total control. After this one, the Stones got into the studio enough and produced new tracks so that they were able to exert at least some influence on their releases from here on out. Keith has been quoted in several sources as saying\ntheir fans in the UK would not have accepted an album like this. He was later proven right when the UK market failed to pick up on the many greatest hits releases by Klein and Decca after the Stones formed their own label in the 1970s.\n\nThe album does mark the advent of Jagger and Richards as ballad writers with I'm Free, As Tears Go By, Blue Turns To Grey, and The Singer Not The Song. They also did Gotta Get Away and Get Off Of My Cloud. The rest of the album includes the premature rocker She Said Yeah,\nChuck Berry's Talkin' 'Bout You, and Look What You've Done from the Chess Studio sessions in Chicago when Muddy himself was present. I'm Movin' On is a live track from their live UK EP and You Better Move On and Route 66 were from the earlier UK EP &quot;The Rolling Stones.&quot;\n\nNow a bit about the hits: Get Off Of My Cloud was the follow up to Satisfaction and was their 2nd #1 single in the States. As Tears Go By was first done as a demo on March 11 or 12, 1964 but was finally finished on Oct 26, 1965 and was also released by Mick's girlfriend at the time,\nMarianne Faithful.\n\nThe tracks were recorded from 1963-5 as follows:\nNov 14, 1963 at De Lane Lea Studios in Kingsway, London\n.....You Better Move On (originally released on the UK EP The Rolling Stones)\nJune 10-11, 1964 at Chess Studios in Chicago\n.....Look What You've Done\nLive in the UK on March 5 (Regal Theatre in Edmonton), March 6 (Empire in Liverpool), 7 (Palace in Manchester), or 16 (Granada in Greenford)\n.....I'm Moving On\n.....Route 66\nSep 6-7, 1965 at RCA Studios in Hollywood\n.....I'm Free\n.....Get Off Of My Cloud\n.....The Singer Not The Song\n.....She Said Yeah\n.....Gotta Get Away\n.....Blue Turns To Grey\nOct 26, 1965 at IBC Portland Place Studios, London\n.....As Tears Go By\n\nAlso of interest, the UK Out Of Our Heads used the same artwork as the US release of December's Children.\n\nThis information comes from &quot;It's Only Rock And Roll: The Ultimate Guide To The Rolling Stones&quot; by Karnbach and Bernson and from my own\ncollection. \n\nby Richard R. Carlton\n\nTRACKLIST:\n\n01 - She Said ''Yeah''.wma                                            \n02 - Talkin' 'Bout You.wma                                            \n03 - You Better Move On.wma                                           \n04 - Look What You've Done.wma                                        \n05 - The Singer Not The Song.wma                                      \n06 - (Get Your Kicks On) Route 66 (Live).wma                          \n07 - Get Off Of My Cloud.wma                                          \n08 - I'm Free.wma                                                     \n09 - As Tears Go By.wma                                               \n10 - Gotta Get Away.wma                                               \n11 - Blue Turns To Grey.wma                                           \n12 - I'm Moving On (Live).wma\n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!\t","torrent":{"xt":"urn:btih:419ecc64dd39237d0b10bdce50aef96aa80b56b8","amp;dn":"The+Rolling+Stones+-+December%5C%27s+Children+%281965%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"419ecc64dd39237d0b10bdce50aef96aa80b56b8","infoHashBuffer":{"type":"Buffer","data":[65,158,204,100,221,57,35,125,11,16,189,206,80,174,249,106,168,11,86,184]},"announce":[],"urlList":[]}}