{"title":"Paragon.Backup.Recovery.v10.0.Suite.Recovery.CD.based.on.WinPE-F","uid":5182848,"size":214372700,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:41e6edd7b6f34cb406adccab5871cf2ff3464e80&amp;dn=Paragon.Backup.Recovery.v10.0.Suite.Recovery.CD.based.on.WinPE-F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aoloffline","files":3,"time":1259330766,"description":"Our Bootable Recovery CD is a special add-on developed as an alternative for Windows environment. It provides some opportunities when one can't use our software under Windows for certain reasons. All functions of our software products under Windows can be found on Recovery CD and even more:\n\n   1. You can create/format/delete partitions on hdd, when no OSes are available.\n   2. You can correct different unbootable situations using Update MBR, changing partitions' properties, editing 'boot.ini' file, etc. Some versions include powerful tool 'BootCorrector'.\n   3. When applying operations you can see directly the process taking place and its immediate results.\n   4. You can restore system partition and operate other locked partitions for OSes, which don't have BlueScreen mode (Windows 9x/ME). In DOS mode not all hardware is supported (USB/Firewire devices, some RAIDs).\n   5. You can perform operations, which are unavailable due to software incompatibilities under Windows.\n\nRecovery CD includes Paragon Linux and Paragon DOS. You can read about their differences in the manual. In general, we recommend you to use Linux as it has more capabilities.\n\nThere is no need to be afraid of &quot;Linux&quot; here, because:\n\n   1. It easily works with Windows partitions.\n   2. Knowledge of Linux is unnecessary, you'll see nice GUI with menus, wizards, etc.\n\nWe recommend you to download the Recovery CD image, burn it and store away to be on the safe side.\n\nWinPE based Recovery CD is also available for some products.","torrent":{"xt":"urn:btih:41e6edd7b6f34cb406adccab5871cf2ff3464e80","amp;dn":"Paragon.Backup.Recovery.v10.0.Suite.Recovery.CD.based.on.WinPE-F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41e6edd7b6f34cb406adccab5871cf2ff3464e80","infoHashBuffer":{"type":"Buffer","data":[65,230,237,215,182,243,76,180,6,173,204,171,88,113,207,47,243,70,78,128]},"announce":[],"urlList":[]}}