{"title":"Chris Brown - Forever","uid":5006030,"size":161091588,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4211564b42d6d356733f16e11f1eddb59dbc34b0&amp;dn=Chris+Brown+-+Forever&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1247737204,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Forever&quot; is a song by American R&amp;B singer Chris Brown. Produced by Polow da Don, it is the first single from the repackaged Exclusive: Forever Edition, and is the fifth overall single by Brown from his second studio album, Exclusive with backing uncredited vocals from Keri Hilson. Initially created to be used for Doublemint gum, &quot;Forever&quot; was a top 10 hit in various countries. On November 25, the official remix leaked featuring Lil' Wayne &amp; Lupe Fiasco.\n\nThe two-days shoot took place in Los Angeles, California, April 4, 2008. It was directed by the acclaimed Joseph Kahn. The video premiered on TRL on April 30, 2008 and on BET's 106 &amp; Park on May 5, 2008. The video reached number one on the MTV Online Chart. BET placed the song at #55 on their Notarized: Top 100 Videos countdown.\n\nThe music video starts off with Brown driving into a club (where he chews a fresh stick of Doublemint Gum), and people are seen dancing while Brown starts to sing the first verse. Brown is also seen singing with light effects circling him. During the choruses, Brown and his background dancers (Beat Freaks) start to dance on the empty dance floor. In the second verse, Brown is walking outside the club following his love interest. Later he is seen performing a 540 crescent kick in front of a water fountain. During the bridge, Brown is seen in the top roof with his love interest; the girl falls off the roof and Brown jumps to catch her. The two land safely, and after the final chorus, Brown drives out of the club.\n\nAccording to the Billboard, the song's video is &quot;digital dream about sharing with one who makes your world stop.&quot;\n\nThe video was popular in American television. The video for &quot;Forever&quot; debuted on BET's 106 &amp; Park at number 10 on July 21, 2008 before finally reach number 2 and has stayed in the countdown for nine days. The video also has reached number 2 on for 8 days MTV TRL, behind Katy Perry's &quot;I Kissed a Girl&quot;, and has stayed in the countdown for 29 days.\n\nThe video for &quot;Forever&quot; was also popular enough across Asia, by debuting at number 13 on MTV Asia program, &quot;Chart Attack&quot;, which count 20 most popular video in Asia and so far has peaked at number 1 replacing Mariah Carey's &quot;Bye Bye&quot;. &quot;Forever&quot; also debuted at number 7 on MTV Hip Hop Countdown; MTV Asian program which count 10 most popular urban video in the region and has reached number 1 for six consecutive weeks. In UK, it has reached number 1 on MTV Base. It also has peaked at number 1 on the MTV Online Chart for several weeks.\n\nAt the beginning of the video, Brown is seen unwrapping and chewing Doublemint gum then during the chorus he sings &quot;Double your pleasure, Double your fun&quot;, part of a former Wrigley's slogan.\n\nThe video is up for three nominations in the &quot;Best Dancing in a Video&quot;, &quot;Best Choreography&quot; and &quot;Video of the Year&quot; categories 2008 MTV Video Music Awards.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:4211564b42d6d356733f16e11f1eddb59dbc34b0","amp;dn":"Chris+Brown+-+Forever","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4211564b42d6d356733f16e11f1eddb59dbc34b0","infoHashBuffer":{"type":"Buffer","data":[66,17,86,75,66,214,211,86,115,63,22,225,31,30,221,181,157,188,52,176]},"announce":[],"urlList":[]}}