{"title":"VA - Florida Funk -  1968-75 [EAC FLAC CUE LOG]","uid":5023172,"size":389848978,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:43812140b26c6d2d1ca756666ef365d3e30539f8&amp;dn=VA+-+Florida+Funk+-++1968-75+%5BEAC+FLAC+CUE+LOG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ill88eagle","files":-1,"time":1248560574,"description":"Various Artists - Florida Funk 1968-1975: Funk 45s from the Alligator State\nExact Audio Copy FLAC | CUE and LOG Included | CD Rip | Funk | Artwork | 2007\n\nThe third in Jazzman's reissue series collecting rare and forgotten funk treasures from the late '60s and early '70s (the first two covered the Midwest and Texas funk scenes), Florida Funk shows that the Alligator State was also clearly in the groove of it. Fueled by Florida's active club scene and released on vibrant but distributionally-challenged small independent labels, none of the singles gathered here was ever anything more than a regional hit back in the day, but many of them have since become highly sought after by collectors and DJs looking for thick backbeats to sample. And thick is the word here, as grooves as wide as a mangrove swamp and every bit as deep follow here track after track, and it's a wonder Florida wasn't stomped into the ocean with the pulse of it all back in those glorious pre-disco days. Daytona Beach's Universals lead things off with the marvelous &quot;New Generation,&quot; originally released in 1970 on Expression Records, and there's no reason on earth that this side shouldn't have been a huge and enduring hit. Pearly Queen, an all-Latin band from Miami Springs who took their name from the Traffic song, follow with the equally as impressive &quot;Quit Jive'in,&quot; released by Sound Triangle in 1974. Miami guitarist Frankie Seay's 1969 instrumental &quot;Soul Food,&quot; originally put out by Tropical Records, is a delightfully ragged, raw and lo-fi slice of hard soul with stomping drums that sound like they're about to push through the floor. The rarity of some of these 45s is made evident by Bobby Williams' James Brown influenced &quot;All the Time,&quot; a 1969 single from Tropical Records, which is full of the cracks and pops that come from a vinyl source that has been played repeatedly. Mildly irritating as these slight defects are, it \nstill beats not hearing this solid little single at all. Wonderfully paced, sequenced, researched and annotated, Florida Funk is an incalculable blessing in a 21st century world always in danger of running out of new, fresh and previously undiscovered beats to sample.\n\nRipped to FLAC with Exact Audio Copy\n\n01. New Generation - The Universals\n02. Quit Jive'in - Pearly Queen\n03. Save Me - James Knight &amp; The Butlers\n04. Super Cool - Carrie Riley\n05. Cutting Room (Hot Pants) - Oceanliners\n06. It's Gonna Be A Mess - The Mighty Dogcatchers\n07. All The Time - Bobby Williams\n08. Do Right Man - Sam Baker\n09. Good Things - Pearl Dowdell\n10. Pure Funk - Delrays\n11. Everybody Has Some Dues To Pay - Little Beaver\n12. Butterfly Theme - Blowfly\n13. Lay It On Me - Willie Johnson\n14. Funky Fast Bump - The Outlaw Band\n15. Los Filigreses - Luis Santi\n16. Na Na - Coke\n17. Soul Food - Frankie Seay\n18. Baby Don't Cry - The Third Guitar\n19. Spider Web - Westom Prim &amp; Backlash\n20. Get Down - The Montereys\n21. 90% Of Me Is You - Vanessa Kendrick\n22. Soft Soul - Lavell Kamma (previously unreleased bonus track)","torrent":{"xt":"urn:btih:43812140b26c6d2d1ca756666ef365d3e30539f8","amp;dn":"VA+-+Florida+Funk+-++1968-75+%5BEAC+FLAC+CUE+LOG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43812140b26c6d2d1ca756666ef365d3e30539f8","infoHashBuffer":{"type":"Buffer","data":[67,129,33,64,178,108,109,45,28,167,86,102,110,243,101,211,227,5,57,248]},"announce":[],"urlList":[]}}