{"title":"George Harrison - What is Life?  (BBC Radio)","uid":5101377,"size":53152036,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:438c3fa5d7eb88cca5d94e22ae1b6b17f5ad7784&amp;dn=George+Harrison+-+What+is+Life%3F++%28BBC+Radio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eddie1969","files":2,"time":1254004112,"description":"George Harrison: What Is Life - Audio Documentry - BBC Radio 2 via DVB-T\n\n1 x 60 minutes episode - 128k - MP3\n\n\n\nMichael Palin presents a tribute to his friend George Harrison, who died in November 2001. It features archive interviews with George, as well as contributions from his wife and son, Bob Geldof, Jim Keltner, Jeff Lynne, Brian May, Gary Moore, Tom Petty, Ringo Starr, Ravi Shankar and the Beatles' producer George Martin.\n\nThe programme highlights George's contribution to the extraordinary and enduring legacy of the Beatles. Although John or Paul would usually sing the lead vocal, George played a vital role in the distinctive harmonies that enhanced the Beatles' records. Guitarist Gary Moore demonstrates the brilliance of George's solos on their records. And Ravi Shankar talks about how George's love for Indian music and culture influenced Beatles records.\n\nAfter the Beatles split in 1970, all four released solo records but - to the astonishment of many - it was George who initially achieved the most commercial and critical success. His single My Sweet Lord was a worldwide number one in 1971 and returned to the top of the UK chart in 2002. He organised the Concert for Bangladesh and the triple album of the recordings topped charts around the world. This event, and George Harrison's understanding of the power and responsibility that rock musicians could wield in the world, have had a lasting influence.\n\nGeorge's solo career had periods of great productivity and also two phases when his profile dipped below the horizon. He enjoyed a late 1980s 'comeback' with his hit album Cloud Nine, released the number one single Got My Mind Set On You and two albums with his supergroup The Traveling Wilburys (featuring Bob Dylan, Jeff Lynne, Roy Orbison and Tom Petty). The year after George died Brainwashed was released, which featured the music he had worked on since his last solo album in 1987. Among them was the beautiful instrumental Marwa Blues, which won a Grammy Award.\n\n\n\n\nAudio Format    : MP3\nDuration Approx : 58mn 54s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits","torrent":{"xt":"urn:btih:438c3fa5d7eb88cca5d94e22ae1b6b17f5ad7784","amp;dn":"George+Harrison+-+What+is+Life%3F++%28BBC+Radio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"438c3fa5d7eb88cca5d94e22ae1b6b17f5ad7784","infoHashBuffer":{"type":"Buffer","data":[67,140,63,165,215,235,136,204,165,217,78,34,174,27,107,23,245,173,119,132]},"announce":[],"urlList":[]}}