{"title":"KT Tunstall - Live in London March 2011 (HMV Forum 3-8-11) FLAC","uid":6306241,"size":598212185,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:43e2d8f69ae5fcfdcf69393c761791892c135101&amp;dn=KT+Tunstall+-+Live+in+London+March+2011+%28HMV+Forum+3-8-11%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jimclip","files":28,"time":1302347583,"description":"KT Tunstall\nLive in London March 2011\nHMV Forum 3-8-2011\n\nA jimclip rip . . . 4-8-2011\n\nLINEAGE: Official CDs &gt; WAV &gt; FLAC -8 (XLD CDParanoia III 10.2, offset corrected, no errors)\n\nCover scan, XLD logs, CUE files, FFP and MD5 checksum included. FLAC files are fully META-tagged.\n\n. . . \n\n&quot;Live In London March 2011&quot; is an official limited edition release from the &quot;Tiger Suit&quot; tour and is available as a double-CD digipack or MP3 download. Although primarily marketed through KT's website, the CDs were first offered for sale just a few minutes after the concert ended (sure beats a T-shirt !) and then as part of the merchandise mix at subsequent shows. My copy took nearly 3 weeks to arrive in the USA from the UK, and coincidentally it was delivered on the same day (April 8) that KT announced another release that won't be sold in stores -- this time a set of softer, all-acoustic studio recordings called &quot;The Scarlet Tulip EP&quot; that will be available as a 10&quot; vinyl edition limited to 500 copies in addition to CD and MP3 formats.\n\nPerhaps these back-to-back, retail-skipping releases are hints of more to come from KT using this rapid-fire method of distribution for new material, live or otherwise. It would have been cool to take home a copy of the CD the night of the show, but beyond that I can't argue with the turnaround time; despite its transatlantic crossing, this double CD set landed in my mailbox precisely one month after the lights came up in London. I'm listening to the music at a point when most traditional record labels would still be selecting fonts for the artwork. My only complaint is that the downloads aren't offered in a lossless format such as FLAC, which some progressive artists have embraced for their digital sales. I understand that many prefer the convenience of MP3, so give us a choice (or even both); the cost of doing so is negligible.\n\n&quot;Live In London&quot; captures a fantastic performance in excellent fidelity and includes the complete setlist from the evening, including one song not found on any of KT's studio albums, and one cover. &quot;The Hidden Heart&quot; is a KT composition included on the 2008 &quot;Songs For Survival&quot; compilation issued in support of Survival International. And she covers &quot;Close To Me&quot;, a song by The Cure which appeared on their 1985 album &quot;The Head On The Door&quot;.\n\nEnjoy, please seed, and please support KT by purchasing her records. Now on with the show . . .\n\n\nDISC 1\n1. Come On, Get In\n2. Glamour Puss\n3. Uummannaq Song\n4. False Alarm\n5. If Only\n6. Other Side Of The World\n7. The Hidden Heart\n8. Black Horse And The Cherry Tree\n9. Difficulty\n10. Lost\n11. Golden Frames\n\n\nDISC 2\n1, Saving My Face\n2. Madame Trudeaux\n3. Push That Knot Away\n4. Fade Like A Shadow\n5. (Still A) Weirdo\n6. Close To Me\n7. Suddenly I See\n\n\n\n. . . . . . . . . . .  end . . . . . . . . . . . \n","torrent":{"xt":"urn:btih:43e2d8f69ae5fcfdcf69393c761791892c135101","amp;dn":"KT+Tunstall+-+Live+in+London+March+2011+%28HMV+Forum+3-8-11%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43e2d8f69ae5fcfdcf69393c761791892c135101","infoHashBuffer":{"type":"Buffer","data":[67,226,216,246,154,229,252,253,207,105,57,60,118,23,145,137,44,19,81,1]},"announce":[],"urlList":[]}}