{"title":"Ponyo on the Cliff by the Sea (2009) ( ENG NL SUBS) Pioen 2Lions","uid":5041358,"size":4637426892,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:43f2d8a8707457d3ebc686ce482c8d06074fada8&amp;dn=Ponyo+on+the+Cliff+by+the+Sea+%282009%29+%28+ENG+NL+SUBS%29+Pioen+2Lions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1249345903,"description":"Ponyo on the Cliff by the Sea (2009) NTSC\n\n\n\n\nVanaf 23 juli in de bioscoop!!\n\nJapan\nAnimatie / Avontuur\n100 minuten\n\ngeregisseerd door Hayao Miyazaki\nmet de stemmen van Yuria Nara, Hiroki Doi en Akiko Yano\n\nOp een steile rots boven de zee woont een klein jongetje van vijf jaar, Sosuke, samen met zijn ouders. Op een dag ziet hij in het water een goudvis met een meisjesgezichtje. Het bijzondere visje, dat hij Ponyo noemt, is ontsnapt aan haar vader, een onderwatertovenaar. Ponyo is van plan mens te worden. Door haar sterke magische wil begint ze al te veranderen, maar haar vader is op zoek naar zijn dochter om haar dat te beletten. Ponyo roept de hulp van Sosuke in om uit de buurt van haar vader te kunnen blijven. Dat valt nog niet mee...\n\n\nenglish\n\nThe plot is centered on a fish girl, or mermaid, who runs away from her home in the sea. She ends up stranded on the shore and is rescued by Ssuke, a five year old boy who lives on a cliff. After taking a great liking to her, Ssuke names her Ponyo and vows to protect her forever. Meanwhile, her father, Fujimoto, is looking for his daughter, upset that she ran away. He calls his wave spirits to return Ponyo to him. Ssuke is heartbroken by this, and goes home with his mother, Lisa (or &quot;Risa&quot; in some translations), who tries to cheer him up, but to no avail.\n\nPonyo and her father have a confrontation, where Ponyo refuses to let her father call her &quot;BrÃƒÂ¼nnhilde&quot;. She declares her name to be Ponyo, and voices her desire to become human because she has started to fall in love with Ssuke. Her father silences her with difficulty and goes to summon Ponyo's mother. Meanwhile, Ponyo, with the help of her sisters, breaks away from her father, and uses his magic to make herself human. This causes an imbalance in the world, which in turn results in a huge storm. Riding on the waves of the storm, Ponyo goes back to visit Ssuke. Lisa, Ssuke, and Ponyo stay the night at Ssuke's house, hoping the storm will be over, whereupon Lisa leaves the house to check up on the residents of the nursing home she works at.\n\nGranmammare, Ponyo's mother, arrives at Fujimoto's submarine. Fujimoto notices the moon has come out of its orbit and the satellites are falling like shooting stars. Granmammare declares that if Ssuke and Ponyo pass a test, Ponyo can live as a human and the world order will be restored. Ssuke and Ponyo wake up to find that most of the land around where the house has been covered by the ocean. Lisa has not come home yet, so with the help of Ponyo's magic, they make Ssuke's toy boat life-size and set out to find Lisa. While travelling they see ancient extinct fish swimming, such as the Gogonasus and Licosus.\n\nAfter landing and finding Lisa's empty car, Ponyo and Ssuke go through a tunnel. There Ponyo loses her human form and resumes the form of a fish. Ssuke and Ponyo are taken by Fujimoto into the ocean and down to the protected nursing home where they're reunited with Lisa and meet Granmammare. Granmammare asks Ssuke if he can love Ponyo even if she is a fish or mermaid. Ssuke replies that he loves Ponyo in all forms. Granmammare then allows Ponyo to become human once Ponyo kisses Ssuke on the surface.\n\nType.................: Film\nAlternatieve titel...: Gake no Ue no Ponyo (2008)\nFilename.............: Ponyo.on.the.Cliff.NTSC.2008.Custom.NL.Thai-Tanic\n\nSource...............: DVD9 R3\nRegie................: Hayao Miyazaki\nActeurs..............: met de stemmen van Yuria Nara, Hiroki Doi en Akiko Yano\nGenre................: Animatie / Avontuur\nSpeelduur............: 100 minuten.\nLand.................: Japan Dolby Digital 5.1\nIMDB.................: imdb.com/title/tt0876563/\nIMDB-RATING..........: 8.0/10 2,484 votes\n\nOndertitels..........: Nederlands custom door Thai-Tanic\nBewerking en Synch...: Thai-Tanic en Kathmandu\n\n\n\nSpotinformatie\nCategorie : Beeld\nFormaat : DVD5\nBron : Retail\nWidescreen 16:9\nVideo :CCE-6 pass Compression\nExtra : None\n\n\nOndertitels : Nederlands, Engels\n\nGenre : Avontuur\nAnimatie\n\nWeblink : http://www.moviemeter.nl/film/46282\nWeblink : http://www.imdb.com/title/tt0876563\n\n*****************************************\n\nBrought to you by\nPioen\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum\n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n******************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\n\nDon`t quit after you finished the download, but keep seeding.","torrent":{"xt":"urn:btih:43f2d8a8707457d3ebc686ce482c8d06074fada8","amp;dn":"Ponyo+on+the+Cliff+by+the+Sea+%282009%29+%28+ENG+NL+SUBS%29+Pioen+2Lions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43f2d8a8707457d3ebc686ce482c8d06074fada8","infoHashBuffer":{"type":"Buffer","data":[67,242,216,168,112,116,87,211,235,198,134,206,72,44,141,6,7,79,173,168]},"announce":[],"urlList":[]}}