{"title":"Derek And Clive - Come Again [Bubanee]","uid":4986236,"size":73443236,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4492e09f43d4530058a029539d6df0a8b87c73d6&amp;dn=Derek+And+Clive+-+Come+Again+%5BBubanee%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bubanee","files":20,"time":1246719257,"description":"Derek and Clive Come Again, subtitled &quot;Further Ejaculations From......&quot; is the second record released by Derek and Clive, a pair of characters created by comedy duo Peter Cook and Dudley Moore. Although the first album, Derek and Clive (Live), was reasonably good-natured in its blasphemous subversiveness, Come Again was released at the height of the punk rock phenomenon and Cook, in particular, seems keen to elevate the excess to new heights of jaw-dropping offensiveness. To that end, he improvises routines about raping the victims of road traffic accidents, oral sex performed in lavatory cubicles and cross-dressing members of the aristocracy masturbating rent boys in taxi cabs, not to mention several extended routines on cancer in all its variations. Moore, on the other hand, improvises a smutty rhyme about his mother sucking his penis, and how he masturbates with the aid of a greased toilet roll connected to his electric train-set.\n\nThroughout much of album (recorded in just one day for a Christmas release), both Cook and especially Moore are drunk and out of control, with Moore in particular regularly collapsing in hysterics (Cook achieving his primary comic aim of making Moore laugh with regular ease). Shortly after the album's release, controversy unsurprisingly erupted in a variety of forms, most notably a petrol station attendant being fired from his job after it was discovered that he owned a copy of the album (Cook testified at the man's industrial tribunal), and a distributor of talking books accidentally sending out copies of Come Again on cassette in cases intended for the children's classic Black Beauty. The CD reissue adds several previously unreleased routines, including a sketch about Derek (Moore) cutting his wife's hymen out with an electric carving knife, and one of their most popular sketches amongst their fans, 'Mother', in which Moore plays Cooks hysterical, domineering, deranged mother. Like much of the extra material, it was actually recorded during the 'Ad Nauseam' sessions a couple of years later than the original Come Again album.\n\n[edit] Track listing\n\n   1. You Stupid Cunt\n   2. Coughin' Contest\n   3. Cancer\n   4. Non-Stop Dancer / My Mum Song\n   5. Joan Crawford\n   6. Norman The Carpet\n   7. How's Your Mother\n   8. Back Of The Cab\n   9. Alfie Noakes\n  10. Nurse\n  11. In The Cubicles\n  12. Ross McPharter\n  13. Hello Colin\n  14. Having A Wank\n  15. I Saw This Bloke\n  16. Parking Offence\n  17. Members Only\n  18. Valerie's Hymen*\n  19. Mother*\n  20. Films*\n  21. Young Dudley Moore Performs &quot;Jump&quot;\n\nI remember as a kid my brothers and their mates while gettin trashed with pink floyd and bob dylan\nand i knew when they had enough. off went the music and on with derek and clive. i had learnt every word before i stole the ol' cassette\nand made a double for my myself.. couldn forget the laughing and coughin and the smoke that filed out of that bedroom in the back corner\ni guess me brother should of closed his bedroom window [Cigarettes] of course!! ha ha \n","torrent":{"xt":"urn:btih:4492e09f43d4530058a029539d6df0a8b87c73d6","amp;dn":"Derek+And+Clive+-+Come+Again+%5BBubanee%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4492e09f43d4530058a029539d6df0a8b87c73d6","infoHashBuffer":{"type":"Buffer","data":[68,146,224,159,67,212,83,0,88,160,41,83,157,109,240,168,184,124,115,214]},"announce":[],"urlList":[]}}