{"title":"[swelog]Men.of.War.Assault.Squad-SKIDROW","uid":6197030,"size":1204394810,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:45fca266bdb4e3d3d1b7f0381b17e83ea01507ab&amp;dn=%5Bswelog%5DMen.of.War.Assault.Squad-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"swelogz","files":27,"time":1298478265,"description":"\n\n\nS  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nMen of War: Assault Squad (c) 1C company\n\n23-02-2011........Release Date - Protection.............SecuROM\nStrategy.............Game Type - Disk(s)..................1 DVD\n\nRELEASE NOTES\n\nMen of War: Assault Squad features a completely new cooperative\nskirmish game mode with access to five different nations (Russia,\nGermany, USA, Commonwealth and, for the first time ever in the Men of\nWar series, Japan) as well as increased realism and accessibility.\n\nPlayers can get behind the controls of a tank to smash through\nobstacles, crush soldiers under their tracks and fire high-explosive\nshells at enemy emplacements, they can even take control of individual\nsoldiers as they fight. As in previous games in the series, Men of War:\nAssault Squad includes the unique \\&quot;direct control\\&quot; feature which\nenables players to be in command of any unit using the WASD controls,\nrather than pointing and clicking.\n\nFeatures:\n\nDifferent historical settings and battlegrounds for every nation\npresented in the game allowing players to face distinct varieties of\nenemies and tactics\n\nUnique hero units with powerful abilities such as increasing units\\'\nfirepower, boosting morale or providing other advantages to defeat the\nenemy against all odds\n\nBonuses featuring remote controlled bombs that can flatten entire\nresidential blocks, airstrikes to destroy incoming tank columns,\nspecial \\&quot;For the Motherland\\&quot; charge attacks and many more\n\nImproved and dynamic AI ensures that no two missions in the game will\nplay out the same way, making each battle a new experience against an\nAI that really fights back\n\nA great choice of various locations including Western Europe to Eastern\nEurope, North Africa and the Pacific area\n\nThe ability to play together with up to four friends in LAN or\ncooperative online play\n\nNew multiplayer maps and game settings\n\nImproved multiplayer providing authentic use of equipment and vehicles\n\nOverhauled infantry squads and the ability to purchase specific\nsoldiers\n\nMore realistic weapon behavior and penetration values\n\nA reworked artillery system providing innovative assault and defense\nstrategies\n\nNew types of ammunition which increase the tanks\\' strength\n\nINSTALL NOTES\n\n1. Unpack release\n2. Mount or burn the image\n3. Install\n4. Copy the content from the SKIDROW folder to the game installation\n5. Support the companies, which software you actually enjoy\n\nGREETINGS\n\nUnleashed - TiNYiSO - MRN - RADIKAL - POSTMORTEM - GENESIS - Fairlight\nSHOCK - CRUDE - ReUnion - VACE - OUTLAWS - BACKLASH - Titan\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix  irokos\ntitan artdivision\n\n\n\n","torrent":{"xt":"urn:btih:45fca266bdb4e3d3d1b7f0381b17e83ea01507ab","amp;dn":"%5Bswelog%5DMen.of.War.Assault.Squad-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45fca266bdb4e3d3d1b7f0381b17e83ea01507ab","infoHashBuffer":{"type":"Buffer","data":[69,252,162,102,189,180,227,211,209,183,240,56,27,23,232,62,160,21,7,171]},"announce":[],"urlList":[]}}