{"title":"The.Sims.Medieval-RELOADED","uid":6264462,"size":4930940629,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:46085e01f2be4153dd0b3cb5aac9eaf9ab9b792a&amp;dn=The.Sims.Medieval-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MAFIAA.","files":-1,"time":1300862457,"description":"The Sims: Medieval (c) Electronic Arts Inc\n03/2011: RELEASE.DATE .. PROTECTION: Custom\n1: DISC(S) .. GAME.TYPE: Family\n\nDeveloped by the award-winning The Sims studio, The Sims Medieval is a new\nstand-alone game offering a fresh setting, a new look, an exciting new set of\nfeatures gameplay mechanics, and all-new features.The Sims Medieval lets you\nexperience the medieval era with Sims you create and control: kings, queens\nknights, wizards, spies, blacksmiths, merchants, bards and many more. You\nwill create heroes, choose quests, build your kingdom, and create epic tales\nfull of drama, romance, conflict and comedy.Built with next-gen Sims tech and\nfeatures:A world of Sims filled with stories, adventures, romance, drama and\ncomedyEnhanced environment and character graphics, lighting, and gameplayRich\ndramatic medieval setting:Experience epic stories of the age, full of drama\nfantasy, conflict, comedy, romance, and intrigueHeroes:Create Hero Sims and\nbuild up their skills and send them on epic questsQuests:Drive your kingdom s\nstory - Good or evil, cruel or kind, romantic or warlikeKingdom\nBuilding:Start with an empty field and build up your kingdom, deciding its\nultimate ambition and working to achieve its destinyDiving in a bit\ndeeper:The Sims Medieval offers Achievements to reward you for your skill in\nreaching your ambitions and completing your Quests.The Sims Medieval allows\nyou to play every Hero Sim in your kingdom, not just the Sims in one\nhousehold.There is a magic system, and your wizard will learn a variety of\npowerful spells.There is a crafting system, allowing your blacksmith to forge\nweapons of varying quality and physician to create cures for a variety of\nailments.There is a diplomatic system, allowing you to negotiate trade and\ndeclare war on surrounding kingdom.The objects your Sims will interact with\nrangefrom profession-oriented objects like the Blacksmith's forge and anvil\nand the Physician s operating table to medieval food-preparation objects such\nas a roasting spit and cook-pot hanging over a fire.The buildings are\ncustom-crafted for each profession, from the Monarch s Great Hall in the\ncastle to the Tavern for the Bard to the Wizard s Tower.The art style is\npainterly, with a hand-crafted look to befit the medieval setting.And yes\nthere is fishing\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game and use the keygen when asked for a serial\n4. Copy over the cracked content\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT!\n\nNOTE!\nIf you start the game without copying over crack first it wont work\nTo solve it you just have to rename the .ex_ to .exe and it should be fine.","torrent":{"xt":"urn:btih:46085e01f2be4153dd0b3cb5aac9eaf9ab9b792a","amp;dn":"The.Sims.Medieval-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46085e01f2be4153dd0b3cb5aac9eaf9ab9b792a","infoHashBuffer":{"type":"Buffer","data":[70,8,94,1,242,190,65,83,221,11,60,181,170,201,234,249,171,155,121,42]},"announce":[],"urlList":[]}}