{"title":"The Last Samurai [HDRip.4.iPod] -- VoV","uid":5090753,"size":1624180951,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:477d9c2ff960094c3c7c497d29af8fcc3eb7318e&amp;dn=The+Last+Samurai+%5BHDRip.4.iPod%5D+--+VoV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"VixenofVenus","files":-1,"time":1253121487,"description":"*******************************************************************************\nThe Last Samurai\n*******************************************************************************\n\n\n-------------------------------------------------------------------------------\nCommon File Information\n-------------------------------------------------------------------------------\nSource / Type........: 720p HD Blu Ray Rip (REVEiLLE)\nCompatibility........: All iPods &amp; iPhones / Zune / X-Box 360 / PS3 / etc.\nVideo Format.........: H.264\nVideo Resolution.....: 853 x 352 (640x352 Container)\nVideo Frames/Second..: 23.98\nVideo Bitrate........: 1.38 Mbps\nAudio Format.........: AAC-LC\nAudio Bitrate........: 160kbps\nAudio Sampling.......: 48kHz\nAudio Channels.......: Stereo\nGenre................: Action &gt; Adventure &gt; Drama &gt; War &gt; Romance\nCover Art............: &lt;a href=&quot;\nhttp://i120.photobucket.com/albums/o168/VixenofVenus/ScreenShots/plastsamuraithe.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i120.photobucket.com/albums/o168/VixenofVenus/ScreenShots/plastsamuraithe.jpg&lt;/a&gt;\nScreen Shots.........: &lt;a href=&quot;\nhttp://i120.photobucket.com/albums/o168/VixenofVenus/ScreenShots/lastsam.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i120.photobucket.com/albums/o168/VixenofVenus/ScreenShots/lastsam.jpg&lt;/a&gt;\nIMDb Link............: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0325710/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0325710/&lt;/a&gt;\nIMDb Description.....: In Japan, Civil War veteran Captain Nathan Algren trains the Emperor's troops to use modern weapons as they prepare to defeat the last of the country's samurais. But Algren's passion is swayed when he is captured by the samurai and learns about their traditions and code of honor.\n-------------------------------------------------------------------------------\n\nThis is a requested upload from romeox145 @thePirateBay.  I knew it would be a bugger to do because it has scenes with Japanese audio which means it needs hardcoded subtitles and the last time I tried that, it didn't work out so well, but I thought of a new method or work-around for that and tested it out ... oddly enough on another Edward Zwick film ... while I downloaded the 720p of this film to convert from.  As many of you have probably already downloaded it, the test run on &quot;Defiance&quot; went splendidly and has hardcoded English subtitles for the foreign-language dialogue.  Similarly, for this encode, as you can see from the screen shots, the Japanese dialogue has hardcoded English subtitles.\n\nPersonally, I love this film, although I know it got a whole lot of bad reviews and criticism just because it stars Tom Cruise.  Now, Tom Cruise is surely one crazy guy who put some sort of Scientology hex on Katie Holmes.  What's really funny is how it took him jumping up and down on a couch in front of Oprah's audience for most of the world to figure out he was a freak ... this is a guy who started out as a kid who wanted to be a Franciscan priest, then converted to Scientology when they &quot;cured&quot; him of Dyslexia ... so while he is a freak, and everyone thinks his acting is horrible ... I personally think his acting is great.  And in this film, he does an amazing job playing Nathan Algren.\n\n\nTRIVIA:\n1.  Unlike what most people believe/think ... the film's title does not refer to Nathan Algren.  In fact, the title is plural and refers to ALL of Katsumoto's clan as the &quot;Last Samurai&quot;.  A better English phrase might be &quot;The Last OF the Samurai&quot;, although that title just isn't as good.\n2.  This is the first American film which Ken Watanabe stars and is also the first film he speaks English in.  As most people can see, he doesn't suffer the same problems as Jackie Chan, for which we can all be grateful.\n3.  For those who don't know Japanese characters or calligraphy, the character that Taka's son paints and gives to Algren is the character for &quot;samurai&quot;.\n4.  Rumor is that during filming of a particular action sequence where Cruise was performing his own stunt because it required a close-up shot, one of Cruise's co-stars swung a sword at him that would have swung harmlessly over his head.  But instead, because the mechanical horse he was riding malfunctioned, the sword was swung directly at Cruise's neck and could have caused potentially fatal wounds.  While the sword was not sharp, it was still metal and could have still caused a near-decapitation.  However, his co-star reacted and the sword was stopped within an inch of his neck.\n5.  (Copied from IMDb) The real-life counterpart to Katsumoto (played by 'Ken Watanabe') is Takamori Saigo, who led a samurai rebellion in 1877. As in the movie, Saigo ended up committing suicide in September 1877 after defeat in battle. The Emperor's attitude in the film toward Katsumoto's struggle and death reflects actual Japanese popular sentiment toward Saigo, who though defeated, was regarded as a hero; a statue of Saigo was erected shortly after his death, and can today be seen in Ueno, in northeast Tokyo.\n\n\n-------------------------------------------------------------------------------\nAdditional Info\n-------------------------------------------------------------------------------\nLike all my iPod torrents, these files have their ID3 tags preformatted for your ease!  Album Art, Release Dates, and TV Tags are already filled out for you.  However, if you wish to change them, I recommend the third-party tagging program TVTagger!\n\nFor VoV's iPod Downloads throughvisit RapidRise! &lt;a href=&quot;\nhttp://www.rapidrise.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rapidrise.org/&lt;/a&gt;\n\nCheck out VoV's Blog at BayWords! Get up to date information on new VoV torrents, what is coming up, and just random stuff about VoV! &lt;a href=&quot;\nhttp://vixenofvenus.baywords.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://vixenofvenus.baywords.com/&lt;/a&gt;\n\nAfter downloading, please leave your client open and the torrent actively seeding so others may download as well and your ratio will remain high!  Also remember not to severely limit your upload speed by over-throttling.  Be kind, rewind!  Remember to eat your green vegetables.  And ...\n\n-- Please Enjoy and Keep Seeding for Others to Enjoy!! --","torrent":{"xt":"urn:btih:477d9c2ff960094c3c7c497d29af8fcc3eb7318e","amp;dn":"The+Last+Samurai+%5BHDRip.4.iPod%5D+--+VoV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"477d9c2ff960094c3c7c497d29af8fcc3eb7318e","infoHashBuffer":{"type":"Buffer","data":[71,125,156,47,249,96,9,76,60,124,73,125,41,175,143,204,62,183,49,142]},"announce":[],"urlList":[]}}