{"title":"PowerISO 4.7 Portable","uid":5510599,"size":3322906,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:47e58d77d44d7f7463f4593b71a38c787080163d&amp;dn=PowerISO+4.7+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoExcuses","files":4,"time":1272033531,"description":"PowerISO 4.7 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Serial are included...\n\n\nPowerISO is a powerful CD/DVD image file processing tool, which allows you to open, extract, create, edit, compress, encrypt, split and convert ISO files, and mount these files with internal virtual drive. It can process almost all CD-ROM image files including ISO and BIN. \n\nMain Features:\n\n    * Support almost all CD/DVD-ROM image file formats(ISO, BIN, NRG, CDI, DAA and so on).\n      Note: DAA(Direct-Access-Archive) is an advanced format for image file, which supports some advanced features, such as compression, password protection, and splitting to multiple volumes. It can be handled directly just like other formats, such as ISO, BIN, ...\n    * Support both 32-bit and 64-bit Windows.\n    * Open and extract ISO File.\n    * Create ISO file from hard disk files or CD/DVD-ROM. \n    * Edit an existing ISO file directly.\n    * Convert image files between ISO/BIN and other formats. PowerISO can convert almost all image file formats to standard ISO format file.\n    * Make bootable ISO file, get boot information from bootable ISO file.\n    * Make floppy disk image file.\n    * Optimize files to save disk space while saving ISO file.\n    * Mount ISO file with internal virtual drive. You don't need install any other virtual drive software.\n    * Can be used easily. PowerISO supports shell integration, context menu, drag and drop, clipboard copy paste...\n\n\nMore infos at &lt;a href=&quot;\nhttp://www.poweriso.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.poweriso.com/&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at: &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you like it and it's useful for you, show your support buying it!\n\n\n","torrent":{"xt":"urn:btih:47e58d77d44d7f7463f4593b71a38c787080163d","amp;dn":"PowerISO+4.7+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47e58d77d44d7f7463f4593b71a38c787080163d","infoHashBuffer":{"type":"Buffer","data":[71,229,141,119,212,77,127,116,99,244,89,59,113,163,140,120,112,128,22,61]},"announce":[],"urlList":[]}}