{"title":"Parliament Chocolate City .flac files","uid":6226364,"size":266730005,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:48bda52cc6b15c5276841467136247d78b99ba16&amp;dn=Parliament+Chocolate+City+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ulikes","files":12,"time":1299527621,"description":"Like Up for the Down Stroke, Chocolate City is a perfectly adequate album that nonetheless fails to scale the heights that later Parliament discs would. It's a really rough album, featuring, for your entertainment, the worst song Parliament ever attempted: &quot;I Misjudged You&quot;, a pained attempt at an orchestrated ballad. Ballads were never P-Funk's strong suit in the first place, but even by those standards it's a bad song. It honestly sounds like someone mashed up the Jackson 5's &quot;I Want You Back&quot; (the lyrics), Pink Floyd's &quot;Echoes&quot; (the string arrangements sound a LOT like that classic riff), and some random doo-wap ballad from the '50s (Melody; vocals; the overabundance of strings), and decided to have the whole thing go on for five minutes. Not good. The keyboard-and-vocals &quot;Let Me Be&quot; isn't a heck of a lot better, either, but it is a slight improvement over &quot;Misjudged&quot;. However, both are comparable to stinkers like Funkadelic's &quot;Baby I Owe You Something Good&quot; (funky power ballads should never exist).\nOnto the rest! Basically, other than those two ballads this is divided into good funk and mediocre funk. On the good side you've got your black-power title track (though it's not racist - when people talk about the &quot;God bless Chocolate City&quot; refrain, they forget the &quot;And its vanilla suburbs&quot; part), with fascinatingly weird trumpet solos and a great interlocking keyboard/bass part. Great lyrics, too, packed with humorous off-the-cuff pop culture references. &quot;Ride On&quot; is even better, booty-shakin' funk-rock like Funkadelic's &quot;Red Hot Mama&quot;. The lyrics need a bit of work, though. Compare &quot;Don't worry 'bout bein' right, just be for real&quot; to &quot;You don't have to worry that it's wrong&quot; from Marvin Gaye's &quot;Let's Get It On&quot; released two years previous. It probably isn't a direct rip-off, but it's not a very original chorus. Actually, it pretty much recasts &quot;Let's Get it On&quot; and any other funk baby-makin' song. But it's got a groove, and that's all that counts. The stomping, hilarious &quot;Big Footin'&quot; is one of Parliament's most underrated cuts. The last of the &quot;great funk&quot; songs is the Sly &amp; the Family Stone-like &quot;Together&quot;, with wonderful group vocals and an unbelievably catchy refrain. The remaining three songs (&quot;If It Don't Fit (Don't Force It)&quot;; &quot;What Becomes Funky&quot;; &quot;Side Effects&quot;) aren't bad at all, but they're mediocre and essentially interchangeable. This was actually my first Parliament studio album (I bought it because I liked the group and it was cheap), and while I'm glad I own it, Mothership Connection and its ilk are much better. \n\nThe format is .flac so you don't lose even a little bit of the sound and comes withe the original artwork. Book mark my list as at some point I will be offering the entire Parliament/Funkadelic collection.\n\nMp3 is dead! Long live Flac!!!","torrent":{"xt":"urn:btih:48bda52cc6b15c5276841467136247d78b99ba16","amp;dn":"Parliament+Chocolate+City+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48bda52cc6b15c5276841467136247d78b99ba16","infoHashBuffer":{"type":"Buffer","data":[72,189,165,44,198,177,92,82,118,132,20,103,19,98,71,215,139,153,186,22]},"announce":[],"urlList":[]}}