{"title":"How to Win Campaigns: 100 Steps to Success-Mantesh","uid":6307451,"size":2186310,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4914e59894581b90e544ab64b23efac8dbac9b74&amp;dn=How+to+Win+Campaigns%3A+100+Steps+to+Success-Mantesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MANTESH","files":4,"time":1302394810,"description":" &lt;a href=&quot;http://ecx.images-amazon.com/images/I/5161NBZTJ1L._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://ecx.images-amazon.com/images/I/5161NBZTJ1L._SL500_AA300_.jpg&lt;/a&gt;\n\n\n\n[\n\n\n\nHow to Win Campaigns: 100 Steps to Success\n\n\n\n\nEarthscan Publications Ltd \nChris Rose\nEnglish\n2005 \nISBN: 1853839612 \n256 Pages  \nPDF \n2.05 MB\n\n\n\n\n* The essential one-stop, how-to guide for PR and communication specialists\n* For business and non-profit sectors\n* Start, conduct and win campaigns on any issue in any context\n* Written by campaign master Chris Rose, and distilled from his twenty years of experience directing and running campaigns for Greenpeace, Friends of the Earth, WWF International and other major organizations\n* Presents 100 key actionable steps to campaigning and shows what works and what doesn't work\n\nWritten for the new campaigner and the experienced communicator alike, this is a comprehensive and systematic exploration of what works in campaigning, and a practical how-to guide for using principles and strategy in campaigning as a new form of public politics.\n\nApplicable to any issue, the book's 100 key steps and tools provide models of motivation, analysis, and communication structure.\n\nContent includes: how to begin a campaign; motivating people; research and development, including issue mapping; planning using the campaign planning star; organizing communications including visual language; constructing campaign propositions; insight into news media; how to keep a campaign going; how to use old and new media and what to do and what not to do.\n\nThe final chapter reviews the bigger picture, including why campaigns need brands, and examines how campaigns became a form of politics and provides new research material on how issues mature and become 'norms', and the consequent problems for campaigning.\n\n\n[","torrent":{"xt":"urn:btih:4914e59894581b90e544ab64b23efac8dbac9b74","amp;dn":"How+to+Win+Campaigns%3A+100+Steps+to+Success-Mantesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4914e59894581b90e544ab64b23efac8dbac9b74","infoHashBuffer":{"type":"Buffer","data":[73,20,229,152,148,88,27,144,229,68,171,100,178,62,250,200,219,172,155,116]},"announce":[],"urlList":[]}}