{"title":"Attila Zoller - Gypsy Cry (1969) [Jazz][mp3 320][schon55]","uid":5067312,"size":98828585,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:491f15816d0dbd0ed92a3c40da6fd7601827e320&amp;dn=Attila+Zoller+-+Gypsy+Cry+%281969%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":16,"time":1251073183,"description":"Attila Zoller - Gypsy Cry \nRecorded in New York City, July 23 &amp; August 4, 1969\nYear: 1969\nEmbryo SD 523\nRipped from vinyl\nQuality: mp3 320 kbps\n\nThis might as well be called: the two sides of a guitar genius.  Most tracks here show Zoller at his straight ahead best with some catchy originals (The Birds and the Bees, Wild Wild Wes) while other tracks are a showcase for his avantgarde leanings (Meet in Berlin) and his Hungarian roots (Gypsy Cry).  Herbie Hancock on acoustic and electric piano feels obviously at home in all settings. \n\nHere's what Zoller had to say about the album:\n\n&quot;In '70, I recorded Gypsy Cry (1969) on Embryo label.  It was on Atlantic, actually, with the Herbie Mann production label.  And they called that series &quot;Embryo,&quot; which recorded about five other artists, including Ron Carter and Arnie Lawrence.  He had a whole bunch of them.  (Mann) recorded musicians who used to work with him.  He bought Miroslav Vitous' tape because he found out that some of the tapes had disappeared.  So they bought the whole thing and just put it on a shelf. \n\nHerbie Hancock played piano on The Gypsy Cry.  At that time, Herbie Hancock was struggling.  The drummer was Sonny Brown, and now he's disappeared and I don't know where he is.  Reggie Workman was on bass.  Also, Victor Gaskin was on too because I wanted two dates.  It was two different kinds of music I played on the album.  I played one part avant garde stuff and another part of popular stuff.  The dates were on Tuesday and Thursday.  The first date had standard type of styles, and the second had Hungarian folk-type motifs.  They were all original compositions, of course, but I own that Hungarian style.  We tacked on this free Jazz playing.  We had started to do that.  Ornette Coleman, you know, turned everybody on to this free type of playing.  So anyway, we played that type of thing and regular Jazz.  That's why I had two bass players.  Reggie is better at the free stuff. &quot;\n\nPersonnel:\nAttila Zoller (g)\nLew Tabackin (tarogato on A2, 3, B2, 3)\nHerbie Hancock (p,e-p)\nReggie Workman (b on A4, B1, 2, 4)\nVictor Gaskin (b on A1, 2, 3, 5, B 3)\nSonny Brown (d)\n\nSide A:\n01  Wild Wild Wes 02:42\n02  Another Kind Of Love 04:08\n03  Horns 04:00\n04  Meet In Berlin 04:48\n05  The Birds And The Bees 03:50\n\nSide B:\n01  Alicia's Lullaby 05:16\n02  At Twilight 03:47\n03  Gypsy Cry 08:00\n04  Sweet Hustler 03:35","torrent":{"xt":"urn:btih:491f15816d0dbd0ed92a3c40da6fd7601827e320","amp;dn":"Attila+Zoller+-+Gypsy+Cry+%281969%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"491f15816d0dbd0ed92a3c40da6fd7601827e320","infoHashBuffer":{"type":"Buffer","data":[73,31,21,129,109,13,189,14,217,42,60,64,218,111,215,96,24,39,227,32]},"announce":[],"urlList":[]}}