{"title":"Robbie Williams-Songbook 2009 (Promo-The Mail)[EAC - FLAC] (oan)","uid":5119874,"size":446609449,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:49d26ff86a165777cfe76100b8ac9c21355f80dd&amp;dn=Robbie+Williams-Songbook+2009+%28Promo-The+Mail%29%5BEAC+-+FLAC%5D+%28oan%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"oneanight","files":-1,"time":1255274496,"description":" &lt;a href=&quot;http://bayimg.com/image/iaemdaaci.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/image/iaemdaaci.jpg&lt;/a&gt;\n\n\n\nWhy would Robbie Williams give away his greatest hits to Mail on Sunday readers for free? Louise Gannon, who has known and worked with Robbie since he was 16, explains why he's ripping up the industry rule book yet again.\n\nThe first time I met Robbie Williams was in the back of a second-hand Transit van parked outside a school playground in Rotherham. It was 1990. Williams was 16 years old and, with his as yet unknown band Take That, was touring round junior schools, performing in lunch breaks in school halls to slightly mystified pre-teens. It was hardly rock 'n' roll.\nEnlarge   Robbie Williams shooting the video for Bodies\n\nRobbie shooting the video for his new single, Bodies, at the aeroplane graveyard in the Mojave Desert\n\nGary Barlow, Mark Owen, Howard Donald and Jason Orange were a strange mix of shy, polite, awkward and over-eager boys waiting to be told what to do and say by their then manager, the mercurial Mancunian Nigel Martin-Smith. Gary was keen to talk about the music. Mark, the budding diplomat, did a lot of nodding and grinning. Howard and Jason struggled to think of anything to do or say, clearly unsure whether next week would bring a break-time performance in Hull or a trip down to the dole offi\u001ece.\n\nBut it was Robbie, the baby of the band, who instinctively understood how to handle the situation. Buzzing on the thrill of speaking into a tape recorder (he wanted it played back to hear his voice on tape), he swaggered, pulled faces, made jokes, came out with the (what then seemed) completely ridiculous statement that 'we're going to be the biggest band in Britain' - and eff\u001dortlessly dominated the situation. When it came to photographs, the Stoke-on-Trent-born son of a pub entertainer insisted on climbing on top of a wall to jump into the path of the lens, screaming his head o\u001dff as he fell.\n\nIn the bland suburban surroundings of a northern primary school, in a totally unknown band, Robbie was the showman, the natural born rock star.\n\nAnd then it happened, as Robbie predicted. Take That became not just the biggest band in Britain, but the biggest in Europe, too.\n\nOver another half decade of interviews in flash hotel rooms throughout Europe, I saw him go from being thrilled at his fame to being trapped by the constraints of it. The Robbie Williams from the playground in Rotherham was always too large a character for a boy band.\n\nInitially he didn't bother trying to hide his pleasure in being famous. In 1992, taking refuge in a London hotel room, safe from the adoring mob in the street outside, he told me: 'I love it. I love the fans. I love the screaming. At concerts you can't even hear us singing for the screaming. It's wicked. There's absolutely nothing I don't like about it. I'm never going to complain about any of it. It's all great.'\n\nThe reinvention of Robbie Williams was about to start. Drawing on an eclectic selection of idols ('Who do I like? Loads of people. Tom Jones. David Bowie. Frank Sinatra...') Robbie immersed himself in the business of becoming a solo artist. He moved to Los Angeles, hooked up with songwriter Guy Chambers and produced some of the biggest hits of the decade from Angels to Come Undone, Let Me Entertain You and Rock DJ.\nEnlarge   Robbie Williams shooting video to Bodies\n\nRobbie laughing on the set of his latest video\n\nAs a live performer, he was untouchable, e\u001dffortlessly able to play his audience.\n\n'My best performances of songs are live,' he said in 1997. 'There's something about singing in front of thousands of people that just takes it to the next level.' \n\nTwo of the songs on our CD are from Robbie's spectacular 2003 Knebworth shows - he played to 365,000 people over three nights, which makes the event the biggest ever in UK live music history; no one has come close to this achievement before or since. He has consistently set new records for album and ticket sales, not least when he entered the Guinness Book of Records for selling 1.6 million tickets on one day for his 2006 tour. \n\nBut soon after Robbie began to withdraw from the limelight. And with time out of the spotlight he has clearly turned a corner. The Robbie I once knew as an eternal reckless teenager with something to prove has matured, mellowed and settled into himself. And even as he grew a beard, stayed home (with girlfriend Ayda Field) and retired from evenings out at bars and nightclubs ('those places never appealed to me - I was just looking for someone to stay in with'), he never stopped working on new songs. \n\nWith his new-found inner peace, old scores with Take That have been resolved, scars have healed and a deep affection for his past has grown.\n\nHis new album, Reality Killed The Video Star, out next month, is set to be a massive evolution. Already the industry buzz has suggested it is his greatest to date. It was written at Robbie's Los Angeles home studio and recorded in London. It's had major input from Chambers and is produced by the legendary British music guru Trevor Horn.\n\n\n\nROBBIE'S SONGBOOK CD - IN HIS OWN WORDS\n\n\nRobbie Williams Songbook - Free CD with The Mail on Sunday\n\n1. LET ME ENTERTAIN YOU \u001fLIVE FROM KNEBWORTH\u001e\n\n'I was beyond terrified. There was a sea of 135,000 people in front of me and I felt like anything but a rock god. They hadn't paid to see someone petrified from Stoke-on-Trent, so I had to override my feelings for the sake of entertainment.' \n\n\n2. FEEL \u001fLIVE FROM KNEBWORTH\u001e\n\n'By this point in the show, I had dusted away the self-doubt and just let the song do the talking.' \n\n\n3. COME UNDONE\n\n'My favourite &quot;me&quot; song.'\n\n\n4. VIVA LIFE ON MARS\n\n'The first song written for the Rudebox album, dictating where the album was to go.'\n\n5. THE TROUBLE WITH ME\n\n'This is me trying to be from &quot;art school.&quot;'\n\n\nRobbie Williams\n6. MAN MACHINE\n\n'A song about one drink before blackout.'\n\n\n7. ME AND MY MONKEY\n\n'I had a conversation with a girl in a pool in Singapore. She said,&quot;How do you write a song?&quot; I said ,&quot;You write about anything that comes to mind: give me two things and I will write a song for you this afternoon.&quot; She said, &quot;Monkeys and rollerblades&quot;.'\n\n\n8. NO REGRETS \u001fLIVE FROM SLANE CASTLE\u001e\n\n'A bitter, younger me being a bit of a drama queen about the band I used to be in.'\n\n\n9. PHOENIX FROM THE FLAMES\n\n'It is my crew's favourite Robbie song, I think.'\n\n\n10. NAN'S SONG\n\n'A song dedicated to someone made of love, and the reason I have a B on my neck  -  Bertha Talbot.'\n\n11. ROCK DJ \u001fLIVE FROM MUNGERSDORFER STADION, KOLN\u001e\n\n'I don't want to Rock DJ  -  still don't!'\n\n\n12. ANGELS\n\n'It's a toss-up between the Irish and the Scots for the most mental audiences I have performed in front of. I haven't been fortunate enough to write another song as good as this  -  maybe one day.'\n\nPlaying Time.........: 00:59:32\nTotal Size...........: 419.90 MB\n\nIncluded.............: LOG,CUE,MD5, + Artwork @ 600dpi JEPG\n\n\n\nOnly Available in the uk..\n\n","torrent":{"xt":"urn:btih:49d26ff86a165777cfe76100b8ac9c21355f80dd","amp;dn":"Robbie+Williams-Songbook+2009+%28Promo-The+Mail%29%5BEAC+-+FLAC%5D+%28oan%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49d26ff86a165777cfe76100b8ac9c21355f80dd","infoHashBuffer":{"type":"Buffer","data":[73,210,111,248,106,22,87,119,207,231,97,0,184,172,156,33,53,95,128,221]},"announce":[],"urlList":[]}}