{"title":"The Story Of Rapunzel(1951)-Hyperdrive25.avi","uid":6173911,"size":59258710,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:49e0ef5eb3eb176e7181e16e6c73d16ff6e1070a&amp;dn=The+Story+Of+Rapunzel%281951%29-Hyperdrive25.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hyperdrive25","files":1,"time":1297693522,"description":"                  The Story Of Rapunzel (1951) F. Harryhausen\n                  -------------------------------------------\n\nAn adaptation of the classic German fairy tale. In this version, the story starts of with Rapunzel, a beautiful maiden with extraordinarily long yellow hair, imprisoned in a tall tower which had no doors and only one window, by an old witch who had taken her from her true mother long ago as punishment for stealing some radishes from her garden.\n\nEach day when the old witch came to visit the maiden. She would take great care so that no one would see her and then she would yell, \\&quot;Rapunzel! Rapunzel! Let down your hair!\\&quot;. Whereupon Rapunzel let down her long hair down to the witch below through the only window of the tower. \n\nThen the old witch would cast a magic spell on Rapunzels hair and it would braid itself into a long rope so that the old witch could climb to the top of the tower.\nThe witch would the spend the whole day with Rapunzel gazing at her beauty.\n\nThey lived this way for several years, until at last a wandering prince chanced upon the strange tower. As he stood gazing at the tower from below, he heard some footsteps and quickly hid behind the tower. He saw an old woman approaching, who later yelled \\&quot;Rapunzel! Rapunzel! Let down your hair!\\&quot;, to the window above.\n\nGazing up he saw the most beautiful maiden he had ever seen in his life. He saw the maiden let down her incredibly long yellow hair that shone like gold in the sun, to the old woman below. He watched the old woman climb to the top using the maidens long hair as a rope.\n\nHe waited for the old woman to leave. When the old woman finally left, the prince courageously climb to the top of the tower.\n\nWill Rapunzel be saved? See and enjoy this classic!\n\n\n \nRay Harryhausen (born Raymond Frederick Harryhausen on June 29, 1920 in Los Angeles, California) is an American film producer and a special effects creator and created a brand of stop-motion model animation sometimes called Dynamation.\n\n...................................................................................\n\nThis file can be played with any DIVX/MP4 compatible DVD/VCD Player. Just burn the file onto a CD using Nero or Ashampoo Buring Studio by making a DATA CD.\n\nPlayback guide for PC: To play this video make sure you have VLC media player \n                       (VideoLAN) or SMplayer installed on your PC.\n\n\nDownload VLC Media Player: http://www.videolan.org/\n\nDownload SMPlayer: http://smplayer.sf.net/\n\n\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\nRemember To Keep Seeding. A little seeding goes a long way...\n\n***************************ITS TIME TO GO HYPER!!!*********************************\n\nI love to share,\nI love to care,\nI like to sing,\nSo that I can bring,\nA ray of sunshine in your life.\n\n\nRemember: its YOUR WORLD. I just live in it. :) \n\n          *** A BIG THANK YOU FOR ALL YOU SEEDERS OUT THERE! *** \n                            \n                        KEEP UP THE GOOD WORK!\n\n                            I LOVE U ALL!\n\n\n","torrent":{"xt":"urn:btih:49e0ef5eb3eb176e7181e16e6c73d16ff6e1070a","amp;dn":"The+Story+Of+Rapunzel%281951%29-Hyperdrive25.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49e0ef5eb3eb176e7181e16e6c73d16ff6e1070a","infoHashBuffer":{"type":"Buffer","data":[73,224,239,94,179,235,23,110,113,129,225,110,108,115,209,111,246,225,7,10]},"announce":[],"urlList":[]}}