{"title":"The Red Sea Crossing - The Sea Yields Proof - DivX","uid":5070558,"size":538319682,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:49f80886cc062da01741c6f17d05ac52ab2c2c7b&amp;dn=The+Red+Sea+Crossing+-+The+Sea+Yields+Proof+-+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"verifire","files":-1,"time":1251366681,"description":"Hi there..\n\nThen it finally happened. TPB's trackers are down. But I've been anticipating something like this for a while. So for those who'll want to download torrents I've made and will make in the future, I'm moving nearly all of them to another torrent-site, maybe two. I guess it'll be at least:\n &lt;a href=&quot;\nhttp://www.torrentbox.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentbox.com&lt;/a&gt;\n\nJust browse for the torrents on that site, and all uploads will come up, just give me some days.. :-)\n\nAnd you can still start your download from this site!! Just add these trackers to the torrent, and we'll find each other again.\n &lt;a href=&quot;\nhttp://tracker.publicbt.com:80/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.publicbt.com:80/announce&lt;/a&gt;\n &lt;a href=&quot;\nhttp://tracker.torrentbox.com:2710/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.torrentbox.com:2710/announce&lt;/a&gt;\n \nNow don't click on the &quot;links&quot; above, that won't work. Copy and paste them to add them to your trackers in the torrent-file.\n\nAnd be sure to enable DHT. It tracks too..\n  \nAnyway, they should also all be available by search on my alias, verifire, on for instance: &lt;a href=&quot;\nhttp://www.isoHunt.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.isoHunt.com&lt;/a&gt;\n \n- because they search the contents and comments on the upload for tags as well as the title of the torrent.. Just give me some time..\n\nSee you later, when things are settled and (maybe) there's a working tracker on the site again, and I'll miss it terribly, but I hope for, and guess this isn't the last word on the matter. I'll upload stuff here anyway, as well as on the other sites...\n\nTPB WILL ALWAYS RULE!! THANK YOU, GUYS. YOU'VE BEEN A PLEASURE TO BE SHIPWRECKED WITH. IT'S AN HONOUR...\n\nVerifire.\n\n____________________________________________________________________________\n\nAnd &quot;Somebody&quot;, and it's not my ISP, keeps on blocking my listening port and slows down my bandwidth all the time to an extreme low, but then I change it, and the speed picks up, then they find me, and.. on and on..\nThe only thing I can do, is to appeal to you who are Christians, to help me. Please seed these torrents with me, because I don't know how much longer I'm able to do this. Not for long, I fear. And I live in Norway, a so called &quot;free Nation&quot; of the western world.. And then I'm accused of being a &quot;conspiracy-theorist&quot;.. :-)\n\nAnyway: A while ago I uploaded this movie by Jonathan Gray, and named it &quot;Lamb Of God And Ark Of The Covenant&quot;. It's now uploaded on the TorrentBox site as well.\nTruly amazing stuff. And he has several more amazing DVDs to share with us. I've bought them, And his books too, and they blow my mind...\n\nYou can find them, and prescribe to his free newsletter at:\n &lt;a href=&quot;\nhttp://beforeus.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://beforeus.com/&lt;/a&gt;\n\nUpon prescription, you'll receive special offers not available to the general public.\n\nWhat you are about to see in this movie may:\n1: Leave you in awe and wonder, or you\n2: may not believe in it, and subsequently\n3: also fail to see it's significance.\n\nI hope you are among those under point 1.\nMr Gray is NOT a wealthy man. In fact he has sold his house and rents a place to live, just so that he can travel in search for evidence of the Bible's accuracy. I've made a small upload Named: &quot;Surprising Discoveries Presented By Jonathan Gray&quot;, where he tells you a little about what he has to offer.\n\nI make this upload in spite of Mr. Gray's financial situation, because this is so important and exceptional stuff, so I take that chance in the Name of Jesus. Just to get this footage out before it's too late.\n\nThis one is about the findings of the crossing point of Israel in the Red Sea. It'll blow your mind. I'll just Name it &quot;The Red Sea Crossing - The Sea Yields Proof - DivX&quot;\n\nBut please, after watching this: If you're really a Christian and have the opportunity, and want to support a brother who works full-time for Jesus, go to Mr Gray's website and preferably order at least a book or a DVD or something.\n\nGreetings from Verifire.\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;d0a6b5a2b9b6b9a2b5bdb1b9bc90b7bdb1b9bcfeb3bfbd&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:49f80886cc062da01741c6f17d05ac52ab2c2c7b","amp;dn":"The+Red+Sea+Crossing+-+The+Sea+Yields+Proof+-+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49f80886cc062da01741c6f17d05ac52ab2c2c7b","infoHashBuffer":{"type":"Buffer","data":[73,248,8,134,204,6,45,160,23,65,198,241,125,5,172,82,171,44,44,123]},"announce":[],"urlList":[]}}