{"title":"DVD KidsCrew Disney/Pixar Deel 9 (disney) (dutch) 2Lions-Team","uid":5040089,"size":4697338129,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4a278082707f0278b69c21b2864b14fdc2ecc068&amp;dn=DVD+KidsCrew+Disney%2FPixar+Deel+9+%28disney%29+%28dutch%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1249329759,"description":"DVD KidsCrew Disney/Pixar Deel 9 - 9\n\n\n\nFantasia 2000\n\n\nFladderende driehoekjes binden de strijd aan op de bekende noten van Beethovens Vijfde Symfonie.\nEen school walvissen kiest het luchtruim tijdens Ottorino Respighi's 'Pini di Roma' en even later\nwordt onder de klanken van Gershwins 'Rhapsody in Blue' het leven in het New York van de jaren\ndertig getoond. Vervolgens beleeft een tinnen soldaatje met slechts TTn been een bloedstollend\navontuur op Sjostakovitsj' Pianoconcert No. 2 en haalt een excentrieke flamingo stunts uit met\neen jojo gedurende de finale van Saint-Sadns' 'Le Carnival des Animaux'. Mickey Mouse ziet zijn\nkunsten uit de hand lopen terwijl 'l'Apprenti-sorcier' van Dukas klinkt en Disney-collega Donald\nDuck helpt de oude Noach een handje op de wat pompeuze tonen van Elgars 'Pomp and Circumstance'.\nTenslotte verrijst de natuur miraculeus uit de as wanneer het orkest de laatste maten van Igor\nStravinksky's 'Vuurvogel Suite' inzet.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/8395&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/8395&lt;/a&gt;\n\nEen Luizenleven\n\n\nElk jaar komt een groep sprinkhanen naar de mierenhoop om het voedsel op te eten dat de mieren\nvoor hen verzameld hebben. Op een dag, als de voorbereidingen voor dit offer net zijn afgerond,\ngooit Flik per ongeluk het gehele offer in de rivier. De sprinkhanen geven de mieren een tweede\nkans. Flik gaat op zoek naar andere insecten die mee willen vechten tegen de sprinkhanen, maar\nhij komt terug met een circuscrew. Losjes gebaseerd op Kurosawa's &quot;Seven Samurai&quot;.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/306&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/306&lt;/a&gt;\n\nKeizer Kuzco\n\n\nAls de verwaande keizer Kuzco zijn rechterhand Yzma ontslaat, verandert zij hem uit wraak in een\nlama, en neemt de macht van Kuzco over. Samen met de hulp van een dorpeling moet Kuzco zien terug\nte keren naar het paleis, z'n oude vorm weer terug te zien te krijgen, en de macht van Yzma zien\naf te pakken.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/162&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/162&lt;/a&gt;\n\nRatatouille\n\n5\nRemy is een rat die constant zijn leventje in het dure Franse restaurant Gusteau op het spel zet.\nNiet alleen vanwege zijn liefde voor lekker eten, maar ook omdat hij dolgraag zelf topkok wil zijn.\nWanneer de jonge Linguini, die ondanks zijn gebrek aan talent een baan in de keuken krijgt\naangeboden, de talenten van Remy ontdekt, is dat de kans voor de rat om zijn droom uit te laten\nkomen. Linguini en Remy werken vervolgens samen en proberen Gusteau's restaurant weer op de kaart\nte zetten.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/3786&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/3786&lt;/a&gt;\n\n\nThe Wild\n\n\nDe luidruchtige leeuw Samson is de held van de dierentuin in New York. Als zijn zoon, het leeuwen-\nwelpje Ryan, per ongeluk wordt verscheept naar de wildernis, moet hij in actie komen, geholpen door\neen vreemd gezelschap aan dieren. Samen met de gracieuze giraffe Bridget, de slome slang Larry,\nde komische koala Nigel en de eigenwijze eekhoorn Benny, gaat Samson op een gevaarlijke missie dwars\ndoor de jungle van New York City om Ryan te redden.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/34679&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/34679&lt;/a&gt;\n\n\n\nAlle films zijn van sublieme kwalteit en hebben allen Nederlandse audio.\n\n\nCategorie : Beeld\nFormaat : DVD5\nBron : CAM\n\nOndertitels : Geen\n\nGenre : Animatie\n\nIn deze fantastische collectie zijn de volgende films megenomen:\n\nAssepoester, Finding Nemo, Pinokkio, Sneeuwwitje, Brother Bear, Bambi, Pocahontas, De reddertjes, De Kleine Zeemeermin, Lion King, Belle en het Beest, De Klokkenluider van de Notre Dame, Mulan, Hercules, The Incredibles, Dombo, Fantasia, Peter Pan, Piratenplaneet, Taran en de Toverketel, 101 Dalmatiers, Aladin, Frank en Frey, Ichabod en Meneer Pad, Paniek op de Prairie, Dinosaur, Pooh's Lolifanten Film, Monster en Co, Lady en de Vagebond, Vrij en Vrolijk, Cars, Chicken Little, Robin Hood, Tarzan, Atlantis, Bee Movie, Jungle Boek, Toy Story, Meet the Robinsons, Teigetjes Film, Fantasia 2000, Een Luizenleven, Keizer Kuzco, Ratatouille, The Wild.\n\nThanks: CoolKidWeb\n\n\n*****************************************\n\nBrought to you by\nPioen\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum\n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n******************************************","torrent":{"xt":"urn:btih:4a278082707f0278b69c21b2864b14fdc2ecc068","amp;dn":"DVD+KidsCrew+Disney%2FPixar+Deel+9+%28disney%29+%28dutch%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a278082707f0278b69c21b2864b14fdc2ecc068","infoHashBuffer":{"type":"Buffer","data":[74,39,128,130,112,127,2,120,182,156,33,178,134,75,20,253,194,236,192,104]},"announce":[],"urlList":[]}}