{"title":"David Attenborough's Life Stories (BBC 2009)","uid":5136229,"size":181672606,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4a34f747d535326bc085aec321a973821653c925&amp;dn=David+Attenborough%5C%27s+Life+Stories+%28BBC+2009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dougietrotter","files":-1,"time":1256501195,"description":"David Attenborough's Life Stories - Series 01 - Audio Wildlife Documentary (Ish) - BBC Radio 4 via DVB-T\n\n20 x 10 Minute Episodes - 128Kbps - Mp3\n\n\n\nTHE grand old man of the wildlife documentary brings an unusually personal approach to David Attenborough's Life Stories.\n\nA 20-part run of short talks on the extraordinary variety of creatures, birds and other wonders he has come across during his travels.\n\nSome of these reveal his passion for his work, while others give rare insights into someone who, off-screen, remains a very private individual. \n\nHis initial topics include giant birds and massive flowers, as well as an immaculate fossil feather which gave the world of palaeontology its first insight into the evolutionary link between dinosaurs and birds.\n\n\n\nDavid Attenborough's Life Stories - S01 - E01 - Sloths\nDavid Attenborough's Life Stories - S01 - E02 - Monstrous Flowers\nDavid Attenborough's Life Stories - S01 - E03 - Platypus\nDavid Attenborough's Life Stories - S01 - E04 - Giant Birds\nDavid Attenborough's Life Stories - S01 - E05 - Songsters\nDavid Attenborough's Life Stories - S01 - E06 - Bower Birds\nDavid Attenborough's Life Stories - S01 - E07 - Dragons\nDavid Attenborough's Life Stories - S01 - E08 - Archaeopteryx\nDavid Attenborough's Life Stories - S01 - E09 - Salamander\nDavid Attenborough's Life Stories - S01 - E10 - Birds Of Paradise\nDavid Attenborough's Life Stories - S01 - E11 - The Serpent's Stare\nDavid Attenborough's Life Stories - S01 - E12 - Faking Fossils\nDavid Attenborough's Life Stories - S01 - E13 - Coelacanth\nDavid Attenborough's Life Stories - S01 - E14 - The Dodo\nDavid Attenborough's Life Stories - S01 - E15 - Tracks\nDavid Attenborough's Life Stories - S01 - E16 - Bird's Nest Soup\nDavid Attenborough's Life Stories - S01 - E17 - Adams Face\nDavid Attenborough's Life Stories - S01 - E18 - Amber\nDavid Attenborough's Life Stories - S01 - E19 - Large Blue\nDavid Attenborough's Life Stories - S01 - E20 - Collecting\n\n\n\nAudio Format    : MP3\nDuration        : 10mn s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n","torrent":{"xt":"urn:btih:4a34f747d535326bc085aec321a973821653c925","amp;dn":"David+Attenborough%5C%27s+Life+Stories+%28BBC+2009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a34f747d535326bc085aec321a973821653c925","infoHashBuffer":{"type":"Buffer","data":[74,52,247,71,213,53,50,107,192,133,174,195,33,169,115,130,22,83,201,37]},"announce":[],"urlList":[]}}