{"title":"El evangelio de la espada [ebook].","uid":6137237,"size":10238201,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a8c0eea3a49b5dc1976745e4cb0e4c931786a65&amp;dn=El+evangelio+de+la+espada+%5Bebook%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1296347422,"description":"Cuando a finales del siglo VIII Carlomagno emprendiÃƒÂ³ la conquista del norte, en su afÃƒÂ¡n por expandir el Imperio Franco y convertir a los paganos al cristianismo, tuvo que enfrentarse a pueblos que han pasado a la historia por su ardor guerrero, como los vikingos o los sajones. Pero, sobre todo, tuvo que vÃƒÂ©rselas con un personaje indÃƒÂ³mito y audaz que se puso al frente de los rebeldes y que no tardarÃƒÂ­a en convertirse en sÃƒÂ­mbolo de la independencia polÃƒÂ­tica y religiosa sajona, y en un guerrero legendario: Widukind.\n\n\n\nEn esta arrebatadora novela, con la que Artur Balder inicia su proyecto narrativo mÃƒÂ¡s ambicioso hasta la fecha, la trilogÃƒÂ­a CrÃƒÂ³nicas de Widukind, la combinaciÃƒÂ³n de un profundo y sÃƒÂ³lido conocimiento histÃƒÂ³rico, la garra en la narraciÃƒÂ³n de batallas, la agudeza en la exploraciÃƒÂ³n de los pensamientos mÃƒÂ¡s ÃƒÂ­ntimos de los personajes y la visiÃƒÂ³n global de lo que fue y significÃƒÂ³ un momento trascendental en la historia europea dan como resultado una de las mejores novelas histÃƒÂ³ricas que pueden leerse en nuestros dÃƒÂ­as.\n\nEl Evangelio de la Espada marca un hito en el gÃƒÂ©nero de la novela histÃƒÂ³rica ambientada en la Edad Media.","torrent":{"xt":"urn:btih:4a8c0eea3a49b5dc1976745e4cb0e4c931786a65","amp;dn":"El+evangelio+de+la+espada+%5Bebook%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a8c0eea3a49b5dc1976745e4cb0e4c931786a65","infoHashBuffer":{"type":"Buffer","data":[74,140,14,234,58,73,181,220,25,118,116,94,76,176,228,201,49,120,106,101]},"announce":[],"urlList":[]}}