{"title":"Volcanic Eruption Used for War Games","uid":5508867,"size":52606781,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:4a9ca11910b9f4b4a73f809ea26520a220e48be8&amp;dn=Volcanic+Eruption+Used+for+War+Games&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ryba777","files":6,"time":1271963858,"description":"\nVolcanic Eruption Used for War Games\n\n\n\np r o u d l y  b r o u g h t  t o  y o u  b y\n\n\n                      oooo                  ooooooooooo ooooooooooo ooooooooooo \noo oooooo  oooo   oooo 888ooooo     ooooooo 888    888  888    888  888    888  \n 888    888 888   888  888    888   ooooo888      888         888         888   \n 888         888 888   888    888 888    888     888         888         888    \no888o          8888   o888ooo88    88ooo88 8o   888         888         888     \n            o8o888                                                              \n\n\n\nBevolution - The Human Project Presents\n\nDr. Rauni-Leena Luukanen Kilde talks about Iceland, volcanos, war, NATO, propaganda (19th April 2010)\n\nIt's a Warning Signal\n\nVolcanic eruption as exercise for world war? Dr. Rauni Kilde, former health minister in Lapland / Finland and a studied medical doctor, speaks on 20 April 2010 about the volcanic eruption in Iceland. The points, which she addresses: The volcanic eruption and the grounding are meant to stir up fear. The earthquake, which caused the volcanic eruption, was artificially created by technologies such as HAARP or EISCAT. By the grounding of airplanes and the manipulation of the media in the whole play, NATO and the European Union knew large military exercises could be driven through, as I had already written in this article over Eyjafjalla. The military exercises could serve as preparation for a war in Iran. The whole event is a large experiment. She also talks about psychic mind control used to manipulate politicians.\n\n\nFiles: \n\nMP4: Two video clips with Rauni Kilde\n\nPDF: Revealed - European Military Use Total Breakdown of Civil Aviation for War Games (German with English Translation)\n\n\nComment: What is true here, what is disinformation? Don't believe, think for yourself, research, use your intuition, do your homework, question authority.\n\n\ntags: Iceland, volcano, military, exercise, war, NATO, propaganda, PSYOPS, disinformation, World War 3, HAARP, EISCAT, Rauni Kilde, grounding, Eyjafjalla, Iran, Brilliant Ardent, experiment, mind control, manipulation, propaganda\n","torrent":{"xt":"urn:btih:4a9ca11910b9f4b4a73f809ea26520a220e48be8","amp;dn":"Volcanic+Eruption+Used+for+War+Games","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a9ca11910b9f4b4a73f809ea26520a220e48be8","infoHashBuffer":{"type":"Buffer","data":[74,156,161,25,16,185,244,180,167,63,128,158,162,101,32,162,32,228,139,232]},"announce":[],"urlList":[]}}