{"title":"Kanye West/KiD CuDi - Welcome To Heartbreak [HQ] [balleron24z]","uid":5114183,"size":143433728,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4aa0828b7160ea24a2bafebf7b203575fd22a86b&amp;dn=Kanye+West%2FKiD+CuDi+-+Welcome+To+Heartbreak+%5BHQ%5D+%5Bballeron24z%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"balleron24z","files":-1,"time":1254972149,"description":"Hello again.  So yea, first let me start by saying that you assholes aren't nice enough to just say thanks for the upload or appreciate your work.  Instead you go and bitch about me having a watermark on my video....or rather a logo. A fucking logo, whoopteedoo.  MTV DOES THAT SHIT TOO YOU GONNA SUE EM?  NOPE  Go suck a fucking dick seriously.  Its a video.  Want a better version?  GO GET IT YOUR DAMN SELF!!!!\n\nThis is the HQ version of Kanye West's &quot;Welcome To Heartbreak&quot; video featuring KiD CuDi.  This video was released a few months back, but didn't see it on TPB.  I snatched it from the provider &quot;On Smash&quot; or something like that, can't remember the name, but they had the best quality one.  This video is WAY different from most mainstream videos, the producer used an effect which simulated a poorly encoded video.  The result is a wicked awesome fade-style transition.  \n\nCodec for video is DivX @ 3948kbps Reso: 640x424 and codec for audio is MP3 @ 256kbps 48000khz.  I initially captured the video with no audio (stupid Vista stereo mix lol) but that was good because it uses more cpu to capture audio in the process, resulting in jittery video capture.  I then used VirtualDubMod to add the MP3 stream to the file of the audio from the actual album, and saved the AVI.  I re-processed the video with VirtualDubMod to reduce the framerate to 29.97fps, as when I captured, I recorded at 200fps so if there was a frameskip, it would be able to capture the lost frame.  Hope you enjoy the video.  If you like this release, please leave comments and some positive feedback. ","torrent":{"xt":"urn:btih:4aa0828b7160ea24a2bafebf7b203575fd22a86b","amp;dn":"Kanye+West%2FKiD+CuDi+-+Welcome+To+Heartbreak+%5BHQ%5D+%5Bballeron24z%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aa0828b7160ea24a2bafebf7b203575fd22a86b","infoHashBuffer":{"type":"Buffer","data":[74,160,130,139,113,96,234,36,162,186,254,191,123,32,53,117,253,34,168,107]},"announce":[],"urlList":[]}}