{"title":"A_Force_More_Powerful_ A_Century_of_Nonviolent_Conflict","uid":6249579,"size":1377442195,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4af3185d177b5fddabdcb62563ee7581dc20ed5f&amp;dn=A_Force_More_Powerful_+A_Century_of_Nonviolent_Conflict&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"xposya","files":3,"time":1300360025,"description":"A FORCE MORE POWERFUL- A Century of Nonviolent Conflict\n\nA FORCE MORE POWERFUL is a two part documentary series on one of the 20th century's most important and least known stories - how nonviolent power overcame oppression and authoritarian rule. In South Africa in 1907, Mohandas Gandhi led Indian immigrants in a nonviolent fight for rights denied them by white rulers. The power that Gandhi pioneered has been used by underdogs on every continent and in every decade of the 20th century, to fight for their rights and freedom.\n\nEPISODE ONE\n\nIn the 1960s, Gandhi's nonviolent weapons were taken up by black college students in Nashville, Tennessee. Disciplined and strictly nonviolent, they successfully desegregated Nashville's downtown lunch counters in five months, becoming a model for the entire civil rights movement.\n\nIn India in the 1930s, after Gandhi had returned from South Africa, he and his followers adopted a strategy of refusing to cooperate with British rule. Through civil disobedience and boycotts, they successfully loosened their oppressors' grip on power and set India on the path to freedom.\n\nIn 1985, a young South African named Mkhuseli Jack led a movement against the legalized discrimination known as apartheid. Their campaign of nonviolent mass action, most notably a devastating consumer boycott in the Eastern Cape province, awakened whites to the black grievances and fatally weakened business support for apartheid.\n\nRuntime: 77 Minutes\n\nEPISODE TWO\n\nIn April 1940, German military forces invaded Denmark. Danish leaders adopted a strategy of &quot;resistance disguised as collaboration&quot;- undermining German objectives by negotiating, delaying, and obstructing Nazi demands. Underground resistance organized sabotage and strikes, and rescued all but a handful of Denmark's seven thousand Jews.\n\nIn 1980, striking workers in Poland demanded independent unions. Using their leverage to negotiate unprecedented rights in a system where there was no power separate from the communist party, they created a union, Solidarity. Driven underground by a government crackdown in 1981, Solidarity re-emerged in 1989 as Poland's governing political party.\n\nIn 1983, Chilean workers initiated a wave of nonviolent protests against the military dictatorship of Gen. Augusto Pinochet. Severe repression failed to stop protests, and violent opposition failed to dislodge the dictatorship- until the democratic opposition organized to defeat Pinochet in a 1988 referendum.\n\nRuntime: 77 Minutes\n\n----\nReviewing a century often called the most violent in history, this series is the story of millions who chose to battle the forces of brutality with nonviolent weapons- and won.","torrent":{"xt":"urn:btih:4af3185d177b5fddabdcb62563ee7581dc20ed5f","amp;dn":"A_Force_More_Powerful_+A_Century_of_Nonviolent_Conflict","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4af3185d177b5fddabdcb62563ee7581dc20ed5f","infoHashBuffer":{"type":"Buffer","data":[74,243,24,93,23,123,95,221,171,220,182,37,99,238,117,129,220,32,237,95]},"announce":[],"urlList":[]}}