{"title":"Danza.Acondicionamiento.Fisico","uid":5495320,"size":9527950,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4af367d865f12a4caa416cb3fc6a669491051780&amp;dn=Danza.Acondicionamiento.Fisico&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"furtaperas","files":1,"time":1271239702,"description":"En este libro se describen los principios bÃƒÂ¡sicos del entrenamiento de la resistencia y del acondicionamiento fÃƒÂ­sico para la danza. Para ello, se integran los componentes tradicionales de la fuerza, la flexibilidad y el nivel cardiorrespiratorio desde una perspectiva somatica. El autor destaca la importancia del alineamiento en todas las secuencias del movimiento ejercicios y pasos de danza, describe la biodinÃƒÂ¡mica del mismo junto con los efectos que tiene sobre la ejecuciÃƒÂ³n de las secuencias de danza y, muestra cÃƒÂ³mo aumentar el equilibrio mediante la mejora de la coordinacion corporal. TambiÃƒÂ©n se centra en las tÃƒÂ©cnicas para el uso de las imÃƒÂ¡genes, la conexiÃƒÂ³n mente-cuerpo y en el modo de aplicar estos principios al entrenamiento con resistencia y al aumento de la flexibilidad. Asimismo, se dedica un capitulo a tres de los principales intereses de los bailarines: giros, saltos y aberturas, y muestra como mejorar estas tres habilidades utilizando la atencion cinestesica y las tecnicas de acondicionamiento. Por ultimo, se presenta una sesion de veinte minutos con Thera-Band que combina los principios tratados a lo largo del libro dentro de una sesion corporal completa. Eric Franklin tiene mas de veinticinco anos de experiencia como bailarin y coreografo. Es miembro de la International Association of Dance Medicine and Science y fundador y director del Instituto del Metodo Franklin en Uster, Suiza.","torrent":{"xt":"urn:btih:4af367d865f12a4caa416cb3fc6a669491051780","amp;dn":"Danza.Acondicionamiento.Fisico","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4af367d865f12a4caa416cb3fc6a669491051780","infoHashBuffer":{"type":"Buffer","data":[74,243,103,216,101,241,42,76,170,65,108,179,252,106,102,148,145,5,23,128]},"announce":[],"urlList":[]}}