{"title":"Frank Zappa - Just Another Band From L.A. TQMP","uid":5100206,"size":356671815,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4b18e1f37e51235e7d2785f4a624d0bb8050d61e&amp;dn=Frank+Zappa+-+Just+Another+Band+From+L.A.+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":19,"time":1253909916,"description":"Just Another Band From L.A. was recorded live at the Pauley Pavillion, UCLA (Los Angeles), on August 7, 1971. Released in early 1972, it is the last album to document the Mothers of Invention lineup that included singers Mark Volman and Howard Kaylan (aka Flo &amp; Eddie). (The other bandmembers on this particular recording are: Ian Underwood, Aynsley Dunbar, Don Preston, and Jim Pons.) A previous LP, Fillmore East, June 1971, focused on material related to life on the road that had to be dropped from the movie and album 200 Motels. This second live record presents different material, plus two old favorites completely rearranged for this version of the band: &quot;Call Any Vegetable&quot; and &quot;Dog Breath.&quot; Side one of the LP was entirely comprised of &quot;Billy the Mountain,&quot; a continuous 25-minute story-song. The piece, filled with silly (some would say childish) stage antics and simple rock riffs, foretells &quot;The Adventures of Greggary Peccary&quot; and follows a logic similar to the &quot;Sofa&quot; suite. But the inclusion in its plot of dozens of very space-and-time-specific references (to towns, TV personalities, government officials, and businesses) made it age very quickly. Fans of the Flo &amp; Eddie period will love the improvised storyline developments. Others should approach with caution, even though this one has much better sound quality than Fillmore East, June 1971. \n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:      &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)\t","torrent":{"xt":"urn:btih:4b18e1f37e51235e7d2785f4a624d0bb8050d61e","amp;dn":"Frank+Zappa+-+Just+Another+Band+From+L.A.+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b18e1f37e51235e7d2785f4a624d0bb8050d61e","infoHashBuffer":{"type":"Buffer","data":[75,24,225,243,126,81,35,94,125,39,133,244,166,36,208,187,128,80,214,30]},"announce":[],"urlList":[]}}