{"title":"Renegade Angel - Jim Steinman, Meat Loaf, Bonnie Tyler, et. al.","uid":6218980,"size":247779080,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4b4b064edc6e32521d0b397f5bdae202c4ab3b05&amp;dn=Renegade+Angel+-+Jim+Steinman%2C+Meat+Loaf%2C+Bonnie+Tyler%2C+et.+al.+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cashiers","files":27,"time":1299267282,"description":"Bad For Good is an 1981 album by American songwriter Jim Steinman. Steinman wrote all of the songs and performed on most, although Rory Dodd contributed lead vocals on some tracks.\n\nThe songs were originally intended to be recorded by Meat Loaf as a follow up to Bat out of Hell, titled Renegade Angel. However, Meat Loaf suffered vocal problems and was unable to sing. However, he would record several tracks from Bad for Good for his later albums.\n\nThe critical reaction to the album was rather mediocre. Many reviews commented that Steinman's singing voice was inadequate for the songs.\n\nMany of the tracks, or elements thereof, on Bad for Good have been recorded by other artists, including projects that Steinman has been involved in.\n\nHe produced Barbra Streisand recording &quot;Left in the Dark&quot; for her album Emotion. The intro to &quot;Stark Raving Love&quot; was used for &quot;Holding Out for a Hero&quot;, a 1984 hit for Bonnie Tyler.\n\nMeat Loaf has recorded most of Bad for Good:\n\n* &quot;Surf's Up&quot; - Bad Attitude;\n* &quot;Rock And Roll Dreams Come Through&quot; - Bat out of Hell II\n* &quot;Out of the Frying Pan (And Into the Fire)&quot; - Bat out of Hell II\n* &quot;Love And Death and an American Guitar&quot; (&quot;Wasted Youth&quot;) - Bat out of Hell II\n* &quot;Lost Boys and Golden Girls&quot; - Bat out of Hell II\n* &quot;Left in the Dark&quot; - Welcome to the Neighborhood;\n* &quot;Bad for Good&quot; - Bat out of Hell III: The Monster\n* An excerpt of &quot;The Storm&quot; is used as intro to &quot;Seize the Night&quot; on Bat out of Hell III.\n\n\nTracks / Artists\n\nSeize The Night - Meat Loaf Disc 1\nBad For Good - Meat Loaf Disc 1\nLost Boys And Golden Girls - Meat Loaf Disc 1\nLove And Death and an American Guitar - Meat Loaf Disc 1\nOut Of The Frying Pan (And Into the Fire) - Meat Loaf Disc 1\nSurf's Up - Meat Loaf Disc 1\nLeft In The Dark - Meat Loaf Disc 1\nRock And Roll Dreams Come Through - Meat Loaf Disc 1\nThe Storm - Jim Steinman Disc 2\nBad For Good - Jim Steinman Disc 2\nLost Boys And Golden Girls - Jim Steinman Disc 2\nLove And Death And An American Guitar - Jim Steinman Disc 2\nStark Raving Love - Jim Steinman Disc 2\nOut Of The Frying Pan (And Into The Fire) - Jim Steinman Disc 2\nSurf's Up - Jim Steinman Disc 2\nDance In My Pants - Jim Steinman Disc 2\nSpoken Introduction / Left In The Dark / Spoken Ending - Jim Steinman Disc 2\nRock And Roll Dreams Come Through - Jim Steinman Disc 3\nOverture - Dance Of The Vampire Demos Disc 3\nThe Opening of the Box - Pandora's Box Disc 3\nWasted Youth (Speech) (Live) - Meat Loaf Disc 3\nOut Of The Frying Pan (And Into The Fire) (Live) - Meat Loaf Disc 3\nOut Of The Frying Pan (And Into The Fire) (Live) - Meat Loaf Disc 3\nRock And Roll Dreams Come Through (Live) - Meat Loaf Disc 3\nRock And Roll Dreams Come Through (Live) - Meat Loaf Disc 3\nLeft In The Dark - Barbra Streisand Disc 3\nHolding Out For A Hero - Bonnie Tyler Disc 3\n","torrent":{"xt":"urn:btih:4b4b064edc6e32521d0b397f5bdae202c4ab3b05","amp;dn":"Renegade+Angel+-+Jim+Steinman%2C+Meat+Loaf%2C+Bonnie+Tyler%2C+et.+al.+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b4b064edc6e32521d0b397f5bdae202c4ab3b05","infoHashBuffer":{"type":"Buffer","data":[75,75,6,78,220,110,50,82,29,11,57,127,91,218,226,2,196,171,59,5]},"announce":[],"urlList":[]}}