{"title":"Flikken Seizoen 8 dvd 2 (Dutch) TBS","uid":6278482,"size":4519893372,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4c67adfef5c0a32d1f57e10775e768ccb6877cca&amp;dn=Flikken+Seizoen+8+dvd+2+%28Dutch%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Mad_Parrot","files":-1,"time":1301350169,"description":"\n\n\nFlikken Seizoen 8 dvd 2\n\n\n\nDe serie werd gecreÃƒÂ«erd door scenarioschrijver Pierre De Clercq en producent Erwin Provoost en was een coproductie van het productiehuis MMG en VRT en, seizoen 5 en 6, ook de Nederlandse TROS.\n\nDe serie Flikken heeft de Vlaamse stad Gent als achtergronddecor. Het lokale politieteam staat centraal in de serie en niet een of twee hoofdpersonages. De makers hadden bij aanvang van de serie zoveel vertrouwen in de serie, dat de opnames voor de tweede reeks in 1998 al begonnen waren, voordat de eerste aflevering uitgezonden was. \nIn de eerste reeks was er geen doorlopend verhaal tussen de verschillende afleveringen, dit volgde pas in de latere reeksen. Zo gingen de flikken, bijgestaan door de Nederlandse rechercheur Robert Nieuwman (Boudewijn de Groot), in 2004 op zoek naar de seriemoordenaar Luc Feiremans.\n\nIn april 2007 maakte de Vlaamse omroep VRT bekend dat het tiende seizoen van Flikken het laatste zou zijn. De financiÃƒÂ«n speelden hierbij een rol. De serie kostte veel geld, terwijl de VRT veel andere fictiereeksen op de rol had staan. \nHet slotseizoen, dat overigens maar tien afleveringen heeft in plaats van de gebruikelijke dertien, werd van 15 februari tot 19 april 2009 uitgezonden op ÃƒÂ©ÃƒÂ©n.[1]\n\nOm Flikken een waardige afsluiter te geven werd er op zaterdag 18 april 2009 in Gent een Flikkenparty georganiseerd. Op het einde van de dag kon in Kinepolis Gent de laatste Flikken-aflevering in avant-premiÃƒÂ¨re bekeken worden.\n\nSinds september 2007 zendt de TROS een Nederlandse versie van Flikken uit, Flikken Maastricht. Deze serie is qua cast kleinschaliger dan de originele serie.\n\n95 &quot;Gilbert en George&quot; 25 februari 2007 8.04 \nEr wordt door het team ontdekt dat de Barracudabende in verband staat met een vastgoedmaatschappij Immoportus. Immoportus heeft grootse plannen met een volkswijk aan de grens van de Gentse haven. Om de plannen te realiseren wordt het niet al te nauw genomen met de wet. Raymond denkt dat Lidy die aan de Spaanse kust verblijft de relatie tussen hem en Carla eindelijk accepteert.  \n\n96 &quot;Grote kuis&quot; 3 maart 2007 8.05 \nEen meisje als getuige van de bende wordt geprobeerd uit de weg te ruimen door de advocaat Davina Lansknecht van Immoportus. Gilbert Remmery die getuige is van de illegale praktijken in de volkswijk lijkt dan toch bereid te getuigen. Bij Immoportus kunnen ze dit minder waarderen. De hond van Gilbert moet dit met zijn leven bekopen.  \n\n97 &quot;Code T1&quot; 10 maart 2007 8.06 \nHet meisje CÃƒÂ©leste Mombaerts wordt kroongetuige. Maar overleeft zij de gedwongen overdosis van paracetamol wel? Om te overleven heeft ze een levertransplantatie nodig. Pasmans komt in contact met een geÃƒÂ¯nteresseerde journalist. Het is een knappe mannelijke journalist die ook de indruk wekt homofiel te zijn. Raymond maakt hier onschuldige grapjes over tegen Pasmans. Bruno komt niet op zijn werk verschijnen en is nergens te vinden.  \n\n98 &quot;Code rood&quot; 17 maart 2007 8.07 \nBruna is nog steeds spoorloos en wordt officieel geseind. Er zijn weinig aanwijzingen, maar die wijzen erop dat zijn verdwijning waarschijnlijk een bewuste zet was. Emma komt met het eerste harde bewijs tegen de advocaat Lansknecht. De relatie tussen de journalist Mortelmans en Pasmans krijgt ook een onverwachte wending.  \n\n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : ISO \nBron          : Retail\nMenu          : Ja\nExtra's       : Ja\nAudio         : Nederlands\nOndertitels   : Nederlands (instelbaar)\nCover &amp; label : Ja\nGenre         : Actie\n \n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Flikken_(televisieserie)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Flikken_(televisieserie)&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.een.be/programmas/flikken&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.een.be/programmas/flikken&lt;/a&gt;\n\n\n\nBrought to you by TinkerBell @ TBS","torrent":{"xt":"urn:btih:4c67adfef5c0a32d1f57e10775e768ccb6877cca","amp;dn":"Flikken+Seizoen+8+dvd+2+%28Dutch%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c67adfef5c0a32d1f57e10775e768ccb6877cca","infoHashBuffer":{"type":"Buffer","data":[76,103,173,254,245,192,163,45,31,87,225,7,117,231,104,204,182,135,124,202]},"announce":[],"urlList":[]}}