{"title":"Pat Metheny Group - Companion Vol 1 - 1976-1980","uid":5109196,"size":1456478504,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4c805bfe0d645f36397818ea5f84ae2141a7b27e&amp;dn=Pat+Metheny+Group+-+Companion+Vol+1+-+1976-1980&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":55,"time":1254627340,"description":"This is a special compilation of not comercially available tunes.\n\n\nActually it is not compressed with FLAC but with Shorten (SHN).\n\n\nAnother lossless audio format. \n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Shorten&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Shorten&lt;/a&gt;\n\n\nI just wanted to be able to put it in the popular flac category.\n\n\n\nPLEASE SEED   !!!\n\n\n\n\n\nPAT METHENY GROUP\nThe PMG Companion, Volume 1 (1976 - 1980)\n\nThe PMG Companion series (additional volumes to follow) attempts to gather together the many\ncompositions the Pat Metheny Group has performed in its history which have not appeared on\ncommercially available albums by the PMG. Included are unreleased originals, standards and\ncovers, and PMG treatments of material Metheny has released outside the Group.\n\nEvery effort was made to determine which was the best available version of each inclusion.\nMost of the choices were &quot;obvious choices.&quot; By happy coincidence, many of the Group's best\nperformances (and a good number of the rarities) happened to have been broadcast on radio or\ntelevision. The tracks that are taken from audience recordings are also very listenable. This\ncompilation is &quot;a work in progress,&quot; however, and members of the collecting community are urged\nto come forward with 1) source upgrades, 2) any performance by the PMG of a piece that does not\nappear here and meets criteria for inclusion, 3) alternate performances that are thought to be\nsuperior to the ones used, 4) information as to titles, dates and locations that are now listed\nas &quot;unidentified,&quot; and 5) corrections.\n\nTremendous thanks are due Charles Fredericks for his tireless dedication to presenting the best\npossible package. Charles remastered the raw tracks so that the playback volumes were consistent.\nHe faded applause in and out. He gently and expertly reduced tape hiss. He EQ'ed, when necessary.\nIn, short, he lovingly polished the diamond in the rough. Also, huge thanks are due Ted Foos,\nwho graciously gave of his time and talent to the creation of the artwork package for this\nvolume. It is sincerely hoped that these two friends will again offer their artistry and\nexpertise to the creation of Volume 2.\n\nLastly, it would be a great oversight not to thank the many tapers and collectors who have\nworked to capture and to share these recordings. They have collectively unlocked, for this\nlongtime PMG fan and for many others, an only-dreamed-of vault of live performance documents.\nThere is one person among them I wish to thank by name. He has a heart as big as a house, a true\npassion for &quot;all things Metheny,&quot; and is one of the world's foremost collectors - Lisardo\nMaggipinto. These compilations could not have been assembled (at least, not by me) without his\nunending generosity over the years. \n\nWe hope you will enjoy and value this addition to your PMG collection, and will seek out\nVolume 2 of The PMG Companion series when it becomes available. Please remember that this\ncompilation is never to be used for personal gain. Any attempts to sell copies via eBay or\nother means will be thwarted to the best of the abilities of the international PMG fan\ncommunity, to whom this series is humbly dedicated. \n\nJim Leonard\nJuly 2004 \n\n\n\nDisc 1:\n\na) Pat Metheny\n\nPersonnel:\nPat Metheny: guitar\nLyle Mays: piano\nMike Richmond: bass\nDan Gottlieb: drums\n\n\n\nThe first five tracks of this compilation are taken from the first show of a two-night stand\nat Boston's then-premier jazz venue, the Jazz Workshop, on September 21, 1976. The set was\nbroadcast by WBCN, Boston's influential progressive rock station, as part of its &quot;Live At The\nJazz Workshop&quot; series.\n\nAt the time of the broadcast, Metheny and drummer Dan Gottlieb were members of the Gary Burton\nQuartet and were preparing to record &quot;Passengers&quot; with Burton and then to tour. Metheny, with\nBurton's blessings and encouragement, had already released his debut as a leader, &quot;Bright Size\nLife&quot; (a trio project, with Jaco Pastorius, bass, and Bob Moses, drums), the previous year. And\nit was the generous Burton who introduced Metheny to pianist Lyle Mays at the Berklee School of\nMusic in Boston in 1976, suggesting they might find in each other simpatico musical\nsensibilities.\n\nThe Jazz Workshop dates were booked as a showcase engagement for then-local favorite (but\nquickly emerging phenomenon) Pat Metheny, who would soon gain wider international recognition\nand acclaim with the release of &quot;Watercolors,&quot; featuring Mays and Gottlieb (along with ECM\nlabel-mate Eberhard Weber on bass). To the best of my knowledge, Metheny, Mays and Gottlieb\nhad not performed together in public before these Boston shows, nor would they again until they\ncame together with bassist Mark Egan to form the Pat Metheny Group in the spring of the following\nyear. Bassist Mike Richmond was a member of Jack DeJohnette's band at the time of the Jazz\nWorkshop dates, and, like the other players, active at Berklee. With three-fourths of the\noriginal quartet in the group, however, and with the launch of the PMG only months away, it was\nimpossible not to regard these five tracks as &quot;PMG&quot; performances.\n\nPersonnel:\nPat Metheny: guitar\nLyle Mays: piano\nMike Richmond: bass\nDan Gottlieb: drums\n\n01. Bright Size Life (Metheny)\n      06:04 (Boston, Massachusetts, September 21, 1976)\nThis performance of the title track from Metheny's debut contains a rare solo by Mays. When the\nPMG was formed in early 1977, &quot;Bright Size Life&quot; was used to feature bassist Mark Egan.\n \n02. The Whopper (Metheny)\n      06:48 (Boston, Massachusetts, September 21, 1976)\nThis is likely the only PMG version of this seminal Metheny original. A favorite from the\nalbum, it was released in 1977 by the Gary Burton Quartet (featuring Metheny and Gottlieb) on\n&quot;Passengers.&quot; \n\n03. Nacada (Metheny)\n      05:00 (Boston, Massachusetts, September 21, 1976)\nOn stage, Metheny introduced this beautiful composition as his first attempt at writing a jazz\nballad. While later PMG performances would find Mays providing subtle backing on Oberheim\nsynthesizer, in this early reading he contributes his always-eloquent accompaniment solely on\nacoustic piano. Like &quot;The Whopper,&quot; this piece was featured on the Gary Burton Quartet's\n&quot;Passengers.&quot;\n\n04. There Will Never Be Another You (Harry Warren-Mack Gordon)\n      12:55 (Boston, Massachusetts, September 21, 1976)\nTo the best of my knowledge, this is the only existing PMG performance of this standard. All the\nplayers know the song well, and it swings. &quot;In the tradition,&quot; each musician receives ample solo\nspace, and each makes great use of it.  \n\n05. Unquity Road (Metheny) \n      06:54 (Boston, Massachusetts, September 21, 1976)\nA rare performance of this hard-driving tune from &quot;Bright Size Life,&quot; Mays again navigates\npreviously uncharted waters to deliver an impassioned solo to complement Metheny's. Gottlieb and\nRichmond are right there with them, all the way. The track originates from a source inferior to\nthe one used for the previous four Jazz Workshop tracks - &quot;Unquity Road&quot; was, sadly, incomplete\nin the superior source - and an upgrade is sought.\n\n\n\nb) Pat Metheny Group (1977 - 1980)\n\nPersonnel:\nPat Metheny: guitar\nLyle Mays: piano, keyboards\nMark Egan: bass\nDan Gottlieb: drums\n\n06. Unity Village (Metheny)\n      06:42 (unidentified location, 1977)\nHere is a rare stand-alone performance of this memorable tune from the &quot;Bright Size Life&quot; album,\nand - as was the case with the version of &quot;Bright Size Life&quot; heard earlier - it includes an\nequally rare solo by Mays. This tune was used almost exclusively during the years of the original\nPMG to open a three-part suite. &quot;Unity Village&quot; would dissolve into a solo guitar improvisation,\nwhich would, in turn, segue into a full-band rave-up (usually Keith Jarrett's &quot;The Windup&quot;).\nMetheny would be the lone soloist on the &quot;Unity Village&quot; portion of the suite, with Mays' feature\nreserved for the closer.  \n\n07. Missouri Uncompromised (Metheny)\n      06:16 (Montreal, Quebec, 1977)\nThis exciting version of yet another tune from &quot;Bright Size Life&quot; is an edit from just such a\n&quot;Unity Village&quot; suite (see previous track), where it served as the closer, and as a feature for\nthe stunning drumming of Gottlieb. (One of the true benefits of hearing live recordings of the\noriginal quartet is the acquiring a deeper understanding of Gottlieb's musicianship and important\ncontributions to the Group during his tenure.) Note the quote from &quot;House Of The Rising Sun.&quot;\nThe PMG would quote the song again, in grander fashion - along with &quot;Louie Louie&quot; and other rock\nand soul favorites - during the &quot;American Garage&quot; era.\n\n08. All The Things You Are (Jerome Kern-Oscar Hammerstein)\n      03:43 (Montreal, Quebec, 1977)\nThis standard was performed frequently during the first year of the PMG, and Metheny has\ncontinued to display his affection for it in trio and other outside-the-Group settings in the\nyears since. In its original incarnation as a stripped-down quartet, the PMG could be more\nexploratory (as a unit) in live performance than it had the luxury of being in later years.\nConsequently, the Group approached some material, including this tune, from considerably\ndifferent angles on different nights. This version presents the standard as a fast-paced Metheny\nfeature, and I consider this to be the &quot;definitive&quot; PMG performance. A studio version was\nreleased on Metheny's 1990 trio album, &quot;Question And Answer&quot; (Dave Holland, bass, and Roy Haynes,\ndrums). \n\n09. Unidentified #1\n      08:24 (Portland, Maine, August 3, 1977)\nIs this an original, or is it a swingin' blues from the pen of one of the masters? In that\nMetheny does not introduce it as a cover, which he normally does when the PMG play one, my\nguess is that it's an original (as much as it can be considered one). Whatever the case, it\nfurther demonstrates the Group's straight-ahead jazz chops, while it retains the unmistakable\nstylistic characteristics of these decidedly contemporary musicians.\n\n10. On Green Dolphin Street (Ned Washington-Bronislau Kaper)\n      06:42 (unidentified location, 1977)\nHere's a joyful, hard-chargin' performance of this seldom-played (by the PMG) standard.\n\n11. Unidentified #2\n      06:36 (Troy, New York, 1977)\nThis is a slower, funkier blues than the blues of Unidentified #1. Except for that fact, the\nabove comments regarding Unidentified #1 apply here.\n\n\n\nDisc 2:\n\n01. Midwestern Nights Dream (Metheny)\n     16:14 (Bremen, Germany, March 13, 1978)\nThis moody, and, yes, dreamy Metheny original from the &quot;Bright Size Life&quot; album had been in the\nPMG's set list from the beginning. By the time of this 1978 performance (one of the final\nrenditions of the piece by the Group), it had evolved into an epic excursion suggesting the\nlong-form PMG compositions to come. This time the dream takes you to some unexpected musical\nlandscapes while never losing sight of itself, thanks in large part to Egan's concentration as\n&quot;variations on a theme&quot; swirl around him.   \n\n02. Wrong Is Right (Gary Burton-Larry Coryell)\n      05:11 (Bremen, Germany, March 13, 1978)\nThis pleasing, uptempo nod to mentor Burton had been used as an encore in PMG set lists from\nthe first, and this mature 1978 performance was judged to be the &quot;definitive&quot; version. Like\n&quot;Midwestern Nights Dream,&quot; it would soon disappear from the set list to make way for the wealth\nof new material generated by the inspired Metheny-Mays composing partnership.\n\n03. Unidentified #3 (version 1)\n      06:53 (Bremen, Germany, March 13, 1978)\nAlthough no writer is credited above, this memorable Latin-flavored romp is almost certainly a\nMetheny original. It was the last song played at the Jazz Workshop show in Boston in 1976, which\nwas before Metheny and Mays began writing together, and it appeared in many shows during 1977\nand 1978. Metheny, to the best of my knowledge, never introduced it as a cover. I consider this\nto be the &quot;definitive&quot; performance. A studio version of this tune would have been welcome on\n&quot;Watercolors&quot; or &quot;Pat Metheny Group.&quot;   \n\n04. Unidentified #3 (version 2)\n      12:49 (unidentified location, 1978)\nThe same tune, again? Yes, included as an illustration of the exploratory nature of the early\nPMG. In this performance - presumably a few months after Bremen, and not long before it, too,\nwas retired from the set list - we're almost halfway through this reinvention before we\nrecognize it as one. Even then, the material is approached in a radically different way.     \n\n05. O Grande Amor (Antonio Carlos Jobim-Joao Gilberto)\n      06:35 (unidentified location, 1978)\nLike &quot;Unity Village,&quot; this classic Brazilian samba was used in the first years of the PMG as\nthe first piece in a three-part suite, which, in this case, would conclude with &quot;Lakes&quot; from\nthe &quot;Watercolors&quot; album. Only &quot;O Grande Amor&quot; is included here. The track is faded to end on the\nlast note Metheny plays prior to beginning his mid-suite solo guitar improvisation. \n\n06. Meantime (Metheny, or Metheny-Mays)\n      09:19 (Madison, Wisconsin, May 28, 1978)\nThe theme that opens and closes this mostly-improvised piece surfaced several times in the early\nyears of the PMG as the energetic closer in the &quot;Unity Village&quot; suite. This recording from the\nradio broadcast from Bunky's is the only stand-alone version of which I'm aware. After the\nopening theme statement and a stage-setting solo by Gottlieb, the Group heads off into territory\nleft unexplored in the more &quot;rock-ish&quot; versions heard at the end of the &quot;Unity Village&quot; suite.\n\n07. Unidentified #4\n      08:58 (Madison, Wisconsin, May 28, 1978)\nThis is a rarely, or once-played, ballad taken from the radio broadcast from Bunky's, and is\nalmost certainly a Metheny or Metheny-Mays original. Several tapes of the broadcast exist, but\nit was an original 1978 cassette from an anonymous donor that was the only one found to contain\nthis tune in its entirety, if at all. This lone source, unfortunately, has two damaged sections,\nwhich you will hear. An upgrade is fervently sought. In the set, the tune appeared between\n&quot;The Epic&quot; and &quot;Jaco.&quot; Please check your copies. \n\n08. Four On Six (Wes Montgomery)\n      06:53 (rehearsal, Jamaica Plain, Massachusetts, November 12, 1978)\nIn this rare rehearsal recording Metheny can be heard teaching &quot;Question And Answer&quot; to the\nGroup. The other tune Metheny was teaching the Group that day was this Montgomery classic, which\nwas nailed in this performance. This is the only complete take of either song on the tape, which\ncontains only a portion of the day's proceedings.  \n\n09. Unidentified #5 (&quot;circus music&quot;) (Metheny-Mays)\n      06:19 (Philadelphia, Pennsylvania, June 14, 1979)\nMetheny introduced this tune by saying it had been written for a soundtrack. (Was the film\nreleased?) Although the piece had no title yet, he said, the Group was referring to it as\n&quot;circus music,&quot; because the scene for which it was written was set at a circus. It was played\nin almost every show in 1979, and this performance, recorded at Stars, was judged to be the\n&quot;definitive&quot; version.\n\n\n\nDisc 3:\n\n01. Mars (later retitled Close To Home) (Mays)\n      12:06 (San Francisco, California, February 17, 1979)\nThe PMG performed this Mays original throughout 1979, with Metheny introducing it as &quot;Mars.&quot; It\nwould then be shelved until 1982, when it would reappear as the long-form composition on the\n&quot;Offramp&quot; tour. In this stripped-down (pre-Synclavier and sequencers) version, the sound of\nMetheny's electric guitar plays a greater role than it did in 1982. Mays recorded the piece\nwithout Metheny, in shorter form, for his 1986 self-titled debut album. \n\n02. The Magician's Theatre (Metheny-Mays)\n      09:55 (Hempstead, New York, November 17, 1979)\nMetheny introduced this short-lived original, featuring an impressive solo by Gottlieb, as\nhaving been written in tribute to The Magician's Theatre in Tulsa, Oklahoma, one of the Group's\nfavorite venues to play. This performance was taken from the WLIR broadcast of the Hofstra\nUniversity concert.\n\n03. Old Folks (Willard Robinson-Dedette Lee Hill)\n      09:33 (Hempstead, New York, November 17, 1979)\nAlso from the WLIR broadcast comes the &quot;definitive&quot; PMG version of this lovely old standard,\nwhich would soon be retired from the once-in-a-while status it enjoyed in the set list. Metheny\nreleased a trio version, with Dave Holland and Roy Haynes, on 1990's &quot;Question And Answer.&quot;  \n\n04. Autumn Leaves (Joseph Kosma-Johnny Mercer)\n      08:55 (Rome, Italy, June 10, 1980)\nAn exciting guitar-and-drums duet segment highlights this performance of another standard in the\nGroup's repertoire. Like &quot;Old Folks,&quot; and others already mentioned, it would soon disappear from\nthe PMG's set lists in favor of new material. The PMG helps to send it out in grand style here\nwith a fast-paced performance featuring Metheny.  \n\n05. Hermitage (Metheny)\n      07:13 (Hamburg, Germany, July 8, 1980)\nThis beauty from Metheny's multi-tracked 1979 solo album, &quot;New Chautauqua,&quot; was tailor-made for\na PMG treatment. Here is a rare example, taken from the exceptional concert the Group gave at\nOnkel Po's, which was taped for television broadcast.  \n\n06. Sirabhorn (Metheny) 10:10 &gt;\n07. solo guitar improvisation (Metheny) 02:41 &gt;\n08. The Windup (Keith Jarrett) 08:25\n      (Hamburg, Germany, July 8, 1980)\nThe Onkel Po's show also gives us a rare PMG performance of &quot;Sirabhorn,&quot; another piece from\nMetheny's &quot;Bright Size Life&quot; album. Here it served to open one of the PMG's trademark three-part\nsuites. This time the suite is allowed to play through, so as to present an example of the\nsuite's flow, and to present a version of Mays' frequent feature, Keith Jarrett's &quot;The Windup.&quot;\n\n09. Down Here On The Ground (Wes Montgomery)\n    07:25 (Hamburg, Germany, July 8, 1980)\nThis famous ballad by one of Metheny's principle inspirations was performed often in the early\nyears of the PMG, and at no time better than in this &quot;definitive&quot; rendition at Onkel Po's.","torrent":{"xt":"urn:btih:4c805bfe0d645f36397818ea5f84ae2141a7b27e","amp;dn":"Pat+Metheny+Group+-+Companion+Vol+1+-+1976-1980","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c805bfe0d645f36397818ea5f84ae2141a7b27e","infoHashBuffer":{"type":"Buffer","data":[76,128,91,254,13,100,95,54,57,120,24,234,95,132,174,33,65,167,178,126]},"announce":[],"urlList":[]}}