{"title":"Donde nadie.te.encuentre.(ebook).","uid":6246806,"size":6643264,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4cb17455fd1499ea1b2c159c8df2563992ad8ac2&amp;dn=Donde+nadie.te.encuentre.%28ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1300265058,"description":"Un psiquiatra de La Sorbona especializado en mentes criminales viaja a la Barcelona de 1956. Quiere realizar un estudio sobre el caso de Teresa Pla Meseguer, llamada La Pastora, una mujer acusada de veintinueve muertes. Se trata del maquis mÃƒÂ¡s buscado por la Guardia Civil, y se ha convertido en una leyenda popular porque sigue libre. SÃƒÂ³lo un periodista barcelonÃƒÂ©s parece tener claves importantes en torno al personaje, pero lo que el viajero francÃƒÂ©s le propone es algo fuera de lo normal: no desea datos sobre Teresa, sino un encuentro cara a cara.\n\nEl idealista Lucien Nourissier y el cÃƒÂ­nico Carlos Infante emprenderÃƒÂ¡n ese viaje a las tierras del Maestrazgo, donde se esconde su casi imposible objetivo. A lo largo de su investigaciÃƒÂ³n deberÃƒÂ¡n sortear la vigilancia de los guardias, distinguir las pistas verdaderas de las falsas y esquivar los mil obstÃƒÂ¡culos que les salen al paso. La novela se convierte entonces en una bÃƒÂºsqueda, en una huida, en una aventura que nos descubre las miserias y la humanidad de una EspaÃƒÂ±a terrible.\n\n\nY en el centro de este relato crudo y fascinante que se lee sin tregua, mÃƒÂ¡s allÃƒÂ¡ del mito del guerrillero, emerge el personaje insospechado de la Pastora, histÃƒÂ³rico y real, que fue tanto mujer como hombre, y siempre estuvo en fuga del mundo y de sÃƒÂ­ mismo. Donde nadie te encuentre es una novela sobre el redescubrimiento de nuestro pasado y la infinita soledad del ser humano.","torrent":{"xt":"urn:btih:4cb17455fd1499ea1b2c159c8df2563992ad8ac2","amp;dn":"Donde+nadie.te.encuentre.%28ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cb17455fd1499ea1b2c159c8df2563992ad8ac2","infoHashBuffer":{"type":"Buffer","data":[76,177,116,85,253,20,153,234,27,44,21,156,141,242,86,57,146,173,138,194]},"announce":[],"urlList":[]}}