{"title":"Canfield-China's Trojan Horses(Chinese silent invasion of USA","uid":4991366,"size":11828879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d9283a4aa304267c73557b3b4d18e697d5ba77a&amp;dn=Canfield-China%5C%27s+Trojan+Horses%28Chinese+silent+invasion+of+USA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1247062045,"description":"This is Roger Canfield's shocking book China's Trojan Horses - Red Chinese Soldiers, Sailors, Students, Scientists and Spies Occupy America's Homeland (2002) which clearly points out that while the danger from al-Qaeda-type terrorists who have infiltrated the U.S. is very real, it is paltry compared to the threat posed by China's agents, who have far greater access, assets, and capabilities. Canfield, political and intelligence analyst and former executive director of the U.S. Intelligence Council, notes that the Red Chinese may very well have placed thousands of potential agents in American universities, research centers, nuclear labs, silicon valleys, defense industries, and military bases. Already, Red Chinese agents, government officials, workers, students, and visitors have gained intimate knowledge of American technologies and their most critical infrastructures. He names names of Chinese officials, corporations and front companies now carrying forward Beijing's strategy of unrestricted warfare, on American soil, in American ports and waterways, and in strategic points worldwide. He also names American corporations, corporate leaders, current U.S. officials, and former officials serving as enablers and agents of influence for China's penetration and invasion of America. A major focus is the China Overseas Shipping Company (COSCO) and its shadow, the Orient Overseas Container Line (OOCL), whose ships freely sail in and out of U.S. harbors daily. Although presented as a commercial entity COSCO is actually an arm of the Chinese military establishment. In short, COSCO is a military asset of the People's Liberation Army (PLA). Ditto for the OOCL, run by Hong Kong's Tung family for the mainland Communists, the real owners of the shipping line. COSCO's massive, global fleet of 600 ships includes about 100 that are always forward-deployed in U.S. waters. As the author points out, on-site surveys by the Interagency Commission on Crime and Security at U.S. seaports has found that only 2 percent of all trade cargo is physically inspected. Millions of cargo containers are brought into American ports each year uninspected. What do they contain, besides VCRs, GameBoys, cell phones, blenders, tennis shoes, and millions of other made-in-China products? Well, we do know that on at least a few occasions they have been found to contain drugs, illegal aliens, and even thousands of automatic weapons for California street gangs. Is it possible that many more of them contain similar contraband--or even worse? Is it possible that they may contain larger weapons, even biological or nuclear weapons? Is it possible for a rubber dinghy to take out a destroyer or a few guys with box cutters to take down the World Trade Center and the Pentagon? Long Beach, America's largest port facility, became the focus of Republican concern during the Clinton Chinagate scandals, especially when the Clinton White House tried to give COSCO a 20-year lease to the former Long Beach Naval Station. But the same GOP congressional contingent and pundit claque breathes nary a word today about the ongoing COSCO and OOCL expansion projects at Long Beach, Los Angeles, and many other U.S. ports. China's Trojan Horses provides detailed information--including maps, photos, and diagrams--on the operations and facilities of COSCO, OOCL, and other Red fronts at Long Beach, Los Angeles, Oakland, Seattle, Portland, New York-New Jersey, Charleston, Norfolk, Houston, Savannah, and New Orleans. In addition, China's Trojan Horses exposes the serious national security problem caused by Congress and the State Department in their inexcusably promiscuous granting of visas of all kinds--F-1, H-1 B, J, J-1, and L--to hundreds of thousands of Chinese students, scientists, and hightech workers. Who does background security checks on these people or conducts follow-up checks to see that they have left the country at their appointed times? In all too many cases, this security is lax to nonexistent. And what of those who enter illegally? The aforementioned Interagency Commission found illegal aliens being smuggled into 10 of 12 U.S. seaports surveyed. It also reported that U.S. immigration authorities have &quot;no way of knowing whether manifested crews actually leave on the ship they arrive on ... or remain illegally in the United States.&quot; That should give cause for serious heartburn the next time you, an American citizen, are subjected to a humiliating search at the airport. China's Trojan Horses performs a very important service in sounding a timely and credible alarm about an imminent danger to which all too many American officials are willfully blind. To ignore its obvious warning is to invite future attacks that could dwarf the destruction, loss of life, and loss of liberty caused by the September 11th attacks. 200 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:4d9283a4aa304267c73557b3b4d18e697d5ba77a","amp;dn":"Canfield-China%5C%27s+Trojan+Horses%28Chinese+silent+invasion+of+USA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d9283a4aa304267c73557b3b4d18e697d5ba77a","infoHashBuffer":{"type":"Buffer","data":[77,146,131,164,170,48,66,103,199,53,87,179,180,209,142,105,125,91,167,122]},"announce":[],"urlList":[]}}