{"title":"Young-Deadlier Than H-Bomb(international bankers conspiracy)(195","uid":4991526,"size":347691,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4da9c2ee6e1d784176e95a584098df88d90db013&amp;dn=Young-Deadlier+Than+H-Bomb%28international+bankers+conspiracy%29%28195&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1247071118,"description":"This is Leonard Young's shocking book Deadlier Than the H-Bomb (1957) which covers the conspiracy of the international bankers against Britain and the world. Is there a threat to the world more dangerous than even the H-bomb? Wing commander Young's many years of research have pointed to that conclusion. In trying to assess the situation he has come to realise that we are in the process of actual destruction by something deadlier than the H-bomb; something, which in our blindness, we are allowing to corrode the props of our culture and civilisation; insidiously and relentlessly. Deadlier Than the H-Bomb shows the development of the main lines of attack, sounds the alarm and introduces the reader to a number of other works on the subject which expound various necessary truths and remedies. Chapter subjects include: early British history, the international bankers, the Khazars, the Khazars in britain, moneylenders, some effects of the usury system, two plans, the poison in Britain, the poison in America, the League of nations, Hitler and the war, Winston Churchill, the plot in America, the United nations, post-war Britain, a hint from the bible, famous men of the Khazars, other means of assault by the Khazars, the remedy. 80 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:4da9c2ee6e1d784176e95a584098df88d90db013","amp;dn":"Young-Deadlier+Than+H-Bomb%28international+bankers+conspiracy%29%28195","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4da9c2ee6e1d784176e95a584098df88d90db013","infoHashBuffer":{"type":"Buffer","data":[77,169,194,238,110,29,120,65,118,233,90,88,64,152,223,136,217,13,176,19]},"announce":[],"urlList":[]}}