{"title":"Fast Mailer Pro v6.2 Portable","uid":5134414,"size":4236666,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4e58da63007dc761b3b2aa689e7a6f317d4f4a4b&amp;dn=Fast+Mailer+Pro+v6.2+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoExcuses","files":4,"time":1256376568,"description":"Fast Mailer Pro v6.2 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Keygen are included....\n\n\nFast Mailer Pro is a fast subscription-based mass mailer used by many Internet professionals and online store owners, to notify their customers about various events and send requested newsletters. This program lets you create and manage subscription-based mailing lists, and send personalized email messages utilizing message templates. You can easily define messages and insert macro substitution patterns, to be replaced by information from the customer database, for each recipient, just before dispatching. You can use all the standard message formats like plain text, HTML or even create a rich content message in the Microsoft Outlook Express and export it into the program. Fast Mailer Pro is easy-to-configure and lets you import an email mailing list of your existing subscribers along with all data fields into the internal database quickly and easily. It lets you do filter-based manipulations on your email list, search for duplicate emails and enable or disable individual subscribers. The program also has a subscription confirmation feature you can use to confirm that your sending is really solicited. Online Help is available. Try our Internet and email tools. Free downloads.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.getfreefile.com/fastmm.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.getfreefile.com/fastmm.html&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:4e58da63007dc761b3b2aa689e7a6f317d4f4a4b","amp;dn":"Fast+Mailer+Pro+v6.2+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e58da63007dc761b3b2aa689e7a6f317d4f4a4b","infoHashBuffer":{"type":"Buffer","data":[78,88,218,99,0,125,199,97,179,178,170,104,158,122,111,49,125,79,74,75]},"announce":[],"urlList":[]}}