{"title":"Amadeus (1984 - Director's Cut)","uid":5078791,"size":2389869303,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4e98c7fa23277e8a6748da571e1f96ce986a1c0f&amp;dn=Amadeus+%281984+-+Director%5C%27s+Cut%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sheila6","files":-1,"time":1252100250,"description":"Movies : Drama : DVD Rip : English\n\nFor this film adaptation of Peter Shaffer's Broadway hit, director Milos Forman returned to the city of Prague that he'd left behind during the Czech political crises of 1968, bringing along his usual cinematographer and fellow Czech expatriate, Miroslav Ondricek. \n\nAmadeus is an expansion of a Viennese &quot;urban legend&quot; concerning the death of 18th-century musical genius Wolfgang Amadeus Mozart. From the vantage point of an insane asylum, ageing royal composer Salieri (F. Murray Abraham) recalls the events of three decades earlier, when the young Mozart (Tom Hulce) first gained favour in the court of Austrian emperor Joseph II (Jeffrey Jones). \n\nSalieri was incensed that God would bless so vulgar and obnoxious a young snipe as Mozart with divine genius. Why was Salieri - so disciplined, so devoted to his art, and so willing to toady to his superiors - not touched by God? \n\nUnable to match Mozart's talent, Salieri uses his influence in court to sabotage the young upstart's career. Disguising himself as a mysterious benefactor, Salieri commissions the backbreaking &quot;Requiem,&quot; which eventually costs Mozart his health, wealth, and life. \n\nAmong the film's many pearls of dialogue, the best line goes to the Emperor, who rejects The Abduction from the Seraglio on the grounds that it has &quot;too many notes.&quot; Apparently he really said this!!\n\nAmadeus won eight Academy Awards, including Best Picture, Best Director, Best Adapted Screenplay, and Best Actor for F. Murray Abraham. In 2002, the film received a theatrical re-release as &quot;Amadeus: The Director's Cut,&quot; a version that includes 20 minutes of additional footage. \n\nA note-perfect cinematic event whose immortality was assured from its opening night, Amadeus is an unlikely candidate for the director's-cut treatment. Like one of Mozart's operas, the multiple Oscar-winning theatrical version seemed perfectly formed from the outset - ideal casting, costumes, sets, cinematography, lighting, screenplay, music, music, music - so the reinstatement of an extra 20 minutes simply risks adding &quot;too many notes.&quot; Yet though this extended cut can hardly be said to improve a picture that needed no improvement, it does at least flesh out a couple of small subplots and shed new light on certain key scenes. Here we learn why Constanze Mozart bears such ill will towards Salieri when she discovers him at her husband's deathbed, and we see deeper into the reasons why Mozart has no students. The structure of the picture is otherwise unaltered.\n\nThe second disc contains an excellent new hour-long &quot;making of&quot; documentary, with contributions from Forman, Shaffer, Sir Neville Marriner, and all the main actors, taking in the scriptwriting, choice of music, casting, and problems involved in filming in Communist Czechoslovakia with half the crew and extras working for the Secret Police.\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:4e98c7fa23277e8a6748da571e1f96ce986a1c0f","amp;dn":"Amadeus+%281984+-+Director%5C%27s+Cut%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e98c7fa23277e8a6748da571e1f96ce986a1c0f","infoHashBuffer":{"type":"Buffer","data":[78,152,199,250,35,39,126,138,103,72,218,87,30,31,150,206,152,106,28,15]},"announce":[],"urlList":[]}}