{"title":"Miles Davis - Seven Steps to Heaven (1963) [Jazz][flac][schon55]","uid":5104218,"size":267620330,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4ebe52cc379e790e427136014a37475d35aad1bf&amp;dn=Miles+Davis+-+Seven+Steps+to+Heaven+%281963%29+%5BJazz%5D%5Bflac%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":12,"time":1254241110,"description":"Miles Davis - Seven Steps to Heaven \nRecorded April 1963 Hollywood and May 1963 NYC \nAudio CD (April 21, 1992) \nOriginal Release Date: April 21, 1992 \nLabel: Sony \nQuality: flac\n\n&quot;Seven Steps To Heaven&quot; is one of those albums that you have to take in stride and listen to track by track and not so much as a cohesive album.  Miles was in a state of flux in 1963.  His quintet with Hank Mobley, Wynton Kelly, Paul Chambers, and Jimmy Cobb had been disbanded, and Miles had been recording with Gil Evans.  When the time came for a new lp, Miles was still working on getting a steady group together.  So, in fact, this lp is in fact 2 ep's, as 2 different groups play on this lp, each with a very different character from the other. \n\nGroup 1- Miles, George Coleman (tenor), Victor Feldman (piano), Ron Carter, (Bass), Frank Butler (dr) (tracks 1,3,5).  This group is quite traditional in outlook, and the tracks played show this.  Miles' beautifully heartfelt performances are backed perfctly by Feldman's supple and understated piano.  This group proved that Miles could pack a wallop on the standards.  The tenor of Coleman and Carter's bass compliment Miles and Feldman very well.  As a fan of jazz, I very much enjoy what this very short lived quintet did (2 days in April 1963 was the life of this group). \n\nGroup 2- Miles, Coleman, Carter, Herbie Hancock, Tony Williams.  4/5 of what would be the 2nd great quintet are in action on tracks 2,4,6.  The character of the band is immediatly felt on &quot;Seven Steps to Heaven&quot; (group 1 also recorded the song, as well as &quot;So Near So Far&quot;- track 4- and &quot;Summer Nights&quot;, which landed on the &quot;Quiet Nights&quot; lp; perhaps at some point both takes of both of these songs will be on a remastered version of this lp to showcase the very different interpretations of the songs by the old and new guard), as Ron Carter's walking bass is pushed by Williams' drumming.  Herbie Hancock's style is also apparent- a more open style as opposed to Feldman's more traditional block chord style. \n\nIf looked at as 2 ep's, the works are excellent, regardless of which group reocrding what.  As a collective lp, it is made weaker by the diametrically opposed styles of the 2 groups recording it, and thus falls out of favor with many Miles fans who deem it inconsistent.  It is not inconsistent at all, I can assure you.  What it is, however, is a fine collection of songs and the first glance of the men who would make Miles famous again in the mid to late 60's and change jazz forever. ~ Sean M. Kelly \n\nThis album definitely is an overlooked classic. The original versions of &quot;Joshua&quot; and the title track are worth the price of admission; &quot;So Near, So Far&quot; is absolutely beautiful. Add to that a chance to hear the underrated Victor Feldman on the ballad portion of the album (especially &quot;I Fall in Love Too Easily&quot;). But the greatest thing about this recording is the debut of what was the rhythm section to end all rhythm sections: even this early as a unit, Herbie Hancock, Ron Carter, and the late Tony Williams sound awesome. ~ A Customer, Amazon\n\nPersonnel:\nMiles Davis (trumpet);\nGeorge Coleman (tenor saxophone);\nVictor Feldman, Herbie Hancock (piano);\nRon Carter (bass instrument);\nFrank Butler, Tony Williams (drums).\n\nMiles Davis - Seven Steps to Heaven Tracks:\n01  Basin Street Blues\n02  Seven Steps to Heaven\n03  I Fall in Love too Easily\n04  So Near, So Far\n05  Baby Won't You Please Come Home\n06  Joshua","torrent":{"xt":"urn:btih:4ebe52cc379e790e427136014a37475d35aad1bf","amp;dn":"Miles+Davis+-+Seven+Steps+to+Heaven+%281963%29+%5BJazz%5D%5Bflac%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ebe52cc379e790e427136014a37475d35aad1bf","infoHashBuffer":{"type":"Buffer","data":[78,190,82,204,55,158,121,14,66,113,54,1,74,55,71,93,53,170,209,191]},"announce":[],"urlList":[]}}