{"title":"PAL-PSP MotorStorm (working on cfw 5.50 GEN-b2)","uid":5106221,"size":761724928,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:4fd4e9671242efdae4063e4484e9516c114cb3cd&amp;dn=PAL-PSP+MotorStorm+%28working+on+cfw+5.50+GEN-b2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"khronicana","files":-1,"time":1254390786,"description":"*copied from the GameFAQs data page for this game.*\n\nThe most brutal offroad racing festival returns, with players taking part in the latest off-beat and secret site to join the wild and alternative MotorStorm festival. This time around, the location moves to the unpredictable Alaskan terrain, where players will race through multi-route tracks, harsh terrain, and sub-zero conditions to try and become festival champ. Staying true to the signature MotorStorm style, players will throw traditional offroad driving and caution to the wind where the ultimate goal in the festival is to not only win, but survive. Players will take on a variety of brutal artificial intelligence (AI) racers and negotiate the dangerous arctic conditions, including sudden avalanches, broken ice bridges, and three different racing altitudes. In addition to the six vehicle classes from the original MotorStorm, new snow-specific vehicle classes as well as all-new track designs are introduced to MotorStorm Arctic Edge.\n\n\nThis is for everybody that wants to play MotorStorm: arctic edge on their psp without updating. So... here you go. Excellent game, Definitely worth the buy.","torrent":{"xt":"urn:btih:4fd4e9671242efdae4063e4484e9516c114cb3cd","amp;dn":"PAL-PSP+MotorStorm+%28working+on+cfw+5.50+GEN-b2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fd4e9671242efdae4063e4484e9516c114cb3cd","infoHashBuffer":{"type":"Buffer","data":[79,212,233,103,18,66,239,218,228,6,62,68,132,233,81,108,17,76,179,205]},"announce":[],"urlList":[]}}