{"title":"Epic Illustrated [ADULT]","uid":5089704,"size":1009628595,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5026913576a8497cf7d61a9a78b853225e81ba22&amp;dn=Epic+Illustrated+%5BADULT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1253036411,"description":"Epic Illustrated was a comics anthology magazine published Marvel Comics. The series lasted for 34 issues, from Spring 1980 to February 1986.\nSimilar to the US-licensed graphic-story magazine Heavy Metal, it featured mature content oriented at an older audience than traditional American comic books, as well as offering its writers and artists ownership rights and royalties in place of the industry-standard work for hire contracts.\n\nThe magazine was initiated under editor Rick Marschall in 1979 under the title Odyssey, and originally set to launch as an issue of Marvel Super Special, Marvel's early graphic novel line.  After Marschall learned of at least seven other magazines titled Odyssey, the project was renamed Epic Illustrated and launched as a standalone series.  Marschall was replaced by editor Archie Goodwin in the autumn of 1979, several months before the first issue was published.\n\nThe anthology featured heroic fiction and genre stories, primarily fantasy and science fiction, but in a broad range of styles. Established mainstream-comics talents as X-Men's Byrne-Austin pencil-ink team, John Buscema, and Jim Starlin, were featured, as well as independent-press creators as Wendy Pini and The Studio's Jeffrey Jones, M.W. Kaluta, Barry Windsor-Smith, and Berni Wrightson. Goodwin commissioned stories by many new artists, including Steve Bissette, Pepe Moreno, Jon J. Muth, Rick Veitch and Kent Williams. The magazine format, which was a first for Marvel, allowed for a broader range of color than the traditional three-color printing process, and many of the stories, and all the covers, were painted. Fantasy artists who did not normally work in the comics field, such as Richard Corben, Frank Frazetta, The Brothers Hildebrandt, and Boris Vallejo contributed covers.\n\nEpic Illustrated also included an occasional Marvel Comics protagonist, such as the first issue's Silver Surfer story by Stan Lee and John Buscema. Because the magazine was not subject to traditional comic books' Comics Code Authority, however, writers and artists were free to create material stories that might be risquÃƒÂ© or non-canon.  Each issue usually featured a main story, a number of regular serials, and anthological shorts.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:5026913576a8497cf7d61a9a78b853225e81ba22","amp;dn":"Epic+Illustrated+%5BADULT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5026913576a8497cf7d61a9a78b853225e81ba22","infoHashBuffer":{"type":"Buffer","data":[80,38,145,53,118,168,73,124,247,214,26,154,120,184,83,34,94,129,186,34]},"announce":[],"urlList":[]}}