{"title":"LDS Church Materials of Interest Jan 2011","uid":6134242,"size":254743076,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:506179121d0c1d64394470039eb1ebdef32d884f&amp;dn=LDS+Church+Materials+of+Interest+Jan+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":152,"time":1296238913,"description":"\n                |-----------------------------------------------|\n                |   Materials of Interest From and About the    |\n                |  Church of Jesus Christ of Latter-day Saints  |\n                |-----------------------------------------------|\n\n1 - Restricted Access Publications\n  Books and Manuals:\n    - Charge to Religious Educators (1994)\n        This is a manual and guide for religious educators in the Church\n        Education System (both the Seminary and Institute programs).  It\n        contains a wide compilations of tealks and excerpts of talks relating to\n        teaching LDS religion courses.  One interesting aspect of the book is\n        that, while restricted, it is a commonly cited source for CES student\n        manuals such as &quot;Teachings of the Living Prophets&quot;.  This manual also\n        contains manu famous (and infamous) talks such as &quot;Candle of the Lord&quot;,\n        &quot;The Mantle is Far, Far Greater Than the Intellect&quot;, &quot;To Those Who Teach\n        in Troubled Times&quot;, &quot;Finding Answers to Gospel Questions&quot;, and more.  An\n        interesting piece inside is the &quot;Basic Doctrine&quot; section which lays out\n        the basic doctrine that an LDS religious instructor is expected to\n        teach.\n    - Church Handbook of Instructions (Book 1) (2010)\n        The CHI is the instruction manual given to Bishops and Stake Presidents\n        to aid in the administration of wards and stakes.  It contains\n        instructions and counsel, as well as the Church's official stance on\n        many questions that lay members may approach their local leaders about.\n        Book 1 is heavily restricted, although Book 2 (meant for other local\n        ward and stake leaders) has been publicly available for years and is in\n        the &quot;Obtainable Publications&quot; folder.  This particular leak is famous\n        for appearing on the Internet a number of days *before* they were\n        officially announced to local Church leadership.\n  Etc\n    - Official LDS Sites - Web Traffic Stats (Dec 2010)\n        Leaked to the Internet early in 2011, these stats meant for internal use\n        by Church employees and General Authorities show the dismal performance\n        of LDS web sites; nearly all of the traffic is self-generated by\n        existing members of the Church who are doing geneological research,\n        looking at Church materials at lds.org, or using scriptures.  Nearly all\n        mobile use is for scriptures.  Proselytizing and outreach websites\n        experience much lower traffic than member-oriented websites and, on the\n        whole, monthly visits are much lower than currently accepted figures of\n        &quot;active&quot; members of the Church implying that not even Mormons themselves\n        make much use of the Internet websites available to them.\n  Talks and Pamphlets\n    - Boyd K. Packer &quot;Talk to the All-Church Coordinating Council&quot; (1993)\n        This famous talk details what Elder Boyd K. Packer felt, in 1993, as\n        three &quot;dangers&quot; facing Church members in the form of the gay-lesbian\n        &quot;movement&quot;, the feminist &quot;movement&quot;, and &quot;so-called&quot; scholars or\n        intellectuals.  \n    - Boyd K. Packer &quot;To Young Men Only&quot; (1976)\n        This talk was given in the October 1976 Priesthood of General\n        Conference, but it was decided not to publish the talk publicly in the\n        &quot;Ensign&quot; magazine.  Instead, the talk was only published in the official\n        &quot;Conference Report&quot; (from which this copy is taken) and in a seperate\n        pamphlet that enjoyed widespread publication up until the mid-2000s.\n        Famous for its replacement of such apparently difficult terms as\n        &quot;testicles&quot; with &quot;little factory&quot; and &quot;semen&quot; with &quot;life-creating\n        substance&quot;, the talk also discussed Elder Packer's approval of the youth\n        keeping themselves safe from those who would seek homosexuality even\n        through violence if necessary.  Elder Packer describes an implied gay\n        missionary who was punched by his companion by saying, &quot;Well, thanks.\n        Somebody had to do it, and it wouldn't be well for a General Authority\n        to solve the problem that way.&quot;\n    - Mark E. Petersen &quot;Race Problems as They Affect the Church&quot; (1954)\n        This talk, famous and well-used in its day, is now nowhere to be found\n        in publications, both print and online, from BYU or the LDS Church.  In\n        it, Elder Petersen covers for Church educators his approach to the\n        &quot;Negro Question&quot;.  Although the views presented in this talk have been\n        repudiated, topics such as interracial marriage are still often viewed\n        with distrust by older Church members.  Elder Petersen is widely\n        considered to have authored the editorial &quot;Interracial marriage\n        discouraged&quot; in the LDS Church News of June 17, 1978: the same issue\n        announcing the reversal of the Temple and Priesthood Ban for black LDS.\n2 - Redactions and Private Correspondence\n    - Letter from Bruce R. McConkie to Eugene England (1981)\n        In this authoritatively-written letter in response to some public\n        and private musings by professor Eugene England of the BYU English\n        faculty, Elder McConkie attempts to set Dr. England straight on how to\n        read statements by Brigham Young about the Adam-God doctrine.  It was\n        not meant to be publicly distributed, but since Elder McConkie also sent\n        copies of the same letter to many of Dr. England's aquatainces it leaked\n        out into the public before Dr. England was even aware he had received\n        it.  Famous for Elder McConkie's admission that Brigham Young had, in\n        fact, taught that Adam was God.\n    - Ronald E. Poelman &quot;The Gospel and the Church&quot; (1984)\n        Delivered, somewhat ironically, in 1984, this talk was well-received by\n        Church members when Elder Poelman spoke in the October general\n        conference.  However, when the talk was published in the Ensign it had\n        received drastict revisions.  Also, in a bizarre event, the talk was\n        actually re-recorded with Elder Poelman delivering the redacted text in\n        the Salt Lake Tabernacle (complete with a &quot;cough track&quot; and a\n        congregational response of &quot;Amen&quot; after Elder Poelman finished). The\n        changes were noticed, however, by some members of the Church and a few\n        early VCR recordings of the talk as originally delivered are in\n        existence.  This presentation of the talk is given with the deletions\n        and additions kept in-text so that the reader can view for themselves\n        how the inteded purpose of the talk itself was reverse almost entirely\n        by the required redactions.  It is still unknown at this time who called\n        for the changes or was in charge of coordinating the rewriting and\n        re-recording.\n3 - Obtainable Publications\n    - Anonymous - Interracial Marriages Discouraged (1978)\n        Published in the same issue of the LDS Church News that joyfully\n        announced the end of the Temple and Priesthood Ban for black LDS\n        members, this editorial reaffirmed the Church's public opposition to\n        cross-cultural marriages even as black members of the Church began to\n        enjoy full participation in the rituals and practices of the Church.  It\n        was widely believed to have been either written by or demanded by Elder\n        Mark E. Petersen of the Quorum of the Twelve who had a long history of\n        public pronouncements against cross-cultural marriages.\n    - Boyd K. Packer - For Time and All Eternity (1993)\n        Famous for its bizarre, sexually-loaded &quot;parable&quot; at the end, this talk\n        declares that gender roles are eternal, shares one of Boyd K. Packer's\n        favorite stories used to mock LGBT legislation (voting on a kitten's\n        gender), and speaks of the &quot;devestating effect&quot; of women entering the\n        workforce during WWII. \n    - Boyd K. Packer - The Equal Rights Amendment (1977)\n        A fascinating view into the anti-ERA sentiment officially encouraged by\n        the LDS Church during the late 1970s and early 1980s.\n    - Boyd K. Packer - The Snow-White Birds (1995)\n        Due to the originally-scheduled speaker being ill, Elder Packer spoke at\n        the newly-finished BYU Wilkensen Center about BYU's historical\n        encounters with &quot;higher criticism&quot; and &quot;evolution&quot;, complete with a\n        misquoted and misattributed dream about how scholastic studies were\n        preventing students from spiritual soaring.\n    - Church Handbook of Instructions (Book 2) (2010)\n        Already publicly available for years, Book II of the CHI contains\n        instructions for auxiliary leaders in wards and stakes.  For the\n        heavily restricted Book I, see the Books and Manuals folder of the \n        &quot;Restricted Access Publications&quot; folder.  This particular leak is famous\n        for appearing on the Internet a number of days *before* they were\n        officially announced to local Church leadership.\n    - Journal of Discourses\n        Covering a period of over forty years, the Journal of Discourses is a\n        collection of shorthand recordings of sermons and speeches given in\n        Utah throughout the later half of the 19th Century.  Although they are\n        occasionally ignored due to supposed errors in transcriptions, the use\n        of shorthand in the recordings was actually quite good and the Journal\n        of Discourses shows far better accuracy and consistency than most of the\n        public sermons of Joseph Smith that Church members today study.  They are\n        a fascinating look into the viewpoint, doctrine, and culture of 19th\n        Century Utah.\n    - Julie B. Beck - Mothers Who Know (2007)\n        President beck has often been a divisive figure who can quickly\n        alternate back and forth from supporting to detracting from a feminist\n        empowerment of the LDS Female Relief Society.  This talk, delivered in\n        2007, was widely seen as a retrenchment-style talk that encouraged\n        &quot;traditional&quot; gender roles for women within the home such as housework,\n        cooking, and cleaning.\n    - Missionary Handbook (2005)\n        While not available online, this small handbook of rules, guidance, and\n        instruction for LDS missionaries is publicly available through the\n        Church's Distribution Services.  It is, along with the teaching manual\n        &quot;Preach My Gospel&quot;, one of the major tools used by LDS missionaries\n        worldwide.\n    - Vaugh J. Featherstone - A Self-Inflicted Purging (1975)\n        Fun more for the unintentional irony of the talk-name, this speech\n        focused on avoiding masturbation and homosexuality for LDS men through\n        &quot;purging&quot; the Church and themselves of such things.\n4 - Additional Papers and Books\n    - Alexander Campell &quot;Delusions&quot; (1831)\n        One of the first critiques of the Book of Mormon, this review and\n        deconstruction of the book was written by Alexander Campbell.  From the\n        review it is evident that Campbell did not simply reject the work\n        outright, but spent time on a close reading the entire work and\n        subsequently comparing its teachings with the Bible.\n    - Edward L. Kimball &quot;Lengthen Your Stride&quot; (Working Draft, 2005)\n        In producing this biography of his father's presidency, Edward Kimball\n        presented this working draft to Deseret Book for editing and\n        publication.  Deseret Book was hesitant about some of stories and\n        details related that could be seen as too human or too negative for\n        general authorities, so a strongly edited print copy was produced.\n        However, Edward Kimball was able to persuade Deseret Book to include the\n        working copy with the published book.  This PDF contains colors to mark\n        areas where Deseret Book editors felt additional work and/or editing was\n        needed.  These cover both normal editorial problems (overly repetitious)\n        as well as problems specific to a book published by a Church-owned\n        publication company.  While written as a faith-affirming volume, it is a\n        fascinating look into the 1970's Church administration.\n    - Gregory A. Prince &quot;The Red Peril, the Candy-Maker, and the Apostle&quot; (2004)\n        Detailing some of the issues that church leaders such as President David\n        O. McKay and Elder Ezra Taft Benson had in the 1950s and 1960s in how to\n        officially approach Communism and anti-Communist organizations like the\n        John Birch Society.\n    - Joseph Smith, jr, As a Translator (1912)\n        One of the first responses published by trained Egyptologists to the\n        facsimiles in the Book of Abraham, this book as a bombshell when\n        published in Utah in 1912.  Containing the educated interpretations of\n        a number of the world's leading Egyptologists they showed that the\n        official LDS Church interpretations of the facsimiles, written by Joseph\n        Smith before archeologists and historians could read and understand\n        ancient Egyptian, did not line up with modern understandings of Egyptian\n        language and art.  While not discussing much of the English Book of\n        Abraham or its translation (the papyri Joseph used had been assumed to\n        be lost in the Chicago fire and would not be rediscovered for over fifty\n        years), the book was a devestating critique of Joseph's ability of\n        translation and interpretation.\n    - Linda King Newell &quot;A Gift Given: A Gift Taken&quot; (Dec 1999 Reprint)\n        A gound-breaking paper, Ms. Newell details the rise and fall of the\n        common practice among LDS women in the 19th Century of blessings and\n        healings performed through the laying on of hands.  While still of much\n        use, it has been superceded by the recent paper &quot;Female Ritual Healing\n        in Mormonism&quot; in Journal of Mormon History Winter 2011 (v37n01).\n    - Responses to &quot;A Gift Given: A Gift Taken&quot; (Oct 1981)\n        Contains the famous assertion by Dr. D. Michael Quinn that LDS women are\n        ordained to the Priesthood through the Temple endowment ceremony and\n        have, by extension, been Priesthood holders since the mid-1840s.\n    - Richard S. Van Wagoner &quot;Mormon Polyandry in Nauvoo&quot; (1985)\n        A good general overview of the practice of polyandry that occured in\n        Nauvoo where Joseph Smith would request and marry women who were already\n        married.\n    - Ronald V. Huggins &quot;Did the Author of 3 Nephi Know the Gospel of Matthew?&quot;\n      (1997)\n        A comparison and study of the &quot;Sermon at the Temple&quot; in 3 Nephi showing\n        the close relationship with Matthew's &quot;Sermon on the Mount&quot; and arguing\n        for a wholesale copy from the New Testament to the Book of Mormon,\n        complete with King James Version mistranslations and misunderstandings.\n    - Testimony of Important Witnesses (Reed Smoot Hearings 1904-1905)\n        Apostle Reed Smoot became, in 1903, the second Latter-day Saint General\n        Authority to be elected to represent Utah in Congress and the first to\n        be allowed to serve his term (B.H. Roberts had been sent home in 1898).\n        Unlike Robert, Smoot was a monogamist and had been elected to the\n        Senate.  After allowing Smoot to take his seat, Senate leaders began a\n        lengthy series of heries to decide whether Smoot would be allowed to\n        continue to serve as a United States Senator.  Under question was\n        whether his alleigance was to the LDS Church or the US Constitution\n        foremost, but there were also claims that he was secretly living a\n        polygamous lifestyle.  The hearings subpoenaed many famous and infamous\n        Utahns.  This collection is notable for having the three-day questioning\n        of LDS Church President Joseph F. Smith (begins on page 59).  Smith was\n        questioned on a range of subjects from aspects of his presidency, to his\n        business holdings and the Church's financial control of Utah, to Utah\n        politics, to female ordination to the Priesthood, to temple ceremony and\n        ritual, to expectations of the LDS Church for its members at that time.\n5 - LaTeX Sources Files\n      These are the source files for many of the PDFs in this collection.  You\n      are free to edit these sources files into a better format or fix editorial\n      or grammatical mistakes.  Some of these items are in the public domain;\n      others are obviously still under copyright.  You should be able to compile\n      PDFs using these LaTeX files on a machine with a general TeX Live\n      installation.","torrent":{"xt":"urn:btih:506179121d0c1d64394470039eb1ebdef32d884f","amp;dn":"LDS+Church+Materials+of+Interest+Jan+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"506179121d0c1d64394470039eb1ebdef32d884f","infoHashBuffer":{"type":"Buffer","data":[80,97,121,18,29,12,29,100,57,68,112,3,158,177,235,222,243,45,136,79]},"announce":[],"urlList":[]}}