{"title":"MAY BLITZ - MAY BLITZ ABD THE 2ND OF MAY[TNTVILLAGE]","uid":5067080,"size":463203924,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5077ea0ae529e4dc851cd8baa1603da98d346278&amp;dn=MAY+BLITZ+-+MAY+BLITZ+ABD+THE+2ND+OF+MAY%5BTNTVILLAGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":9,"time":1251064414,"description":"[b][color=blue]MAY BLITZ[/color]\n\n[color=red] MAY BLITZ/THE 2ND OF MAY[/b][/color]\n\n[b][color=green]::-&gt;COVER&lt;-::[/b][/color]\n\n[IMG]http://img5.imageshack.us/img5/1691/417115.jpg[/IMG]\n\n[b][color=green]::-&gt;DATI ALBUM&lt;-::[/color][/b]\n\n[b]Titolo:[/b] MAY BLITZ/THE 2ND OF MAY\n[b]Data Uscita:[/b] 1992\n[b]Genere:[/b] ROCK BLUES PROGRESSIVE\n[b]Etichetta:[/b] BGO RECORDS\n\n\nMAY BLITZ is:\nTony Newman: drums, vibes, percussion\nJames Black: lead guitar, 12 string, lead vocals\nReid Hudson: bass, vocals\n\n\n[b][color=green]::-&gt;Tracklist&lt;-::[/color][/b]\n\n   1.  Smoking the Day Away\n   2. I Don't Know\n   3. Dreaming\n   4. Squeet\n   5. Tomorrow May Come\n   6. Fire Queen\n   7. Virgin Waters\n   8. For Mad Men Only\n   9. Snakes and Ladders\n  10. 25th of December 1969\n  11. In Part\n  12. 8 Mad Grim Nits\n  13. High Beech\n  14. Honey Coloured Time\n  15. Just Thinking\n\n\n[b][color=green]::-&gt;I MAY BLITZ&lt;-::[/color][/b]\n\n[IMG]http://img26.imageshack.us/img26/4430/mayide.jpg[/IMG]\n\nI May Blitz si costituiscono nel 1969 da un'idea del batterista Keith Baker e del bassista Terry Poole, in seguito allo scioglimento della band rock blues \n\ndei Bakerloo. Ben presto i due decidono perÃƒÂ² di seguire altre strade per la loro carriera: Baker partecipa alle registrazioni del secondo album degli Uriah \n\nHeep, Salisbury (1971), mentre Poole va a suonare con Graham Bond e appare sul long playing We Put Our Magick On You (1971). CosÃƒÂ¬ le sorti dei May Blitz \n\npassano nelle mani del sostituto di Baker, Tony Newman, veterano della scena musicale inglese giÃƒÂ  in epoca beat con i Sounds Incorporated, un gruppo autore \n\ndi numerosi lavori a 33 e 45 giri conosciuto per avere aperto nel 1965 il famoso concerto dei Beatles allo Shea Stadium di New York, davanti a 56.000 \n\npersone.\nIl batterista incide anche un singolo a proprio nome (Soul thing / Let the good times roll - Decca, 1968) [V], quindi sostituisce Micky Waller nel Jeff Beck \n\nGroup per le registrazioni dell'album Beck-Ola (Columbia, 1969).\nNewman rifonda i May Blitz con l'aiuto di due musicisti di origine canadese (da Victoria), il chitarrista e cantante James Black e il bassista Reid Hudson. \n\nIl gruppo guadagna rapidamente una buona reputazione dal vivo grazie ad efficaci esibizioni nei circuiti dei club e dei college (tra gli altri il Mothers \n\nClub di Birmingham e la Leeds University). Nel maggio del 1970 i May Blitz suonano un ottimo concerto nell'ambito del Whitsun Festival a Plumpton, un poco \n\nconosciuto Festival organizzato con certe ambizioni ma praticamente fallito per le poche presenze di pubblico registrate (3.000 spettatori contro i 30.000 \n\npreventivati); il cast era comunque di tutto rispetto, con la Ginger Baker's Airforce e Richie Havens come maggiori attrazioni e una folta schiera di gruppi \n\ndell'underground inglese (Hard Meat, Warm Dust, Gracious, Jan Dukes De Grey, Black Widow, Van Der Graaf Generator e altri).\nOttenuto un contratto discografico con l'etichetta Vertigo, i May Blitz con l'organico appena ridefinito entrano in studio e registrano l'ottimo album \n\nd'esordio omonimo. Il disco, pubblicato nel 1970, presenta un'originale copertina disegnata da Tony Benyon, vignettista del New Musical Express.\nUna delle questioni piÃƒÂ¹ impegnative nel trattare della musica contenuta nel primo album dei May Blitz ÃƒÂ¨ riuscire ad inquadrare il gruppo di Tony Newman in un \n\ngenere ben definito. Questa, probabilmente, ÃƒÂ¨ la forza relativa del complesso: relativa, in quanto la felice promiscuitÃƒÂ  tra blues, hard rock e suono \n\nprogressivo rende la musica dei May Blitz appassionante e moderna, ma la sua stessa natura poco incline a facili accomodamenti e codifiche commerciali relega \n\nil gruppo ai margini del mercato, compromettendo la capacitÃƒÂ  di sopravvivenza della formazione.\nL'omonimo esordio su vinile convince in pieno per la ricercata elaborazione di una sintesi hard blues permeata da una spiccata attitudine progressiva. \n\nL'iniziale Smoking the day away enuncia le coordinate della musica del trio: padronanza strumentale, equilibrio formale, agili strutture in continua \n\nevoluzione con la presenza di ampie parti improvvisate. Non particolarmente esaltanti ed espressive, invece (anche se formalmente corrette), le parti vocali, \n\nche in ogni caso non inficiano l'ottimo risultato complessivo. Tra i tanti gruppi del dopo Cream, i May Blitz sono tra i meno indiziati di plagio e tra i piÃƒÂ¹ \n\nlimpidi e originali estensori del verbo rock blues.\nNewman si trova benissimo in tale contesto ed esibisce le sue migliori qualitÃƒÂ  poliritmiche. Black e Hudson suonano convinti e concisi, evitando di perdere \n\nil fiato dietro a compiacenti ed evanescenti elucubrazioni solistiche. I don't know muove su moderate linee blues per aprirsi all'improvviso in una \n\neffervescente jam memore di free festival e concerti in piccoli club. Dreaming attenua notevolmente il ritmo, preferendo acustiche e soffuse atmosfere, suoni \n\nintrisi di una recondita tensione che deragliano nella parte centrale della canzone. La frastagliata Squeet e soprattutto la pirotecnica Fire queen \n\naffrontano il suono sotto l'aspetto di una forte eccitazione elettrica, divise dalla bellissima e raffinata Tomorrow May come, cullata dagli asciutti colori \n\ndel vibrafono di Newman. L'epica Virgin waters chiude il lavoro, a metÃƒÂ  tra il sogno e la consapevolezza, con parti di gran fascino.\nPurtroppo le vendite del disco risultano modeste, non corrispondendo certamente alla qualitÃƒÂ  della musica proposta, e la carriera del gruppo subisce un \n\ninevitabile contraccolpo negativo. I May Blitz riusciranno ad incidere solamente un secondo album, The 2nd Of May, prima del precoce sciglimento.\n\n[b][color=green]::-&gt;DATI TECNICI&lt;-::[/color][/b]\n\n- FLAC + CUE\n- COVER E BOOKLET\n\n[color=RED][B]\n\nTNTVILLAGE.SCAMBIOETICO.ORG[/b][/color]","torrent":{"xt":"urn:btih:5077ea0ae529e4dc851cd8baa1603da98d346278","amp;dn":"MAY+BLITZ+-+MAY+BLITZ+ABD+THE+2ND+OF+MAY%5BTNTVILLAGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5077ea0ae529e4dc851cd8baa1603da98d346278","infoHashBuffer":{"type":"Buffer","data":[80,119,234,10,229,41,228,220,133,28,216,186,161,96,61,169,141,52,98,120]},"announce":[],"urlList":[]}}