{"title":"The Beatles - Please Please Me (1963) WMA320","uid":6282049,"size":90410589,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:50b15c050a919254a5df6d98718572bd21fc95b8&amp;dn=The+Beatles+-+Please+Please+Me+%281963%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1301475855,"description":"With &quot;A 1,2,3,4,&quot; history was made with the rousing opening number, &quot;I Saw Her Standing There&quot; from Please Please Me, the debut album of the best group the world has had the pleasure to experience.\n&quot;Misery&quot; has the rhythm guitar that became part of the Beatles' signature style. At least in the early days. I wonder if Helen Shapiro set fire to her coiffure after turning this great number down--it was originally offered to her.\n\n&quot;Anna (Go To Him)&quot; is an archetypal 60's type ballad originally done by R&amp;B singer Arthur Alexander. Beatles renditions of other Alexander songs appear on the Live At The BBC album.\n\nTheir rendition of the Cookies' &quot;Chains&quot; shows they do justice to the works one of America's best songwriters, Carole King and Louise Goffin.\n\n&quot;Boys&quot; is classic rollicking rock and roll and sung by Ringo, and one of two Shirelles numbers done here--the other is the slow and languid &quot;Baby It's You,&quot; the song beginning with &quot;Sha la la la la la la.&quot;\n\nThe centerpiece of this album is the title track, which became the Beatles' first #1 hit on the British charts--it only reached #3 in the U.S. Anyone who wonders why the Beatles made it big need only hear this song. Love that harmonica inbetween the verses!\n\nThe &quot;Love Me Do&quot; version here is not the originally recorded single version which reached #17 on the British charts and #1 on the Billboard Singles Chart. Rather, this has Andy White on drums while Ringo is relegated to tapping a tambourine. For the version that hit the single charts, get Past Masters Volume I. I like both versions all the same.\n\n&quot;P.S. I Love You&quot; is sung by Paul and is the first song on where he sings solo--he sings with John on the previous songs. The other song where he sings solo is on the ballad &quot;A Taste Of Honey,&quot; singing of honey &quot;tasting much sweeter than wine.&quot;\n\nIt's George's turn to sing lead on &quot;Do You Want To Know A Secret.&quot; The backing vocals after the second verse provide a nice touch.\n\nTwo rollicking numbers signal the close of Please Please Me, both sung by John. They are &quot;There's A Place&quot; and the definitive rendition of the Isley Brothers' &quot;Twist And Shout.&quot; I wonder how long it took John's vocals to recover after nearly singing himself to shreds.\n\nMany artists would not have come to be without the Beatles, and we have this album to thank for. \n\nby Daniel J. Hamlow\n\nTRACKLIST:\n\n01 - I Saw Her Standing There.wma                           \n02 - Misery.wma                                             \n03 - Anna (Go To Him).wma                                   \n04 - Chains.wma                                             \n05 - Boys.wma                                               \n06 - Ask Me Why.wma                                         \n07 - Please Please Me.wma                                   \n08 - Love Me Do.wma                                         \n09 - P.s. I Love You.wma                                    \n10 - Baby It's You.wma                                      \n11 - Do You Want To Know A Secret.wma                       \n12 - A Taste Of Honey.wma                                   \n13 - There's A Place.wma                                    \n14 - Twist And Shout.wma \n\nWMA 320Kbps 44100Hz STEREO\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!","torrent":{"xt":"urn:btih:50b15c050a919254a5df6d98718572bd21fc95b8","amp;dn":"The+Beatles+-+Please+Please+Me+%281963%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50b15c050a919254a5df6d98718572bd21fc95b8","infoHashBuffer":{"type":"Buffer","data":[80,177,92,5,10,145,146,84,165,223,109,152,113,133,114,189,33,252,149,184]},"announce":[],"urlList":[]}}