{"title":"Happy Days Tutti i Torrent Stagioni da 1 a 4 [DVDrip ITA] TNT Vi","uid":6248594,"size":1862176,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5129b911dcff40a1e86345adb6d877bbd25fbfff&amp;dn=Happy+Days+Tutti+i+Torrent+Stagioni+da+1+a+4+%5BDVDrip+ITA%5D+TNT+Vi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"l.diliberto","files":18,"time":1300319176,"description":"Happy Days Tutti i Torrent Stagioni da 1 a 4 [DVDrip ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=244265&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=244265&lt;/a&gt;\n\n.: Trama :.\n\nLa serie narra le vicende di una famiglia borghese degli anni '50 e '60 (in particolare dal 1954 al 1964) che vive nella cittÃƒÂ  di Milwaukee, i Cunningham; la famiglia ÃƒÂ¨ composta da Howard, proprietario di un negozio di ferramenta, da sua moglie Marion, casalinga, e dai figli Charles (detto Chuck), Richard (detto Richie) e Joanie. Il figlio maggiore Chuck appare sporadicamente solo durante la prima e la seconda stagione (interpretato da due diversi attori), per poi scomparire dal cast senza alcuna spiegazione da parte degli sceneggiatori, lasciando solo i due figli minori di etÃƒÂ  adolescenziale.\n\nIl quadro ÃƒÂ¨ completato dai migliori amici di Richie, Ralph Malph e Warren Webber &quot;Potsie&quot; (in particolar modo il secondo avrÃƒÂ  dapprima un ruolo maggiore del primo, in quanto sarÃƒÂ  identificato nelle prime puntate come il miglior amico di Richie e inizialmente sarÃƒÂ  l'unico dei due a comparire nella sigla iniziale), e soprattutto da Arthur Fonzarelli, detto Fonzie (o anche Fonz nella versione originale), meccanico rubacuori con piÃƒÂ¹ di un tocco alla James Dean, che all'inizio della terza stagione andrÃƒÂ  a vivere in un piccolo appartamento ricavato sopra il garage dei Cunningham. Nato come tipico duro e delinquente giovanile anni '50 di poche parole, che avrebbe dovuto avere un ruolo marginale nel telefilm per dare un tocco di realismo maggiore, il personaggio, visto il successo che ottenne, si trasformerÃƒÂ  ben presto quasi in un membro della famiglia Cunningham, che fa da mentore a Richie grazie alla sua maggiore esperienza, prendendo cosÃƒÂ¬ quello che avrebbe dovuto essere il ruolo del fratello maggiore Chuck, il quale probabilmente sparÃƒÂ¬ dalla serie per questo motivo.\n\nNel corso della serie vari altri personaggi intrecciano le loro storie con quelle dei protagonisti, fra cui i piÃƒÂ¹ importanti sono Arnold e Alfred, che si alternano come proprietari del locale frequentato dai giovani, Arnold's, e Chachi Arcola, cugino di Fonzie e innamorato di Joanie. Dopo la settima stagione, Richie e Ralph lasceranno la serie e faranno la loro comparsa nuovi personaggi, tra cui il principale ÃƒÂ¨ Roger Phillips, nipote di Marion, che va ad abitare in casa Cunningham e che prende il posto di Richie come controparte di Fonzie nello svolgimento degli episodi.\n\nLe storie proposte da Happy Days sono in massima parte incentrate sui problemi del passaggio dall'adolescenza alla maturitÃƒÂ , piÃƒÂ¹ in specifico sui rapporti con sÃƒÂ© stessi e con l'altro sesso, affrontati comunque con leggerezza e ironia. Sia i coniugi Cunningham che Fonzie, anche se in modo diverso e alle volte opposto, sono per i personaggi piÃƒÂ¹ giovani gli esempi, la cui autorevolezza si basa sulla saggezza dell'esperienza.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img718.imageshack.us/img718/2817/happydays.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img718.imageshack.us/img718/2817/happydays.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nPaese: Stati Uniti d'America\nAnno: 1974-1984\nGenere: sit-com\nStagioni: 11\nEpisodi Totali: 255 (253 in Italia)\nDurata: 24 min per episodio\nIdeatore: Garry Marshall\n\nCast: * Ron Howard: Richie Cunningham\n* Henry Winkler: Arthur &quot;Fonzie&quot; Fonzarelli\n* Marion Ross: Marion Cunningham\n* Tom Bosley: Howard Cunningham\n* Anson Williams: Warren &quot;Potsie&quot; Weber\n* Donny Most: Ralph Malph\n* Gavan O'Herlihy: Chuck Cunningham\n* Erin Moran: Joanie Cunningham\n* Pat Morita: Matsuo &quot;Arnold&quot; Takahashi\n* Al Molinaro: Alfred Delvecchio\n\n0=============================0\n\n.: Info Ripping :.\n\ndurata: 24 minuti circa\nformato: 640 x 464\n300 Mb circa","torrent":{"xt":"urn:btih:5129b911dcff40a1e86345adb6d877bbd25fbfff","amp;dn":"Happy+Days+Tutti+i+Torrent+Stagioni+da+1+a+4+%5BDVDrip+ITA%5D+TNT+Vi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5129b911dcff40a1e86345adb6d877bbd25fbfff","infoHashBuffer":{"type":"Buffer","data":[81,41,185,17,220,255,64,161,232,99,69,173,182,216,119,187,210,95,191,255]},"announce":[],"urlList":[]}}