{"title":"Melanie Fiona - Give It To Me Right","uid":4994714,"size":138516484,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:51a45133d01a21a5b21bb4c0c7a9bbf8855aeaf6&amp;dn=Melanie+Fiona+-+Give+It+To+Me+Right&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"2nafish","files":-1,"time":1247223197,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Give It to Me Right&quot; is a song by Canadian R&amp;B singer Melanie Fiona. It is her debut single off her first studio album The Bridge. The song was released to radio outlets on February 28, 2009. &quot;Give It to Me Right&quot; samples the 1968 hit &quot;Time of the Season&quot; by The Zombies. The lyrics were written by Fiona herself.\n\nThe song debuted on the Canadian Hot 100 at number 96 on the issue date of March 7, 2009. It has so far peaked at number 20. The song has also gained American success debuting at number 95 on the U.S. Billboard Hot R&amp;B/Hip-Hop Songs on March 14, 2009. It has peaked at number 57 on the chart. On Croatian Top 40 song debuted at number 13 and so far peaked at number 2. In Italy on the week dated May 19th the single debuted at number 17 and peaked at number 13 so far.\n\nThe Bridge is the debut album from Canadian R&amp;B/soul singer Melanie Fiona. The album will be released under the SRC/Universal Motown label.\n\nThe album is a mixture of soul, R&amp;B, neo soul, reggae and hip hop music influenced by pop music. In an interview, Fiona described the album's sound as &quot;pop soul&quot;. On the album, she worked with Steve Rifkind, Future Cut, Vada Nobles, J. Phoenix, Affiliate, Peter Wade, Salaam Remi and Supa Dups.\n\nMelanie Hall, better known by her stage name Melanie Fiona, is a Canadian R&amp;B singer-songwriter from Toronto, Canada. Melanie was born to Guyanese immigrant parents and grew-up in the inner city of Toronto . Living in a music filled household, Melanie Fiona says she always knew music was her passion. Melanie's father was a guitarist in a band and would allow her to sit on the stage when she was younger as he practiced and remembers her mother playing music at home; everything from The Ronettes to Whitney Houston.\n\nMelanie Fiona's debut album The Bridge was released in the Spring of 2009. The debut single &quot;Give It to Me Right&quot; was released to radio stations on February 28, 2009 and has peaked at #39 on Billboard's Canadian Hot 100. Melanie has worked with Future Cut, Vada Nobles, J. Phoenix, Peter Wade and Salaam Remi for her freshman album. Melanie Fiona was featured on 2008's Reggae Gold 2008 with Supa Dups' &quot;Somebody Come Get Me&quot;.\n\nMelanie opened for Kanye West during his European Tour in 2008, notable since she still hasn't released an album.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:51a45133d01a21a5b21bb4c0c7a9bbf8855aeaf6","amp;dn":"Melanie+Fiona+-+Give+It+To+Me+Right","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51a45133d01a21a5b21bb4c0c7a9bbf8855aeaf6","infoHashBuffer":{"type":"Buffer","data":[81,164,81,51,208,26,33,165,178,27,180,192,199,169,187,248,133,90,234,246]},"announce":[],"urlList":[]}}