{"title":"Employee Of The Month (2006) DVDRIP.XVID","uid":5597547,"size":739638050,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:53a7f19c2640ac76b4b03020c22c23a26e279577&amp;dn=Employee+Of+The+Month+%282006%29+DVDRIP.XVID&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neon","files":3,"time":1275090965,"description":"Employee of the Month is a 2006 American comedy film directed by Greg Coolidge and starring Dane Cook, Harland Williams, Andy Dick, Dax Shepard, and Jessica Simpson. The main plot centers around two shop employees who compete for the affection of their newest co-worker. The film was filmed primarily at a Costco in Albuquerque, New Mexico\n\nFor years, Zack Bradley (Dane Cook) has been working at the local &quot;Super Club&quot; as a box-boy. Living with his grandmother, he spends his free time with his co-workers, Lon (Andy Dick), Iqbal (Brian George), and Russell (Harland Williams). His coworker Vince Downey (Dax Shepard) earns the Employee of the Month title for the 17th time in a row. Vince is egotistical and rude towards his co-workers, mainly Jorge (Efren Ramirez), whom he berates constantly.\n\nWhen new cashier Amy (Jessica Simpson) joins the staff, Zack and Vince fall for her and begin to compete for Amy's affection. Although Amy had a dinner with Vince, she is disgusted by his actions of making moves on her. However, Vince doesn't realize Amy's repulsion of him, thinking that they had a good kiss, and continues pursuing her. When Zack is told that Amy slept with the &quot;Employee of the Month&quot; at her last job, he decides to aim for the title. He also goes on a date with Amy, which takes place entirely in Super Club. It is revealed that the store is going to be audited by the company's head office due to financial irregularities.\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0424993/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0424993/&lt;/a&gt;","torrent":{"xt":"urn:btih:53a7f19c2640ac76b4b03020c22c23a26e279577","amp;dn":"Employee+Of+The+Month+%282006%29+DVDRIP.XVID","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53a7f19c2640ac76b4b03020c22c23a26e279577","infoHashBuffer":{"type":"Buffer","data":[83,167,241,156,38,64,172,118,180,176,48,32,194,44,35,162,110,39,149,119]},"announce":[],"urlList":[]}}