{"title":"My little Pony en vriendjes - part 2  (NL SUBS) TBS","uid":6308461,"size":1998202065,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5482a46bf87fba97f5a9dcabce29d89a2f36ade6&amp;dn=My+little+Pony+en+vriendjes+-+part+2++%28NL+SUBS%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Vlinder2","files":-1,"time":1302441822,"description":"My little Pony en vriendjes - part 2  \n\n\n De magische munten\nAls de pony's aan het picknicken zijn vinden ze vreemden munten. Deze munten kunnen wensen vervullen. Dat kan soms heel handig zijn maar het kan natuurlijk ook problemen opleveren. Door een foute wens is Ponyland bijna helemaal uitgedroogd. Megan en de rest gaan op zoek naar de plaats waar de pony's de munten gevonden hebben en proberen daar naar de oplossing te zoeken. Tijdens de zoektocht komen ze de trol Nithiek tegen die de pony's wel wil helpen, echter verlangt hij wel van de pony's dat ze iets moeten terugggeven wat dezelfde waarde heeft als de munten. Zal het de pony's lukken om iets te vinden of gaan ze de overgebleven munten gebruiken om de problemen op te lossen?\n\nOproer op landgoed Paradijs\nDe pony's Sweet Stuff en Paradise zijn bezig kun huisjes te schilderen met verf die ze gevonden hebben. Deze verf veroorzaakt echter veel problemen want hun huisjes worden betoverd. Om weer in hun huisjes te kunnen wonen moeten onze vriendjes alles uit de kast halen. Ze krijgen plotseling onverwachte hulp van de baby pony's die een oplossing denken te hebben. \n\nVanaf 6 jaar!\n\n\nEnglish\nMy Little Pony And Buddies 2\n\nMy Little Pony Tales captures the type of fantasy and adventure adored by children the world over. Ponyland brims with excitement in every episode as the young girl ponies Starlight, Bright Eyes, Sweetheart, Bon Bon and Melody and the young boy ponies Ace, Lancer and Teddy together learn from every experience they encounter. Join the closest of friends as they laugh, cry, get angry, and make up and above all learn what friendship is all about.\n\n\nAudio ........: Engels\nSubs..........: Nederlands aan/uit!\nCover.........: Yes\nFormat........: DVD5 \nSource........: Retail \nGenre ........: Animation Kinderfilm \nSpeelduur.....: 70 minuten\n\n\nTBS\n","torrent":{"xt":"urn:btih:5482a46bf87fba97f5a9dcabce29d89a2f36ade6","amp;dn":"My+little+Pony+en+vriendjes+-+part+2++%28NL+SUBS%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5482a46bf87fba97f5a9dcabce29d89a2f36ade6","infoHashBuffer":{"type":"Buffer","data":[84,130,164,107,248,127,186,151,245,169,220,171,206,41,216,154,47,54,173,230]},"announce":[],"urlList":[]}}