{"title":"Confidence.DVDRIP.(SPANISH).","uid":5016601,"size":732389376,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:559e9c8e9ba72ba7e888351d751fdac7514cf8e5&amp;dn=Confidence.DVDRIP.%28SPANISH%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":1,"time":1248251500,"description":"DirecciÃƒÂ³n: James Foley.\nPaÃƒÂ­ses: USA, CanadÃƒÂ¡ y Alemania.\nAÃƒÂ±o: 2003.\nDuraciÃƒÂ³n: 97 min.\nInterpretaciÃƒÂ³n: Edward Burns (Jake Vig), Rachel Weisz (Lily), Andy GarcÃƒÂ­a (Gunther Butan), Dustin Hoffman (Winston King), Paul Giamatti (Gordo), Leland Orser (Lionel Dolby), Donal Logue (Lloyd Whitworth), Luis GuzmÃƒÂ¡n (Omar Manzano), Brian Van Holt (Shills Miles), Franky G. (Lupus), Morris Chestnut (Travis), Ethan Embry (Bobby).\nGuiÃƒÂ³n: Doug Jung.\nProducciÃƒÂ³n: Marc Butan, Michael Paseornek, Michael Burns y Michael Ohoven.\nMÃƒÂºsica: Christophe Beck.\nFotografÃƒÂ­a:Juan Ruiz AnchÃƒÂ­a.\nMontaje: Stuart Levy.\nSinopsis:La vida de Jake Vig (Edward Burns) podrÃƒÂ­a depender de lo que no sabe. Este avispado y elegante timador acaba de estafar miles de dÃƒÂ³lares al incauto Lionel Dolby con la ayuda de su equipo: Gordo (Paul Giamatti), Shills Miles (Brian Van Holt), Big Al y dos agentes corruptos del Departamento de PolicÃƒÂ­a de Los Angeles, Lloyd Whitworth (Donal Logue) y Omar Manzano (Luis GuzmÃƒÂ¡n). Sin embargo, cuando Lionel y Big Al aparecen muertos, sale a la luz que Lionel no era un primo cualquiera; Jake no tarda en averiguar que era contable del excÃƒÂ©ntrico jefe del hampa Winston King (Dustin Hoffman). No siendo una persona que se acobarde ante un desafÃƒÂ­o, Jake se ofrece a devolver el dinero a King montando el mayor golpe de su vida. La vÃƒÂ­ctima serÃƒÂ¡ ni mÃƒÂ¡s ni menos que Morgan Gillette, un banquero que mantiene estrechos lazos con el crimen organizado. Con una apuesta tan elevada, Jake recurre a una atrevida carterista llamada Lily (Rachel Weisz), que se incorpora al equipo para llevar a cabo un complejo plan que entremezcla crÃƒÂ©ditos a empresas, contabilidad creativa, transferencias bancarias y cuentas en el extranjero.","torrent":{"xt":"urn:btih:559e9c8e9ba72ba7e888351d751fdac7514cf8e5","amp;dn":"Confidence.DVDRIP.%28SPANISH%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"559e9c8e9ba72ba7e888351d751fdac7514cf8e5","infoHashBuffer":{"type":"Buffer","data":[85,158,156,142,155,167,43,167,232,136,53,29,117,31,218,199,81,76,248,229]},"announce":[],"urlList":[]}}