{"title":"Days of Thunder(1990)DVDRip.AC3(ENG)-DROCK","uid":6213762,"size":733973930,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:566a05ffc0639742c3e60eab6ccd1ecbec2cb8df&amp;dn=Days+of+Thunder%281990%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"drock232","files":-1,"time":1299082711,"description":"The Top Gun team of producers Don Simpson and Jerry Bruckheimer, director Tony Scott, and superstar Tom Cruise reunite for this excursion into stock-car racing that incorporates the vroom and rumble of deafening car engines with a rehash of the same elements that worked so effectively in Cruise\\'s Top Gun, The Color of Money, and Cocktail. Cruise plays stock-car driver Cole Trickle, a young fireball on the Southern stock-car circuit who has loads of talent but no conception of how to channel that talent in to racing success. When Tim Daland (Randy Quaid) commissions veteran stock-car racer Harry Hogge (Robert Duvall) to built a car and hires Cole to drive it, Harry must instill in Cole his philosophy of winning and teach him how to channel his raw talent into success -- or, as Harry puts it, \\&quot;controlling something that\\'s out of control.\\&quot; Cole immediately comes into conflict with the circuit\\'s star driver, Rowdy Burns (Michael Rooker), and their hijinks on the track causes them to smash up their cars and lands them both in the hospital. Because of his injuries, Rowdy is forced to withdraw from the circuit competition. With no rival to torment, Rowdy becomes Cole\\'s supporter and friend, while Cole revs up his motors for Dr. Claire Lewicki (Nicole Kidman), the attractive brain specialist who supervises Cole\\'s recovery from the crackup. Cole\\'s health is restored, and he begins to race again, chastened and hanging onto Harry\\'s every word. Cole appears to have centered himself for success, but in an orgasmic grand finale, Cole must compete against Russ Wheeler (Cary Elwes), a dastardly driver who not only wants to see Cole defeated but permanently disabled. \n\nRipped with Handbrake.\n\nLength: 1 Hour 47 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:566a05ffc0639742c3e60eab6ccd1ecbec2cb8df","amp;dn":"Days+of+Thunder%281990%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"566a05ffc0639742c3e60eab6ccd1ecbec2cb8df","infoHashBuffer":{"type":"Buffer","data":[86,106,5,255,192,99,151,66,195,230,14,171,108,205,30,203,236,44,184,223]},"announce":[],"urlList":[]}}