{"title":"The Red Green Show - Season 9","uid":5185832,"size":3096398918,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5737d18d466a1ceb1fd4e41b6e8a87e2062ac268&amp;dn=The+Red+Green+Show+-+Season+9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"theanonymousentity","files":16,"time":1259456646,"description":"Season 9 of The Red Green Show, ripped from the 1999 season DVD set. This is the third season of five to be released on DVD.\n\nThis includes the following episodes:\n\nHarold's Job - A major change in the show as Harold leaves the Lodge and moves to the city to take a job as Assistant Account Executive at Multi-Corp International Inc.\n\nThe Fishing Derby - When nobody catches any fish in the Fishing Derby, the men have Possum Lake tested for contaminants and the report shows that the lake is no longer classified as water.\n\nLady in Red - A beautiful young chiropractor goes into business in Possum Lake and creates more kinks than she removes. \n\nThe Bachelor Auction - The men decide to have a Bachelor Auction as a way of raising money and getting dates. \n\nAngel - Red and the boys argue about the existence of angels and Mike volunteers to produce one. \n\nSchool Bus Blimp - Red talks the guys into converting an old school bus into a hot air balloon.\n\nCoup De Grass - Red creates a new type of grass seed that only grows two inches tall. \n\nRent A Wreck - Mike borrows Red's van to use in a demolition derby.\n\nCurse of the Mummy - Red and Mike have some fun with artifacts from the local museum.\n\nRoll Out the Barrels - The local brewery gives all their old beer barrels to the Lodge and Red decides to take his over the falls.  \n\nNo Retreat - Harold's company tries to buy the Lodge.\n\nThe Battle Call - The men stage a mock battle against their rival club, the Caribou Lodge.\n\nHurricane Doug - The Lodge is threatened with a Force 5 hurricane.\n\nGuinness World Records - The men try to devise ways of getting themselves into the record book. \n\nThe Auto Club - The men form an auto club to make money servicing other people's vehicles. \n\nToo Much Information - Harold gives the guys a bunch of old computers which changes their lives.\n\nEnjoy and keep seeding!","torrent":{"xt":"urn:btih:5737d18d466a1ceb1fd4e41b6e8a87e2062ac268","amp;dn":"The+Red+Green+Show+-+Season+9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5737d18d466a1ceb1fd4e41b6e8a87e2062ac268","infoHashBuffer":{"type":"Buffer","data":[87,55,209,141,70,106,28,235,31,212,228,27,110,138,135,226,6,42,194,104]},"announce":[],"urlList":[]}}