{"title":"TEREZIN - THERESIENSTADT - ANNE SOFIE VON OTTER[TNTVILLAGE]","uid":5124927,"size":270376987,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:581a1578f1faa736f2222b81fd92bf2c53e9ea36&amp;dn=TEREZIN+-+THERESIENSTADT+-+ANNE+SOFIE+VON+OTTER%5BTNTVILLAGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"f.kruger","files":7,"time":1255559090,"description":"[b][color=blue]TEREZIN - THERESIENSTADT[/COLOR][color=red] \n\nANNE SOFIE VON OTTER \n\n[/b][/color]\n\n[b][color=green]::-&gt;COVER&lt;-::[/b][/color]\n\n\n[IMG]http://img98.imageshack.us/img98/5962/frontcoverq.jpg[/IMG]\n\n\n[b][color=green]::-&gt;IL TEMA&lt;-::[/color][/b]\n [color=teal]\nLa capacitÃƒÂ  evocativa della musica puÃƒÂ² toccare livelli quasi insopportabili. E basta ascoltare il cd di Anne Sofie von Otter dal titolo TerezÃƒÂ¬n/Theresienstadt, che la Deutsche Grammophon ha appena pubblicato, per rendersene conto. Un disco struggente, che raccoglie le musiche composte da quegli artisti cechi che dai nazisti avevano lÃ‚Â´ordine di mettere in scena il teatrino dellÃ‚Â´insediamento ebreo Ã‚Â«modelloÃ‚Â» (di TerezÃƒÂ¬n appunto, Theresienstadt per i tedeschi, 60 chilometri a nord di Praga, la cittÃƒÂ  che ospitÃƒÂ² il campo di concentramento voluto dai nazisti durante la seconda guerra mondiale, ha giÃƒÂ  trattato sulle pagine di questo giornale Milan Kundera, in un articolo uscito lo scorso 23 ottobre, ndr) buono per le visite della Croce Rossa e i filmati della propaganda, ma che sapevano perfettamente che da un giorno allÃ‚Â´altro sarebbero partiti per le camere a gas.\nIlse Weber, Karel Svenk, Adolf Strauss, Pavel Haas, Erwin Schulhoff, sono i nomi di questi compositori. E i loro registri spaziano dal cabaret al lieder, dalla ninnananna alla musica contemporanea. Anne Sofie von Otter, mezzosoprano, restituisce intatte, col suo canto, la dignitÃƒÂ  e la disperazione di melodie nate sullÃ‚Â´orlo della fine, ma sempre ricche di quellÃ‚Â´energia iniziale che accompagna ogni vero atto creativo. Nei canti di Theresienstadt (che la von Otter ha inciso insieme a Bengt Forsberg, Christian Gerhaher e Daniel Hope), ci sono dei momenti in cui lÃ‚Â´immaginazione del contesto si fa cosÃƒÂ¬ pesante da annebbiare la vista. Come durante la ninnananna Wiegala, che Ilse Weber cantÃƒÂ² con la sua chitarra ai bambini del campo fino allÃ‚Â´ultimo, mentre il gas cominciava giÃƒÂ  a uscire. Ma invece ÃƒÂ¨ proprio questa immaginazione a rilanciare lÃ‚Â´ascolto. Indefinitamente.\n\n[/color]\n[b][color=green]::-&gt;TRACK LISTINGS&lt;-::[/color][/b]\n[color=teal]\n\n 01.- Ich Wandre Durch Theresienstadt\n02.- Pod Destnikem\n03.- Vsechno Jde! (Terezin March)\n04.- Ade, Kamerad!\n05.- Und Der Regen Rinnt\n06.- Ich Weiss Bestimmt, Ich Werd\n07.- Terezin-Lied\n08.- Wir Reiten Auf HÃƒÂ¶lzernen Pferden\n09.- Wiegaka\n10.- Three Songs After Poems By Arthur Rimbaud\n11.- Three Songs After Poems By Arthur Rimbaud\n12.- Three Songs After Poems By Arthur Rimbaud\n13.- Ein JÃƒÂ¼disches Kind\n14.- Beryozkele\n15.- Three Songs From Sixteen Sonnets, Op. 34\n16.- Three Songs From Sixteen Sonnets, Op. 34\n17.- Three Songs From Sixteen Sonnets, Op. 34\n18.- Four Songs On Chinese Poetry\n19.- Four Songs On Chinese Poetry\n20.- Four Songs On Chinese Poetry\n21.- Four Songs On Chinese Poetry\n22.- Sonata For Solo Violin - Erwin Schulhoff\n23.- Sonata For Solo Violin - Erwin Schulhoff\n24.- Sonata For Solo Violin - Erwin Schulhoff\n25.- Sonata For Solo Violin - Erwin Schulhoff\n\n[/color]\n\n[b][color=green]::-&gt;ANNE SOFIE VON OTTER&lt;-::[/color][/b]\n [color=teal]\n\n[IMG]http://img242.imageshack.us/img242/7452/otterspan.jpg[/IMG]\n\n\nDa oltre due decenni riconosciuta come uno dei maggiori cantanti della sua generazione, la mezzosoprano svedese Anne Sofie von Otter ÃƒÂ¨ richiesta dalle principali orchestre, direttori, teatri e case discografiche del mondo. Si ÃƒÂ¨ formata a Stoccolma, continuando gli studi con Vera Rozsa presso la Guildhall School di  Londra. Ha iniziato la sua carriera presso l'Opera di Basilea dove ha interpretato ruoli che includono Cherubino, Dorabella, Sesto e il Compositore nel Ariadne, prima di intraprendere una carriere internazionale dove appunto le opere di Mozart e Strauss hanno assunto un ruolo fondamentale nel suo repertorio.\nAnne Sofie von Otter ÃƒÂ¨ stata ospite dei maggiori teatri lirici del mondo: a New York, Chicago, Londra, Vienna, Monaco di Baviera, Berlino, Milano, Bastille di Parigi, Ginevra... E' nota per la sua interpretazione di Oktavian, un ruolo che ha cantato a Stoccolma, Monaco di Baviera, Chicago, Covent Garden e Vienna, nonchÃƒÂ© al Metropolitan di New York ed in Giappone sotto la guida di Carlos Kleiber. E' ospite regolare al Metropolitan Opera e James Levine, sia con l'opera di Strauss (che ha inciso con Bernard Haitink) che nell'Idomeneo di Mozart con Placido Domingo, Clemenza di Tito e PÃƒÂ©lleas et MÃƒÂ©lisande . Impegni recenti includono inoltre il Rosenkavalier a Vienna, La Clemenza di Tito alla Bastille di Parigi, Les Troyens a Ginevra, Alcina allo storico teatro Svedese di Drottningholm, Carmen a Glyndebourne, nonchÃƒÂ© ruoli a Lione, Aix-en-Provence, L'Opera di Stoccolma,  Palais Garnier e con Bernard Haitink e la Berliner Philharmoniker.\nHa cantato con le maggiori orchestre e direttori in Europa ed America: Abbado, Davis, Gardiner, Giulini, Kleiber, Levine, Marriner, Muti, Sinopoli, Minkowski, Salonen, Chung, Pinnock, Mortensen, Rattle, Nagano e Solti, ed ÃƒÂ¨ nota per i suoi recitals di Lieder con il fedele accompagnatore, il pianista Bengt Forsberg: impegni recenti in questo campo includono concerti a Parigi, Lione, Graz, Vienna, Vancouver, New York, San Francisco, Bruxelles e Londra, nonchÃƒÂ© ai festivals di Luzern, Schleswig-Holstein e Salisburgo.\nAnne Sofie von Otter ha inciso per la Deutsche Grammophon, Philips, EMI, Erato, Decca, Sony e Archiv. L'ampia discografia include canzoni di Weill (con Gardiner/DG), la Messa in do-minore di Mozart (Marriner/Philips), cantate di HÃƒÂ¤ndel (Goebel/DG Archiv) , l'Ottava Sinfonia di Mahler (Abbado/DG), Lieder di Wolf (EMI), Lieder di Berg (Abbado/DG) e di Mozart e Haydn (con Melvyn Tan /DG), Lieder francesi e scandinavi (DG), Lieder di Mahler e Zemlinsky (Gardiner/DG), Lieder di Korngold (DG), Berlioz Damnation de Faust (Chung/DG), CosÃƒÂ¬ fan tutte (Solti/Decca), Barbablu di Bartok (Haitink/EMI) e Werther (Nagano/Erato), Offenbach (Minkowski). Di recente uscita ÃƒÂ¨ l'acclamato cd intitolato Terezin/Theresienstadt, una commovente collezione di canzoni ed altri brani scritti dai prigonieri nel campo di concentramento di Theresienstadt.\n[/color]\n\n\n[b][color=green]::-&gt;I DATI DE CD&lt;-::[/color][/b]\n [color=teal]\nCopyright:\n    Ã‚Â© 2007 Deutsche Grammophon GmbH, Hamburg\nLabel:\n    Universal Classics &amp; Jazz\nCatalogue Number:\n    4776546\nParent Label:\n    DG\nBarcode:\n    00028947765462\nRelease Date:\n    13-08-2007\nRecording Date:\nRecording Location:\nSung Language:\n    DE/EN/CS\n[/color]\n\n[b][color=green]::-&gt;DATI TECNICI E NOTE&lt;-::[/color][/b]\n[color=red]\n[b]CD formato APE+CUE\nCover e Booklet allegati\n[/b]\n[/color]\n\n[color=RED][B]\n\nTNTVILLAGE.SCAMBIOETICO.ORG[/b][/color]","torrent":{"xt":"urn:btih:581a1578f1faa736f2222b81fd92bf2c53e9ea36","amp;dn":"TEREZIN+-+THERESIENSTADT+-+ANNE+SOFIE+VON+OTTER%5BTNTVILLAGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"581a1578f1faa736f2222b81fd92bf2c53e9ea36","infoHashBuffer":{"type":"Buffer","data":[88,26,21,120,241,250,167,54,242,34,43,129,253,146,191,44,83,233,234,54]},"announce":[],"urlList":[]}}