{"title":"Mac Mass Mailer","uid":5135881,"size":1541102,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:58217c85524e9067aebd579cef62df79142b3737&amp;dn=Mac+Mass+Mailer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Flor1an","files":3,"time":1256477504,"description":"Release by: Flor1an\n\nDate: 25/10/2009\n\nType: Application\n\nPlatform: Mac\n\nFilesize: 1.5 Megabytes\n\nSerial number: Included\n\nDescription:\n\nWho needs a fully-featured mass mailer\n\nWhether you run a small business or work in a large company, there always is a problem of communicating with lots of existing customers. It does not matter whether you send newsletters, notifications or invoices; each customer should be served individually. You have to send email messages personally and use customer names and other personal information in your messages. If you use a regular mail client, you know well how long it takes to create a hundred of personal messages. And what if we are talking about thousands of messages? This job would be impossible without using a mass mailer offering message templates and recipient database.\n\nThe main advantages of Mac Mass Mailer\n\nMac Mass Mailer is a fully-featured mass mailer specially designed for Apple Macintosh computer. It offers everything you need to create and maintain separate mailing lists for different needs and send mass messages directly form your Mac at a very high speed. Mac Mass Mailer uses Apple Mail's framework to deliver your messages. It means that 100% of your email messages will get delivered properly to recipient mailboxes as if they were delivered by Apple Mail in a regular way.\n\nPersonalize your messages using templates\n\nThe recipient database is fully customizable. You can add as many recipient fields as you want and use them in message templates for the purpose of personalizing your messages. Each recipient will receive individualized message as if it were separately sent with Apple Mail personally for him in a regular way. \n\n\n\nRemember to SEED, and to BUY the software when you like it!","torrent":{"xt":"urn:btih:58217c85524e9067aebd579cef62df79142b3737","amp;dn":"Mac+Mass+Mailer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58217c85524e9067aebd579cef62df79142b3737","infoHashBuffer":{"type":"Buffer","data":[88,33,124,133,82,78,144,103,174,189,87,156,239,98,223,121,20,43,55,55]},"announce":[],"urlList":[]}}