{"title":"Black.Sheep.2006.AVCHD","uid":5187866,"size":4194106001,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:5864cf1cd242a609ef332a6a7bde09cfdacdc4c1&amp;dn=Black.Sheep.2006.AVCHD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Tricari","files":4,"time":1259544107,"description":"Black Sheep (2006)\n\nVideo: AVCHD 1280x544\nAudio: AC-3 English @ 384k\n\nSynopsis: This blood-soaked horror comedy is the story of Henry Oldfield (Nathan Meister), a New Zealander with an unfortunate phobia...of sheep. When Henry was a boy, his father was killed in a herding...  This blood-soaked horror comedy is the story of Henry Oldfield (Nathan Meister), a New Zealander with an unfortunate phobia...of sheep. When Henry was a boy, his father was killed in a herding accident on the land, and Henry fled to the big city. Now, years later, he has returned to sell his half of the farm and--at the behest of his therapist--to face his fears. Meanwhile, Henry's sadistic older brother Angus (Peter Feeney) has taken over the family business, and become widely known for his controversial genetic experiments on the animals. When two animal activists release one of Angus's genetically-altered lambs, Henry's trip quickly turns into his worst nightmare, as the lamb's zombie-like bite turns sheep and people into vicious flesh-eaters. Henry joins forces with one of the animal activists (Danielle Mason), and together they try to escape the sheep and find an antidote for the virus. Director Jonathon King cleverly plays on the silliness of the normally docile, dimwitted lamb as terrifying monster, and his shots of the sheep swarming over the hills induce equal parts thrills and laughter. However, the storyline could perhaps have benefited from a bit less action, and a bit more plot, as the suspense and jokes begin to fizzle by the end. The excellent WETA WORKSHOP (known for its work on the LORD OF THE RINGS trilogy) delivers hilariously gory special effects. Faces are eaten off, humans throw their own limbs, and heads explode, culminating in a raucous bloodbath that will likely earn BLACK SHEEP cult status among the EVIL DEAD crowd\n\nRotten Tomatoes: 71%\nIMDB: 6/10 (11859 votes)","torrent":{"xt":"urn:btih:5864cf1cd242a609ef332a6a7bde09cfdacdc4c1","amp;dn":"Black.Sheep.2006.AVCHD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5864cf1cd242a609ef332a6a7bde09cfdacdc4c1","infoHashBuffer":{"type":"Buffer","data":[88,100,207,28,210,66,166,9,239,51,42,106,123,222,9,207,218,205,196,193]},"announce":[],"urlList":[]}}