{"title":"District.9.2009.SPANiSH.R5.XViD.LiNE.","uid":5087397,"size":1466347520,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:593d77693e2d52f2b3608bb73b2b9a8db7cd3fd8&amp;dn=District.9.2009.SPANiSH.R5.XViD.LiNE.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gamolama","files":2,"time":1252836473,"description":"Hace casi treinta aÃƒÂ±os, los alienÃƒÂ­genas contactaron por primera vez con el planeta Tierra. La raza humana esperÃƒÂ³ un ataque hostil o un gran avance en la tecnologÃƒÂ­a. No ocurriÃƒÂ³ ninguna de las dos cosas. Los alienÃƒÂ­genas eran refugiados, los ÃƒÂºltimos sobrevivientes de su planeta de origen. Al tiempo que las naciones del mundo intentaban ponerse de acuerdo en lo que tenÃƒÂ­an que hacer con ellos, las criaturas fueron instaladas de forma temporal en el Distrito 9 de SudÃƒÂ¡frica. Ahora, la paciencia en cuanto a la situaciÃƒÂ³n de los alienÃƒÂ­genas se ha agotado. El control sobre los extraterrestres ha sido delegado en la Multi-National United (MNU), una compaÃƒÂ±ÃƒÂ­a privada que lo que le interesa no es el bienestar de los alienÃƒÂ­genas sino las formidables ganancias que les podrÃƒÂ­a reportar su impresionante armamento, en el caso de que pudieran hacerlo funcionar. Hasta el momento no lo han logrado; la activaciÃƒÂ³n de las armas requiere ADN alienÃƒÂ­gena. La tensiÃƒÂ³n entre los extraterrestres y los humanos llega a un punto crÃƒÂ­tico cuando un operario de campo, Wikus, contrae un misterioso virus.","torrent":{"xt":"urn:btih:593d77693e2d52f2b3608bb73b2b9a8db7cd3fd8","amp;dn":"District.9.2009.SPANiSH.R5.XViD.LiNE.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"593d77693e2d52f2b3608bb73b2b9a8db7cd3fd8","infoHashBuffer":{"type":"Buffer","data":[89,61,119,105,62,45,82,242,179,96,139,183,59,43,154,141,183,205,63,216]},"announce":[],"urlList":[]}}