{"title":"Two and a Half Men, TVSeries (divx), S04E05-08, NL Subs, DMT","uid":6130594,"size":1027481548,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:59b13d3a01617d814598c4623d6de817784685aa&amp;dn=Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S04E05-08%2C+NL+Subs%2C+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MeMar","files":-1,"time":1296114338,"description":"Two and a Half Men, TVSeries (divx), S04E05-08, NL Subs, DMT\n\n\n\nVerenigde Staten\nCategorie: Beeld\nFormaat: DivX\nOndertitels (ingebakken): Nederlands\nGenre: Sitcom\nBron: Retail\nDuur: ongeveer 20 minuten per aflevering\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0369179/episodes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0369179/episodes&lt;/a&gt; &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&lt;/a&gt;\n\nDe hoofdrollen worden vertolkt door Charlie Sheen, Jon Cryer en Angus T. Jones.\n\nHet begint met een man alleen (Alan gaat scheiden... alweer) en eindigt met een glimmende steen \n(de diamant die Evelyns nieuwe vriend aan de derde vinger van haar linkerhand wil schuiven). In de \ntussentijd is het hippe strandhuis van Charlie Harper in Malibu de perfecte plek voor grappen, mooie \nmeisjes, een eenoudergezin, beroemde buren, familie en nog meer grappen. Charlie (Charlie Sheen) \nkomt dicht in de buurt bij zijn al lang overleden vader. Alan (Jon Cryer) begint met online dating \nnadat hij zijn cv een beetje heeft opgeleukt. Jake (Angus T. Jones) vervangt zijn Harry Potter-posters \ndoor plaatjes van mooie meiden.\n\nAflevering 5: A Live Woman of Proven Fertility\nAlan kan zijn geluk niet op wanneer hij ontdekt dat zijn ex-vrouw Judith ingaat op het huwelijksaanzoek van haar vriend Herb. Dit betekent immers dat hij haar geen alimentatiegeld meer moet betalen. Zijn vreugde is echter maar van korte duur: Jake is niet opgezet met het nieuws en wil de trouwplannen van zijn moeder dwarsbomen. Alan slaagt erin zijn zoon op andere gedachten te brengen door hem om te kopen, maar dan blijkt dat ook Herb zijn twijfels heeft over het huwelijk\n\nAflevering 6: Apologies for the Frivolity\nCharlie's nieuwe verovering Lydia blijkt zowel op persoonlijk als op professioneel vlak bijzonder veel gemeen te hebben met zijn moeder. Alan doet er alles aan om zijn broer dit te helpen inzien, maar kent hierbij weinig succes. Charlie weigert te geloven dat hij een Oedipus-complex heeft, tot hij ziet hoe Lydia met haar twee zoontjes omgaat.\n\nAflevering 7: Repeated Blows to His Unformed Head\nAlan en Charlie maken kennis met Naomi, de hoogzwangere dochter van hun huishoudster Berta. In tegenstelling tot zijn broer voelt Alan zich bijzonder aangetrokken door zwangere vrouwen. Terwijl hij zoveel mogelijk tijd met Naomi probeert door te brengen, gaan Berta en Charlie op zoek naar het ex-vriendje van de jonge vrouw. Die probeert namelijk te ontsnappen aan zijn vaderlijke plichten\n\nAflevering 8: Release the Dogs\nAlan kampt al enkele dagen met een ernstig slaapgebrek. Na een bezoek aan de psychiater komt de oorzaak van zijn probleem aan de oppervlakte: hij is verwikkeld in een innerlijke tweestrijd. Hij is Charlie dankbaar voor zijn gastvrijheid, maar tegelijk ook jaloers op het zorgeloze leven van zijn broer.\n\n\n\nDeze serie wordt u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:59b13d3a01617d814598c4623d6de817784685aa","amp;dn":"Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S04E05-08%2C+NL+Subs%2C+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59b13d3a01617d814598c4623d6de817784685aa","infoHashBuffer":{"type":"Buffer","data":[89,177,61,58,1,97,125,129,69,152,196,98,61,109,232,23,120,70,133,170]},"announce":[],"urlList":[]}}