{"title":"Cal Tjader - Plugs In (1969) [Jazz][mp3 320][schon55]","uid":5076140,"size":83914708,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5a1c6ed1698ae6397860f8e58ff802ed01a07c28&amp;dn=Cal+Tjader+-+Plugs+In+%281969%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":13,"time":1251851677,"description":"Cal Tjader - Plugs In \nYear: 1969\nLabel: Dusty Groove - Skye\nQuality: 320 kbps\n\nCal Tjader Live at the Lighthouse Hermosa Beach, CA: February 20-21, 1969\n\n&quot;A beautifully plugged-in, turned-on session from Cal Tjader -- one that features the funky vibist alongside some sweet Fender Rhodes! The session was recorded live, but it's got a flowing, modal quality that rivals Tjader's best work in the studio for Verve and Fantasy at the end of the 60s -- a soaring, spacious sound that comes from the interplay between Cal's ringing vibes and the Fender Rhodes and acoustic piano work of Al Zulaica -- an excellent player we only know from a few of Tjader's albums.  Armando Peraza provides some tight conga work on the set -- and titles include &quot;Spooky&quot;, &quot;Tra La La Song&quot;, &quot;Morning Mist&quot;, &quot;Alonzo&quot;, &quot;Nica's Dream&quot;, and &quot;Get Out of My Way&quot; -- a great instrumental take on the Latin soul hit from Joe Torres!&quot;\n\nSeeing as how nobody has reviewed this wonderful album, I felt compelled to put my two cents in.  Cal Tjader was a beautiful musician concerned above all with attractive melodies and deep rhythms.  He's often dismissed out of hand by many jazz fans, a shame since if they would just put their prejudices aside, they would find that he meant every note he played, no less so than Milt Jackson or Bobby Hutcherson.  This album documents a 1969 live performance where Tjader and his band are in perfect synergy with all in attendance.  Indeed, the audience occasionally breaks into spontaneous applause in mid-song just because the musicians are in such a sweet groove.  The material ranges from Horace Silver's &quot;Nica's Dream&quot; to the Banana Splits theme (no joke!) and everything swings equally.  This album has a glow to it that's hard to describe, the rhythms cook nicely while the sound of Tjader's vibes and Al Zulaica's electric piano totally mellow you out.  It's infectious and positive and very well-recorded.  Highly recommended! ~ Greg C. \n\nAs a Cal Tjader fan for over 50 years, I found this album a delightful surprise.  I didn't have it in my collection, and was very pleased with the set performed at the Lighthouse in Hermosa Beach in the 60s.  I would recommend this to all Tjader afficionados.  I was a public radio program director and a friend of Cal's back in the 70s and 80s, and we all lost a wonderful musician and great-hearted person when he passed too soon.  This set is great! ~ Katie Sloan\n\nPersonnel:\nAl Zulaica (el-p);\nJim McCabe (el-b);\nJohnny Rae (perc);\nCal Tjader (vib);\nArmando Peraza (cga)\n\nCal Tjader - Plugs In Tracks:\n01  Alonzo 4:08   \n02  Lady Madonna 3:59   \n03  Nica's Dream 5:03   \n04  Spooky 4:15   \n05  St.  Croix 5:09   \n06  Tra-La-La Song 2:59   \n07  Morning Mist 3:05   \n08  Get Out Of My Way 6:18","torrent":{"xt":"urn:btih:5a1c6ed1698ae6397860f8e58ff802ed01a07c28","amp;dn":"Cal+Tjader+-+Plugs+In+%281969%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a1c6ed1698ae6397860f8e58ff802ed01a07c28","infoHashBuffer":{"type":"Buffer","data":[90,28,110,209,105,138,230,57,120,96,248,229,143,248,2,237,1,160,124,40]},"announce":[],"urlList":[]}}