{"title":"Fallout: New Vegas - EnhancedGamePlay","uid":6140873,"size":13379097,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5a761468afddf7710f90418db3bf5bf8b83d0c7b&amp;dn=Fallout%3A+New+Vegas+-+EnhancedGamePlay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iztari","files":1,"time":1296497083,"description":"Ingestibles\nBeer (all varieties) adds a nuka cola cap after being drunk.\nVarious sodas (Nuka, variants, sarparilla) increases thirst more, and also increase hunger slightly.\nXander root value changed from 0 to 2.\n\nAmmo\nMicroBreeder ammo given minimal weight, and no longer has DT bypass effect given by last official patch.\n\nArmor\nSurgical Mask weight reduced from 1 to .05\nMakeshift gas mask replaces eyeglasses, mask ,a nd mouth objects, and also has a gas-mask effect that appears to have been intended by FNV designers but not installed.\nRaul's Jumpsuit (and Armored Jumpsuit) now playable.\nFedora Hat now playable.\nRaul's Hat now playable.\nGladiator Armor now also covers eyeglass slot.\nChinese Stealth suit now has FO3-style stealth field, value and health hugely increased.\nNew generic Petro-Chico jumpsuit added to loot lists.\n\nNPC classes\nDoctors now sell much more stuff.\nBartenders now also sell clothing.\nMechanics now hve Repair tag skill, not Lockpicking.\nGun Merchants sell misc items.\nAddicts enable to sell chems.\nAdventurer Vendors now sell misc items and do repairs.\nTravelling merchants now do repairs.\n\nContainers and Merchant Inventories\nHuge numbers of items added to various miscellabous containers, including chances of:\nschematics\nskill books\nmagazines\nweapon mods\n\nCreatures\nNumerous changes to animal factions and agressiveness.\nDogs no longer in AnimalFriendFaction, look nastier, hev better AI for hunting behaviors.\nRavens now preferentially look for human flesh :).\nFeral Ghouls wearing jumpsuits now have jumpsuit in loot.\n\nDialog\nSome fixes to NPC passing comments regarding Primm\nDoctor dialogs changed to include new Primm doctor.\nLorenzo in Hidden Valley will do repairs.\n\nObject Effects\nStun grenades now also paralyse, in addition to stun effect.\nGas grenades now create a poison gas cloud, have nastier explosions.\n\nFactions\nNumerous changes to who's in what factions, and relations between factions.\nNCR Faction now enemies with various wastelasn critters, like rats, scorpions, geckos, lakelurks.\nGreat Khans no longer enemies of NCR.\nPrimm residents now enemies of bloatflys and geckos.\nDogs now enemies of lots of other creatures, such as ghouls, supermutantsm robots, raiders, etc. Basically they now go after everyone, it seems.\nMojave Civilians now enemies of creatures, powder gangers, and jackals.\nVipers and Jackals now attack lots of creatures on sight.\nMojave Mercenaties now allies of Novac/Primm/188, enemies of ghouls, supermutants, creatures, fiends.\n\nGame Settings\nMax level upped to 99.\n\nLeveled Items\nNumerous changes to level lists, mostly adding new loot, including a few unbalancing ones:\nSkill books now buyable at vendors, at cost of 50 caps base.\nHoly Frag grenades can be found in loot.\n\nMisc Items\nNumerous weight changes, most reasonable reductions and giving some weight to 0 weight items.\nPoweder, primer, and cases now have weight.\n\nNotes\nLots of fun new notes (junk mail, love letters) added to mailboxes.\n\nNPCs\nNumerous NPC changes, including voices, inventories, and AI packages.\n Companions level up at 1.0x player level (not 0.75 as in last official patch), max level 99.\nChris Haversham now has Novac work/sleep AI.\nResidents of various places (Primm, Goodsprings) now have vastly increased AI, including putting on nighties to go to bed, eating breakfast, finding weapons and ammo and clothes.\nNCR Troopers have enchanced assualt and guard AI.\nAll legionaries have Legion Ears as death items.\nDoctor Michelle Lee added to Primm.\n\nAI Packages\nNost NPCs put on nightwear before sleeping.\nMost NPCs restore health after sleeping\nNPCs actaully use food to eat.\n\nQuest\nFixes for VMS02 'I fought the Law'\n\nWeapons\nSniper Rifle damage restored to 62, not 42 as changed in last official patch.\nSniper Rifle does a Miss Foutune kncokdown on critical.\nBoone's Scoped hunting rifle now playable, has scope, cases head explosion on critical.\nBinoculars always have Rex' 'search and mark' ability.\nGas Grenades cause paralysis.\nMiss Fortune's Bad Luck Bringer damge now 25, not 10.\nWeapKnifeAssassin name changed from 'Combat Knife' (one of many) to 'Assassin Knife', abd given poison effect. \nGobi Campaign Scout Rifle now has nightvision scope.\nIncendiary Grenade criticals now same as flamer crits, rather than plasma gooification.\nStun Grenade criticals cause Mezz effect rather than plasma gooification.\nHoly Frag Grenade crits cause MissFortune BlowUp effect.\nStun Baton crits cause Mezz effect rather than Flamer effect.","torrent":{"xt":"urn:btih:5a761468afddf7710f90418db3bf5bf8b83d0c7b","amp;dn":"Fallout%3A+New+Vegas+-+EnhancedGamePlay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a761468afddf7710f90418db3bf5bf8b83d0c7b","infoHashBuffer":{"type":"Buffer","data":[90,118,20,104,175,221,247,113,15,144,65,141,179,191,91,248,184,61,12,123]},"announce":[],"urlList":[]}}