{"title":"Naruto Uncut Box Set, Vol. 15 disk 3","uid":5075339,"size":7552079364,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5a80b88eb9aa7556d3a3da3c33c27739074de82c&amp;dn=Naruto+Uncut+Box+Set%2C+Vol.+15+disk+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mike80219","files":-1,"time":1251778958,"description":"Actors: Artist Not Provided \nFormat: Animated, Box set, Color, Dubbed, DVD, Subtitled, NTSC \n\nAspect Ratio: 1.33:1 \nNumber of discs: 3 \n\nStudio: Viz Video \nDVD Release Date: July 21, 2009 \nRun Time: 350 minutes \n\nIno faces an unusual exercise in royal etiquette when she is asked by an overweight princess to take her place and attend the first meeting with the young prince she adores. Then the Hidden Leaf Village comes under serious threat when important blueprints of the village are stolen! Naruto, Shikamaru and the others have their hands full finding and removing the massive numbers of paper bombs placed throughout the village. Can they save the Hidden Leaf Village from utter demolition? \n\nThis box set will have for the most part the more humorous Naruto episodes before we reach the Shippuden arc. Off the start we have Tsunade teaming Naruto and Ino with a mission to help a feudal lords daughter who usually is an exact double of Ino but because of her nervousness of her impending marriage to a nobles son she has only heard about but never seen has eaten more than she should and has gain a little bit of weight, so not to disappoint her betrothed she hired Ino to stand in her place to impress her fiancee but she maybe surprised at how her fiancee really is though. Also we have Rock Lee starting his own Dojo but because few have heard of it doesn't get to many students to train and when Gai sensei hears this and enlists Naruto's help you know calamity is sure to follow. Than another team up of Team Kiba, Hinata, and Naruto to find the feudal lords daughter of the land of candy whose disappeared near their borders and to Naruto's regret find themselves trapped in a seemingly haunted castle. Than team Gai teams up with Naruto again as someone with a past with Gai seeks revenge on him and decides to trick him into a ambush and with Rock Lee hurt again it's up to Naruto, Neji , and Tenten to save Gai sensei, but as you expect with Rock Lee hearing that his idol is in danger goes to help to no matter what. We than have two arc sagas the first is a long time enemy of the leaf village who seeks its destruction sneaks into the village to begin his plans, but as Naruto befriends this saboteur he feels there's more to this would be avenger than what the rest of the village shinobi aren't seeing. The final episodes deal with a dark time of Kurenai's past with another genjutsu prodigy from the leaf village and the tragedy of that relationship may destroy both herself and her relationship with her current genin team. The episodes were very entertaining no matter what other reviewers keep saying about the filler episodes as they continue to give you time to connect with the characters of Naruto and see their teamwork and friendship throughout the series grow. The voice cast did as usual a great job both the English and Japanese cast. So for any completest Naruto fans like me here's another great box set for you home and for new comers I say try out the first box set and see if this series is your cup of tea because I really think it will be... \n","torrent":{"xt":"urn:btih:5a80b88eb9aa7556d3a3da3c33c27739074de82c","amp;dn":"Naruto+Uncut+Box+Set%2C+Vol.+15+disk+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a80b88eb9aa7556d3a3da3c33c27739074de82c","infoHashBuffer":{"type":"Buffer","data":[90,128,184,142,185,170,117,86,211,163,218,60,51,194,119,57,7,77,232,44]},"announce":[],"urlList":[]}}