{"title":"The Match","uid":5018851,"size":1568145455,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5b23f586b8d2c5fd58eec1e18c590b2fe8b957d8&amp;dn=The+Match&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stanimir2","files":-1,"time":1248360910,"description":"Country: United Kingdom\nYear: 1999\nGenre: Comedy / Sport\nRuntime: 95 min.\nDirector: Mick Davis\nWriter: Mick Davis\nCast: Max Beesley, Tom Sizemore, Isla Blair, Richard E. Grant, Ian Holm\nSubtitles: English / Serbian / Turkish\nIMDb: http://www.imdb.com/title/tt0165384/\n\nThe Match is a contemporary romantic comedy, set in the idyllic Highland village of Inverdoune. Wullie Smith, still carrying the physical and emotional scars of the childhood death of his younger brother, is the village milkman. A young man whose potential is concealed his gently diffident exterior, Wullie is locally known for his remarkable T.F.R. (Total Football Recall) and for his not-very-secret love for Rosemary Bailey, the breathtaking daughter of Bill Bailey, a local farmer with a curious affection for his cows. Rosemary has returned briefly to her home with a college degree before she leaves again to pursue a career in the big city. The single-street village has only two pubs - the ramshackle delights of Benny's Bar, spiritual home of its charmingly eccentric clientele and the sterile modernity of Le Bistro, owned by former professional footballer and preening narcissist, George Gus. But Benny's Bar may soon be lost forever. A bet made to settle a feud between the original owners of Benny's Bar and Le Bistro was made long before anyone living in the village today can remember. The ancestral feud is to be finally resolved by the result of the annual football (soccer) contest between the two bars in this hundredth year of the contest. Past form indicates poor prospects for the Benny's Bar team which has lost for 99 years in a row. But it is only the result of this, the hundredth game, which will determine which bar is to be closed forever by the winning side.\n","torrent":{"xt":"urn:btih:5b23f586b8d2c5fd58eec1e18c590b2fe8b957d8","amp;dn":"The+Match","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b23f586b8d2c5fd58eec1e18c590b2fe8b957d8","infoHashBuffer":{"type":"Buffer","data":[91,35,245,134,184,210,197,253,88,238,193,225,140,89,11,47,232,185,87,216]},"announce":[],"urlList":[]}}