{"title":"Pinky.Violence.Delinquent.Girl.Boss-Worthless.To.Confess.1971.DV","uid":5610397,"size":748592145,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5be6c469be5963c7b4061e2cbbad29095aa351a3&amp;dn=Pinky.Violence.Delinquent.Girl.Boss-Worthless.To.Confess.1971.DV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"thelad53","files":52,"time":1275835829,"description":"Moving right along, we've got Kazuhiko Yamaguchi's 1971 sleaze fest, Delinquent Girl Boss  - Worthless To Confess, the last in the series of four films to go under the Delinquent Girl Boss banner.\n\nThe movie sets its standards pretty high in the opening few minutes when a group of reform-school girls start a riot after their principal refuses to let them watch a Ken Takakura Yakuza film! From here, we see the lovely Reiko Oshida released from the reform school and back into the general population, freedom is hers once again and she's going to make the most of it.\n\nThe first thing that she does is head on out to find the father of a former acquaintance, who currently runs a garage on the other side of town. He decides to let bygones be bygones and soon he takes her on as an apprentice in his shop where she hopes to earn an honest living. It doesn't take long before a gang decides that they're going to start harassing her new friend though, and this, understandably, sets her off a bit.\n\nOshida hopes to settle things peacefully, but we wouldn't have much of a movie if things worked out for her and before you know it, she's in the middle of an all out war with the rival gang. Oshida allies herself with a few other girls, they slap on some slick red overcoats, and decide to set things right for once, no matter what the cost.\n\nArtfully directed with fantastic use of colors (red, predominantly), this one finds a nice blend of humor, action, and comic book visuals that really do work very well together. Whereas the first film was out and out action, this second movie in the set is a little more light hearted and not quite as bleak. Rest assured though that there are still plenty of exploitative elements in here to keep the action coming, and enough oddball bits and pieces in the background to make sure your eyes never get bored.\n\nWhen the final showdown gets going, you're certainly not going to think you're watching a comedy. The finale is bloody, stylized violence at its best, with some fantastic bottoms up camera angels, odd citrus colored lighting gels, and a fair amount of lovely arterial spray. The big finish is the only real action set piece in the movie, but it's good enough and long enough that if you're going to take anything away from this film, it's going to be that last chunk of celluloid.\n\nOn a side note, director Kazuhiko Yamaguchi moved on from this series to the Sister Streetfighter series starring Sonny Chiba's main leading lady, the lovely Etsuko Shiomi.\n\n\nRip iNFO\n\nName.........: 04-Delinquent.Girl.Boss-Worthless.To.Confess.1971.DVDRip.XviD-Allzine.avi\nFilesize.....: 695 MB\nRuntime......: 01:26:32\nVideo Codec..: XviD\nVideo Bitrate: 989 kb/s\nAudio Codec..: MPEG-1 Layer 3\nAudio Bitrate: 124 kb/s (62/ch, stereo) VBR LAME3.90\nFrame Size...: 624x256 (2.44:1)\nQf...........: .207 bits/pixel\n\n...also included, the movie trailer in QuickTime format...","torrent":{"xt":"urn:btih:5be6c469be5963c7b4061e2cbbad29095aa351a3","amp;dn":"Pinky.Violence.Delinquent.Girl.Boss-Worthless.To.Confess.1971.DV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5be6c469be5963c7b4061e2cbbad29095aa351a3","infoHashBuffer":{"type":"Buffer","data":[91,230,196,105,190,89,99,199,180,6,30,44,187,173,41,9,90,163,81,163]},"announce":[],"urlList":[]}}