{"title":"Ballare.Per.Un.Sogno.2008.iTAL.DVDRip.XviD-Republic[volpebianca]","uid":5015214,"size":733921280,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5ca0a7b45621050cfe4a1860fc0544595f2dd9b1&amp;dn=Ballare.Per.Un.Sogno.2008.iTAL.DVDRip.XviD-Republic%5Bvolpebianca%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Volpebianca","files":1,"time":1248192200,"description":":::Scheda del film:::\nTitolo: Ballare per un sogno\nTitolo originale: Make It Happen\nNazionalitÃƒÂ : USA\nAnno: 2008\nGenere: Drammatico\nRegia: Darren Grant\nData di uscita: 03 Aprile 2009 (cinema)\nCast: Mary Elizabeth Winstead, Riley Smith, Tessa Thompson, John Reardon, Ashley Roberts, Leigh Enns, Julissa Bermudez, Karen LeBlanc\n\n:::Trama:::\n\n&quot;Ballare per un sogno&quot; racconta la storia di Lauryn (Mary Elizabeth Winstead), ragazza di una piccola cittadina dell'Indiana che nutre la speranza di diventare una ballerina affermata. Dopo la prematura morte di entrambi i genitori, Lauryn deve mettere da parte le sue aspirazioni e decide di aiutare il fratello Joel come contabile per mandare avanti l'attivitÃƒÂ  di famiglia, un'officina. Nonostante tutto Lauryn trova il tempo per continuare i suoi allenamenti; fa pratica all.alba da autodidatta; tutto questo per partecipare all'audizione presso la prestigiosa Scuola di Chicago di Musica e Danza. Finalmente il tanto atteso giorno arriva e Lauryn e ansiosa di dimostrare ciÃƒÂ² che sa fare. La ragazza sostiene la prova di ammissione. Tuttavia la sua monotona e inespressiva prova di esame non riesce a impressionare la commissione, cosi Lauryn abbandona l'audizione distrutta. Il suo cuore e infranto e il suo sogno anche. Incapace di tornare a casa e affrontare Joel, Lauryn conosce Dana che le offre un posto dove stare. Anche Dana e una ballerina e aiuta Lauryn a trovare lavoro come contabile al club Ruby, dove si pratica lo stile di danza &quot;burlesque&quot;. Le ragazze del club danzano sul palco come se stessero sfilando su una passerella riuscendo, grazie alle loro elaborate e appariscenti coreografie, a catturare l'attenzione del pubblico. Attraverso gli spettacoli, il deejay del club Russ mixa i brani dalla sua postazione di lavoro, pur mantenendo nel profondo il desiderio di scrivere e produrre la sua musica. All'apparenza Lauryn e felice di lavorare nell'ufficio come contabile ma dentro di se sente crescere una forte attrazione per il modo in cui Dana, Carmen e Brooke sono orgogliose di ciÃƒÂ² che fanno. Una notte, dopo la chiusura del locale, sola nel suo ufficio, Lauryn cede alla tentazione. Fa partire la musica e sale sul palco, rapidamente si lascia andare in un insieme di hip-hop, classico e danza moderna. Per la prima volta, da quando ha lasciato l'Indiana, si sente libera e disinibita, dovendo ogni giorno vivere la bugia di non aver detto a Joel del suo fallimento. Infatti, il fratello crede che lei sia a Chicago per realizzare il suo sogno di ballare. Concentrata esclusivamente sui passi di danza, Lauryn e completamente immersa nel suo mondo tanto da estraniarsi da ciÃƒÂ² che la circonda. Non si accorge che Russ la osserva nell'ombra in silenzio. E rapito dalla sua bellezza e dalla fluiditÃƒÂ  dei suoi movimenti. A sua insaputa, il segreto di Lauryn e svelato: la ragazza sa ballare! Man mano che il rapporto tra Lauryn e Russ cresce, entrambi si rendono conto della forza dei loro sogni. Quando Brooke decide di lasciare il suo posto da Ruby, Russ confessa al proprietario del club che Lauryn e un'ottima ballerina. Inizialmente Lauryn s'infuria ma, dopo averci riflettuto, trova il coraggio di affrontare la situazione; come previsto non delude le attese. Dopo aver entusiasmato il pubblico con la sua prima esibizione, Brenda le offre il posto di ballerina fissa. Esattamente quello che le serviva per credere di nuovo nelle sue capacita, giusto in tempo per ritentare l'audizione alla prestigiosa Scuola di Musica e Danza di Chicago. Lauryn e pronta per la sua seconda possibilitÃƒÂ , ma un nuovo ed inatteso evento sembra ostacolare la sua rinnovata fiducia in se stessa...\n\n\nQualitÃƒÂ  audio e video Ottima da DVD.","torrent":{"xt":"urn:btih:5ca0a7b45621050cfe4a1860fc0544595f2dd9b1","amp;dn":"Ballare.Per.Un.Sogno.2008.iTAL.DVDRip.XviD-Republic%5Bvolpebianca%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ca0a7b45621050cfe4a1860fc0544595f2dd9b1","infoHashBuffer":{"type":"Buffer","data":[92,160,167,180,86,33,5,12,254,74,24,96,252,5,68,89,95,45,217,177]},"announce":[],"urlList":[]}}