{"title":"Halo Legends 2010 Audio English-Japans DD5.1 Multisubs Retail --","uid":6280361,"size":7489031594,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5ca4e5e4ed9011eff4e3a20f8fe560ac3e9d05fc&amp;dn=Halo+Legends+2010+Audio+English-Japans+DD5.1+Multisubs+Retail+--&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Saggin","files":-1,"time":1301409130,"description":"Halo Legends 2010 Audio English-Japans DD5.1 Multisubs Retail\n\n\n\nNederlands:       \n\nJapan / Verenigde Staten\nAnimatie / Science-Fiction\n120 minuten ( 2 Disk)\n\ngeregisseerd door Shinji Aramaki, Hideki Futamura, Toshiyuki Kanno, Tomoki KyÃƒÂ´da, KÃƒÂ´ichi Mashimo, Yasushi Muraki, Daisuke Nishio, Frank O'Connor (I), Mamoru Oshii, Koji Sawai, Keiichi Sugiyama, Takahiro Tanaka en Hiroshi Yamazaki\nmet de stemmen van Tessho Genda, Yumi Touma en Hiroaki Hirata\n\nEen collectie van zeven verhalen uit het Halo universum gecreÃƒÂ«erd door de meest creatieve geesten van Japan. &quot;Origins&quot; behandelt de geschiedenis van het expansieve Halo universum door de ogen van Cortana. &quot;The Duel&quot; vindt plaats lang voor de mens-Convenant oorlog, en vertelt het verhaal van arbiter Fal 'Chavamee', die weigert de Convenant-religie te aanvaarden. &quot;Homecoming&quot; richt zich op de tragedies van de Spartan-II aanwervingen in 2517. Los van het Halo-concept is er de parodie &quot;Odd One Out&quot;, waarin een Spartan op een planeet belandt bewoond door dinosaurussen en gestrande kinderen. &quot;Prototype&quot; vertelt het verhaal van een Marine die ingaat tegen de orders om een geavanceerd harnas te vernietigen. Hij maakt gebruik van het pak om burgers te evacueren van de planeet. &quot;The Babysitter&quot; volgt een vierkoppige squad Orbital Drop Shock Troopers naar een Convenant zone om een Prophet te elimineren. En tenslotte &quot;The Package&quot;, een twee-delige CGI film, volgt Master Chief en een elite squad van de Spartan-II soldaten terwijl ze een top-geheime missie uitvoeren om een zeer waardevol pakketje te halen op een Convenant schip.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/66439&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/66439&lt;/a&gt;\n\nEnglish\nA collection of seven stories from the Halo Universe created by Japan's most creative minds. First up is &quot;Origins&quot; a two part episode showing the expansive history of the Halo Universe and the history of the 100,000 year long franchise timeline, told through the eyes of Cortana. Second comes &quot;The Duel&quot; Taking place long before the Human-Covenant War, it tells the story of an Arbiter, Fal 'Chavamee, who refuses to accept the Covenant Religion. Taking a turn to the Spartan side of the story &quot;Homecoming&quot; focuses on the tragedies involving the Spartan-II recruitment in 2517, and the Spartans coming to terms with their origins. Taking a turn in tone comes &quot;Odd One Out&quot; a non-cannon parody of the Halo storyline. &quot;Prototype&quot; tells the story of a Marine who goes against his orders to destroy an advanced prototype armor and uses the suit to buy time for civilians evacuating from the planet. \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1480660&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1480660&lt;/a&gt;\n\n\nSpotinformatie\n\nCategorie      : Beeld \nFormaat        : DVD5\nAudio          : English Japans DD 5.1\nBron           : Retail\nOndertitels    : English,Chinese,French.Japans, Korean,Portugese,Spanish,Thai\nMenu           : Ja\nGenre          : Animatie / Science-Fiction\nCover          : Ja \n \nBrought by TBS","torrent":{"xt":"urn:btih:5ca4e5e4ed9011eff4e3a20f8fe560ac3e9d05fc","amp;dn":"Halo+Legends+2010+Audio+English-Japans+DD5.1+Multisubs+Retail+--","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ca4e5e4ed9011eff4e3a20f8fe560ac3e9d05fc","infoHashBuffer":{"type":"Buffer","data":[92,164,229,228,237,144,17,239,244,227,162,15,143,229,96,172,62,157,5,252]},"announce":[],"urlList":[]}}