{"title":"Tron Betrayal [EN] .PDF","uid":6135990,"size":53155454,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5caa2c77f9524b565dd6d0f28e51e5283f9c89b5&amp;dn=Tron+Betrayal+%5BEN%5D+.PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Prathero","files":2,"time":1296262766,"description":"The setting of the series is following the events of the original Tron. Set in the year 1983, Kevin Flynn has become the CEO of fictional software company Encom, which he has built into the largest videogame company in the world. As a personal project, Flynn has been secretly building The Grid, a virtual world filled with increasingly sentient programs. Designed as an environment where he can build and test worlds limited only by his imagination, The Grid eventually becomes more complex than he intended, including the generation of isomorphic programs dubbed &quot;ISOs&quot;, who spontaneously emerge within The Grid, as opposed to the &quot;Basics&quot;, which becomes the term for the programs created by Flynn.\n\nAs his responsibilities in the real world grow, he creates Clu 2 - an updated version of his original Clu program which was seen in the first film. As this new world and his creations develop a life of their own, Flynn must cope with both worlds, and Clu 2 must cope while Flynn is away. In Flynn's absence, Clu 2 becomes more and more prejudiced against the ISOs, irrationally perceiving them as a threat to the &quot;perfect system&quot; that he wishes to maintain.[1][2] The story also introduces us to Flynn's young son, Sam Flynn, who will become the protagonist of the second Tron movie.\n\nThe plot is directly followed by the events of the 2010 videogame Tron: Evolution, in which Clu 2 moves against the ISOs.","torrent":{"xt":"urn:btih:5caa2c77f9524b565dd6d0f28e51e5283f9c89b5","amp;dn":"Tron+Betrayal+%5BEN%5D+.PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5caa2c77f9524b565dd6d0f28e51e5283f9c89b5","infoHashBuffer":{"type":"Buffer","data":[92,170,44,119,249,82,75,86,93,214,208,242,142,81,229,40,63,156,137,181]},"announce":[],"urlList":[]}}