{"title":"Little Norse Prince Pre Studio Ghibli Japanese audio Eng subs Di","uid":6307419,"size":1534917382,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5cc1edf723b4b71bde2bea9279bc732173d78238&amp;dn=Little+Norse+Prince+Pre+Studio+Ghibli+Japanese+audio+Eng+subs+Di&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sushiplatter","files":2,"time":1302393118,"description":"Mono Japanese with English subtitles high quality Divx\n81 minutes\n\nThe debut feature of master animator Isao Takahata (Grave Of The Fireflies, Pom Poko), The Little Norse Prince tells the tale of Hols, a brave young boy who pulls a blade out from a centuries-old Rock Giant only to discover that it is the Sword Of The Sun. If re-forged, the sword's destiny will transform the boy into the Prince Of The Sun.\n\nUrged by his father, Hols and his pet bear Coro travel to his ancestral village, a place destroyed by the Frost King Grunwald. Along the way, he helps a village whose residents are besieged by Grunwald's magic, but the villagers feel threatened when he befriends Hilda, a beautiful girl whose haunting songs conceal a dark secret.\n\nFusing Japanese folklore with a Scandinavian setting, Takahata&quot;s epic adventure shows the hallmarks of later Studio Ghibli productions: well-rounded characters, dazzling animation and incredible imagination.\n\nIf you like it leave me a little comment and let others know what you think, thanks!","torrent":{"xt":"urn:btih:5cc1edf723b4b71bde2bea9279bc732173d78238","amp;dn":"Little+Norse+Prince+Pre+Studio+Ghibli+Japanese+audio+Eng+subs+Di","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cc1edf723b4b71bde2bea9279bc732173d78238","infoHashBuffer":{"type":"Buffer","data":[92,193,237,247,35,180,183,27,222,43,234,146,121,188,115,33,115,215,130,56]},"announce":[],"urlList":[]}}