{"title":"Windows XP Professional SP3 (32 Bit)","uid":6172737,"size":732563718,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5dc3675dc9ab6d2d9a3a48f06b051a441a71e33b&amp;dn=Windows+XP+Professional+SP3+%2832+Bit%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SanctusSecurity","files":4,"time":1297647675,"description":"Product:  Microsoft Windows XP Professional (32 Bit) Genuine Garunteed\nArchitecture: 32 Bit (x86)\n\n\n\n\nMinimum Requirements For Windows XP (x86)\n\n\n - 300MHz Processor (x86 Only)\n - 64MB RAM\n - 1.5GB Available Hard Drive Space\n\n\n\n \n\nSATA drivers have been integrated into this copy, so you should have no issues installing to a SATA hard drive (HDD) or solid state drive (SDD). We have also integrated many critical security updates to help reduce your time updating this copy.\n\nThis copy of Windows XP Professional uses a very special method of activation. It tricks the computer into thinking it has booted in safe mode (when it really has not), therefore skipping product activation at log on. It loads the product key into the Windows files, making your computer forever genuine. The best part is that you can continue to use Windows Update with no worries of an update overwriting the patch. \n\nIMPORTANT NOTE: You must leave the installation disc in the disc drive until 2 minutes after your first user log in. Otherwise, this copy will not be activated. Be sure to check your activation status after you have logged in, and if it has not activated, browse to the folder on the installation disc named &quot;$OEM$&quot; , go to the folder &quot;Manual Activation&quot;, and open the file &quot;Active Nexus 1.0.bat&quot;.\n\n\nThe disc is in ISO (Disc Image) format, so you will need to use a program that burns ISO files. You can use nLite (http://www.nliteos.com/), or some other disc image burner such as Nero.\n\nThe disc image we modified before we integrated drivers and updates was ripped from an original Dell OEM re-installation disc. If you have any issues installing, please leave a comment. You will not need a product key to install this, but just in case it asks, the product key is provided below.\n\nTEST THIS IN VIRTUALBOX OR ANOTHER VIRTUAL MACHINE BEFORE BURNING TO DISC\n\n\n\n\nIMPORTANT NOTE 2: The last time I uploaded this, I had instantly 400 people downloading, and only I was seeding. Very few people would seed, and no one could download it. Please, I ask you that once you have downloaded this, that you will seed for us! We want people to be able to use this amazing copy of Windows XP Professional.\n\n\nSATA DRIVERS NOTE: The SATA drivers used in this copy are from NVIDIA. If they do not work for you, please click the link below to download some others.\n\n\n\n\n\n\n\nProduct Key:  XJM6Q-BQ8HW-T6DFB-Y934T-YD4YT\n\n\n\nSanctus Security (2/13/2011)\nTorrent Compiled By:  CyberFerret32\n","torrent":{"xt":"urn:btih:5dc3675dc9ab6d2d9a3a48f06b051a441a71e33b","amp;dn":"Windows+XP+Professional+SP3+%2832+Bit%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dc3675dc9ab6d2d9a3a48f06b051a441a71e33b","infoHashBuffer":{"type":"Buffer","data":[93,195,103,93,201,171,109,45,154,58,72,240,107,5,26,68,26,113,227,59]},"announce":[],"urlList":[]}}