{"title":"Jesus Potter Harry Christ: The Fascinating Parallels Between Two","uid":6280792,"size":14509207,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5dcd22b2b22c1f925339e15a739896e75877c524&amp;dn=Jesus+Potter+Harry+Christ%3A+The+Fascinating+Parallels+Between+Two&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1301428772,"description":"Derek Murphy, &quot;Jesus Potter Harry Christ: The Fascinating Parallels Between Two of the World's Most Popular Literary Characters&quot;\nPublisher: H o ly Bl asph emy | 2011 | ISBN: 0615430937 | PDF | 490 pages | 13.8 MB\n\n&quot;Particularly absorbing and highly topical: namely, the idea that nothing substantially separates Jesus of Nazareth from Harry Potter except that most human beings believe in the historical reality of the former. Instead, both figures entertain astonishingly parallel personality traits that derive from universal myths. As part of the continuing debate over the nature of Christ, not only among Christians but between them and today's wave of atheist thinkers, Jesus Potter, Harry Christ is timely. Linking this analysis, moreover, to J. K. Rowling's globally popular character further heightens its relevancy.&quot; Jeff Crouse, Ph.D - Parmenides\n\n&quot;Absolutely loved it! With so much misinformation being disseminated about Jesus Christ, this book was refreshing. Derek pulls from notable and reliable sources to frame his arguments in a way that is both intriguing and satisfying. His insights into the phenomena that captivate the fans of literary characters like Harry Potter and Jesus Christ are extraordinary. To anyone who enjoys a mystery being unraveled, Harry Potter Jesus Christ is a must read.&quot; Andrea Giffith, The Social I.Q. Lady\n\n&quot;If you're a fan of Harry or a fan of Jesus, Derek Murphy's book will open your eyes to the startling similarities between these two characters and why those similarities exist. Murphy takes us on an in depth journey through the land of epic hero tales, their ancient origins and how (and why) they developed. By the end of the journey, Murphy pulls it all together and dares to ask who is perhaps the greater role model; Harry or Jesus? I found this book eye opening and impossible to put down.&quot; Henry Scalfo\n\n&quot;I'm impressed. A lot. I figured that Jesus Potter Harry Christ would focus on the commonalities between Jesus Christ and Harry Potter, but Murphy's aims are a lot more ambitious. And interesting. In a highly readable yet semi-scholarly style, he sets out to examine the origins and evolution of Christianity, seeking evidence for a historical Jesus who is akin to the mythical figure revered by believers today. Jesus Potter Harry Christ demolishes part of the foundation of Christianity, Jesus' purported uniqueness and godly heritage, but leaves the most important part: our capacity as humans to become more and better than we are now.&quot; Brian Hines, author of &quot;Return to the One&quot; \n\nAmazon.com","torrent":{"xt":"urn:btih:5dcd22b2b22c1f925339e15a739896e75877c524","amp;dn":"Jesus+Potter+Harry+Christ%3A+The+Fascinating+Parallels+Between+Two","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dcd22b2b22c1f925339e15a739896e75877c524","infoHashBuffer":{"type":"Buffer","data":[93,205,34,178,178,44,31,146,83,57,225,90,115,152,150,231,88,119,197,36]},"announce":[],"urlList":[]}}