{"title":"Hampton Hawes Duo - As Long As There's Music (197","uid":5062859,"size":240653937,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5de203f5f27ad4d5843c93d75e5ad23efd947cf0&amp;dn=Hampton+Hawes+Duo+-+As+Long+As+There%5C%27s+Music+%28197&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"schon55","files":16,"time":1250787730,"description":"Charlie Haden - Hampton Hawes - As Long As There's Music\nBurbank, CA, January 25, 1976\nYear: 1976\nLabel: Polygram Records \nQuality: flac\n\nCharlie Haden plays the bass with a beautiful, thick sound - any recording of his is a sonic treat.  This duo session with Hampton Hawes contains some exquisite playing.  Some of it swings, some of it shimmers.  Haden's harmonic imagination is astounding.  \n\nThis was my first exposure to Hampton Hawes' piano playing, which I quite enjoy.  There is a particularly bluesy quality about his playing; he apparently loved the laid back gospelish stuff as much as he loved the fast bop lines heard here and on other records.  I enjoy his compositions (IRENE, RAINFOREST).  It's also nice to hear an Ornette Coleman tune (TURNAROUND), as well as some more or less spontaneous compositions.   ~ Michael G.  McNeill\n\nI discovered this album back in 1980 or 1981 and was immediately enthralled.  I had already fallen in love with Charlie Haden's bass playing with his performances with Keith Jarrett, Ornette Coleman, and Old and New Dreams.  His beautiful approach to the instrument here just cemented my musical infatuation.  I had never heard Hampton Hawes' music, but found his piano voice here to be creative and unique.  \n\nAlthough these pieces are the height of improvisation, they never lose their melodic and rhythmic sensibility.  They also never become aimless, or sound formless, even in the entirely improvised tracks, as so often happens in purely spontaneous music.  \n\nHaden and Hawes remain true to the composed pieces as well, never allowing those songs to serve as mere vehicles for their solos.  Instead, they perform the music as an integrated whole, flowing seamlessly from composed melody to improvised solo and back.  There is never the moment where the musicians seem to say, &quot;OK, now we are going to take our solos and impress you with our virtuousity. &quot; They don't need to: Charlie Haden and Hampton Hawes clearly had mastered the tension between sound and soundlessness.  \n\nMy only regret is that these two beautiful musical minds did not have the opportunity to record more music.  ~ Scott Hercher\n\nPersonnel:\nHampton Hawes (p)\nCharlie Haden (b)\n\nCharlie Haden - Hampton Hawes - As Long As There's Music Tracks:\n01  Irene\n02  Rain Forest\n03  Turnaround\n04  As long as there's music\n05  This is called love\n06  Hello/Goodbye\n07  Irene (alt)\n08  Turnaround (alt)\n09  As long as there's music (alt)","torrent":{"xt":"urn:btih:5de203f5f27ad4d5843c93d75e5ad23efd947cf0","amp;dn":"Hampton+Hawes+Duo+-+As+Long+As+There%5C%27s+Music+%28197","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5de203f5f27ad4d5843c93d75e5ad23efd947cf0","infoHashBuffer":{"type":"Buffer","data":[93,226,3,245,242,122,212,213,132,60,147,215,94,90,210,62,253,148,124,240]},"announce":[],"urlList":[]}}