{"title":"Fuga degli Innocenti, La(Hidden Children)(ITA)(NL SUBS) 2Lions-T","uid":5177684,"size":8214989250,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5e4ef030e8f9264725356f7f8dd4dcb8d76389b9&amp;dn=Fuga+degli+Innocenti%2C+La%28Hidden+Children%29%28ITA%29%28NL+SUBS%29+2Lions-T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Pioen","files":-1,"time":1259022365,"description":"Fuga degli Innocenti, La (2004) \n\nHidden Children 2004 Miniserie (2 dvd)     \n\n \n  ItaliÃƒÂ«\nDrama\n200 minuten (miniserie, 2 delen) / 116 minuten (Korte Versie)\n\ngeregisseerd door Leone Pompucci\nmet Ken Duken, Max von Sydow en Ennio Fantastichini\n\nVier Joodse kinderen, die uit angst voor de Jodenvervolging van het Nazi-regime naar Palestina proberen te vluchten, arriveren in een opvangkamp in Noord-ItaliÃƒÂ«. Daar komen ze samen met een andere groep vluchtelingen . Door weer en wind onder erbarmelijke omstandigheden leggen zij honderden kilometers te voet af, waarna ze onverwacht op de Duitse en Italiaanse bezetters in JoegoslaviÃƒÂ« stuiten.\n\nEnglish\n\nThis is a true story about forty Jewish children on their way to Palestine, who were blocked by the German and Italian occupation of Yugoslavia in 1941. Before finding a haven at Villa Emma in Nonantola in northern Italy, where they arrived on June 17, 1942, the children spent several adventurous months in Slovenia, caught up in the ongoing fight between the partisans and the Italian army. In April 1943, another 33 children, some from the Balkans, others from France, joined the original group. All were orphans who had lost their parents in concentration camps and had subsequently been smuggled out of Germany by Recha Freier, a well-known Zionist. The group ranged in age from six to twenty one and settled in at Villa Emma with their chaperones and teachers, Josef Indig, Marco Schoky and the pianist Boris Jochverdson. The children lived in modest, but quite acceptable conditions. They attended class and courses in agriculture and craftsmanship prepared them for their impending departure for Palestine and a future on a Kibbutz. The orphans were under police supervision and forbidden to go out alone, but even so Nonantola took their plight to heart and firm friendships were established between the townspeople and the young Jews. After Italy surrendered to the Allies on September 8, 1943, German troops arrived in Nonantola and the situation changed dramatically. In less than 48 hours, Villa Emma was abandoned and the fugitive boys and girls found refuge in the seminary of the Abbey, and in the homes of local farmers, craftsman and shopkeepers. The local priest, Father Arrigo Beccari, showed great courage in these circumstances. The threat of raids by the German police provoked much anxiety and between September 28 and October 16, 1943 all the young refugees were successfully smuggled into Switzerland, fording the fast-flowing Tresa River under cover of darkness. In Switzerland, Zionist organizations hosted them in an institute in Bex in the Rodano Valley and it was from there that most of the group reached Palestine in May 1945 after an odyssey that had lasted five years. One of the boys who contracted TB and had to be admitted to a sanatorium was unable to escape and his name appears on a list of deportees to Auschwitz. Subsequently, Arrigo Beccari and Giuseppe Moreali, the local doctor in Nonantola, were cited in the Yad Vashem for their courage and they have their own tree in the Avenue of Just Men.\n\n\n\nOriginele DVD 5\n\n\nFormaat Full 4:3\nAudio : Dolby Digital 2:0\nMenu : Ja\nTaal : Italiaans\nOndertiteling : Ja Nederlands\nLengte hoofdfilm C.A 200 Minuten\nDVD : Pal\nKleur : Ja \nCover : Ja\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail Pal\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Drama\nOorlog\n \nWeblink : http://www.moviemeter.nl/film/38952\nWeblink : http://www.imdb.com/title/tt0404608\n\n***************************************** \n\nBrought to you by \nPioen \n2Lions Team \n\nmeer zien?? \nKom dan eens kijken op ons forum \n     &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding","torrent":{"xt":"urn:btih:5e4ef030e8f9264725356f7f8dd4dcb8d76389b9","amp;dn":"Fuga+degli+Innocenti%2C+La%28Hidden+Children%29%28ITA%29%28NL+SUBS%29+2Lions-T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e4ef030e8f9264725356f7f8dd4dcb8d76389b9","infoHashBuffer":{"type":"Buffer","data":[94,78,240,48,232,249,38,71,37,53,111,127,141,212,220,184,215,99,137,185]},"announce":[],"urlList":[]}}