{"title":"Ben Hur 1925 ISO","uid":6144607,"size":4655173632,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5e5b7e27bdde977eebe4a19f1d8756b659a406be&amp;dn=Ben+Hur+1925+ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ulikes","files":9,"time":1296630233,"description":"Ben-Hur is a 1925 silent film directed by Fred Niblo. It was a blockbuster hit for newly merged Metro-Goldwyn-Mayer. This was the second film based on the novel Ben-Hur: A Tale of the Christ by Lew Wallace. Costing between $4 and 6 million, Ben-Hur is the most expensive silent film ever made.\n\nShooting began in Italy in 1923, starting two years of difficulties, accidents, and eventually a move back to Hollywood. Additional recastings (including RamÃƒÂ³n Novarro as Ben-Hur) and a change of director caused the production's budget to skyrocket. The studio's publicity department was shameless, advertising the film with lines like: &quot;The Picture Every Christian Ought to See!&quot; Although audiences flocked to Ben-Hur after its premiere in 1925 and the picture grossed $9 million, its huge expenses and the deal with Erlanger made it a loser for MGM. MGM was unable to recoup its $4 million investment.\n\nWhen filming the chariot scene, the drivers were careful and slow, which disappointed Meyer. To make it more exciting, he offered a prize of $100 to the winner, and the resulting heated competition led to the horrendous crash that remains in the movie. Several horses were killed during the production. That and another fatal accident led to changes in rules of filming and film safety.\n\nA total of 60,960 m (200,000 ft) of film was shot for the chariot race scene, which was eventually edited down to 229 m (750 ft). This scene has been much imitated. It was re-created virtually shot for shot in the 1959 remake, copied in Prince of Egypt, and more recently imitated in the pod race scene in Star Wars Episode I: The Phantom Menace which was made almost 75 years later. Some scenes in the film were in two-strip Technicolor. One of the assistant directors for this sequence was a very young William Wyler, who would direct the 1959 remake.\n\nCurrent prints of the 1925 version are from the Turner-supervised restoration. The restoration includes the color tints and Technicolor sections, set to resemble the original theatrical release. There is an addition of a newly recorded stereo orchestral soundtrack by Carl Davis with the London Philharmonic Orchestra which was originally recorded for a Thames Television screening of the movie.\n\nThis download is the restored version.\n\n","torrent":{"xt":"urn:btih:5e5b7e27bdde977eebe4a19f1d8756b659a406be","amp;dn":"Ben+Hur+1925+ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e5b7e27bdde977eebe4a19f1d8756b659a406be","infoHashBuffer":{"type":"Buffer","data":[94,91,126,39,189,222,151,126,235,228,161,159,29,135,86,182,89,164,6,190]},"announce":[],"urlList":[]}}