{"title":"Iron Empires","uid":5108153,"size":91060805,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5f1a6f76074cc8b23c024928889f97f02dd88514&amp;dn=Iron+Empires&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"brodahisou","files":-1,"time":1254549356,"description":"Iron Empires is a comic series written and painted by American artist Christopher Moeller. It consists of two parts: Shadow Empires: Faith Conquers, first published as a limited series by Dark Horse in 1994, and Sheva's War, published by Helix in 1998.\n\nThe Iron Empires comprise eight nations of peoples scattered across the Milky Way galaxy; being representative of the remains of a decaying human civilization which was once immeasurably vast. For millennia, the alien Vaylen, a parasitic worm-like race, have rolled back the frontiers of inhabited human space, invading the minds of their conquered hosts and gradually eroding human control throughout the galaxy.\n\nIn Faith Conquers, seasoned warrior Trevor Faith arrives on Hotok to command the armed forces of the orthodox national church, whose aging local head is beset by wrangling counselors, many of whom are probably in cahoots with powerful heretics, who in turn probably constitute a Vaylen front. Calmly and firmly refusing all contrary advice, Faith immediately launches combat exercises for his troops, which allow him to descry which officers he can trust at the time, very soon, that he turns exercises into genuine offensives against the heretics.\n\nIn Sheva's War Ahmi Sheva is the once-young, beautiful and restless baroness of Taramai, a planet located within the boundaries of the Karsan League. She is also a soldier by training and holds the rank of captain in the planetary Landwehr. Frustrated with life in the company of her much older husband and bored by dalliances with a string of younger lovers, Sheva assumes command of local forces when the Ganasch, the deformed ape-like minions of the Vaylen first infiltrate and then invade her planet.\n\nAlso included is the short story The Passage From Dark Horse Presents #79-81.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:5f1a6f76074cc8b23c024928889f97f02dd88514","amp;dn":"Iron+Empires","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f1a6f76074cc8b23c024928889f97f02dd88514","infoHashBuffer":{"type":"Buffer","data":[95,26,111,118,7,76,200,178,60,2,73,40,136,159,151,240,45,216,133,20]},"announce":[],"urlList":[]}}