{"title":"Five For Fighting - Chances","uid":5167949,"size":137768964,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5f4e66bb690432fac4e87d0b4ba07a87cd144863&amp;dn=Five+For+Fighting+-+Chances&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1258520059,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nFive for Fighting is the stage name of American singer-songwriter John Ondrasik. His 2000 album America Town went Platinum in the U.S. largely because of the success of the song &quot;Superman (It's Not Easy)&quot;. The 2004 album The Battle for Everything was also certified Platinum, mainly due to the hit single &quot;100 Years&quot; and the consistent sales of the album. Ondrasik has also released a DualDisc of his 2004 album which has one side containing The Battle for Everything in its entirety and the other side being a DVD containing bonus footage and Five For Fighting music videos. Five for Fighting's fourth album, Two Lights, was released on August 1, 2006, and earned Ondrasik his first career Top 10 Album, debuting at #8 on the Billboard Top 200 Albums Chart. Five for Fighting's fifth album, Slice, was released on October 13, 2009, and the first single off the album, called &quot;Chances&quot;, was released on Tuesday, July 21, 2009 for download.\n\nSlice is the fifth studio album by American singer-songwriter Five for Fighting (born John Ondrasik), released on October 13, 2009. In May 2009, Ondrasik posted on his MySpace blog that the name of his forthcoming record will be taken from fan suggestions, and will be subsequently voted on to determine the winning album title.\n\nThe first single from the new album, called &quot;Chances&quot;, was released on July 21, 2009, as a digital download. It also debuted on the Billboard Hot 100 at #83 and at #12 on the Billboard Hot Adult Contemporary Tracks chart on the week ending October 31, 2009.\n\nOn September 22, 2009, the music video for &quot;Chances&quot; was released on VH1.com. The music video shows the story of two teenagers falling in love, while Ondrasik narrates (sings) to the story. The video was directed by Steven Drypolcher (Beyonce, Kanye West, Boys Like girls) and produced by Partizan. The &quot;Making of the Chances Music Video&quot; is available on Amazon.com.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5f4e66bb690432fac4e87d0b4ba07a87cd144863","amp;dn":"Five+For+Fighting+-+Chances","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f4e66bb690432fac4e87d0b4ba07a87cd144863","infoHashBuffer":{"type":"Buffer","data":[95,78,102,187,105,4,50,250,196,232,125,11,75,160,122,135,205,20,72,99]},"announce":[],"urlList":[]}}