{"title":"Con Air(1997)DVDRip.AC3(ENG)-DROCK","uid":6185039,"size":733004908,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6078a5fcee76ef469982ed7ce9354f6903133fa0&amp;dn=Con+Air%281997%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1298090640,"description":"Former war hero Cameron Poe (Nicolas Cage) is sentenced to eight years in prison when he accidentally kills a man in a barroom brawl while defending his pregnant wife. When his release comes through, he's eager to see the daughter he's never met. However, Poe's original flight is delayed, so he's put aboard a flight transporting ten of the most dangerous men in the American penal system to a new high-security facility. One of the criminals, Cyrus &quot;The Virus&quot; Grissom (John Malkovich), is a serial killer and insane genius who has hatched a diabolical plot: with the help of several other hoods, including Diamond Dog (Ving Rhames), Johnny 23 (Daniel Trejo), and Garland Greene (Steve Buscemi), Cyrus and his men will hijack the plane and fly to a neutral nation where they can live as free men. Poe finds himself stuck in the middle; he has to find a way to get home, keep himself alive, look after his cellmate Baby-O (Mykelti Williamson), who will die without proper medicine, and try to help the cops on the ground, including agent Vince Larkin (John Cusack). Producer Jerry Bruckheimer's first film after the death of his partner Don Simpson, Con Air shows he learned well how to assemble the formula all by himself, with plenty of action, stunts, and special effects and not a lot of story to get in the way. \n\nRipped with Handbrake.\n\nLength: 1 Hour 55 Minutes\n\nFile Type: AVI\n\nNo Subs.\n\n","torrent":{"xt":"urn:btih:6078a5fcee76ef469982ed7ce9354f6903133fa0","amp;dn":"Con+Air%281997%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6078a5fcee76ef469982ed7ce9354f6903133fa0","infoHashBuffer":{"type":"Buffer","data":[96,120,165,252,238,118,239,70,153,130,237,124,233,53,79,105,3,19,63,160]},"announce":[],"urlList":[]}}