{"title":"Crimson Skies V102 incl. Screen/Textfix","uid":6193780,"size":721565376,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6086a8b6cbae0ee400db24f4b5efc1f4539f8699&amp;dn=Crimson+Skies+V102+incl.+Screen%2FTextfix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MarcAce","files":2,"time":1298385472,"description":"ALL CREDITS GO TO TIMESLIP !!!!!!!!!!!!\n\n=======================================\nE A S Y   I N S T A L L    G U I D E  :\n=======================================\n\n1. Burn or mount the .mdf with - for instance - Deamon Tools and run setup.exe\n2. Install the game, do not run\n3. Fix the game, see Fixed installation instructions below\n4. Play the game, finally without any trouble !! Yippy-Kay-Yee-Mother****** !!!\n\nby MarcAce\n\n\nCrimson skies fix by timeslip &lt;a href=&quot;\nhttp://timeslip.chorrol.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://timeslip.chorrol.com&lt;/a&gt;\n30/5/09\n\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\nXX Installation instructions XX\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n\nExtract into your crimson skies installation directory, overwriting crimson.exe. (Make a backup first in case you want to uninstall later.)\n\nIf you want to change the default options, open csfix.ini in a text editor and modify the appropriate lines.\n\nXXXXXXXXXXX\nXX Fixes XX\nXXXXXXXXXXX\n\n= Crash on startup with a divide by zero error\n\nThis appears to be an application bug, caused by the designers assuming that processors would never exceed a certain speed. Fixed by disabling the high performance counter check, forcing crimson skies to fall back onto a counter that doesn't tick over so quickly. Running in win95 compatibility mode also fixes it, although at a performance penalty.\n\n= Blocky text, in game crashes when text is displayed\n\nThis is a collection of several application bugs, first a broken check for non power of two texture support, and next in the games response if it decides that support does not exist. Fixed by supplying the game with a fake collection of caps flags. Using the software renderer is an alternative fix.\n\n= Flickering textures during fading, banding on textures with smooth colour gradients\n\nThis was caused by a deliberate design decision by both nvidia and ati to remove dithering support on their DX10 class hardware. An understandable move, as it makes no difference to 32 bit render targets (which pretty much every game made in the last 5 years or so uses,) and just adds to transistor count. It does cause a degradation in appearance on any old games which render in 16 bit though, and on top of that dithering was also switched off in the drivers, meaning e.g. that anyone with a 6000 or 7000 series card installing a driver release made after the 8000 series launch will also loose dithering support. Fixed by forcing crimson skies to use a 32 bit render target.\n\nSince this causes corruption of the into screen, this option is disabled by default.\n\n= Generic crashes/lockups\n\nMany old games have threading issues which can cause random lockups or crashes on systems with multi-core processors. I've not seen crimson skies do so, but better safe than sorry, since it can't really make proper use of a multi-core processor anyway.\n\n= safedisc\n\nNot actually something I originally set out to do, but as it turned out I had to strip off the safedisc protection in order to make some of the modifications to the exe. It's no great loss, as it's removal improves startup time and fixes issues with some cd drives anyway. (Plus you get to play the game without the CD in, if you've made a full install.) ","torrent":{"xt":"urn:btih:6086a8b6cbae0ee400db24f4b5efc1f4539f8699","amp;dn":"Crimson+Skies+V102+incl.+Screen%2FTextfix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6086a8b6cbae0ee400db24f4b5efc1f4539f8699","infoHashBuffer":{"type":"Buffer","data":[96,134,168,182,203,174,14,228,0,219,36,244,181,239,193,244,83,159,134,153]},"announce":[],"urlList":[]}}