{"title":"Harry Potter en Fakkel met de Groene Vlammen by 118819","uid":5185578,"size":1692594,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:60d8ae1e8800e31269928a6b372a58629538ba45&amp;dn=Harry+Potter+en+Fakkel+met+de+Groene+Vlammen+by+118819&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"118819","files":-1,"time":1259446832,"description":"***********************************************************************************\n\n                      ##   ##   ######   ######   ##   ######\n                     ###  ###  ##    ## ##    ## ###  ##    ##\n                      ##   ##  ##    ## ##    ##  ##  ##    ##\n                      ##   ##   ######   ######   ##   #######\n                      ##   ##  ##    ## ##    ##  ##        ##\n                      ##   ##  ##    ## ##    ##  ##   ##   ##\n                     #### ####  ######   ######  ####   #####\n\n***********************************************************************************\n\nHarry Potter en de fakkel met de groene vlammen\n\n***********************************************************************************\n\nDe 16-jarige Dennis Hoogeveen uit Hoogeveen schreef zelf de opvolger van het vijfde Harry Potter-boek, omdat hij niet op deel 6 kon wachten.\nOmdat het van de Londense uitgeverij Bloomsbury niet uitgegeven mocht worden heeft hij het op het internet geplaatst: Hoogeveen-producties.svpdata.de \n\nIk had het boek al eens gelezen toen het net op het internet stond in 2005. Laatst wou ik het nog eens lezen en toen bleek dat de site niet meer bestaat. Toen heb ik het naar lang zoeken nog ergens anders gevonden. Omdat ik dacht dat andere mensen het misschien ook nog wel eens wilden lezen hed ik het maar ge-upload als torrent.\n\n***********************************************************************************\n\nDitmaal verblijft Harry Potter geen 2 maanden bij de vreselijke Duffelingen, want hij moet eerder terug naar Zweinsteins Hogeschool voor Hekserij en Hocus-Pocus. Albus Perkamentus heeft hem nodig: over de hele wereld gebeuren er vreselijke dingen en Zweinstein dreigt ook in gevaar te komen. Na een gevaarlijke reis vind Harry de Fakkel met de Groene Vlammen. Dit object is niet alleen genoeg om het ultieme kwaad, Heer Voldemort, te verslaan. Harry leert genoeg nieuwe dingen die zijn leven voorgoed zullen veranderen. Harry moet leren met verliezen om te gaan en zijn vriendschap met Ron Wemel en Hermelien Griffel komt onder druk te staan. Gelukkig gebeuren er niet alleen vreselijke dingen. Er wordt zelfs een stel in het echt verbonden en er ontstaan nieuwe liefdes. Zal het harry, ondanks alles, lukken om de wereld te redden van de meedogenloze Hij Die Niet Genoemd Mag Worden en zo de rust herstellen?\n\n***********************************************************************************\n\nVeel plezier met lezen en blijf seeden\n\nBEWARE: THIS IS NOT A HARRY POTTER STORY BY J.K ROWLING. THIS IS A ON THE HARRY POTTER BOOKS OF J.K ROWLING BASED STORY WRITTEN BY A DUTCH GUY.","torrent":{"xt":"urn:btih:60d8ae1e8800e31269928a6b372a58629538ba45","amp;dn":"Harry+Potter+en+Fakkel+met+de+Groene+Vlammen+by+118819","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60d8ae1e8800e31269928a6b372a58629538ba45","infoHashBuffer":{"type":"Buffer","data":[96,216,174,30,136,0,227,18,105,146,138,107,55,42,88,98,149,56,186,69]},"announce":[],"urlList":[]}}