{"title":"Bukka White - The Sonet Blues Story","uid":5178948,"size":111806790,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:60ed5dfc12d85c89fdc82ba53c384c0e28a282b1&amp;dn=Bukka+White+-+The+Sonet+Blues+Story&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"muzik62","files":-1,"time":1259128615,"description":"Bukka White - The Sonet Blues Story\n\nReleased: 2005 (Recorded: 1963)\nmp3 320 kbits\n\nBooker White (his name was misspelled on the label for Shake 'Em on Down when it was issued on Vocalion in 1937, and it stuck) turned his vigorous guitar style, heavy voice, and considerable songwriting abilities into 20 classic blues tracks between 1930 and 1940. Then, following a last session for Vocalion in 1940 when he recorded the striking and passionate group of songs on which his reputation rests (including the ultimately revelatory &quot;Aberdeen Mississippi Blues&quot;), White effectively dropped off the public radar. Until 1963, that is, when graduate students and blues fans John Fahey and Ed Denson sent a letter addressed to &quot;Bukka White, Old Blues Singer, c/o General Delivery, Aberdeen, MS,&quot; in an effort to locate the man who had recorded a 78 rpm called &quot;Aberdeen Mississippi Blues&quot; some 20 years earlier. Amazingly, the letter actually reached White, who was still alive, although he had since moved from Mississippi to Memphis. The two budding blues scholars rushed to Memphis to meet him, recording the songs found on this collection one afternoon in the singer's room. These historic recordings. released as The Sonet Blues Story, reveal that White's robust guitar playing and his gruff, thundering voice had lost none of their vitality in the intervening years, and the bluesman delivers impassioned versions of some of his key tunes, including &quot;Shake 'Em on Down,&quot; and the song that led to his rediscovery, &quot;Aberdeen Mississippi Blues.&quot; White even takes a surprisingly nimble turn at the piano for &quot;Drunk Man Blues.&quot; These sessions were originally released on Fahey's Takoma label, and although White went on to do other recording dates for small labels, he never sounded quite this intimate and impassioned again. The only minor complaint about this reissue is that the haunting version of &quot;When Can I Change My Clothes&quot; included here is mislabeled as &quot;Parchman Farm Blues.&quot; Blues historian Samuel Charters eventually included these recordings in his Legacy of the Blues series, which in turn were released by a small Stockholm jazz and blues label founded in the '50s called Sonet Records. Listeners should start with White's stunning 1940 sides to get a real sense of this powerful musician, but these initial rediscovery tracks are only a notch or two less combustive, and are easily the best of White's later years. - Steve Leggett\n\n------- Track ------------\n1. Aberdeen Mississippi Blues [4:12]\n2. Baby Please Don't Go [4:50]\n3. New Orleans Streamiline [3:45]\n4. Parchman Farm Blues [2:54]\n5. Poor Boy Long Ways From Home [2:22]\n6. Remembrance of Charlie Patton [3:54]\n7. Shake 'em on Down [3:32]\n8. I Am the Heavenly Way [3:44]\n9. The Atlanta Special [5:55]\n10. Drunk Man Blues [3:53]\n11. Army Blues [3:02]\n\n--------- Personnel --------------\nBukka White (Guitar, Piano, Vocals)\n\nmuzik62","torrent":{"xt":"urn:btih:60ed5dfc12d85c89fdc82ba53c384c0e28a282b1","amp;dn":"Bukka+White+-+The+Sonet+Blues+Story","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60ed5dfc12d85c89fdc82ba53c384c0e28a282b1","infoHashBuffer":{"type":"Buffer","data":[96,237,93,252,18,216,92,137,253,200,43,165,60,56,76,14,40,162,130,177]},"announce":[],"urlList":[]}}