{"title":"The Rolling Stones - Their Satanic Majesties (1967) WMA320","uid":6304905,"size":109594035,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6100b946da5ea92343fb9597e780f9bf07d3114f&amp;dn=The+Rolling+Stones+-+Their+Satanic+Majesties+%281967%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1302292187,"description":"I already have a review for the original CD release of this album for Amazon, but the remaster of this highly underrated\nalbum was so important that I feel it warrants another review.\nIn short--get it *now*. &quot;Satanic Majesties&quot; is an album of such dense layers of sound effects that it really deserves the best possible sound quality, which is what it finally receives here.\nNo matter what you think of the album, it sounds almost brand new, with a clarity, crispness and rich aural sheen completely missing from the original CD. This is much closer to the original vinyl, and I would even say superior, since there are sounds I had *never* heard before...&quot;Sing This All Together&quot;, \n&quot;In Another Land&quot; and &quot;Gomper&quot; sound particularly strong, with the stereo separation making it sound as if the entire band is playing in your living room.\nI have always had a soft spot in my heart for &quot;Satanic&quot;--sure, it sounds nothing like The Stones, but that's part of what gives it its charm. It certainly sounds almost nothing like &quot;Sgt.Pepper&quot;, either, although it is clearly influenced by it. Songs like &quot;Citadel&quot;, &quot;2000 Light Years&quot; and &quot;Gomper&quot; are much darker, heavier and more experimental than anything on &quot;Pepper&quot;, and the catchy riffs and hooks *are* still there. There's only one thing missing in the new CD remaster and that is the 3-D effect on the cover art, although the rest of the packaging is up to par.\n\nby Michael Topper\n\nTRACKLIST:\n\n01 - Sing This All Together.wma                                       \n02 - Citadel.wma                                                      \n03 - In Another Land.wma                                              \n04 - 2000 Man.wma                                                     \n05 - Sing This All Together (See What Happens).wma                    \n06 - She's A Rainbow.wma                                              \n07 - The Lantern.wma                                                  \n08 - Gomper.wma                                                       \n09 - 2000 Light Years From Home.wma                                   \n10 - On With The Show.wma\n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!\t","torrent":{"xt":"urn:btih:6100b946da5ea92343fb9597e780f9bf07d3114f","amp;dn":"The+Rolling+Stones+-+Their+Satanic+Majesties+%281967%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6100b946da5ea92343fb9597e780f9bf07d3114f","infoHashBuffer":{"type":"Buffer","data":[97,0,185,70,218,94,169,35,67,251,149,151,231,128,249,191,7,211,17,79]},"announce":[],"urlList":[]}}