{"title":"Shostakovich Piano Trio No 1 &amp; 2","uid":4993634,"size":50288936,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:61190882a9edd604fafa723ab7b951c7e840dcd7&amp;dn=Shostakovich+Piano+Trio+No+1+%26+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"muzik62","files":-1,"time":1247167762,"description":"Dmitry Shostakovich (1906-1975) - Piano Tri No 1 &amp; 2\n\nmp3 160 kbits\n\nPerformers:\nPiano\tAlexander Bonduriansky\nViolin\tVladimir Ivanov\nCello\tMikhail Utkin\n\n----------------------------- Tracks ----------------------------------\n1, Piano Trio No. 1 in C minor, Op. 8 for Piano, Violin and Cello\n2. Piano Trio No. 2 in E minor op 67 for Piano, Violin and Cello Andante - Moderato\n3. Piano Trio No. 2 in E minor op 67 for Piano, Violin and Cello Allegro con brio\n4. Piano Trio No. 2 in E minor op 67 for Piano, Violin and Cello Largo\n5. Piano Trio No. 2 in E minor op 67 for Piano, Violin and Cello Allegretto\n\nPiano Trio No 1 in C minor was created as a student work in 1923 and its last 16 bars were completed later by Shostakovich's pupil, Boris Tishchenko. Alternative solutions have been provided by Leslie Howard and Borys Lyatoshynsky. The one-movement trio was composed in late romantic style with impressionist elements. There are melodic and rhythmic structure changes in several sections.\n\nThe Piano Trio No. 2 in E minor, Op. 67, by Dmitri Shostakovich was written in 1944 and dedicated to the memory of his closest friend Ivan Sollertinsky, who had recently died. The work received its premiere in Leningrad on 14 November 1944.\n\n-------------------------- Francais ----------------------\nLe NO1 de trio de piano dans le mineur de C a ÃƒÂ©tÃƒÂ© crÃƒÂ©ÃƒÂ© comme travail d'ÃƒÂ©tudiant en 1923 et ses 16 derniÃƒÂ¨res barres ont ÃƒÂ©tÃƒÂ© accomplies plus tard par la pupille de Shostakovich's, Boris Tishchenko. Des solutions de rechange ont ÃƒÂ©tÃƒÂ© fournies par Leslie Howard et Borys Lyatoshynsky. Le trio d'un-mouvement s'est composÃƒÂ© dans le modÃƒÂ¨le romantique en retard avec les ÃƒÂ©lÃƒÂ©ments impressionnistes. Il y a les changements mÃƒÂ©lodiques et rhythmiques de structure de plusieurs sections.\n\nLe numÃƒÂ©ro 2 de trio de piano dans le mineur d'E, op. 67, par Dmitri Shostakovich ont ÃƒÂ©tÃƒÂ© ÃƒÂ©crits en 1944 et consacrÃƒÂ©s ÃƒÂ  la mÃƒÂ©moire de son ami plus ÃƒÂ©troit Ivan Sollertinsky, qui ÃƒÂ©tait rÃƒÂ©cemment morte. Le travail a reÃƒÂ§u sa premiÃƒÂ¨re ÃƒÂ  LÃƒÂ©ningrad le 14 novembre 1944.\n\n--------------------------- Deutsch ----------------------------\nKlavier-Trio-NO1 im c-MinderjÃƒÂ¤hrigen wurde als Kursteilnehmerarbeit 1923 hergestellt und seine letzten 16 StÃƒÂ¤be wurden spÃƒÂ¤ter durch Shostakovichs Pupille, Boris Tishchenko abgeschlossen. AusweichlÃƒÂ¶sungen sind von Leslie Howard und von Borys Lyatoshynsky zur VerfÃƒÂ¼gung gestellt worden. Das Einbewegung Trio bestand in der spÃƒÂ¤ten romantischen Art mit impressionist Elementen. Es gibt melodische und rhythmische StrukturÃƒÂ¤nderungen in einigen Abschnitten.\n\nDas Klavier-Trio Nr. 2 im e-MinderjÃƒÂ¤hrigen, OP. 67, durch Dmitri Shostakovich wurden 1944 geschrieben und eingeweiht dem GedÃƒÂ¤chtnis seines nÃƒÂ¤hsten Freunds Ivan Sollertinsky, das vor kurzem gestorben war. Die Arbeit empfing seine Premiere in Leningrad am 14. November 1944.\n\nmuzik62","torrent":{"xt":"urn:btih:61190882a9edd604fafa723ab7b951c7e840dcd7","amp;dn":"Shostakovich+Piano+Trio+No+1+%26+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61190882a9edd604fafa723ab7b951c7e840dcd7","infoHashBuffer":{"type":"Buffer","data":[97,25,8,130,169,237,214,4,250,250,114,58,183,185,81,199,232,64,220,215]},"announce":[],"urlList":[]}}