{"title":"Gran'Pa Jack Series issues 1-8","uid":5123890,"size":1228475154,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:613030578e9adc6c5f29bfb13d1da0277dc98a51&amp;dn=Gran%5C%27Pa+Jack+Series+issues+1-8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Bonesman1990","files":-1,"time":1255507626,"description":"From the JPFO website:\n\nEntertaining and educational, our ''Gran'pa Jack'' booklets explain complex issues in easily understood terms. Discounts for bulk orders. \n\n\n\n\n\n        JPFO: Fierce Defender of American Liberty\n\nTo destroy &quot;gun control&quot; and to encourage Americans to understand and defend all of the Bill of Rights for everyone. Those are the twin goals of Wisconsin-based Jews for the Preservation of Firearms Ownership (JPFO). Founded by Jews and initially aimed at educating the Jewish community about the historical evils that Jews have suffered when they have been disarmed, JPFO has always welcomed persons of all religious beliefs who share a common goal of opposing and reversing victim disarmament policies while advancing liberty for all.\n\nJPFO is a non-profit tax-exempt educational civil rights organization, not a lobby. JPFO's products and programs reach out to as many segments of the American people as possible, using bold tactics without compromise on fundamental principles. For example, JPFO offers easy-reading, comic-style, fully-documented &quot;Gran'pa Jack&quot; booklets that explain:\n\n    * the entire Bill of Rights, its roots, its meaning, and how it is being trampled today\n    * the racist roots of &quot;gun control&quot; in America\n    * the United Nations assault on the U.S. Bill of Rights\n    * how &quot;gun control&quot; laws led to the nearly 70 million deaths of unarmed civilians in eight 20th-Century genocides\n    * how to explode 21 &quot;gun control&quot; myths\n    * ...and much more! \n\n\n\n\n----------------------------------------------------------------------------------\n\n\nMy own addendum:\n\nFrom Jews for the Preservation of Firearms Ownership (JPFO) come the educational comic series, Gran'Pa Jack.\n\n\nEntertaining and informative, these quick-reading booklets are packed with the facts and figures our government wants hidden from We the People. facts and figures that our children will NOT learn in a public school's &quot;Civics&quot; curriculum.\n\n\nDo yourself, your family and your friends a favor and share these tools of freedom with all. Great resource for family discussions and great AMMUNITION for political discussions with the conformists in your personal and professional circles.\n\n\nAlso, these booklets are perfect for sharing with the public. And at the JPFO Online Store ( http://shop.jpfo.org/cart.php?m=product_list&amp;c=11 ), the entire series can be purchased in bulk (10 ea. x 8 booklets) for $32, making them more affordable than the paper and ink that it would take to print out second-rate facsimiles.\n\n\nGood deeds like this are rewarded.\n\n\nSpecial thanks to Aaron Zelman and all who contributed to this fantastic series!\n\n\n\n\n","torrent":{"xt":"urn:btih:613030578e9adc6c5f29bfb13d1da0277dc98a51","amp;dn":"Gran%5C%27Pa+Jack+Series+issues+1-8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"613030578e9adc6c5f29bfb13d1da0277dc98a51","infoHashBuffer":{"type":"Buffer","data":[97,48,48,87,142,154,220,108,95,41,191,177,61,29,160,39,125,201,138,81]},"announce":[],"urlList":[]}}