{"title":"Stone.Cold.1991.DVDRip.XviD-KooKoo","uid":5083734,"size":764830809,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6142bdffa1a591cc7fd5df1a18756083d8046ce6&amp;dn=Stone.Cold.1991.DVDRip.XviD-KooKoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zingooo","files":-1,"time":1252544885,"description":"Stone Cold is a 1991 action movie based around a biker gang out to assassinate the governor and free one of their members who is on trial for murder. The movie marked the acting debut of 80's football star Brian Bosworth, otherwise known as &quot;The Boz&quot;.\n\nPlot details\n\nBosworth plays Joe Huff, an Alabama cop with a rough and tumble attitude who possesses a Komodo dragon house pet. Although under suspension for his seemingly deviant police tactics, Huff single-handedly stops a grocery store heist with wing-tipped jacket, bottle of oil and a huge smile in the opening minutes of the movie. Shortly after this episode, Huff is summoned by FBI Special Agent Cunningham, whom he meets in a vacant underground parking lot. Cunningham proceeds to blackmail Huff into going undercover, threatening Huff with expanding his three week suspension to six months, without pay. This undercover operation entails infiltrating &quot;The Brotherhood&quot; - a powerful Mississippi biker gang linked in the murder of government officials as well as dealing drugs with the mafia.\n\nThe Brotherhood is run by Chains (Henriksen) and Ice Hensley (Forsythe) as Commander and Sergeant at arms, respectively. Ice and Chains are the epitome of tough-as-nails white trash, and after Ice is killed he is sent out in style by his fellow gang members, by way of a Viking funeral, complete with a bonfire.\n\nJoe Huff takes the undercover name John Stone and manages to infiltrate the gang. With the help of his partner Lance (McMurray), an FBI agent, Huff sets up a &quot;P2P&quot; sting in order to catch the Brotherhood in the act. But their plan backfires, and Huff soon learns that the gang's criminal activities are merely fundraising efforts by the bikers to finance their master plan: To storm the state capitol of Mississippi with stolen military equipment and murder District Attorney Abernathy Whipperton, AKA &quot;The Whip&quot;, who seeks to put one of their brothers to death.\n\n\n\n\n\n                       &lt;a href=&quot; http://www.imdb.com/title/tt0102984/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0102984/&lt;/a&gt;","torrent":{"xt":"urn:btih:6142bdffa1a591cc7fd5df1a18756083d8046ce6","amp;dn":"Stone.Cold.1991.DVDRip.XviD-KooKoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6142bdffa1a591cc7fd5df1a18756083d8046ce6","infoHashBuffer":{"type":"Buffer","data":[97,66,189,255,161,165,145,204,127,213,223,26,24,117,96,131,216,4,108,230]},"announce":[],"urlList":[]}}