{"title":"Aliens, Nasa Scientist, Project Blue Beam, Brainchips","uid":5126248,"size":4505632768,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:614d99524d6e56a91f0af4ab73f02a04007987bb&amp;dn=Aliens%2C+Nasa+Scientist%2C+Project+Blue+Beam%2C+Brainchips&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thisisthat33","files":1,"time":1255635162,"description":"NEW UPDATE! 12-11-09\n\nFolks, a major city will be attacked in a very short time. It is delayed because people know. The new information talk about something before christmas. My warning will be here but if we have succeeded stopping the attack even after late 2009 i have no more time to give. \n\nSerge Monast was the first journalist to write about the mysterious aliens and NASA's Project Blue Beam back in the 90's. He died in his wives arms in a heart attack and they took his children and nobody knows what happened to them.\nIn fact, this &quot;heart attack&quot; was caused by people in the project he wrote about.\nMany earlier journalists suffered heart attacks too.\nThis is the first part of this DVD and the second part is about a Scientist telling the truth about the moon, mars, aliens and the technology. Really interesting and a MUST to know!\nThen, we go deeper in David Icke and Alex Jones thoughts about this things and what Alan Watt is telling us about future generations getting chip implants. Total control. Being slaves. Finally more movies about the microchip and how they have poison in our drinking water!!! Yes, you really have to see this!","torrent":{"xt":"urn:btih:614d99524d6e56a91f0af4ab73f02a04007987bb","amp;dn":"Aliens%2C+Nasa+Scientist%2C+Project+Blue+Beam%2C+Brainchips","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"614d99524d6e56a91f0af4ab73f02a04007987bb","infoHashBuffer":{"type":"Buffer","data":[97,77,153,82,77,110,86,169,31,10,244,171,115,240,42,4,0,121,135,187]},"announce":[],"urlList":[]}}