{"title":"Air-America.DVDrip[vice]","uid":5170372,"size":520722513,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:62dcd6712d8bccab4a2469042c43b81694e5a52a&amp;dn=Air-America.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vicerock","files":-1,"time":1258655543,"description":"AIR AMERICA DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nrun-time 01:47:19\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCast\nRobert Downey Jr. at the premiere of Air America in 1990.\n\n* Mel Gibson as Gene Ryack\n* Robert Downey Jr. as Billy Covington\n* Nancy Travis as Corinne Landreaux\n* Ken Jenkins as Major Donald Lemond\n* David Marshall Grant as Robert Diehl\n* Lane Smith as Senator Davenport\n* Art LaFleur as Jack Neely\n* Michael Dudikoff as General Lee\n* Ned Eisenberg as Nick Pirelli\n* Marshall Bell as Q.V.\n* David Bowe as Saunders\n* Burt Kwouk as General Lu Soong\n* Tim Thomerson as Babo\n* Harvey Jason as Nino\n* Sinjai Hongthai as May Ling\n* Natta Nantatanti as Gene's Daughter\n* Purin Phanichphant as Gene's Son\nPlot\n\nIn late 1969, Billy Covington (Downey) works as a helicopter traffic pilot for a Los Angeles radio station, and is fired after breaking FAA regulations. His piloting skills, bravery and disregard for the law are noticed by a mysterious stranger, who offers him a job in Laos working for a &quot;strictly civilian&quot; company called Air America; insisting &quot;there is no war in Laos, you can take that to the bank&quot;. Billy, unemployed and unable to find work, takes the job and flies to Laos. Upon arrival, he is partnered with veteran pilot Gene Ryack (Gibson). By the end of his first day, he learns that Gene is also an arms merchant who uses official flights to buy black-market weapons for his private cache.\n\nThe next day, Senator Davenport (Lane Smith) arrives in Laos on a &quot;fact finding mission&quot; to determine if Washington D.C rumors are true about Air America's heroin smuggling business. Major Lemond and Rob Diehl, CIA leaders of Air America, have a cover-up in place. Senator Davenport is shown around refugee camps, shrines &amp; temples, and major cities in a careful deception to keep him out of the loop. At the same time, Billy and Jack Neely are shot down in their C-123 cargo plane while airdropping livestock into rural villages. Air America stages a large rescue effort, although more effort is placed to salvage the opium, leaving Billy and Jack in hostile territory. Gene risks his life to pick him out, but he crashes with Billy in the helicopter; now they are stranded in the jungles of Laos when they are captured by a rural tribe. Gene lets his business instincts shine through when he notices they are using obsolete and unreliable guns, managing to convince the tribe to spare their lives in exchange for better weapons. Billy decides to quit Air America, but he wants to get even with General Soong for betraying him when he crashed.\nMel Gibson at the premiere of Air America in 1990.\n\nSenator Davenport is becoming upset when he is not being shown the operations of Air America, and he demands to know who is smuggling heroin. Soon after returning to Air America the pilots are informed that Jack was found dead, leading to the further dissociation of Billy. Later that same day, Billy purchases grenades on the black market and uses them to blow up the heroin factory. Unfortunately, the guards see him running away, and General Soong and Major Lemond use him as their fall guy.\n\nThe next day, Gene finds a buyer for his arsenal, allowing him to leave gunrunning, quit Air America and take his family out of the country. Billy is making a flight before he actually quits, and he is promptly called to land at an airstrip for &quot;routine inspection&quot;, a non-routine situation. Expecting a trap, he searches his cargo to find several kilos of heroin hidden in flour sacks, and a large armed force waiting for him at the airstrip. He refuses to land and tries to fly away, only to find his fuel gauge has been tampered with and he is nearly out of gas. Billy crashes his small plane on the same airstrip he crashed a few days earlier and hides in the wreckage.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0099005/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0099005/&lt;/a&gt;","torrent":{"xt":"urn:btih:62dcd6712d8bccab4a2469042c43b81694e5a52a","amp;dn":"Air-America.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62dcd6712d8bccab4a2469042c43b81694e5a52a","infoHashBuffer":{"type":"Buffer","data":[98,220,214,113,45,139,204,171,74,36,105,4,44,67,184,22,148,229,165,42]},"announce":[],"urlList":[]}}