{"title":"Cyberlink PowerBackup v2.60.1018","uid":6191321,"size":18863849,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:64bda32a45deb6dc084c248e6fafdf7113fcd482&amp;dn=Cyberlink+PowerBackup+v2.60.1018&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ADHDerby","files":-1,"time":1298295877,"description":"The Safest Way to Protect Your Valuable Data\n\nPowerBackup is a back-up and restoration application by Cyberlink. This application allows you to make sure that your files are always secure by letting you carry out back-ups in many ways. With PowerBackup you will be able to archive folders, files and hard drives to an external source such as an external hard drive. You can choose to back up all your files or use filters to select them. You can even schedule back-ups so that your data is always safe and secure even when you don't have time to do the backups yourself. There are three ways in which you can back up your files: Full, differential or incremental. The first one allows you to back up all your files, the second one allows you to back up files that have changed or are new since the last back-up and incremental archives only files that have been modified. With all those options, you are guaranteed to find one feature that suits your needs. PowerBackup has been designed to not leave anything at random. If you want it to, it will even back up your browser favorites, cookies, your e-mail client's database, and more.\n\n\nFeatures:\n\n* Archive files, folders and application data\n* Include or exclude files with advanced filtering\n* Review archives to compare files that have been changed or deleted\n* Recover deleted, damaged, or changed files\n* Schedule automatic backups of important data\n* Back up using full, differential, or incremental modes\n* Locate individual files by searching archives\n* Protect archives with password protection\n* Blu-ray disc support provides users with up to 50GB of storage space on a single disc\n\n\nMore info @ http://www.cyberlink.com/products/powerbackup\n\n\nInstall:\n\nRun Setup.exe and run PowerBackup when the installation is completed\nClick on Try Now, select the Help menu and click Enter Activation Key\n\nUse the CD-Key in the ReadMe to Activate\n\n\nCheers,\n\nADHDerby\n","torrent":{"xt":"urn:btih:64bda32a45deb6dc084c248e6fafdf7113fcd482","amp;dn":"Cyberlink+PowerBackup+v2.60.1018","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64bda32a45deb6dc084c248e6fafdf7113fcd482","infoHashBuffer":{"type":"Buffer","data":[100,189,163,42,69,222,182,220,8,76,36,142,111,175,223,113,19,252,212,130]},"announce":[],"urlList":[]}}