{"title":"Pokemon PlayIt! v2 PRECRACKED","uid":5045414,"size":209518654,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:64c5479809f3ee328778009d96500b93b260bd38&amp;dn=Pokemon+PlayIt%21+v2+PRECRACKED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dmanthing","files":2,"time":1249599988,"description":"This is Precracked and repacked release so no cd is needed,\nalso this version works on every OS\n\ngame info:\n\nPokÃƒÂ©mon Play It! is a game that came from certain classic PokÃƒÂ©mon Trading Card Game Card packs (that were made by Wizards of the Coast, a division of Hasbro who held the licensing rights until 2002, when Nintendo took over) for the PC. In the first version, you have to learn how to play the PokÃƒÂ©mon TCG (Trading Card Game) in any way you like, before you would decide to battle a CPU-controlled girl named Julie. However, there was 4 virtual 30-card packs available, where 2 are secrets, your need to type the word &quot;fire&quot; when you reach the title screen or when Julie starts to talk. This version is included with the Base 2 Beginners PokÃƒÂ©mon Trading Card pack. In the 2nd version, you can now sign-in as a PokÃƒÂ©mon learner trainer, before you can enter in Advanced Challenges as a PokÃƒÂ©mon Master learner trainer. Also, you could build your own PokÃƒÂ©mon TCG card decks, and organize your cards. Both versions included extras, the likes of which encompassed in-computer features and printable ones. Version one was available in the USA as well as the UK (woolworths set up trading card days in store). Version two meanwhile was only available in the USA, however V2 was available in the UK in gift boxes containing the limited edition Tempest deck. Also in Poland V2 was in computer magazine &quot;Play&quot; from May 2001.","torrent":{"xt":"urn:btih:64c5479809f3ee328778009d96500b93b260bd38","amp;dn":"Pokemon+PlayIt%21+v2+PRECRACKED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64c5479809f3ee328778009d96500b93b260bd38","infoHashBuffer":{"type":"Buffer","data":[100,197,71,152,9,243,238,50,135,120,0,157,150,80,11,147,178,96,189,56]},"announce":[],"urlList":[]}}