{"title":"Batman the Brave and the Bold Seasn 2 complete{C_P} UPDATE","uid":6140265,"size":4719829460,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:64dc0b0f9b6a7a3e373d1052e14d0e0cc82b5360&amp;dn=Batman+the+Brave+and+the+Bold+Seasn+2+complete%7BC_P%7D+UPDATE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"despo1ler","files":-1,"time":1296432856,"description":"[center][URL=http://img573.imageshack.us/i/batmanlogo.jpg/][IMG]http://img573.imageshack.us/img573/7832/batmanlogo.jpg[/IMG][/URL]\n-----------------------------------------\n[color=Red]IMPORTANT NOTES[/color]\nPLS READ BEFORE DOWNLOADING\n-----------------------------------------\nI need to apologise to everyone who has already downloaded version 1 of this torrent, I discovered there were 2 episodes missing \nshortly after I'd started seeding it but rather than stop and restart from scratch I decided to let it finish and then issue this update.\n As things worked out tho it means I am able to substitute the current copies of episodes 225 &amp; 226 with the new copies I have just finished\n encoding from a new source I found last night, they are far better quality than the current resized copies of the NATV release.\n-------------------------------------------------------------------------------------------------------------\n[color=Red]Instructions for loading existing torrent folder[/color]\n---------------------\nWhen you download the torrent file for this updated copy of the series you need to make certain that the download location is the same as the existing \n\nfolder,\n ie C:/user/.././My Videos/Batman the Brave and the Bold Seasn 2 complete{C_P} \nthis can usually be done on the box your torrent client opens when you open open a torrent file, if you have a default folder set it should find the \n\nfolder automatically but you may need to stop the torrent and right click on it and select &quot;advanced &gt;&quot; then &quot;set download location&quot; from the dropdown \n\nmenu.\nOnce the folder location is set as the same as the existing one your client should automatically check the files and will load everything you have \n\nalready downloaded, if this does not happen automatically right click the torrent again and select &quot;Force re-check&quot;, if it does not load the existing \n\nfiles re check the download location.\nAnother way to do it is to allow the torrent download enough to create a new folder then stop it cut/paste all the files from the existing folder into \n\nthe new one, making sure you select &quot;replace existing files&quot; when asked and again force the client to do a re-check.\n Once your client is showing the 22 episodes that are identical in both torrents it will then only need to continue downloading the 4 new, updated \n\nfiles.\nOnce again, sorry for the hassle but the new copies of 225 and 226 wioll make it worth the effort.\n-----------------------------------------------------------------------------------------------------------\n\nSeason 2: 2009-2011   Director Writer Airdate \n\n01 &quot;Death Race to Oblivion!&quot; Michael Goguen Greg Weisman November 20, 2009 (2009-11-20) [color=Red]203[/color]\n\nTeaser: When a child genius drinks a formula turning him into Blockbuster and then invades a museum to steal a diamond, Batman and Captain Marvel team \n\nup to stop him.\nMain Plot: Mongul forces heroes (Batman, Green Arrow, Guy Gardner, Huntress, Plastic Man, and Woozy Winks) and villains (Black Manta, Catwoman, \n\nGentleman Ghost, and Joker) alike to race against Steppenwolf for Earth's survival. \n \n02 &quot;Long Arm of the Law!&quot; Ben Jones James Krieg December 11, 2009 (2009-12-11) [color=Red]201[/color] \nTeaser: Batman and Plastic Man rescue some boy scouts from a group of sleeping Shaggy Men, until Plastic Man awakens them.\nMain Plot: Kite Man plans revenge on Plastic Man for putting him to jail after years working for him as one of his henchmen. With a new sidekick named \n\nRubberneck, Kite Man threatens Plastic Man's family, including his wife Ramona, his son Baby Plas, and his sidekick Woozy Winks, and also plans to \n\nremove his powers as well.  \n\n03 &quot;Revenge of the Reach!&quot; Michael Chang J. M. DeMatteis January 1, 2010 (2010-01-01) [color=Red]202[/color] \n\nTeaser: Batman helps the Challengers of the Unknown in a fight against a giant spider on Dinosaur Island. The team of heroes are later ambushed by a \n\ngroup of Starro clones that came from the crashed meteorite.\nMain Plot: Following a fight with Evil Star, Batman and Blue Beetle face off against an alien race called the Reach with the help of the Green Lantern \n\nCorps. It turns out that Blue Beetle's scarab is linked to the Reach as revealed by the Guardians of the Universe.\n  \n04 &quot;Aquaman's Outrageous Adventure!&quot; Ben Jones Steven Melching January 8, 2010 (2010-01-08) [color=Red]204[/color] \nTeaser: Batman travels back through World War I to call upon the help of Enemy Ace to fight an alien using a weapon to attack an army on Enemy Ace's \n\nside.\nMain Plot: After defeating Fisherman, Aquaman goes on vacation with his wife Mera and his son Arthur Jr. However, they stop along the way when Aquaman \n\nhelps other heroes. One of the stops involves saving Batman from the Penguin.  \n\n05 &quot;The Golden Age of Justice!&quot; Michael Chang Todd Casey January 15, 2010 (2010-01-15) [color=Red]205[/color]\n\nTeaser: Batman and Detective Chimp join forces to find out who swiped the Golden Skull and discover that one of the suspects is actually False-Face.\nMain Plot: An aging Justice Society of America (consisting of the second Black Canary, Doctor Mid-Nite, the Golden Age Flash, Hawkman, Hourman, and \n\nWildcat) is faced with the return of their worst enemy Per Degaton as he returns from suspended animation to enact a plan for world domination with his \n\nassistant Professor Zee. Meanwhile, Black Canary helps Wildcat face his greatest regrets which involved the original Black Canary. \n \n06 &quot;Sidekicks Assemble!&quot; Michael Chang Marsha F. Griffin January 22, 2010 (2010-01-22) [color=Red]208[/color]\n\nTeaser: In a flashback, the younger Robin, Speedy, and Aqualad, face-off against multiple villains in a simulation in the Batcave while Batman, Aquaman, \n\nand Green Arrow watch in the control room.\nMain Plot: In the present, Robin, Speedy, and Aqualad, have had it with being bossed around by Batman, Green Arrow, and Aquaman, and demand a piece of \n\nthe action. They get more than they bargained for when the three sidekicks find themselves facing off against Ra's al Ghul and his daughter Talia al \n\nGhul on a flying island.  \n\n07 &quot;Clash of the Metal Men!&quot; Michael Goguen Dean Stefan January 29, 2010 (2010-01-29) [color=Red]206[/color] \n\nTeaser: After helping Batman defeat a gang of pirates, Aquaman returns to Atlantis to find it overtaken by Starro clones. There he meets the Faceless \n\nHunter who is preparing for the Great Starro Invasion.\nMain Plot: During a battle with Chemo, Batman is introduced to a team of energetic androids known as the Metal Men. When their creator Dr. Milton Magnus \n\ngoes missing at the hands of the Gas Gang, Batman and the Metal Men team up to track them down. \n \n08 &quot;A Bat Divided!&quot; Ben Jones Thomas Pugsley February 5, 2010 (2010-02-05) [color=Red]207[/color] \n\nTeaser: Booster Gold and Skeets end up on the Riddler's game show &quot;Riddle Me This&quot; and are forced to answer riddles for the fate of Batman.\nMain Plot: During a science field-trip, the villain Doctor Double X battles Batman and causes a nuclear reaction that splits the hero into three \n\nemotionally unstable personas. Luckily, the brilliant student Jason Rusch and the dimwitted coach Ronnie Raymond are transformed into the superhero \n\nFirestorm who lends Batman a helping hand literally pulling himself together.  \n\n09 &quot;The Super-Batman of Planet X!&quot; Michael Goguen Adam Beechen March 26, 2010 (2010-03-26) [color=Red]209[/color]\n\nTeaser: Dr. Milton Magnus and the Metal Men team up with Batman (who is undercover using his Matches Malone persona) to take down Kanjar Ro and his gang \n\nof intergalactic space bandits.\nMain Plot: Green Arrow assists Batman in defeating the remaining space pirates, but during a chase, a wormhole is created and it sends Batman to the \n\ndistant planet Zur-En-Arrh in the city of Gothtropolis. There he meets his doppelganger, the Batman of Zur-En-Arrh, but more surprisingly, on this \n\nplanet the Caped Crusader has super powers. \nTogether, they battle the mad genius Rohtul who soon learns Batman's super weakness.\n  \n10 &quot;The Power of Shazam!&quot; Ben Jones Steven Melching April 2, 2010 (2010-04-02) [color=Red]210[/color] \n\nTeaser: The Faceless Hunter is shown fighting and putting several heroes under Starro control preparing for a full-scale invasion as he recaps his \n\npreparation for the Great Starro Invasion.\nMain Plot: Batman teams up with Captain Marvel to battle Doctor Sivana and Black Adam when they wish to usurp the magic of Shazam that gives Billy his \n\npower. \n \n11&quot;Chill of the Night!&quot; Michael Chang Paul Dini April 9, 2010 (2010-04-09) [color=Red]211[/color] \n\nTeaser: Abra Kadabra attempts to steal the contents of a museum celebrating history's greatest magicians, when Batman brings his old friend Zatanna in \n\norder to thwart him and his army of mind controlled slaves.\nMain Plot: The Spectre and the Phantom Stranger make a bet on Bruce Wayne's soul, concerning how he will deal with the information of the man who killed \n\nhis parents, Thomas Wayne and Martha Wayne. Batman finds the culprit is Joe Chill, who is auctioning off a highly powerful weapon to several of Batman's \n\nrogues.\n\nSpecial Guest Stars: Adam West as Thomas Wayne, Julie Newmar as Martha Wayne, Kevin Conroy as the Phantom Stranger, and Mark Hamill as the Spectre. \n \n12&quot;Gorillas in Our Midst!&quot; Michael Goguen Todd Casey April 16, 2010 (2010-04-16) [color=Red]212[/color] \n\nTeaser: Professor Milo designs a way to control rats, and uses his new technology to steal diamonds only to run afoul of Batman and the Spectre.\nMain Plot: When Gorilla Grodd, Monsieur Mallah, and Gorilla Boss form G.A.S.P. (short for Gorillas and Apes Seizing Power) and replace all of Gotham \n\nCity's entire human population with gorillas, Batman teams with Detective Chimp, B'wana Beast, and Vixen (after the latter two stop Killer Moth and his \n\nhenchmen from robbing an armored car) to thwart Gorilla Grodd's plans.  \n\n13 &quot;The Siege of Starro! Part One&quot; Ben Jones Joseph Kuhr June 13, 2010 (2010-06-13) (UK)\nSeptember 17, 2010 (2010-09-17) (USA)[5] [color=Red]213[/color] \n\nTeaser: A voiceover explains how there have always been heroes to defeat villains throughout history like Anthro fighting Kru'll the Eternal, Etrigan \n\nthe Demon fighting Morgaine le Fey, Jonah Hex and Cinnamon fighting the Royal Flush Gang, the Justice Society of America fighting Per Degaton's army, \n\nand Batman fighting Ra's al Ghul. Meanwhile, Guy Gardner, Kilowog and several others battle Starro-controlled Green Lanterns in space.\nMain Plot: With most of Earth's heroes under the control of Starro, Batman and Booster Gold team up with Firestorm, B'wana Beast and Captain Marvel to \n\nbattle the Faceless Hunter and thwart the invasion of Starro.  \n\n14 &quot;The Siege of Starro! Part Two&quot; Michael Goguen Joseph Kuhr September 24, 2010 (2010-09-24)[5] [color=Red]214[/color] \n\nTeaser: A recap of the first part is shown, followed by B'wana Beast's origin story.\nMain Plot: Starro may be defeated, but the Faceless Hunter is not. The alien warrior manipulates B'wana Beast, forcing him to combine the tiny Starros \n\ninto one massive beast he plans to use to destroy Earth. But Batman has his own back-up plan, in the form of the Metal Men to rescue him. \n \n15 &quot;Requiem for a Scarlet Speedster!&quot; Michael Chang Greg Weisman May 29, 2010 (2010-05-29) (AUS)\nOctober 1, 2010 (2010-10-01) (USA)[5] [color=Red]215[/color] \n\nTeaser: Batman and the Outsiders (Black Lightning, Katana, Metamorpho, Geo-Force and Halo) must thwart Kobra's plan of global domination and his army of \n\ncultists.\nMain Plot: Two years ago, Barry Allen and Batman worked together to save themselves from villains like Gorilla Grodd, Captain Boomerang, and Mirror \n\nMaster. Two years later, the Rogues (consisting of Heat Wave, Weather Wizard and Captain Cold), Jay Garrick and Kid Flash are depressed over Barry \n\nAllen's apparent death when he was pursuing Professor Zoom. However, after seeing the mysterious ghost of Barry Allen, Batman and the two Flashes use \n\nthe help of the Cosmic treadmill to travel to the 25th century, where Professor Zoom has taken over as the conqueror.  \n\n16 &quot;The Last Patrol!&quot; Ben Jones J. M. DeMatteis September 18, 2010 (2010-09-18) (AUS)[7]October 8, 2010 (2010-10-08) (USA) [color=Red]216[/color]\n\nTeaser: In a flashback, Batgirl debuts as she saves Batman from the maniacal Killer Moth, but they are later captured by the Penguin.\nMain Plot: The Doom Patrol comes out of retirement when a group of villains (consisting of General Zahl, Brain, Monsieur Mallah, Animal-Vegetable-\n\nMineral Man, Arsenal, and Mutant Master) tries to assassinate them. \n \n17 &quot;The Mask of Matches Malone!&quot; Michael Chang Gail Simone September 25, 2010 (2010-09-25) (AUS)  [color=Red]224[/color]\n\nTeaser: Batman joins forces with Black Orchid as they both fight the seductive, but dangerous, Poison Ivy, along with her henchwomen.\nMain Plot: Black Canary and Huntress, along with Catwoman, pursue Two-Face. At the same time, Batman (in his Matches Malone persona) gets amnesia and \n\nbelieves himself to actually be a gangster. This episode features the musical number &quot;Birds of Prey&quot;. \n \n18 &quot;Menace of the Madniks!&quot; Michael Goguen Jim Krieg October 2, 2010 (2010-10-02) (AUS)\nOctober 15, 2010 (2010-10-15) (USA) [color=Red]218[/color] \n\nTeaser: Batman teams up with the Haunted Tank to fight Ma Murder and her gang.\nMain Plot: Following a fight with the Madniks, Booster Gold misses his late old friend Ted Kord so he travels back in time to hang with him. His time \n\ntraveling to help Blue Beetle stop the Madniks soon changes the present when the effects of the Quark Pistol that Booster Gold blew up causes the \n\nMadniks to become energy-draining monsters. Batman \nand Booster Gold must fix the timeline and get one last adventure in with Blue Beetle before he passes on. \n \n19 &quot;Emperor Joker!&quot; Ben Jones Steven Melching October 9, 2010 (2010-10-09) (AUS)\nOctober 22, 2010 (2010-10-22) (USA) [color=Red]219[/color] \n\nTeaser: From the files of the Bat-Computer, Batman and Robin battle Firefly and his Rainbow Monster in a homage to Detective Comics issue #241.\nMain Plot: After Batman defeats Ten-Eyed Man during a jewelry theft, Bat-Mite gives his powers to the Joker by mistake. He uses his new gifts to remake \n\nthe world in his own image and starts killing Batman and bringing him back to life over and over again. At the same time, Bat-Mite develops a crush on \n\nHarley Quinn and vice versa.  \n\n20 &quot;The Criss Cross Conspiracy!&quot; Michael Chang Marsha Griffin October 29, 2010 (2010-10-29) (USA)\nOctober 30, 2010 (2010-10-30) (AUS) [color=Red]220[/color] \n\nTeaser: Batman and the Atom end up fighting Bug-Eyed Bandit and gain the unexpected help of Aquaman.\nMain Plot: Batwoman comes out of retirement when she sees an opportunity for revenge against the Riddler for humiliating her ten years ago during his \n\nfight with Batman and Robin in which he unmasked her. In order to get back at him, she hires the sorcerer Felix Faust to swap her body with Batman's \n\nbody following his fights with Spinner and \nTiger Shark. Batman brings Nightwing and Batgirl to help out.[11] \n \n21 &quot;The Plague of the Prototypes!&quot; Michael Goguen Dean Stephan November 5, 2010 (2010-11-05) (USA) [color=Red]221[/color] \n\nTeaser: Batman travels back to World War II and fights alongside Sgt. Rock and the G.I. Robot.[14]\nMain Plot: When Batman is on call, Gotham is kept safe by his squad of trusty Bat-Robots, but when Black Mask reprograms the unstoppable soldiers to do \n\nhis bidding, Batman must blow the dust off his bumbling beta-test robot &quot;Proto&quot; to help him stop him.[15]  \n\n22 &quot;Cry Freedom Fighters!&quot; Ben Jones Thomas Pugsley November 12, 2010 (2010-11-12) (USA) 222[13] [color=Red]222[/color]\n\nTeaser: Stargirl teams up with the Blue Beetle to fight Mantis.[16]\nMain Plot: The Supreme Chairman of Qward attempts to invade Earth with his forces and it is up to the Freedom Fighters (consisting of Uncle Sam, Doll \n\nMan, Black Condor, Human Bomb, Ray, and Phantom Lady), Batman, and a patriotic Plastic Man to save the day.[17] \n \n23 &quot;The Knights of Tomorrow![18]&quot; Michael Chang Todd Casey &amp; Jake Black[19] November 19, 2010 (2010-11-19) (USA) [color=Red]223[/color]\n\nTeaser: The Question, under Batman's guidance, dodges Kalibak and the Parademons on Apokolips when gathering information on Darkseid's plans to invade \n\nEarth.\nMain Plot: In the future, Batman retires and marries Catwoman, with whom he has a son named Damian Wayne, while Dick Grayson has become the new Batman. \n\nWhen the Joker returns and brings his protege New Joker along, a reluctant Damian will have to assume his deceased parents' legacy by becoming the new \n\nRobin to stop them.[17]  \n\n24 &quot;Darkseid Descending!&quot; Michael Goguen Paul Giacoppo December 3, 2010 (2010-12-03) (USA) [color=Red]224[/color] \n\nTeaser: Batman helps Firestorm take down Ronnie Raymond's crazed, super-powered ex-girlfriend, Killer Frost.[21]\nMain Plot: Batman assembles the Justice League International (consisting of Blue Beetle, Booster Gold, Guy Gardner, Aquaman, Martian Manhunter, Fire and \n\nIce) to prepare for the invasion of Darkseid.[22]  \n\n25 &quot;Bat-Mite Presents: Batman's Strangest Cases![24]&quot; Ben Jones Paul Dini January 19, 2011 (2011-01-19) (UK)[25] [color=Red]225[/color]\n\nTeaser: A recreation of the Mad magazine parody &quot;Bat Boy and Rubin&quot;, as the title characters try to solve a wave of murders.\nMain Plot: Bat-Mite hosts a look at two other incarnations of Batman: a version referencing Jiro Kuwata's Batman featured in Bat-Manga!: The Secret \n\nHistory of Batman in Japan, in which Batman and Robin take on Lord Deathman, and a crossover featuring Scooby-Doo and the Mystery Inc. gang, who assist \n\nthe Dynamic Duo against the Joker and the Penguin.[23] \n \n26 &quot;The Malicious Mr. Mind![26]&quot; Michael Chang &amp; Michael Goguen Dani Michaeli January 20, 2011 (2011-01-20) (UK)[27]  [color=Red]226[/color]\n\nTeaser: Batman, Kamandi and Dr. Canus battle Misfit in modern day Gotham City, while also searching for the ancient artefact that they need in order to \n\nbeat him.\nMain Plot: Batman and the Marvel Family battle the Monster Society of Evil, but the villains escape after Doctor Sivana blasts Batman with an age-\n\nreversing ray. The Marvel Family try to figure out how to get Batman back to normal while also dealing with the Monster Society of Evil, who are now \n\nbeing led by Mr. Mind.  \n----------------------------------------------------------------------------------------------------------\n\nCast\nSeries credited cast: \n\n  Diedrich Bader  ...  Batman (voice)  Lord Death Man / Creepy Usher (voice)\n\nRest of cast listed alphabetically: \n  \n  Jeff Bennett  ...  Rubin / Scooby-Doo Penguin  Captain Marvel (voice)\n  Dee Bradley Baker  ...  Misfit / Baby Batman / Mr. Atom (voice) \n  Corey Burton  ...  Bat-Manga Batman / Scooby-Doo Joker \n  Mindy Cohn  ...  Velma / Ticket Girl (voice)\n  Grey DeLisle  ...  Fire (voice)  Daphne / Bat-Manga Robin (voice)\n  John Di Maggio  ...  Aquaman (voice) \n  Greg Ellis  ...  Dr. Canus / Mr. Mind (voice)  \n  Bill Fagerbakke  ...  Ronnie Raymond (voice)  \n  Will Friedle  ...  Blue Beetle (voice)  \n  Nicholas Guest  ...  Question / Martian Manhunter (voice)  \n  Jennifer Hale  ...  Killer Frost / Ice (voice) \n  Mikey Kelley  ...  Kamandi / 10 year old Batman (voice)  \n  Tom Everett Scott  ...  Booster Gold (voice)  \n  James Arnold Taylor  ...  Guy Gardner (voice)  \n  Billy West  ...  Skeets (voice)  \n  Tyler James Williams  ...  Firestorm (voice)  \n  Michael-Leon Wooley  ...  Kalibak / Darkseid (voice)  \n  Matthew Lillard  ...  Shaggy (voice)  \n  Jason Marsden  ...  Scooby-Doo Robin  \n  Jim Piddock  ...  Dr. Sivana (voice)\n  Paul Reubens  ...  Bat-Mite (voice) \n  Tara Strong  ...  Billy Batson / Mary Marvel / Toddler Batman (voice)  \n  Frank Welker  ...  Batboy / Fred / Scooby-Doo / Scooby-Doo Batman (voice) \n  'Weird Al' Yankovic  ...  Mr. Star (voice)\n\n--------------------------------------------------\nscreens of episodes 225 &amp; 226 V2 \n[URL=http://img842.imageshack.us/i/batmanthebraveandthebolb.jpg/][IMG]http://img842.imageshack.us/img842/4325/batmanthebraveandthebolb.jpg[/IMG][/URL]\n[URL=http://img19.imageshack.us/i/batmanthebraveandthebold.jpg/][IMG]http://img19.imageshack.us/img19/4286/batmanthebraveandthebold.jpg[/IMG][/URL]\n--------------------------------------------------\n              ===== Example File Info ===== \nFileSize           : 168M\nPlayTime           : 00:21:48.725\nVideoCount         : 1\nAudioCount         : 1\n              ===== Video Info ===== \nVideo 0# Stream\nVideoCodec         : DX50\nVideoWidth         : 640 piexs\nVideoHeight        : 480 piexs\nVideoFrameRate     : 23.976fps\nVideoFrameCount    : 31378\nVideoBitRate       : 940658\n              ===== Audio Info ===== \nAudio 0# Stream\nAudioCodec         : MP3\nAudioBitRate       : 128000\nAudioChannels      : 2\nAudioSampleRate    : 48000\n--------------------------------------------------\n\nIMDB &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1213218/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1213218/&lt;/a&gt;\n\nHash\n64DC0B0F9B6A7A3E373D1052E14D0E0CC82B5360[/center]\n\n","torrent":{"xt":"urn:btih:64dc0b0f9b6a7a3e373d1052e14d0e0cc82b5360","amp;dn":"Batman+the+Brave+and+the+Bold+Seasn+2+complete%7BC_P%7D+UPDATE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64dc0b0f9b6a7a3e373d1052e14d0e0cc82b5360","infoHashBuffer":{"type":"Buffer","data":[100,220,11,15,155,106,122,62,55,61,16,82,225,77,14,12,200,43,83,96]},"announce":[],"urlList":[]}}