{"title":"Alan Bennett - Audio Books - MP3 - Slimoo","uid":5489683,"size":354162154,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:64f40015ea7e0d3c45316c67ea99d13487f1ab9b&amp;dn=Alan+Bennett+-+Audio+Books+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":27,"time":1270919210,"description":"Alan Bennett's - Audio Books - BBC Radio 7 via DVB-T\n27 x 15 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\nMr. and Mrs. Ransome live a very quiet life. Apparently they have no friends, no family to speak of and each day is like the last. \n All changes one evening while they are attending the opera, mozart of course. \nThey return to find their flat completely stripped of absolutely everything. \nWhat would happen if you came home to find your house completely empty.\nEvery piece of furniture, every picture, every physical memory of your life was gone? \nThe Clothes the Stood Up In, explores the stress of loss and the chance of rebirth\n\nAlan Bennett's - The Clothes They Stood Up In - 01 of 07 \nAlan Bennett's - The Clothes They Stood Up In - 02 of 07 \nAlan Bennett's - The Clothes They Stood Up In - 03 of 07 \nAlan Bennett's - The Clothes They Stood Up In - 04 of 07 \nAlan Bennett's - The Clothes They Stood Up In - 05 of 07 \nAlan Bennett's - The Clothes They Stood Up In - 06 of 07 \nAlan Bennett's - The Clothes They Stood Up In - 07 of 07 \n\n____________________________________________________________\n\n\n\nAlan Bennett's - Telling Tales - S01 - E01 - A Strip Of Blue \nAlan Bennett's - Telling Tales - S01 - E02 - Our War \nAlan Bennett's - Telling Tales - S01 - E03 - An Ideal Home \nAlan Bennett's - Telling Tales - S01 - E04 - A Shy Butcher \nAlan Bennett's - Telling Tales - S01 - E05 - Days Out \nAlan Bennett's - Telling Tales - S01 - E06 - Proper Names \nAlan Bennett's - Telling Tales - S01 - E07 - Eating Out \nAlan Bennett's - Telling Tales - S01 - E08 - Aunt Eveline \nAlan Bennett's - Telling Tales - S01 - E09 - Unsaid Prayers \nAlan Bennett's - Telling Tales - S01 - E10 - No Mean City \n\n\nAlan Bennett's - Untold Stories - S01 - E01 - Wanting To Go Unnoticed \nAlan Bennett's - Untold Stories - S01 - E02 - Dad \nAlan Bennett's - Untold Stories - S01 - E03 - Aunty Myra \nAlan Bennett's - Untold Stories - S01 - E04 - Aunty Kathleen \nAlan Bennett's - Untold Stories - S01 - E05 - Mam \n\n\nAlan Bennett's - More Untold Stories  - S01 - E01 - Thora Hird \nAlan Bennett's - More Untold Stories  - S01 - E02 - Arise Sir \nAlan Bennett's - More Untold Stories  - S01 - E03 - Seeing Stars \nAlan Bennett's - More Untold Stories  - S01 - E04 - A Common Assault \nAlan Bennett's - More Untold Stories  - S01 - E05 - Staring Out Of The Window \n\n\n\n\n.\n\nAudio Format    : MP3\nDuration        : 13mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[b]A number of people are posting my torrents on other trackers.\nI have no problem with that - (Not much need as I already do this) - But a name check would be nice\nI was the one who spent weeks,months,years recording them[/b]\n\n.","torrent":{"xt":"urn:btih:64f40015ea7e0d3c45316c67ea99d13487f1ab9b","amp;dn":"Alan+Bennett+-+Audio+Books+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64f40015ea7e0d3c45316c67ea99d13487f1ab9b","infoHashBuffer":{"type":"Buffer","data":[100,244,0,21,234,126,13,60,69,49,108,103,234,153,209,52,135,241,171,155]},"announce":[],"urlList":[]}}