{"title":"Two and a Half Men, TVSeries (divx), S04E17-20, NL Subs, DMT","uid":6143912,"size":1021045830,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6522166191da4c8fa58ddc56eb84a8d78145d24d&amp;dn=Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S04E17-20%2C+NL+Subs%2C+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MeMar","files":-1,"time":1296598570,"description":"Two and a Half Men, TVSeries (divx), S04E17-20, NL Subs, DMT\n\n\nVerenigde Staten\nCategorie: Beeld\nFormaat: DivX\nOndertitels (ingebakken): Nederlands\nGenre: Sitcom\nBron: Retail\nDuur: ongeveer 20 minuten per aflevering\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0369179/episodes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0369179/episodes&lt;/a&gt; &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&lt;/a&gt;\n\nDe hoofdrollen worden vertolkt door Charlie Sheen, Jon Cryer en Angus T. Jones.\n\nHet begint met een man alleen (Alan gaat scheiden... alweer) en eindigt met een glimmende steen \n(de diamant die Evelyns nieuwe vriend aan de derde vinger van haar linkerhand wil schuiven). In de \ntussentijd is het hippe strandhuis van Charlie Harper in Malibu de perfecte plek voor grappen, mooie \nmeisjes, een eenoudergezin, beroemde buren, familie en nog meer grappen. Charlie (Charlie Sheen) \nkomt dicht in de buurt bij zijn al lang overleden vader. Alan (Jon Cryer) begint met online dating \nnadat hij zijn cv een beetje heeft opgeleukt. Jake (Angus T. Jones) vervangt zijn Harry Potter-posters \ndoor plaatjes van mooie meiden.\n\n\nAflevering 17: I Merely Slept with a Commie\nNadat Alan en Charlie hun moeder eindelijk durven vertellen dat ze een rotkarakter heeft en dat \nniemand een traan zal laten op haar begrafenis, worden ze enkele weken lang door Evelyn \ngenegeerd. Toch besluiten ze haar te bezoeken op haar verjaardag. Maar dan ontdekken ze dat \nEvelyn zich omringd heeft door een nieuwe groep vrienden, die opvallend veel gelijkenissen vertonen \nmet hen. Het enige verschil is dat die wel helemaal dol zijn op Evelyn\n\nAflevering 18: It Never Rains in Hooterville\nWanneer Alan merkt dat Jake zijn kamer heringericht heeft met posters van schaars geklede dames, \nbeseft hij dat zijn zoon stilaan volwassen wordt. Daar heeft hij het bijzonder moeilijk mee. Er zijn \nimmers zoveel dingen die ze nog niet samen hebben gedaan. Alan besluit zijn schade in te halen en \ngaat samen met Jake kamperen. Ondertussen waagt Kandi haar kans als actrice.\n\nAflevering 19: Smooth as a Ken Doll\nNu Judith op het punt staat een tweede keer in het huwelijksbootje te stappen, schrijft Alan zijn \nlaatste alimentatiecheque uit. Hij denkt voorgoed verlost te zijn van zijn ex-vrouw, maar dan duiken \ner plots problemen op tussen Judith en haar toekomstige echtgenoot Herb. De komst van Herbs zus \nMyra zit daar voor iets tussen. Zij blijkt immers een bloedhekel aan Judith te hebben.\n\nAflevering 20: Aunt Myra Doesn't Pee a Lot\nMyra nodigt Charlie uit om haar te vergezellen naar Judith en Herbs huwelijk. Alan vindt dit plan \nmaar niks : telkens Charlie iets begint met een vrouw die familie is van zijn ex, komen er problemen \nvan. Ook Judith voelt maar weinig voor de aanwezigheid van haar ex-schoonbroer. Maar het \nverliefde koppel houdt het been stijf : ze gaan samen naar het feest. Daar wacht Charlie echter een \nverrassing\n\n\nDeze serie wordt u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:6522166191da4c8fa58ddc56eb84a8d78145d24d","amp;dn":"Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S04E17-20%2C+NL+Subs%2C+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6522166191da4c8fa58ddc56eb84a8d78145d24d","infoHashBuffer":{"type":"Buffer","data":[101,34,22,97,145,218,76,143,165,141,220,86,235,132,168,215,129,69,210,77]},"announce":[],"urlList":[]}}