{"title":"Cyber Update Mar.2011------US -12255 Darling, Isis Love, Dia Z","uid":6294168,"size":780560001,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:668e94f7fbe9c057246f6561f75dc4522af5a4a1&amp;dn=Cyber+Update+Mar.2011------US+-12255+Darling%2C+Isis+Love%2C+Dia+Z&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":472,"time":1301936187,"description":"From Kink.com       (Ultimatesurrender) + Pics\n\n\n\nCyber Update Mar.2011\\US -12255 Darling, Isis Love, Dia Zerva, Allie Haze and Iona Grace\n\nWelcome to the first match of the NEW 2011 Tag Team League. All new teams, all new rivalries. Each team will face off once against each other, and the top three teams will make the playoffs. Totally non-scripted, all in front of a live audience, all broadcast live to members.\n\nThe Team Ice franchise was last year's Tag Team Champions!. With new members Darling and Iona Grace on board, Team Ice is hoping to repeat last year's success. Darling is a 6 season veteran with a lifetime record of (18-5). Iona Grace is one of the better rookies this season. If nothing else, this team has the biggest tits on the mat. \n\nThe Goddesses franchise was last year's basement dwellers, they never won a single match. With new members Dia Zerva and Allie Haze, things might be a little different this year. Dia is a 4 season veteran and last year's Ultimate Surrender Champion with a lifetime record of (10-1). Allie Haze is a first year rookie who already as veteran skills.\n\nLast year's Champion franchise was dominated, destroyed and fucked on the mat. It was one of the worst defeats in the history of the league. The Goddesses opened a huge can of whip ass on the defending champs and humiliated them in from of the live audience. After they got done kicking their ass on the mat, they fucked the losers brutally and without mercy in RD4. Team Ice was left cumming and moaning like common whores as The Goddesses celebrated their first victory in the new season! \n\n\n\nScreens &lt;a href=&quot; http://www.ultimatesurrender.com/site/shoot.jsp?shootId=12255&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.ultimatesurrender.com/site/shoot.jsp?shootId=12255&lt;/a&gt;\n\n\n\nCheerz  :-)","torrent":{"xt":"urn:btih:668e94f7fbe9c057246f6561f75dc4522af5a4a1","amp;dn":"Cyber+Update+Mar.2011------US+-12255+Darling%2C+Isis+Love%2C+Dia+Z","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"668e94f7fbe9c057246f6561f75dc4522af5a4a1","infoHashBuffer":{"type":"Buffer","data":[102,142,148,247,251,233,192,87,36,111,101,97,247,93,196,82,42,245,164,161]},"announce":[],"urlList":[]}}