{"title":"Jessye Norman - The Jessye Norman Collection 2CD  FLAC","uid":5517884,"size":504614345,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:669c61b377c1e4ffdd8ae2d407068645b7537acb&amp;dn=Jessye+Norman+-+The+Jessye+Norman+Collection+2CD++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"keeybee","files":40,"time":1272336564,"description":"Please seed!\n\nJessye Norman (born September 15, 1945) is an American opera singer. Norman is one of the most admired contemporary opera singers and recitalists, and is one of the highest paid performers in classical music. A true dramatic soprano with a majestic stage presence, Norman is associated in particular with the roles of AÃƒÂ¯da, Cassandre, Alceste, and Leonora. Norman is known for the direct and emotionally expressive qualities of her singing and for her formidable intellectual understanding of the music and its style, as well as first-rate\nmusicianship. As a performer, she is known for her magnetic and dramatic personality, and, with her imposing physical presence, cuts an impressive figure before audiences. (Wiki).  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Jessye_Norman&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Jessye_Norman&lt;/a&gt;\n\nAudio CD (October 25, 1990) \nSPARS Code: ADD \nNumber of Discs: 2 \nLabel: Philips\n\nJessye Norman - Jessye Norman Collection - Her Greatest Performances in Opera &amp; Song\n[Disc 1]\n\n01  All the Things You Are, song (from &quot;Very Warm for May&quot;) - Jessye Norman, Boston Pops Orchestra; Oscar II Hammerstein and John Williams\n02  Spring Is Here, song (from &quot;Spring Is Here&quot;)  - Jessye Norman, Boston Pops Orchestra; John Williams\n03  Love Is Here To Stay, song (from The Goldwyn Follies, film)  - Jessye Norman, piano; John Williams\n04  In the still of the night, song (from &quot;Rosalie&quot;)  - Jessye Norman, Boston Pops Orchestra; John Williams\n05  With a Song in My Heart, song (from musical &quot;Spring Is Here&quot;)  - Jessye Norman, Boston Pops Orchestra; John Williams\n06  Ellens Gesang III (&quot;Ave Maria&quot;), song for voice &amp; piano, D. 839 (Op. 52/6)  - Jessye Norman, Royal Philaharmonic Orchestra and Ambrosian Singers; Alexander Gibson\n07  Amazing Grace - Jessye Norman, Royal Philaharmonic Orchestra; Alexander Gibson\n08  Greensleeves, English folk song  - Jessye Norman, Royal Philaharmonic Orchestra and Ambrosian Singers; Alexander Gibson\n09  The Holy City, sacred ballad for voice &amp; piano (or orchestra and chorus, ad lib)  - Jessye Norman, Royal Philaharmonic Orchestra; Alexander Gibson\n10  Panis angelicus for tenor, organ, harp, cello &amp; bass  - Jessye Norman, Royal Philaharmonic Orchestra and Ambrosian Singers; Alexander Gibson\n11  Messe solennelle de Sainte CÃƒÂ©cile for soloists, chorus, orchestra &amp; organ in G major Sanctus  - Jessye Norman, Royal Philaharmonic Orchestra and Ambrosian Singers; Alexander Gibson\n12  There Is A Man Going Round  - Jessye Norman, William Patterson\n13  Give Me Jesus - Jessye Norman, Ambrosian Singers; William Patterson\n14  Couldn't Hear Nobody Pray - Jessye Norman, Ambrosian Singers; William Patterson\n15  Do Lawd, Oh Do Lawd - Jessye Norman, Ambrosian Singers; William Patterson\n16  Gospel Train, spiritual  - Jessye Norman, Dalton Baldwin; William Patterson\n17  He's Got the Whole World in His Hands - Jessye Norman, piano; Geoffrey Parsons\n\nJessye Norman - Jessye Norman Collection - Her Greatest Performances in Opera &amp; Song\n[Disc 2]\n\n01  Le nozze di Figaro (The Marriage of Figaro), opera, K. 492 Porgi, Amor  - Jessye Norman, BBC Symphony Orchestra; Sir Colin Davis\n02  Le nozze di Figaro (The Marriage of Figaro), opera, K. 492 Dove Sono I Bei Momenti  - Jessye Norman, BBC Symphony Orchestra; Sir Colin Davis\n03  Zueignung (&quot;Ja, du weisst es, teur Seele&quot;), song for voice &amp; piano (or orchestra), Op. 10/1 (TrV 141/1)  - Jessye Norman, Leipzig Gewandhaus Orchestra ; Kurt Masur\n04  Ariadne auf Naxos, opera, Op. 60-II (TrV 228a) (revised version) Es Gibt Ein Reich  - Jessye Norman, Leipzig Gewandhaus Orchestra ; Kurt Masur\n05  Ariadne auf Naxos, opera, Op. 60-II (TrV 228a) (revised version) FrÃƒÂ¼hling  - Jessye Norman, Leipzig Gewandhaus Orchestra ; Kurt Masur\n06  Schlechtes Wetter (&quot;Das ist ein schlechtes Wetter&quot;), song for voice &amp; piano, Op. 69/5 (TrV 237/5)  - Jessye Norman, piano; Geoffrey Parsons \n07  Thy hand, Belinda...When I am laid in Earth (from &quot;Dido and Aeneas&quot;), soprano aria, Z. 626/37 Dido Lament: When I'm Laid in Earth  - Jessye Norman, English Chamber Orchestra; Raymond Leppard\n08  Le Spectre de la rose, song for voice &amp; piano or orchestra, (Les Nuits d'ÃƒÂ©tÃƒÂ©), H. 83 (Op. 7/2)  - Jessye Norman, London Symphony Orchestra; Sir Colin Davis\n09  Gretchen am Spinnrade (&quot;Meine Ruh'...&quot;), song for voice &amp; piano, D. 118 (Op. 2)  - Jessye Norman, piano; Phillip Moll\n10  L'invitation au voyage (&quot;Mon enfant, ma soeur&quot;), song for voice &amp; piano (or orchestra)  - Jessye Norman, piano; Dalton Baldwin\n11  Je te veux (I Want You), cafÃƒÂ©-concert song for voice &amp; piano  - Jessye Norman, piano; Dalton Baldwin\n12  Les chemins de l'amour (&quot;Les chemins qui vont&quot;), for voice &amp; piano (or orchestra), FP 106  - Jessye Norman, piano; Dalton Baldwin\n13  Tristan und Isolde, opera, WWV 90 Isoldes Liebestod  - Jessye Norman, London Symphony Orchestra; Sir Colin Davis\n\n &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=43:20824&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=43:20824&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:669c61b377c1e4ffdd8ae2d407068645b7537acb","amp;dn":"Jessye+Norman+-+The+Jessye+Norman+Collection+2CD++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"669c61b377c1e4ffdd8ae2d407068645b7537acb","infoHashBuffer":{"type":"Buffer","data":[102,156,97,179,119,193,228,255,221,138,226,212,7,6,134,69,183,83,122,203]},"announce":[],"urlList":[]}}