{"title":"Smarty Uninstaller 2009 Pro 2.5.2-serial incl","uid":5063748,"size":4406143,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:67825260cea8580e490b0b666a507a1e191a1b31&amp;dn=Smarty+Uninstaller+2009+Pro+2.5.2-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jmb2012","files":2,"time":1250831181,"description":"Smarty Uninstaller 2009 Pro\n\nSmarty Uninstaller is a uninstaller with intuitive and easy to use interface that allows you to manage and completely remove WindowsÃ‚Â® applications.\n\nAt most cases Windows applications are very complicated. They put a large number of traces on your system. Especially, such things as entries in Windows Registry, Program Files and Shortcuts. In general the problem lies in the Uninstaller (simply, an uninstaller is the opposite of an installer. During the uninstall process, uninstaller removes all the components which were installed) that can't properly remove all traces in Windows. Also, some users simply don't use the Uninstaller. They just delete the application's program files from the hard drive. Other traces still stays untouched. Large amount of junk traces will make your PC much slower.\n\nSmarty Uninstaller will help you to avoid all these problems and much more.\n\n\nSmarty Uninstall - COMPLETELY removes applications from your PC (all files, shortcuts and registry entries)\n\nSmarty Analyzer will deeply scan your computer for traces left by selected application.\n\nSmarty UI - easy to use and modern user interface allows to comfortably work with Smarty Uninstaller!\n\nSmarty Cache - makes Smarty Uninstaller very fast and reliable. Much faster solution than regular Windows Add/Remove.\n\nSmarty Protection feature - this feature will protect critical system components. You will not be able to delete system files accidentally or in any other way.\n\nSmarty Startup - tool for managing Windows startup items with easy and intuitive user interface.\n\nSmarty Secure Delete - will overwrite the found files with random characters to ensure that nobody will ever be able to recover these files from your disk.\n\nSmarty Groups - allow you to organize applications list into logical groupings. This will make your work more flexible and organized.\n\nSmarty Drag-Drop - uninstall applications using drag-drop and context menu! Just  drop application's icon to the Smarty  Uninstaller icon on the desktop. Or choose appropriate command in context menu (Right mouse click).\n\nSmarty Reports - Create and Print detailed reports about installed applications.\n\nCreate a queue of applications for analyzing or uninstalling (you can select more than one application at same time)\n\nForce uninstalling applications with broken uninstaller! Complete uninstall.\n\nAutomatically detects invalid installations and gives ways to fix.\n\nVersion: 2.5.2\n\nSize: 4 MB\n\nSupported operating systems: Windows XP (32-bit/64-bit)/Vista (32-bit/64-bit)/2008/2003/2000/Me/98/7\n","torrent":{"xt":"urn:btih:67825260cea8580e490b0b666a507a1e191a1b31","amp;dn":"Smarty+Uninstaller+2009+Pro+2.5.2-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67825260cea8580e490b0b666a507a1e191a1b31","infoHashBuffer":{"type":"Buffer","data":[103,130,82,96,206,168,88,14,73,11,11,102,106,80,122,30,25,26,27,49]},"announce":[],"urlList":[]}}