{"title":"Jazz JackRabbit 2 For Mac OS 9 and Mac OS X","uid":5063967,"size":69522432,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:6791ec3f01401d9bd1b14da6583ab23c2068e2de&amp;dn=Jazz+JackRabbit+2+For+Mac+OS+9+and+Mac+OS+X&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bigjake52","files":-1,"time":1250844044,"description":"Jazz Jackrabbit 2 is a platform game produced by Epic MegaGames, now known as Epic Games..\n\nJazz has to chase Devan Shell through time, in order to retrieve the ring with which he planned to wed Eva. Jazz's brother, Spaz, are introduced as playable characters. The game features multiplayer options, including the ability to play over a LAN or the Internet.\n\nSpaz originally appeared (as a background object) in the previous Jazz installment Holiday Hare '95. Jazz and Spaz have different death animations. Jazz simply falls on his back, dazed. Spaz burps and explodes, leaving only his boots. They each have a unique special move of their own, and Spaz has also a second jump as opposed to Jazz' propeller ears.\n\nIt Runs on \nany Mac system that can Run Mac OS 9 or Mac OS X 10.0-10.5\nI have it running on my Imac g3 (mac OS 9.2.2 Mac OSX 10.4.11)\nAlso it works on my Intell mac book (Mac OS X 10.5.8)\n\n\nTo Install just make a folder and drag the contents to that folder and run Jazz Jackrabbit OSX on OS X system and Jazz Jackrabbit for mac OS 9 system \n\nThis game was wrote in carbon and it is the full verson\n\n\nIf you got any problems email me at mycatisbigfoot  AT me DOT com \n\n\n\n","torrent":{"xt":"urn:btih:6791ec3f01401d9bd1b14da6583ab23c2068e2de","amp;dn":"Jazz+JackRabbit+2+For+Mac+OS+9+and+Mac+OS+X","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6791ec3f01401d9bd1b14da6583ab23c2068e2de","infoHashBuffer":{"type":"Buffer","data":[103,145,236,63,1,64,29,155,209,177,77,166,88,58,178,60,32,104,226,222]},"announce":[],"urlList":[]}}