{"title":"DVD KidsCrew Disney/Pixar Deel 1(disney) (dutch) 2Lions-Team","uid":5039957,"size":4144459695,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:67967aad9ee5b8cbb836984c76ad8119114646a6&amp;dn=DVD+KidsCrew+Disney%2FPixar+Deel+1%28disney%29+%28dutch%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1249324581,"description":"DVD KidsCrew Disney/Pixar Deel 1 - 9\n\n\nAssepoester\n\nVerenigde Staten\nAnimatie / Muziek\n74 minuten\n\ngeregisseerd door Clyde Geronimi, Wilfred Jackson en Hamilton Luske\nmet de stemmen van Illene Woods, Eleanor Audley en Verna Felton\n\nCinderella is de geadopteerde dochter van een vrouw van hoge afkomst.\nZe wordt als slaaf behandeld in haar eigen huis. Terwijl haar moeder\nen haar slechte stiefzusters naar een groot bal zijn krijgt ze een\nverrassend bezoek van een vriend. Disney versie van het bekende sprookje.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/1552&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/1552&lt;/a&gt;\n\n\nFinding nemo\n\nVerenigde Staten\nAvontuur / Animatie\n100 minuten\n\ngeregisseerd door Andrew Stanton en Lee Unkrich\nmet de stemmen van Albert Brooks, Ellen DeGeneres en Willem Dafoe\n\nDe clownvis Marlin leidt samen met zijn enige zoon Nemo een veilig leventje\nin het Great Barrier Reef bij Australid. Wanneer Nemo onverwachts weggehaald\nwordt van zijn thuis, en in het aquarium van een tandarts belandt, is het\naan Marlin om hem te redden. Hij krijgt hierbij hulp van Dory, de vis met het\nslechtste korte termijn geheugen en het grootste hart van de hele oceaan.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/3437&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/3437&lt;/a&gt;\n\n\nPinokkio\n\nVerenigde Staten\nAnimatie / Familie\n88 minuten\n\ngeregisseerd door Hamilton Luske en Ben Sharpsteen\nmet de stemmen van Dickie Jones, Cliff Edwards en Walter Catlett\n\nGepetto maakt een houten pop, en noemt 'm Pinocchio. Zijn wens dat Pinocchio\neen echt jongetje zal zijn wordt door een fee waarheid gemaakt. Ze wijst de\nkrekel Jimmy aan om als Pinocchio's geweten op te treden, en hem uit de prob-\nlemen te houden. Hij is hier echter niet echt succesvol in. Disneyversie van\nCarlo Collodi's beroemde verhaal.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/1576&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/1576&lt;/a&gt;\n\n\nSneeuwwitje\n\nVerenigde Staten\nAnimatie / Muziek\n82 minuten\n\ngeregisseerd door David Hand\nmet de stemmen van Adriana Caselotti, Harry Stockwell en Eddie Collins\n\nEen jaloerse koningin probeert haar mooie stiefdochter Snow White kwijt te raken.\nZe huurt een jager in om haar te vermoorden, maar hij kan het niet over z'n hart\nverkrijgen om haar ook echt te doden. Ze besluit te schuilen bij zeven dwergen in\nhun huis in de bossen. De koningin neemt hier geen genoegen mee en probeert haar\nstiefdochter alsnog om te brengen.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/1351&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/1351&lt;/a&gt;\n\n\n\nBrother Bear\n\nVerenigde Staten\nAnimatie / Familie\n85 minuten\n\ngeregisseerd door Aaron Blaise en Robert Walker\nmet de stemmen van Joaquin Phoenix, Jeremy Suarez en Rick Moranis\n\nLang, heel lang geleden, aan het einde van de ijstijd waren er eens drie broers.\nToen de oudste gedood werd tijdens de jacht op een beer, nam de jongste, Kenai,\nwraak op dit dier. Voor straf veranderden de Goden hem zelf in een beer. Kenai\nleert de dierenwereld nu op een heel andere manier kennen en raakt bevriend met\nhet jonge grizzly beertje Koda, die hem leert wat de echte betekenis van broeder-\nschap is.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/9619&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/9619&lt;/a&gt;\n\n\n\nAlle films zijn van sublieme kwalteit en hebben allen Nederlandse audio.\n\n\n\nCategorie : Beeld\nFormaat : DVD5\nBron : Retail\n\nOndertitels : Geen\n\nGenre : Animatie\n\n\nIn deze fantastische collectie zijn de volgende films megenomen:\n\nAssepoester, Finding Nemo, Pinokkio, Sneeuwwitje, Brother Bear, Bambi, Pocahontas, De reddertjes, De Kleine Zeemeermin, Lion King, Belle en het Beest, De Klokkenluider van de Notre Dame, Mulan, Hercules, The Incredibles, Dombo, Fantasia, Peter Pan, Piratenplaneet, Taran en de Toverketel, 101 Dalmatiers, Aladin, Frank en Frey, Ichabod en Meneer Pad, Paniek op de Prairie, Dinosaur, Pooh's Lolifanten Film, Monster en Co, Lady en de Vagebond, Vrij en Vrolijk, Cars, Chicken Little, Robin Hood, Tarzan, Atlantis, Bee Movie, Jungle Boek, Toy Story, Meet the Robinsons, Teigetjes Film, Fantasia 2000, Een Luizenleven, Keizer Kuzco, Ratatouille, The Wild.\n\nThanks: CoolKidWeb\n\n\n\n*****************************************\n\nBrought to you by\nPioen\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum\n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n******************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\nDon`t quit after you finished the download, but keep seeding.","torrent":{"xt":"urn:btih:67967aad9ee5b8cbb836984c76ad8119114646a6","amp;dn":"DVD+KidsCrew+Disney%2FPixar+Deel+1%28disney%29+%28dutch%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67967aad9ee5b8cbb836984c76ad8119114646a6","infoHashBuffer":{"type":"Buffer","data":[103,150,122,173,158,229,184,203,184,54,152,76,118,173,129,25,17,70,70,166]},"announce":[],"urlList":[]}}