{"title":"Grand.Theft.Auto.IV.Episodes.From.Liberty.City.2010.MULTi.Repack","uid":5502490,"size":9232558029,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6799e650ca14fa868a10535f22cc0b89c35dd7cb&amp;dn=Grand.Theft.Auto.IV.Episodes.From.Liberty.City.2010.MULTi.Repack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"xtracrossxx","files":5,"time":1271622018,"description":"Title: Grand Theft Auto IV: Episodes From Liberty City\nReleased: 2010\nGenre: Action / 3D / 3rd Person\nDeveloper: Rokstar North\nPublisher: Rokstar Games\nPublication Type: Repack\nlanguage voice set / Interface: EN / GE / FR / SP / IT\n\nAbout the game:\nNot one Grand Theft Auto IV (GTA 4) left untouched. A fascinating story, serious themes, vivid characters, realistic city and an abundance of opportunities - without a doubt, the game was the most shocking of all parts of the series.\nGrand Theft Auto: Liberty City Episodes from - these are two full games, combined on one disc. The action takes place in the same Liberty City. You will meet with familiar characters (including the protagonist Grand Theft Auto IV), walks along the well-known streets and all the same variety and exciting gameplay\n\nFeatures:\nNew impressions of Grand Theft Auto IV. With two additions, previously available only to Xbox Live, you will discover new facets of this great game - the cruelty of streets and mock glamor club life.\nSingle plot. Stories Niko Bellic from the original game, as well as Johnny Klebitsa and Luis Lopez of the new episodes are unique and at the same time connected with each other. Just before the end of his way each character, you get a full picture of the enormous network of intrigues, enveloped in Liberty City.\nAdditional transport. Each episode adds to fleet game. At your disposal will be the new motorcycles, luxury cars, and even special equipment, including helicopter gunships and armored personnel carriers. And do not forget about the long-awaited parachuting!\nAdvanced arsenal. The new edge, a grenade launcher, advanced sniper rifle, sticky bombs - these and other kinds of weapons will add to your arsenal as a single, and in the collective game.\nCollective battle. The Lost and Damned and The Ballad of Gay Tony added in GTA IV new kinds of collective game.\nMusic and TV! New TV shows and songs on the radio diversify your leisure time in Liberty City.\n\nFeatures repack:\nDo not cut\nTV is compressed by 60% / 20 FPS\nInstallation time: half hour free of extraneous requests disk\n\nSystem Requirements:\nOperating system: Windows XP / Vista / Windows 7\nProcessor: Intel Core 2 Duo 2.8 GHz or AMD Athlon X2 Dual-Core 5200 +\nMemory: 2 GB (3 GB for Vista)\nVideo Card: compatible with Direct X 9.0c, 512 MB\nfree hard drive space: 16 GB\n\nHow do I save the game\n1. Start the game.\n2. In the menu, press a key Home.\n3. On top is lowered window, Press &quot;Create a new profile.\n4. Now we choose, to create autonomous profile.\n5. Enter any name in English. and click Send.\n6. Now click Finish. You can pre-configure your profile if you wish.\n\nInstallation:\n1. Mount\n2. Set\n3. Play\nThe game does not have the crack included, just download a crack,appy it then install and play!:D\n\ncomment,seed and enjoy!\n","torrent":{"xt":"urn:btih:6799e650ca14fa868a10535f22cc0b89c35dd7cb","amp;dn":"Grand.Theft.Auto.IV.Episodes.From.Liberty.City.2010.MULTi.Repack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6799e650ca14fa868a10535f22cc0b89c35dd7cb","infoHashBuffer":{"type":"Buffer","data":[103,153,230,80,202,20,250,134,138,16,83,95,34,204,11,137,195,93,215,203]},"announce":[],"urlList":[]}}