{"title":"Cold Feet - Seizoen 4 (2 DVD's) Juultje TBS","uid":6135991,"size":9362297845,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:67afe8046734c979c42bd4150641e74e92ba7e7f&amp;dn=Cold+Feet+-+Seizoen+4+%282+DVD%5C%27s%29+Juultje+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"juutje","files":-1,"time":1296306004,"description":"\n\nCold Feet - Seizoen 4 (2 DVD's)\n\n\nDe toekomst is onzeker voor de drie stellen in Mike Bullen\\'s relaas over het leven van dertigplussers. Adam en Rachel hebben een grote kinderwens en worstelen met strikte adoptieprocedures. Rachel weet echter niet dat Adams eerste liefde speciaal naar Manchester verhuisd is om hem terug te winnen. David gooit alles in de strijd om zijn huwelijk te redden, nadat zijn escapade met Jessica bekend is geworden. Maar Karen is niet gevoelig voor zijn inspanningen en haar drankprobleem begint uit de hand te lopen. Haar editor Mark Sean Pertwee is de redder in nood en geeft Karen nieuwe hoop. Ramona vindt de sfeer thuis ondraaglijk en gaat op zoek naar nieuwe \\'carriÃƒÂ¨remogelijkheden\\'. Jenny vertrekt naar New York en Pete is weer alleen. Maar als Rachels oogverblindende vriendin uit AustraliÃƒÂ« Kimberley Joseph een kamer bij hem huurt, voelt hij zich al een stuk minder eenzaam. Na veel geflirt over en weer lukt het Pete uiteindelijk Jo, de vrouw van zijn dormen, voor zich te winnen. Maar Pete\\'s onzekerheid staat een normale relatie in de weg en als Jo terug naar AustraliÃƒÂ« gaat, kan Pete niets anders doen dan haar achterna te reizen om zijn droomvrouw terug te winnen.\n\n\nAlle afleveringen uit het vierde seizoen van de Engelse succes-serie Cold Feet. 432 Minuten lang inclusief erg leuk 'behind the scenes' materiaal.\n\n\nEnglish\n\nJenny and Pete await the birth of their second child but Jenny rethinks her current lifestyle after she miscarries. She decides to take a job in New York in Episode 2 and leaves with little Adam. Pete is unhappy for a time but begins a relationship with Jo Ellison, a friend of Rachel's. The relationship goes well until Jo has to return to Australia after her visa expires. Pete follows her and declares his love and they get married in Episode 8. Karen and David are sleeping in separate beds until she decides he should move out. He moves into Pete's spare bedroom and starts seeing a therapist (Michael Troughton). Karen develops alcoholism and decides to seek therapy too. She and David reconcile and he moves back in. Soon, she starts an affair with a publisher, Mark (Sean Pertwee), which is revealed to David in Episode 8. Having had enough of the lies, he leaves Karen. Adam and Rachel decide to adopt a child and begin going through the procedures. They are pleased when they later discover that Rachel is pregnant but are distraught when their social worker tells them that the adoption cannot proceed. In Australia for Pete and Jo's wedding, Rachel goes into premature labour and gives birth to a boy.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0168596/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0168596/&lt;/a&gt;\n\n\nVideo: DVD Rip Retail\nAudio: AC  3 . 2 English\nSubs: Dutch\nMenu: Yes\nID : 224 (0xE0)\nFormaat: MPEG Video\nFormaatversie: Version 2\nBitrate-modus : Variabel\nBreedte: 720 pixels\nHoogte: 576 pixels\nBeeldverhouding: 4:3\nFramerate: 25,000 fps\nStandaard: PAL\nCover+Label: Yes\n\n\n\nEnjoy The Serie\n","torrent":{"xt":"urn:btih:67afe8046734c979c42bd4150641e74e92ba7e7f","amp;dn":"Cold+Feet+-+Seizoen+4+%282+DVD%5C%27s%29+Juultje+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67afe8046734c979c42bd4150641e74e92ba7e7f","infoHashBuffer":{"type":"Buffer","data":[103,175,232,4,103,52,201,121,196,43,212,21,6,65,231,78,146,186,126,127]},"announce":[],"urlList":[]}}