{"title":"Lily.Allen.Alright.Still(FLAC)","uid":5014042,"size":313968035,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:67cf15f01b817c61b7efcf4889161ae2c51a2b43&amp;dn=Lily.Allen.Alright.Still%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eGaTS","files":20,"time":1248131479,"description":"Lily.Allen.Alright.Still(FLAC)\n\nLike most British pop, Lily Allen's debut album, Alright, Still, overflows with impeccably shiny, creative productions. However, Allen attempts to set herself apart from the likes of Rachel Stevens, Natasha Bedingfield, and Girls Aloud with a cheeky, (mostly) amusing vindictive streak in her lyrics that belies the sugarcoated sounds around them. You know exactly what she means when she says her ex is &quot;not big whatsoever&quot; on &quot;Not Big&quot;; later, she revels in being the one that got away on &quot;Shame for You.&quot; However, this nice-then-naughty approach is at its best on Alright, Still's singles, which open the album in a one-two-three punch. Another ex-boyfriend kiss-off, &quot;Smile,&quot; has a silky verse melody that just barely conceals her spite, which finally spills over on the chorus: &quot;At first, when I see you cry/It makes me smile.&quot; But even here, Allen keeps her revenge sweet -- she sounds like she's singing about how ice cream or puppies or being in love makes her smile, which gives the song an extra sting. &quot;Knock 'Em Out&quot; is an even sassier, more stylized battle of the sexes than the Streets' &quot;Fit But You Know It&quot; (and could very well be the response from the girl in Mike Skinner's song). And &quot;LDN&quot; is a glorious summer confection, even if &quot;it's all lies&quot; underneath the Lord Kitchener sample and &quot;sun is in the sky&quot; chorus. Alright, Still's production and arrangements, courtesy of Greg Kurstin, Mark Ronson, and Futurecut, balance Allen's tart observations with a backdrop of pop-grime beats and freewheeling, feel-good ska that makes her sound playful and kittenish instead of just catty. While the album doesn't exactly go downhill after its opening salvo, it does lose some steam, particularly with &quot;Take What You Take,&quot; a song that feels out of character with the rest of Alright, Still because it's uncharacteristically dull, and &quot;Alfie,&quot; which falls especially flat as the album's final song. Allen softens her tough-girl pose more successfully on &quot;Little Things,&quot; a ballad that celebrates the mundane moments of a dying relationship (&quot;You'd take me out shopping and all we'd buy was trainers/As if we ever needed anything to entertain us&quot;) and &quot;Everything's Just Wonderful,&quot; where &quot;bureaucrats that won't give me a mortgage&quot; are the targets of her ire instead of a previous (or soon-to-be previous) boyfriend. As with Nellie McKay (another young, opinionated woman eager to make herself the maverick in her chosen style of music), the dichotomy between Allen's sweet sound and ironic lyrics could be seen as either witty or clever-clever. Still, enough of Alright, Still works -- as pure pop and on the meta level Allen aims for -- to make the album a fun, summery fling, and maybe more. [The U.S. version of Alright, Still includes a remix of &quot;Smile&quot; and the 50 Cent parody &quot;Nan You're a Window Shopper&quot; as well as U-MYX software, which allows listeners to make their own remixes of &quot;Smile&quot; and &quot;Knock 'Em Out&quot; -- not an essential addition, but a surprisingly fun one nonetheless.] \n\n~ Heather Phares, All Music Guide\n\n01. Smile\n02. Knock Em Out\n03. LDN\n04. Everythings Just Wonderful\n05. Not Big\n06. Friday Night\n07. Shame for You\n08. Littlest Things\n09. Take What You Take\n10. Friend of Mine\n11. Alfie\n12. Nan Youre a Window Shopper\n13. Smile Version Revisited\n\nGenres:\nRock/Pop, \nRock\n\nOriginal Release Date:\nJanaury 30, 2007\n\nRecording type:\nStudio\n\nMono/Stereo:\nStereo\n\nLabel:\nCapitol / EMI Records\n\nProducer:\nGreg Kurstin\n\nPersonnel:\nJohn Ellis - keyboards\nMichael Rose - saxophone\nPaul Farr - guitar\nPaul Powell - drums\nEddie Thornton - trumpet\nJohn Waddington - bass instrument\nTrevor Edwards - trombone\nClive Hunte\nJonny Wimbolt-Lewis\nMark Nicholls\n\nPlease share and seed for sometime.. Thanks a million.. Enjoy.... :)\n","torrent":{"xt":"urn:btih:67cf15f01b817c61b7efcf4889161ae2c51a2b43","amp;dn":"Lily.Allen.Alright.Still%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67cf15f01b817c61b7efcf4889161ae2c51a2b43","infoHashBuffer":{"type":"Buffer","data":[103,207,21,240,27,129,124,97,183,239,207,72,137,22,26,226,197,26,43,67]},"announce":[],"urlList":[]}}