{"title":"Il colpo della metropolitana","uid":5064565,"size":739508224,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:686767c74d2f6b41b48c24776b0531baf3095746&amp;dn=Il+colpo+della+metropolitana&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Duracell72","files":1,"time":1250863253,"description":"Il colpo della metropolitana - Un ostaggio al minuto\n\nTitolo originale: The taking of Pelham One Two Three\nPaese: USA\nAnno: 1974\nDurata: 104'\nColore: colore\nGenere: crimine, thriller, drammatico\nRegia: Joseph Sargent\nSoggetto:\tJohn Godey (romanzo)\nSceneggiatura: Peter Stone\nFotografia: Enrique Bravo, Owen Roizman\nMontaggio: Gerald Greenberg, Robert Lovett\nMusiche:\tDavid Shire\nScenografia: Gene Rudolf\nProduttore: Gabriel Katzka, Edgar J. Scherick\n\nInterpreti e personaggi\n\nWalter Matthau: Tenente Zachary Garber\nRobert Shaw: Signor Blue \nMartin Balsam: Signor Green\nHector Elizondo: Signor Grey\nEarl Hindman: Signor Brown\nJames Broderick: Denny Doyle\nDick O'Neill: Frank Correll\nLee Wallace: Sindaco\nTom Pedi: Caz Dolowicz\nBeatrice Winde: Miss Jenkins\nJerry Stiller: Sergente Rico Patrone\nNathan George: Agente James\nRudy Bond: Poliziotto\nKenneth McMillan: Comandante di zona\nJulius W. Harris: Ispettore capo Daniels\nDoris Roberts: moglie del Sindaco\nTony Roberts: Vicesindaco Warren LaSalle\n\nPremi\n\nNominato al BAFTA Award del 1974 come miglior film.\n\nIl colpo della metropolitana - Un ostaggio al minuto ÃƒÂ¨ un film del 1974, diretto da Joseph Sargent. Il regista Sargent e il protagonista - Walter Matthau - erano entrambi reduci da grandi successi cinematografici: l'uno aveva girato nel '73 &quot;McKlusky, metÃƒÂ  uomo e metÃƒÂ  odio&quot;, mentre l'altro aveva partecipato al thriller di Don Siegel, &quot;Chi ucciderÃƒÂ  Charley Varrick?&quot; - nel 1973. Il film annovera nel cast anche altre stelle dell'epoca. In questo film, Sargent si dimostra un maestro della suspence all'altezza di Don Siegel.\nNel 2009 ÃƒÂ¨ stato realizzato un remake intitolato Pelham 123 - Ostaggi in metropolitana, diretto da Tony Scott ed interpretato da Denzel Washington e John Travolta.\n\nTrama \n\nQuattro loschi individui, tutti con nomi in codice, il signor Green (un ex macchinista della metropolitana di New York), il signor Grey (un ex mafioso), il signor Blue (un soldato mercenario disoccupato) e il signor Brown (un delinquente comune) ordiscono un sequestro a scopo di estorsione ad un vagone della metropolitana, quello partito da Pelham all'1.23 p.m., denominato in codice Pelham 123. I quattro salgono a bordo e si impadroniscono del vagone locomotore, prendendo in ostaggio 17 passeggeri ed il controllore. Sganciati gli altri vagoni, il macchinista del treno e gli altri passeggeri vengono immediatamente lasciati liberi e tornano indietro a piedi verso la stazione precedente. L'ex macchinista Green si mette quindi alla guida del vagone locomotore, mentre Blue chiama via radio il centro di controllo al fine di dettare le proprie condizioni per il rilascio degli ostaggi. L'ufficiale di polizia di turno ÃƒÂ¨ il tenente Zachary Garber, capo della Polizia dei Trasporti, che in quel momento sta facendo da cicerone ad un gruppo di dirigenti giapponesi della metropolitana di Tokyo in visita al centro di controllo. Egli ÃƒÂ¨ costretto a congedarli per cercare di reagire prontamente alla minaccia ma la situazione, che non ha precedenti, non permette un agevole intervento armato. I sequestratori vogliono che la cittÃƒÂ  di New York consegni loro entro un'ora un milione di dollari in contanti: per ogni minuto di ritardo sarÃƒÂ  ucciso uno dei 18 ostaggi. GiÃƒÂ  perÃƒÂ² c'ÃƒÂ¨ stata la prima vittima: un iracondo ispettore della metropolitana, che era sceso in galleria per capire cosa stava effettivamente succedendo, mentre si avvicinava al vagone fermo sui binari viene freddato da Grey, che cosÃƒÂ¬ si rivela un tipo dal grilletto facile. Nel corso dei contatti radio di Garber con i terroristi per le trattative, si intercala spesso uno starnuto di Green, che ÃƒÂ¨ fortemente raffreddato. Garber fa immediatamente contattare il sindaco: questi, che ÃƒÂ¨ a letto con l'influenza, dopo una riunione in casa con i suoi consiglieri, acconsente al pagamento del riscatto; il reale motivo di tale assenso, perÃƒÂ², ÃƒÂ¨ che egli, molto impopolare in cittÃƒÂ , spera cosÃƒÂ¬ di riguadagnare consensi per farsi rieleggere piuttosto che preoccuparsi, prima di tutto, di salvare la vita a 18 innocenti. Intanto, nel cunicolo dove ÃƒÂ¨ fermo il vagone, sopraggiunge una squadra di tiratori scelti pronti ad intervenire. Dopo svariati imprevisti - il tempo che stringe, persino un incidente alla macchina della polizia che porta il riscatto - il gruppo riceve il denaro pattuito proprio allo scadere del tempo ma, nell'operazione, uno dei tiratori scelti perde la calma e parte un colpo che colpisce al braccio Brown, ferendolo perÃƒÂ² soltanto di striscio. A questo punto, Grey - il meno stabile mentalmente del gruppo - inizia a sparare a raffica, rischiando di far fallire l'ingegnoso piano. Blue, per ritorsione all'azione improvvisa dei cecchini, uccide uno degli ostaggi, il controllore del treno. Impadronitisi poi dei soldi, i banditi fanno ripartire il treno fermandolo poco dopo, all'altezza di un'uscita di sicurezza in piena galleria; Green manomette il cosiddetto &quot;uomo morto&quot; (un dispositivo che consente la marcia al treno soltanto se c'ÃƒÂ¨ il peso della mano del macchinista su un apposito pulsante) e i quattro fuggono via facendo ripartire il treno senza guida. Il piano sembra sempre piÃƒÂ¹ sofisticato: grazie ai semafori che, secondo le condizioni dei delinquenti, dovevano rimanere verdi fino all'ultima stazione (quella di South Ferry), il convoglio acquista sempre piÃƒÂ¹ velocitÃƒÂ  senza che nessuno ne arresti la marcia: in questa maniera la polizia ÃƒÂ¨ mobilitata al suo inseguimento nel tentativo di fermarlo credendo che i quattro siano ancora a bordo, e poco ci manca che i banditi riescano a farla franca.\nAll'inizio della corsa del treno, uno dei passeggeri - un poliziotto in borghese presente fra gli ostaggi per puro caso - scende sulle rotaie per inseguire ed affrontare i delinquenti. Tra di loro, inoltre, cominciano perfino a sorgere delle rivalitÃƒÂ : Grey non vuole consegnare il proprio fucile a Brown che dovrebbe nasconderlo e Blue, ormai stufo delle intemperanze di questi (che stavano per mettere a repentaglio la riuscita del piano), senza pensarci due volte lo uccide. Brown, invece, viene a sua volta colpito mortalmente dal poliziotto in borghese che si fa cosÃƒÂ¬ notare dal gruppo. Rimasti in due, Green e Blue si dividono: il primo riesce a raggiungere la superficie e dileguarsi, mentre il secondo ingaggia un conflitto a fuoco con il poliziotto. Alla fine, quest'ultimo viene colpito da un proiettile rimanendo gravemente ferito ma, proprio quando Blue sta per ucciderlo, sopraggiunge il tenente Garber: egli ha finalmente capito il vero piano dei sequestratori e quindi, introdottosi nella galleria, intima al bandito di arrendersi e gettare via la pistola. Pur di non finire in galera, Blue preferisce togliersi la vita autofolgorandosi con i contatti elettrici dei binari, come su una sedia elettrica.\nAppurato che nessun altro dei banditi si trova sul treno, questo viene immediatamente fermato con gli stop automatici poco prima che vada a schiantarsi contro l'ultima stazione: i 17 passeggeri superstiti sono cosÃƒÂ¬ finalmente salvi. Scatta quindi l'operazione per rintracciare l'ultimo uomo: Garber, avendo giÃƒÂ  intuito che almeno uno dei banditi doveva necessariamente saper condurre il treno, aveva richiesto una lista di tutti gli ex macchinisti licenziati in passato per motivi disciplinari o reati vari. L'elenco ne annovera ben 78 ma, scartati quelli ancora in carcere, quelli deceduti, trasferiti e via dicendo, il numero si riduce ad appena 9 sospettati: fra questi figura il nome di Harold Longman, ovvero il signor Green. Passa soltanto qualche ora, e Garber ed il suo assistente sono giÃƒÂ  a casa sua, proprio mentre egli ÃƒÂ¨ intento a contare i soldi del bottino. Nascoste le banconote nel forno della cucina, Green riesce, sia pur con un po' di fatica, a eludere le accuse del tenente, ma poi si smaschera da solo: mentre Garber sta per andarsene, Green starnutisce. La risposta di Garber (&quot;salute!&quot;), che spesso si intercalava nei dialoghi tra il centro di controllo ed il Pelham 123, richiama l'attenzione dello stesso tenente, che cosÃƒÂ¬ scopre ed arresta l'ultimo componente del gruppo.\n\nCuriositÃƒÂ  \n\nI nomi in codice sono stati utilizzati anche in Le Iene di Quentin Tarantino.\nL'autore della colonna sonora risponde al nome di David Shire, meglio noto per essere stato successivamente uno degli autori delle musiche di uno dei piÃƒÂ¹ famosi film degli anni Settanta: La febbre del sabato sera.\nNel doppiaggio in lingua italiana, il nome dell'ispettore &quot;Caz Dolowicz&quot; (la prima vittima del sequestro), al fine di evitare prevedibili analogie del nome stesso con una nota parolaccia in italiano, fu cambiato con &quot;Ed Dolowicz&quot;. Inoltre, nella versione originale in inglese uno dei banditi, il sig. Brown, era anche balbuziente.\nNel 1998 fu proposto un remake televisivo del film (che non ebbe molto successo) con identico titolo e trama, con Edward James Olmos nel ruolo che fu di Matthau (ma con un nome differente, il detective Prescotti) e Vincent D'Onofrio in quello di Robert Shaw, il signor Blue. Nel cast, inoltre, figurano due personaggi femminili in piÃƒÂ¹, in sostituzione di altrettanti personaggi presenti nel film originario: sono il controllore che verrÃƒÂ  ucciso da Blue e, nel gruppo dei banditi, &quot;Miss&quot; Brown.","torrent":{"xt":"urn:btih:686767c74d2f6b41b48c24776b0531baf3095746","amp;dn":"Il+colpo+della+metropolitana","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"686767c74d2f6b41b48c24776b0531baf3095746","infoHashBuffer":{"type":"Buffer","data":[104,103,103,199,77,47,107,65,180,140,36,119,107,5,49,186,243,9,87,70]},"announce":[],"urlList":[]}}