{"title":"Electric Flag - An American Music Band 1968(mp3 320kbs)ICM369","uid":6271307,"size":69222717,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:68866d6cfe6b3bfca1a766138469933fbba4cd80&amp;dn=Electric+Flag+-+An+American+Music+Band+1968%28mp3+320kbs%29ICM369&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ICM369","files":-1,"time":1301112004,"description":"Electric Flag - An American Music Band 1968(mp3 320kbs)ICM369\n_____________________________________________________________\n\nElectric Flag - An American Music Band (1968)\n\n\nNick Gravenites (vocals, guitar)\nBuddy Miles (vocals, drums)\nMike Bloomfield (guitar)\nBarry Goldberg (keyboards)\n\nWith guitarist Hoshal Wright replacing founding member Mike Bloomfield (formerly of Paul Butterfield Blues Band) and Herbie Rich taking full control of the organ \n(from another ex-Paul Butterfield member Barry Goldberg, along with future Lou Reed keyboardist Mike Fonfara), you have a definite sequel to the Electric Flag's March 1968 debut LP, A Long Time Comin' appearing right on its heels, in December of that same year. \n\nThe original album had An American Music Band under the group's name, and that slogan becomes the subtitle of this follow-up. \n\nJanis Joplin songwriter Nick Gravenites takes the hook out of Barry Goldberg's Sittin' in Circles and reinvents it for Hey, Little Girl on this installment. \n\nWhere 60 percent of the first album was written by the Paul Butterfield exiles \nBloomfield and Goldberg, the songwriting is pretty evenly split between the two songs each by Buddy Miles, Harvey Brooks, and Nick Gravenites, with Brooks and Gravenites co-writing an additional title, Nothing to Do. \n\nThis makes for a heavier blues recording, co-produced by Brooks and Cheap Thrills album producer John Simon, who doubles on piano here (which he played on Janis Joplin's Turtle Blues on the aforementioned Big Brother &amp; the Holding Company disc). \n\nThe big revelations, though, are the cover songs, Dr. John's Qualified and an unbelievable version of Bobby Hebb's Sunny, which Buddy Miles just encompasses and devours. \nThe blending of styles is intuitive, as Hebb and Mac Rebennack/Dr. John had worked together on their own.\n\n Virgil Gonsalves' flute at the end of Sunny is frosting on the cake, but the key is that a song which was a smash on three formats -- R&amp;B, country, and pop charts, and captured the heart of jazz musicians from Ella Fitzgerald to Pat Martino, gets this total reinvention here. \n\nAs brilliant as Nick Gravenites is as a songwriter, it is Hebb's tune which is the centerpiece of this disc, that Sony would take it and Buddy Miles' Mystery for the CD release of the first album is the real mystery. \n\nAlto sax player Stemsy Hunter is wonderful on lead vocals for With Time There Is Change, written by co-producer/bassist Harvey Brooks and perhaps the most captivating original here. \n\nThey all trade lead vocalist duties, from Nick Gravenites on Nothing to Do to Herbie Rich on the Dr. John cover. \n\nIt's an amazingly dense set of recordings which, years later, form a remarkable thread of sounds by musicians who worked with Jimi Hendrix, Janis Joplin, the latter day Big Brother &amp; the Holding Company, and who were taking the original concept a step further into uncharted waters. \n\nWhere the Electric Prunes were a fun psychedelic moment, the neon signs superimposed over Buddy Miles' face didn't get the same immediate recognition. \n\nMany of the core players from both discs reunited in 1974 for the Atlantic records release The Band Kept Playing. Real textbook material here, highly enjoyable, and very important.\n \n~ Joe Viglione, All Music Guide  \n__________\n\nTracklist: \n\n1. Soul Searchin' (Buddy Miles)\n\n2. Sunny (Bobby Hebb)\n\n3. With Time There Is Change\n\n4. Nothing To Do (Nick Gravenites, H. Brooks)\n\n5. See To Your Neighbour (Nick Gravenites)\n\n6. Qualified\n \n7. Hey Little Girl (Nick Gravenites)\n\n8. Mystery (Buddy Miles)\n\n9. My Woman Hangs Around The House \n__________\n\nFormat                           : MPEG Audio\nFile size                        : 6.76 MiB\nDuration                         : 2mn 57s\nOverall bit rate                 : 320 Kbps\nAlbum                            : An American Music Band\nTrack name                       : Soul Searchin'\nTrack name/Position              : 1\nPerformer                        : Electric Flag, The\nWriting library                  : LAME3.92\n\nAudio\nFormat                           : MPEG Audio\nFormat version                   : Version 1\nFormat profile                   : Layer 3\nDuration                         : 2mn 57s\nBit rate mode                    : Constant\nBit rate                         : 320 Kbps\nChannel(s)                       : 2 channels\nSampling rate                    : 44.1 KHz\nStream size                      : 6.76 MiB (100%)\nWriting library                  : LAME3.92\n__________\n\nMp3\n\nRipped:320\n\nEnjoy:D","torrent":{"xt":"urn:btih:68866d6cfe6b3bfca1a766138469933fbba4cd80","amp;dn":"Electric+Flag+-+An+American+Music+Band+1968%28mp3+320kbs%29ICM369","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68866d6cfe6b3bfca1a766138469933fbba4cd80","infoHashBuffer":{"type":"Buffer","data":[104,134,109,108,254,107,59,252,161,167,102,19,132,105,147,63,187,164,205,128]},"announce":[],"urlList":[]}}