{"title":"La.estrella.peregrina.(ebook).","uid":6298723,"size":8650999,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b7ced2ef7574a94033725ec1e3bd6fcfcb36b4d&amp;dn=La.estrella.peregrina.%28ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1302084558,"description":"Una peregrinaciÃƒÂ³n a Santiago de Compostela en el aÃƒÂ±o Mil, a travÃƒÂ©s de un milenario camino.\n\nEn el AÃƒÂ±o Mil, tras el fallecimiento de su marido, la condesa de Conquereuil emprende peregrinaciÃƒÂ³n a Santiago de Compostela desde la BretaÃƒÂ±a francesa, para postrarse ante el ApÃƒÂ³stol, recibir la indulgencia y pedirle que haga crecer a su hija pequeÃƒÂ±a, que es enana y que, a causa de su deformidad, ha sido rechazada por las gentes y hasta por su propio padre, pues la han creÃƒÂ­do endemoniada.\n\n\n\nSale al camino con un sÃƒÂ©quito de 200 servidores, recorre vÃƒÂ­as romanas, caminos y veredas; atraviesa puentes inestables; se hospeda en conventos, hospitales o posadas, y duerme bajo su tienda o al raso. Y a lo largo de tantas millas se topa con increÃƒÂ­bles y estrafalarios personajes, y vive no menos excitantes aventuras.\n\nConquereuil, Nantes, Niort, Burdeos, Belin, Lesperon, Roncesvalles, Pamplona, Gares, Lizarra, NÃƒÂ¡jera, los montes de Oca, Burgos, Castrogeriz, CarriÃƒÂ³n, LeÃƒÂ³n, Astorga, la tierra del Bierzo, el puerto del Cebrero, Triacastela, Sarria, Mellid, hasta que, antes del monte del Gozo, a lo lejos se avista la ciudad de Santiago de Compostela. Puntos que conforman el Camino FrancÃƒÂ©s, que consolidÃƒÂ³ la prosperidad de las poblaciones que se encontraban o se levantaron a su paso. Por ÃƒÂ©l no sÃƒÂ³lo circularon personas, sino, con ellas, ideas y arte, en un camino que fue de ida y vuelta. En efecto, en una Europa fragmentada polÃƒÂ­tica y lingÃƒÂ¼ÃƒÂ­sticamente, el Camino de Santiago sirviÃƒÂ³ desde entonces como nexo de uniÃƒÂ³n entre todos los pueblos que la constituyen en el presente.","torrent":{"xt":"urn:btih:6b7ced2ef7574a94033725ec1e3bd6fcfcb36b4d","amp;dn":"La.estrella.peregrina.%28ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b7ced2ef7574a94033725ec1e3bd6fcfcb36b4d","infoHashBuffer":{"type":"Buffer","data":[107,124,237,46,247,87,74,148,3,55,37,236,30,59,214,252,252,179,107,77]},"announce":[],"urlList":[]}}