{"title":"Columna &quot;B&quot; - Twisted Noon [FLAC] TQMP","uid":6235794,"size":419403861,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6b8fd71bdbed3707ed98e5ec391623110bdf0ddc&amp;dn=Columna+%5C%22B%5C%22+-+Twisted+Noon+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pastafari","files":-1,"time":1299866268,"description":"Columna &quot;B&quot; - Twisted Noon\n2001\n\nCuban Music Series. The New Generation.\n\nBrought to you by TQMP\nThe Quality Music Project\n\nThe music of Yosvany Terry and Columna &quot;B&quot; provides an unmistakable milestone in the often elusive unfolding of modern jazz. A synthesis that links past and present influences and creators of Jazz, Afro-Cuban Jazz, Caribbean, and Cuban popular music, Twisted Noon is at once an intricate tapestry of delicate yet playful interplay and determined transformation.\n\nDirected by Yosvany Terry, their debut CD Twisted Noon is the culmination of a four-year evolution by Columna &quot;B&quot;. Since its inception in la Habana, Cuba with Yosvany Terry, Roberto Carcasses Jr., Descemer Bueno, and Dafnis Prieto, this project maintains as its central purpose the exploration of unique perspectives for Latin Jazz that remain tied to Afro-Cuban folkloric roots. These roots form the musical foundation shared by all of the artists who have collaborated along the way.\nColumna &quot;B&quot; offers us the richness of the multiple cultural traditions and musical influences that have shaped the development of all the immensely talented artists in this recording. We are now the grateful recipients of the magic and gifts that only music such as this can bring. Clearly, Columna &quot;B&quot; will be seen across time as a critical event in the development of new frontiers and definitions in the diversity of Latin Jazz.\n\nColumna &quot;B&quot;\nYosvany Terry: Alto Saxophone, Background Vocals, Chekere\nRoberto Carcasses Jr.: Piano\n\nJesus Diaz: Congas and percussion, Lead Vocals, Background Vocals\nYunior Terry: Acoustic Bass\nJosh Jones: Drums\nMarty Wehner: Trombone\nCheherazade Stone: Lead Vocals\nSandy Cressman: Background Vocals\n-- bombomusic.com\n\nReview --\nI almost didn't buy this disc. And I wouldn't blame you for not picking it up. I found it in the Cuban bin of the International section at my local Tower Records. No indication as to what kind of music it was, except that Yosvany Terry is listed as producer. I'd discovered Terry, a cutting edge Cuban reedman, on recordings by Jane Bunnett and Marilyn Lerner. A player at once steeped in the Latin-jazz tradition yet annexing new ground, I trusted that his involvement would stamp this disc with a special flavor.\n\nAnd I guessed right.\n\nTwisted Noon is fast emerging as my favorite Afro-Cuban jazz disc of all time. My only regret is that I didn't pick it up sooner. But with so few clues, I didn't--and I don't blame you for not adding it to your collection either, although with this review, you're left with little excuse.\n\nOK, I'm climbing up on my platform, and I'm going to beat you into submission if you don't just drop everything and pick up this disc. This is the REAL DEAL. I say without embarrassment and with complete confidence that Twisted Noon is one of the greatest if not the greatest Afro-Cuban jazz disc every recorded--right up there with New Directions (*) by Chucho Valdes. It throbs with energy, bursts with life. Pretty much everything's on display right from the git-go. &quot;Llegada a Nueva York,&quot; the opening number, a tribute to such Afro-Cuban masters as Chano Pozo, Dizzy Gillespie, and Mario Bauza, shifts and slips with ease between traditional Latin rhythms and bop stylings. Sounding quite a bit like Jerry Gonzalez's late, great, lamented Fort Apache Band, but updated, wilder, more feral, yet somehow even slicker and more folkloric-based, this is simply astounding music. And it just keeps up throughout the entire disc. The two vocal numbers, &quot;California&quot; and &quot;Tenderly,&quot; although not particularly to my taste, are quite ravishingly sultry and show another side of this band's genius.\n\nMuch of the credit must go to the two leaders, composers, and arrangers, Yosvany Terry (alto sax, checkere, and background vocals) and Roberto Carcasses (piano). These two have been playing together for many years, and Twisted Noon represents a more than three-year gestation of the present band. And does it ever show. This is the tightest, most varied, most brilliantly colored Afro-Cuban jazz band ever. What they've managed to do that no other band has done so successfully is fully integrate a folkloric approach with a visionary jazz esthetic. What emerges is celebratory, ecstatic, fiery, soothing, mesmeric folk-jazz of the highest caliber.\n\nNot to be missed.\n-- Jan P. Dennis &quot;Longboard jazzer&quot; (Amazon Top 500 reviewer)\n\n(*) I think he means Chucho Valdes' New Conceptions ;)\n\n* * * * * * * * * * * * * * * * * * *\n\nEn algun que otro comentario me he referido al interesantisimo panorama que vive el joven jazz facturado por musicos cubanos en an~os recientes. Personalidades decisivas dentro de ese movimiento son los integrantes fundadores de Columna B, es decir, el saxofonista Yosvany Terry, el pianista Roberto Carcasses, el bajista Descemer Bueno y el baterista Dafnis Prieto, los cuales pertenecen a una generacion emergente de creadores que en la actualidad, a tono con los procesos de interaccion por los que atraviesa la cultura universal, hacen musica cubana evolucionada hacia lo mas contemporaneo del quehacer sonoro internacional, sin que eso implique para nada la menor perdida de una autentica cubania. Ello lo llevan a cabo a partir del empleo en su repertorio de concepciones timbricas bien modernas y estructuras acordales complejas, con la utilizacion de un soporte ritmico en el que la polirritmia esta presente todo el tiempo. Un ejemplo de lo antes expuesto se verifica al escuchar el disco Twisted noon, que la agrupacion realizase para el sello estadounidense Bombo Music.\n\nEl antecedente directo de Columna B fue el grupo Estado de Animo, una banda que puede catalogarse como de caracter fundacional para el devenir de los nuevos derroteros del jazz desarrollado por artistas locales dentro y fuera de la Isla desde mediados de los 90 hacia aca. Liderado por Yosvany Terry, el ensamble que registro Twisted noon habia experimentado varios cambios en relacion con la nomina inicial del piquete, para devenir una banda binacional, conformada por musicos de Cuba y EE.UU. De los miembros iniciales, solo permanecia al lado de Terry Roberto Carcasses, y se habian an~adido a la alineacion el contrabajista Yunior Terry y el bateria Josh Jones, como cuarteto base de los diez cortes de la grabacion.\n\nContaron, ademas, con los servicios de varios ejecutantes afincados en California, entre los que merece particular destaque el percusionista y cantante Jesus Diaz quien, junto a un sobresaliente desempen~o como conguero en las piezas &quot;Inner guaguanco&quot; y &quot;Noticiero&quot;, protagoniza un momento de lujo al intervenir como vocalista en &quot;Ochosi&quot;. Su voz vuelve a hacer eficaces aportes en los temas &quot;Estos dias&quot; y &quot;Noticiero&quot;. El tambien ejecuta un buen solo de timbales en &quot;Twisted noon&quot;. Otros interpretes estadounidenses que participan son Marty Wehner (trombon), con brillo sobre todo en &quot;Twisted noon&quot;, &quot;Estos dias&quot; y ajustadas intervenciones en &quot;California&quot;, &quot;Here comes the King&quot; y &quot;Tenderly&quot;; la vocalista Scheherazade Stone, voz lider en &quot;California&quot; y &quot;Tenderly&quot;, caracterizada por un amplio registro como cantante; asi como Sandy Cressman en los coros.\n\nAl formular una valoracion de Twisted noon ha de partirse del hecho de que desde el primer corte del CD, el titulado &quot;Llegada a Nueva York&quot;, uno intuye cuales son las intenciones de la tropa encabezada por Terry. En la composicion hay una lograda alternancia entre los aires afrocubanos y los del jazz de mas pura estirpe. En ese constante ir y venir de un lenguaje a otro, creo que los mejores solos se producen en los pasajes trabajados a partir de lo que se conoce como walking, en los que Carcasses y Terry demuestran plena madurez. El fonograma continua con la pieza que le da nombre a la grabacion y que tambien decursa por los caminos del jazz latino o afrocubano, como prefieren otros llamarle. Aunque la creacion no figura entre mis favoritas del album porque me parece que posee una coda poco feliz, ella deviene uno de los contados momentos en que Yunior Terry asume un rol protagonico en el contrabajo y si soy sincero debo decir que su actuacion me resulta un tanto inferior a las posibilidades que el ha evidenciado en otros trabajos suyos.\n\n&quot;Inner guaguanco&quot; es una de las piezas en las que el grupo suena mas empastado como conjunto. Aqui se registra uno de los mejores solos de Carcasses en el fonograma, a tenor de lo que hace su mano derecha, no unicamente desgranando un discurso armado por una sucesion de notas sino por el modo en que integra a la improvisacion ponches de acordes. Pero si una creacion se destaca por la proyeccion de toda la banda tratase, sin la menor duda, de &quot;Con sabor&quot;, en la cual los solos de Roberto y de Yosvany resultan en extremo calientes, y en particular Terry demuestra ser uno de los saxofonistas cubanos mas aventajados en el presente. La formula de apostar por la hibridacion de ritmos de disimiles procedencias se vuelve a emplear con sumo acierto en &quot;Tenderly&quot;, donde el swing que la vocalista impregna al clasico standard se integra de manera muy organica a un fragmento adicional incorporado al tema con los aires del chachacha. Debe sen~alarse la perfecta asimilacion de los patrones ritmicos cubanos por parte del baterista Josh Jones, quien en &quot;Here comes the King&quot; ejecuta un solo en el que pone de manifiesto que el, ademas de mantener la estabilidad de la marcha, tambien sabe repartir en el instante en que le toca el turno.\n\nEn fin, cuando el lector de compacto arriba al ultimo corte del disco, el denominado &quot;Noticiero&quot;, que dicho sea de paso es una autentica gozada, hay que reconocer que con la audicion de Twisted noon se ha disfrutado de un buen album, que si bien no es una propuesta innovadora ni de vanguardia como la que uno puede esperar de gentes como Yosvany Terry y Roberto Carcasses, resulta atractiva y refrescante para los ya -segun mi opinion- demasiado predecibles senderos del jazz latino.\n\nFuente &lt;a href=&quot;\nhttp://www.lajiribilla.cu/2010/n457_02/compactera.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lajiribilla.cu/2010/n457_02/compactera.html&lt;/a&gt;\n\nTrack List\n01- Llegada a Nueva York\n02- Twisted Noon\n03- Inner Guaguanco\n04- California\n05- Con Sabor\n06- Here Comes the King\n07- Tenderly\n08- Estos Dias\n09- Ochosi\n10- Noticiero\n\nArtwork, EAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafariCubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:6b8fd71bdbed3707ed98e5ec391623110bdf0ddc","amp;dn":"Columna+%5C%22B%5C%22+-+Twisted+Noon+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b8fd71bdbed3707ed98e5ec391623110bdf0ddc","infoHashBuffer":{"type":"Buffer","data":[107,143,215,27,219,237,55,7,237,152,229,236,57,22,35,17,11,223,13,220]},"announce":[],"urlList":[]}}