{"title":"Two and a Half Men, TVSeries (divx), S07E13-16, NL Subs, DMT","uid":6223375,"size":1016977690,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6ba97dcab566547829a29f8bab815b37b3d359de&amp;dn=Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S07E13-16%2C+NL+Subs%2C+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"MeMar","files":-1,"time":1299423125,"description":"Two and a Half Men, TVSeries (divx), S07E13-16, NL Subs, DMT\n\n\nVerenigde Staten\nCategorie: Beeld\nFormaat: DivX\nOndertitels (ingebakken): Nederlands\nGenre: Sitcom\nBron: Retail\nDuur: ongeveer 20 minuten per aflevering\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0369179/episodes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0369179/episodes&lt;/a&gt; &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&lt;/a&gt;\n\nDe hoofdrollen worden vertolkt door Charlie Sheen, Jon Cryer en Angus T. Jones.\n\nIn seizoen 7 heeft Cupido eindelijk zijn pijlen gericht op het hart van Charlie Harper, \nin plaats van op een ander lichaamsdeel - en het was helemaal raak. Jazeker, Charlie heeft ontdekt dat Chelsea serieus is en \nin seizoen 7 probeert hij alles om haar vast te houden. Aardig zijn voor haar ouders. Doen alsof hij luistert als ze praat. \nZelfs, ehm, trouw blijven. (Proberen, zeiden we.) Dat betekent een hoop lol voor de fans van de mannen. Maar Charlie is niet \nde enige Harper die vast zit in het liefdesweb. Alan is ervan overtuigd dat hij alleen wat meer haar nodig heeft voor \nde status van dekhengst, dus probeert hij de variant uit een spuitbus. En Jake besluit dat hij de ruwe golven van het daten \nop tienerleeftijd wel door zal komen met wat advies. Van Charlie.\n\nAflevering 13: Yay, No Polyps!\nChelsea wil Charlie dolgraag voorstellen aan haar ouders en ze probeert hem te overtuigen om binnenkort eens naar Illinois te vliegen. \nDit is Charlies ergste nachtmerrie. Hij doet alsof hij een pijnlijk doktersonderzoek gepland heeft en hoopt haar hiermee te sussen. \nMaar Chelsea staat erop dat ze hem zelf naar het ziekenhuis vergezelt.\n\nAflevering 14:  Crude and Uncalled For\nCharlie en Evelyn huren een advocaat in voor Alan, die onlangs een kerel neersloeg op ÃƒÂ©ÃƒÂ©n van zijn afspraakjes. \nDe man blijkt de tegenpool van Charlie te zijn: vriendelijk, sociaal geÃƒÂ«ngageerd en een echte familieman. \nAlan vreest dat Chelsea daar wel eens voor zou kunnen vallen en waarschuwt zijn broer. Die wil niets aan het toeval \noverlaten en probeert een glimp op te vangen van Chelsea op een liefdadigheidsevenement dat Alans advocaat heeft georganiseerd..\n\nAflevering 15: Aye, Aye, Captain\nCharlie is doodongerust. Hij is er bijna zeker van dat Chelsea een affaire heeft met Alans advocaat Brad. \nHij steekt zijn wantrouwen voor haar speciale band met Brad niet onder stoelen of banken, waarmee hij zich meteen een \nhoop problemen op de hals haalt. Chelsea reageert razend op zijn beschuldigingen en ze besluit haar koffers te pakken\n\nAflevering 16: Tinkle Like a Princess\nChelsea verlaat Charlie. Twee weken lang besluit die zich af te sluiten voor de buitenwereld. Hij is depressief en blijft de hele dag \nin zijn kamer. Alan dwingt hem echter om zijn leven te hervatten. Tijdens ÃƒÂ©ÃƒÂ©n van zijn nachtelijke verovertochten stuit Charlie \nop een oude bekende: Betsy. Ze verdwijnen enkele dagen en wanneer Charlie eindelijk terugkeert, blijkt hij met Betsy getrouwd te zijn.\n\n\nDeze serie wordt u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:6ba97dcab566547829a29f8bab815b37b3d359de","amp;dn":"Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S07E13-16%2C+NL+Subs%2C+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ba97dcab566547829a29f8bab815b37b3d359de","infoHashBuffer":{"type":"Buffer","data":[107,169,125,202,181,102,84,120,41,162,159,139,171,129,91,55,179,211,89,222]},"announce":[],"urlList":[]}}