{"title":"Scarlet Traces","uid":5062881,"size":109322035,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6bc4556a6b81cccf8cdfd0e7030649120671f0bb&amp;dn=Scarlet+Traces&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1250788762,"description":"Scarlet Traces is a steampunk comic written by Ian Edginton and illustrated by D'Israeli.  The series is a sequel to H.G. Wells' The War of the Worlds and is based on the premise that Britain was able to develop alien technology, abandoned after the abortive Martian invasion, to establish economic and political dominance over the remainder of the world.\n\nThe artwork shows an imposition of futuristic devices on early 20th century society. In the first series, set in 1908, London cabbies and the Household Cavalry have swapped their horses for mechanical devices with spiderlike legs and homes are heated and lit by modified versions of the Martian heat ray.  In the sequel, The Great Game, Britain of the late 1930s is recreated along fairly recognisable lines but with an additional layer of alien derived technology and a political agenda that has modern parallels.\n\nAlso included in this torrent is Edginton and D'Israeli's 2006 adaptation of H.G. Wells' The War of the Worlds, as key characters of Scarlet Traces can be glimpsed therein and the same designs for the Martians and their technology are used.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:6bc4556a6b81cccf8cdfd0e7030649120671f0bb","amp;dn":"Scarlet+Traces","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bc4556a6b81cccf8cdfd0e7030649120671f0bb","infoHashBuffer":{"type":"Buffer","data":[107,196,85,106,107,129,204,207,140,223,208,231,3,6,73,18,6,113,240,187]},"announce":[],"urlList":[]}}