{"title":"Shoah [5/6] Ribellione [TVRip Ita] [Tntvillage]","uid":5009482,"size":634981500,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6bc6d38eea1f781e40e6d4b5586ffb5c026b2cca&amp;dn=Shoah+%5B5%2F6%5D+Ribellione+%5BTVRip+Ita%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"darayava","files":1,"time":1247917897,"description":"Visit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=La%20storia%20siamo%20noi%20-%20Shoah%20-%20Parte%205%20di%206&amp;sb=1&amp;sd=0&amp;cat=0\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=Triccotracco&amp;sb=1&amp;sd=0&amp;cat=0\n\n\n\n Visit this link: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=111976[/url]\n\n\nShoah (5/6)\n\nRibellione\n\ndi\nMaurice Philip Remy\n\nLa storia siamo noi\n\n by Tricco \n\n - Scheda del documentario - \n\nResistenza e rivolta nel ghetto di Varsavia\n\nL' eroica rivolta del ghetto di Varsavia fu la piÃƒÂ¹ importante azione di resistenza avvenuta nella seconda metÃƒÂ  del 1942 in Polonia, quando la maggior parte delle comunitÃƒÂ  ebraiche erano state ormai decimate e i sopravvissuti erano stremati dall'orrore e dalla fame. Seppure nella drammatica emergenza del vivere o morire, quella di Varsavia non si tradusse in una mera ribellione alla violenza bruta nazista e non fu solo difesa estrema della vita. L'esistenza di una capillare rete di mutuo soccorso e di numerose attivitÃƒÂ  culturali e formative era ed ÃƒÂ¨ la testimonianza dell'anelito vitale ed affermativo che in essa si esprimeva. Fu la prima rivolta urbana armata contro gli occupanti nazisti e la sua eco si diffuse in tutto il resto d'Europa.\n\n Visit this link: http://img88.Imageshack.us/img88/3098/t065412a.jpg\n\nLa rivolta di Sobibor\n\nIl 5 luglio 1943 Himmler ordinÃƒÂ² la trasformazione di Sobibor in campo di concentramento. Il campo venne ampliato con l'aggiunta di una quarta sezione e vennero costruiti dei magazzini per munizioni sovietiche catturate. Contemporaneamente il perimetro del campo venne circondato da un campo minato.\nProprio nell'estate del 1943 nel campo si organizzÃƒÂ² una cellula di resistenza che aveva come leader Leon Feldhendler che era stato capo del Consiglio Ebraico della cittÃƒÂ  polacca di Zolkiew. Il gruppo aveva intenzione di organizzare una rivolta ed una fuga di massa.\nIl piano venne facilitato dall'arrivo, il 22 settembre 1943, di un 600 prigionieri di guerra sovietici di fede ebraica. Di questi soltanto 80 vennero lasciati in vita per lavorare nel campo.\nTra i sopravvissuti venne reclutato per la sua esperienza militare il tenente Aleksandr Pechersky. Feldhendler gli cedette il comando divenendo il suo vice. Venne cosÃƒÂ¬ preparato un piano per la fuga.\nIl 14 ottobre 1943 scoppiÃƒÂ² la rivolta di Sobibor. I rivoltosi riuscirono ad uccidere undici SS e alcune guardie ucraine, attraversarono il campo minato subendo gravi perdite e in 300 raggiunsero i boschi.\nDi questi la maggior parte venne uccisa nella caccia all'uomo organizzata dai tedeschi. Alla fine della guerra i sopravvissuti erano circa 50.\nA causa della sorpresa i tedeschi decisero di chiudere Sobibor anzichÃƒÂ© trasformarlo in un campo di concentramento. Tutti gli ebrei che non avevano partecipato alla fuga vennero eliminati e alla fine del 1943 il campo venne totalmente distrutto e l'area spianata. Vennero piantati alberi e costruita una fattoria nella quale venne lasciata una guardia ucraina travestita da agricoltore. Nell'estate del 1944 i sovietici liberarono la zona.\nNel dopoguerra 11 SS del campo vennero processati. Il processo tenutosi ad Hagen, in Germania nel 1965-66 terminÃƒÂ² con il suicidio di un accusato in cella, un ergastolo, cinque pene detentive e quattro assoluzioni.\n\n Visit this link: http://img88.Imageshack.us/img88/7990/sopravvissutisobibor.jpg\nUn gruppo di sopravvissuti del campo di Sobibor il terzo da sinistra ÃƒÂ¨ Alexander Pechesky, capo della rivolta.\n\nLa rivolta di Treblinka\n\nI tentativi di fuga da Treblinka furono numerosi. Verso l'aprile del 1943 si formÃƒÂ² un gruppo di resistenza che elaborÃƒÂ² un progetto di fuga di massa. I capi del gruppo di resistenza erano il dottor Julian Chorazycki ex poliziotto polacco, Marceli Galewski ed altri capi delle squadre di lavoro. Il piano consisteva nell'assalire le guardie, sottrarre loro le armi, distruggere gli impianti di morte e fuggire nei boschi circostanti il campo. Il gruppo della resistenza era formato da circa settanta persone. Quando la cremazione dei cadaveri era pressochÃƒÂ© terminata fu chiaro ai membri della resistenza che il campo sarebbe stato chiuso e i sopravvissuti sarebbero stati uccisi. Occorreva agire subito. Il 2 agosto 1943 scoppiÃƒÂ² la rivolta. I prigionieri riuscirono ad impossessarsi delle chiavi dell'armeria e vennero distribuite le armi. A questo punto perÃƒÂ² una SS, Kurt KÃƒÂ¼ttner, si accorse che stava accadendo qualcosa e cercÃƒÂ² di dare l'allarme. I resistenti furono costretti a sparargli uccidendolo. Il colpo mise in allarme gli ucraini e le SS e la distribuzione delle armi fu interrotta. Il piano di impadronirsi del campo venne abbandonato e si decise di tentare la fuga. La maggior parte dei prigionieri in fuga venne falciata dalle mitragliatrici poste sulle torrette. Quelli che riuscirono ad uscire dal campo vennero attaccati da altre unitÃƒÂ  SS arrivate di rinforzo. I piÃƒÂ¹ decisi tra i prigionieri ingaggiarono uno scontro a fuoco con le SS del campo e, prima di allontanarsi, diedero fuoco alle baracche. Nel campo al momento della rivolta vi erano circa 840 prigionieri tra uomini e donne. Circa un centinaio non parteciparono alla rivolta, dei rimanenti 740 soltanto 60 riuscirono a salvarsi la vita e sopravvivere sino alla fine della guerra. Le SS utilizzarono i prigionieri rimasti in vita per smantellare il campo. L'opera di demolizione andÃƒÂ² avanti sino all'autunno. Il 20 ottobre 1943 gli ultimi ebrei furono caricati su cinque vagoni ed inviati a Sobibor dove vennero sterminati. Pochi giorni dopo vennero uccisi gli ultimi trenta ebrei lasciati a Treblinka per terminare i lavori di mascheramento del campo. L'area venne camuffata da podere, venne creata dal nulla una fattoria affidata ad un contadino del luogo che avrebbe dovuto mantenere il segreto.\n\n Visit this link: http://img516.Imageshack.us/img516/3658/incendiotreblinka.jpg\nIl giorno della rivolta: le fiamme si alzano dal campo di Treblinka\n\n\n\n - Scheda tecnica - \n\n[ Info sul file ]\nNome: La storia siamo noi - Shoah - Parte 5 - by Tricco [720x480 x264 AAC].mkv\nData: 18/02/2009 06:36:42\nDimensione: 634,981,500 bytes (605.566 MB)\n\n[ Dati rilevanti ]\nRisoluzione: 720 x 480\nLarghezza: multipla di 16\nAltezza: multipla di 32\n\n[ Traccia video ]\nCodec ID: V_MPEG4/ISO/AVC\nRisoluzione: 720 x 480\nFrame aspect ratio: 3:2 = 1.5\nPixel aspect ratio: 1:1 = 1\nDisplay aspect ratio: 3:2 = 1.5\nFramerate: 25 fps\n\n[ Traccia audio ]\nCodec ID: A_AAC (AAC Low complexity)\nCanali (contenitore): 2\nFrequenza: 24000 Hz\nFrequenza di output: 48000 Hz\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:6bc6d38eea1f781e40e6d4b5586ffb5c026b2cca","amp;dn":"Shoah+%5B5%2F6%5D+Ribellione+%5BTVRip+Ita%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bc6d38eea1f781e40e6d4b5586ffb5c026b2cca","infoHashBuffer":{"type":"Buffer","data":[107,198,211,142,234,31,120,30,64,230,212,181,88,111,251,92,2,107,44,202]},"announce":[],"urlList":[]}}