{"title":"Direct Your Own Damn Movie!!! by Lloyd Kaufman","uid":5491140,"size":3772349,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6be47b6e7336ce952eeb29e001b67418ccebf60e&amp;dn=Direct+Your+Own+Damn+Movie%21%21%21+by+Lloyd+Kaufman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"artpepper","files":-1,"time":1271006485,"description":"Direct Your Own Damn Movie! by Lloyd Kaufman\n\nLloyd Kaufman is one of the very few genuine auteur filmmakers. He has written, produced, and/or directed 25 films including The Toxic Avenger, Terror Firmer, Tromeo and Juliet, and Poultrygeist: Night of the Chicken Dead. Kaufman is president of the world-famous Troma Entertainment, the oldest, and arguably, the longest-running truly independent film studio in history. \n\nHe is also the president of IFTA (Independent Film &amp; Television Alliance), whose members produce more than 400 independent films and countless hours of television programming each year and generate more than $4 billion in distribution revenues annually. \n\n\n\nThe Book:\n\n\nThe Independent Directing Bible that will fit in your back pocket!\n(If you have an extremely large pocket...)\n\nHave you always wanted to direct a movie, but don't know how to start?\n\nWant to know how to get your first directing job?\n\nWhat do directors even do, anyway?\n\nLegendary director Lloyd Kaufman, creator of The Toxic Avenger, reveals 40 years worth of maverick cinematic know-how! Direct Your Own Damn Movie! will be your step-by-step roadmap on the journey through:\n\n\n* Scriptwriting\n* Pre-production\n* Casting\n* Managing your set\n* Post-production\n* Distribution\n\n\n\nMaster the art of directing the easy way! There is no better way to become a director than by following the instruction and wisdom of an actual successful film director, not someone who just talks about it.\n\n\n\nFeaturing expert advice from:\n\nEli Roth (Grindhouse, Hostel)\nJenna Fischer (LolliLove)\nStan Lee (co-writer Spider-Man, Fantastic Four)\nRon Jeremy (credits cannot be printed here)\nStuart Gordon (Re-Animator)\nJames Gunn (Dawn of the Dead, Slither)\n...and many more!\n\n\n\nWARNING!\nDo not read this book if you suffer from motion sickness, or are about to operate heavy machinery. This book is not for the faint of heart, the good of taste, or those who might be pregnant.\n\n\n\n* There's more to directing than a cool-looking chair. Renegade director Lloyd Kaufman reveals all!\n\n* Includes interviews with a host of luminaries on mistakes and disasters from their early film careers\n\n* Learn the ten directing commandments of Lloyd Kaufman, plus the all-important 11th: forget the first 10 and direct your own damn movie! \n\n\n\n &quot;It's funny, it's profane, and you may learn a thing or two.&quot; - Internet Video Magazine","torrent":{"xt":"urn:btih:6be47b6e7336ce952eeb29e001b67418ccebf60e","amp;dn":"Direct+Your+Own+Damn+Movie%21%21%21+by+Lloyd+Kaufman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6be47b6e7336ce952eeb29e001b67418ccebf60e","infoHashBuffer":{"type":"Buffer","data":[107,228,123,110,115,54,206,149,46,235,41,224,1,182,116,24,204,235,246,14]},"announce":[],"urlList":[]}}