{"title":"JAF Virtual PKEY v2","uid":4989823,"size":6729839,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:6ccb8c80788816333c07f8ae3c4d223179b887ad&amp;dn=JAF+Virtual+PKEY+v2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sweunlockers","files":1,"time":1246980410,"description":"Virtual PKEY v2.0\n\nI know there is many stupid internet user who thinks everything is an virus, yes this file may get detected as an virus by avg free andother free shit software.\nWhy? becuse the file i crypted by exe cryptor, why is it that? maybe becuse you shit crackers wanabee wont crack the soft easy like you can do with a delphi exe.\nSo for you people who dont understand computers go home and play with your toy cars or buy a real antivirus software.\nFor you other enjoy a great time with your nokia phones.\n\nVersion 1.0\nHere it comes, completeley free, work with ORIGINAL installed JAF 1.98.64 and JAF CC 0.78\nCompletely new technology to emulate JAF PKEY, ony by software and drivers (no real PKEY required to run any current JAF softwares).\nMain features:\n- Work with ANY JAF Main software up to version 1.98.64 (inclusive)\n- Work with ANY JAF Customer Care up to version 0.78 (inclusive)\n- Make SX4 authorization using JAF CC (need valid email to register one SN)\n- Make SX4 bypass using JAF 1.98.64\n- Access JAF Support Area (flash files/packages download) using JAF CC\n- Randomly change PKEY Serial Number to ANY value for JAF Main software\n- First time usage chose one random SN for JAF CC usage (only Raskal PKEY SN's used for JAF CC)\n- Remember/store SN for JAF CC at every startup\n- Can change used SN for JAF CC to another random value (only Raskal PKEY SN's used for JAF CC)\n\nVersion 2.0\n- Added support for JAF_1.98.64_fix\n- Improved working (emulation) speed, now very fast work when emulate JAF PKEy smartcard\n- Added settings for Virtual Reader Poll Interval (default 1ms)\n- Added settings for Debug Messages (different levels - default No debug Messages)\n\nNotes:\nIf you receive message &quot;ERROR: Insert Virtual PKEY card&quot; please REBOOT your PC!\nIf after reboot receive same message, that means Smartcard Service is not working well on your PC.\nTry to restart/reinstall Smartcard Service, or try on another PC.\nAlso, latest JAF softwares (1.98.63 and 1.98.64) use a stupid method to check original windows WINSCARD.DLL\nThe coder of JAF check if WINSCARD.DLL is not modified, BUT he not had ALL VERSIONS for ALL KIND of Windows of this DLL.\nSo, there is chances that JAF will not start on your currently installed version of Windows.\nSame problems have also users of real PKEY's, just check their support forum, there is a solution for that.\n\nWhat you need:\nA real antivirus software\nJAF 1.98.64\n\nWat some may need:\na bus ticket home\na toy car\na mother to cry out to\nmaybe some milk and cookies\n\nObserve this is no crack so jaf software will stay the same as when you installed it.\n\nGood for the people who had there pkey killed of bad software.\n\n\nwww.sweunlockers.se Free is our way of living.","torrent":{"xt":"urn:btih:6ccb8c80788816333c07f8ae3c4d223179b887ad","amp;dn":"JAF+Virtual+PKEY+v2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ccb8c80788816333c07f8ae3c4d223179b887ad","infoHashBuffer":{"type":"Buffer","data":[108,203,140,128,120,136,22,51,60,7,248,174,60,77,34,49,121,184,135,173]},"announce":[],"urlList":[]}}