{"title":"The Rolling Stones - Tattoo You (1981) WMA320","uid":6241086,"size":116733326,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6d15195d317b6200ebad95f9714f88c4bbfb2bf7&amp;dn=The+Rolling+Stones+-+Tattoo+You+%281981%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"MARCELODRGZ","files":-1,"time":1300065366,"description":"With the old Virgin 1994 remaster and this new 2009 Polydor version 'both' clocking in at exactly 44:26 minutes, I immediately had my suspicions about this latest rehash masquerading as something new for soppy Stones fans like me and a million others. But this 2009 Polydor CD is a FANTASTIC IMPROVEMENT in sound over its 1994 predecessor - it really is... \n\nIf I were to nail down what's different - it would be the BASS and DRUMS. They're suddenly so clear now - and in some cases like &quot;Worried About You&quot; - it's truly startling how good they sound. In fact if feels like every single track has been uplifted out of its former rhythm section muddiness. The clarity and punch is great on everything really. STEPHEN MARCUSSEN and STEWART WHITMORE at Marcussen Mastering in Hollywood, California did the transfers and they're to be praised for their work... \n\nAs you've no doubt already read, &quot;Tattoo You&quot; was a ragbag of outtakes from previous albums with a few new tunes thrown in - Rockers on the A with Ballads on the B. Yet it worked - I played it to death on release - loved it - especially the soulful Side 2. \n\nUnfortunately, the new packaging is a bit of a joke. The 'furry boot' inner sleeve that came with the original LP is reproduced in a paltry gatefold inlay, but there's no lyrics (there's a European LP that has a lyric sheet insert - they could have used that). The startling Christian Piper tattooed 'Three Paintings' are reduced to a point where the credits on the green-coloured rear sleeve are barely legible. The inlay beneath the see-through CD tray is blank - wow - push the boat out boys! But much worse - and like so many Stones LPs - guest musicians who contributed incredible work at the time are now not mentioned on reissues at all. So with all that in mind, here's a detailed breakdown to get a better lay of the land... \n\n1. Start Me Up [begun in 1975, returned to in 1978 as a &quot;Some Girls&quot; possible] \n2. Hang Fire [another &quot;Some Girls&quot; outtake, features IAN STEWART on Piano] \n3. Slave [This is an Extended Version - see PS below] \n4. Little T&amp;A [Lead Vocals and Bass by Keith Richards, Ian Stewart on Piano - T&amp;A is street slang for certain parts of a woman's anatomy] \n5. Black Limousine [the only track on the album co-credited to RONNIE WOOD, it features Mick Jagger on Lead Vocals and Harmonica with Ian Stewart on Piano - backing track dated as far back as &quot;Exile&quot; in 1972] \n6. Neighbours [features' both' the legendary SONNY ROLLINS and BOBBY KEYES on Saxophones] \n7. Worried About You [features BILLY PRESTON on Piano, WAYNE PERKINS on Lead Guitar and SOLO and OLLIE BROWN on Percussion] \n8. Tops [features MICK TAYLOR on Guitar with NICKY HOPKINS on Piano; a Mick Taylor &quot;Exile&quot; outtake - wasn't given a writers credit - sued and won] \n9. Heaven [co-producer CHRIS KIMSEY plays Piano on this] \n10. No Use In Crying [features Nicky Hopkins on Piano] \n11. Waiting On A Friend [features Mick Taylor on Guitar, Sonny Rollins on Saxophone and JIMMY MILLER of &quot;Sticky&quot; fame on Percussion] \n\nThe clarity of the guitar solo on &quot;Slave&quot; is awesome as is the swirling magic of &quot;Heaven&quot;, but best of all is the beautiful axework by Wayne Perkins on the Side 2 opener &quot;Worried About You&quot;. I think it's the best guitar solo on a Stones album anywhere and its clarity now is fabulous. \n\nTo sum up - I know the packaging and presentation leave a lot to be desired, but as I listen to the lovely Piano tinkering of Nicky Hopkins on &quot;No Use In Crying&quot; and the three lads harmonising on Backing Vocals - I don't care - I love it. The sound is wonderful and a major improvement over what went before. \n\nThe buggering truth is that once you hear these remasters, you're screwed - you'll have to have them all... Damn! \n\nDespite niggles, it's recommended - big time. \n\nPS: there's an anomaly worth noting... \n\nWhen &quot;Tattoo You&quot; was originally released on Vinyl and Cassette in August 1981 (Rolling Stones CUNS 39114 in the UK and COC 16052 in the USA), the 3rd track on Side 1 &quot;Slave&quot; clocked in at about 3:20 minutes. So when the first ever CD version of it came out on CBS in 1989 it naturally reflected that timing. \n\nHowever the May 1994 Virgin remaster put out an anomaly without telling anyone - their CD version was inexplicably extended to 6:31 minutes - that error is repeated here - and very much to the benefit of fans because the &quot;Extended Version&quot; of &quot;Slave&quot; is sensational. With the legendary Sonny Rollins playing on Saxophone and Billy Preston on Keyboards, the lengthy mix now sounds like &quot;Can't You Hear Me Knocking&quot; Part 2 from &quot;Sticky Fingers&quot;. A huge chunky guitar riff throughout, great Jagger vocals, Sax wailing - it absolutely rocks (apparently there's a version with Jeff Beck on guitar in the can somewhere too). \n\nWhat should have happened here of course is that the original LP timing be used on this CD - with both the Jeff Beck mix and the Extended Version put on as bonus tracks at the end, but that's for another day and another reissue...\n\nby Mark Barry, Reckless Records Store, London\n\nTRACKLIST:\n\n01 - Start Me Up.wma                                        \n02 - Hang Fire.wma                                          \n03 - Slave.wma                                              \n04 - Little T &amp; A.wma                                       \n05 - Black Limousine.wma                                    \n06 - Neighbors.wma                                          \n07 - Worried About You.wma                                  \n08 - Tops.wma                                               \n09 - Heaven.wma                                             \n10 - No Use In Crying.wma                                   \n11 - Waiting On A Friend.wma \n\nWMA 320Kbps 44100Hz STEREO\n\nFollow Me On Facebook Pages: Marcelodrgz (The Pirate Bay)","torrent":{"xt":"urn:btih:6d15195d317b6200ebad95f9714f88c4bbfb2bf7","amp;dn":"The+Rolling+Stones+-+Tattoo+You+%281981%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d15195d317b6200ebad95f9714f88c4bbfb2bf7","infoHashBuffer":{"type":"Buffer","data":[109,21,25,93,49,123,98,0,235,173,149,249,113,79,136,196,187,251,43,247]},"announce":[],"urlList":[]}}