{"title":"Asher Roth - I Love College","uid":5097405,"size":150315012,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6e3302085bb54fc7346b8d31df868c824c29751c&amp;dn=Asher+Roth+-+I+Love+College&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1253697700,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I Love College&quot; is the first single from rap artist Asher Roth's major-label debut album Asleep in the Bread Aisle, which was released on April 20, 2009.\n\nThe song is about the college parties Roth attended during his time at West Chester University in West Chester, Pennsylvania. The single, produced by Mike Caren and Ben H. Allen, was released in early January 2009. The track originally sampled &quot;Say It Ain't So&quot; by Weezer, but was reworked by Allen as it is believed that their lead singer, Rivers Cuomo, refused to clear the sample. The song also samples &quot;Impeach the President&quot; by the Honey Drippers.\n\nThe music video was directed by Jonathan Lia and Scooter Braun. It was released to online outlets in early February. The video is set at a fraternity house party, and features activities such as binge drinking, strip poker, beer pong and hooking up. The Cool Kids make a cameo appearance.\n\n&quot;I Love College&quot; first made an impact on the Pop 100 chart as it debuted at #85 on the Pop 100 in a late February, and around the same month it debuted at #55 on the Billboard Hot 100. Weekly the single has been ascending up the charts based on increased digital sales as it now sits at #15 on the Billboard Hot 100, and also peaked #19 on the Pop 100. Also in the U.S. it peaked #18 on the Hot Rap Tracks, #34 on the Hot Modern Rock Tracks. The song sold over one-million downloads in the United States in twelve weeks of release. On the UK Singles Chart it has peaked at #26. In Canada it has debuted at #74 on the Canadian Hot 100 and has risen to #53.\n\nAsleep in the Bread Aisle is the debut studio album by American rapper Asher Roth. It was released on April 20, 2009. The album's first single was &quot;I Love College&quot;. The second single was &quot;Be By Myself&quot; and the third &quot;She Don't Wanna Man.&quot;  On Asleep in the Bread Aisle, known producers like Don Cannon contribute, but newcomer Oren Yoel crafted the bulk of the album's beats. The album features guest appearances from Cee-Lo, Jazze Pha, Keri Hilson, Busta Rhymes, pop duo Chester French, and band New Kingdom from Los Angeles. The album carries a PA label but there is no actual Parental Advisory sticker on the album cover. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n\n\n","torrent":{"xt":"urn:btih:6e3302085bb54fc7346b8d31df868c824c29751c","amp;dn":"Asher+Roth+-+I+Love+College","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e3302085bb54fc7346b8d31df868c824c29751c","infoHashBuffer":{"type":"Buffer","data":[110,51,2,8,91,181,79,199,52,107,141,49,223,134,140,130,76,41,117,28]},"announce":[],"urlList":[]}}