{"title":"[Ebook-Ita-Pdf-Fantascienza]Ma gli androidi sognano pecore elett","uid":5090093,"size":655697,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e724e96f815066fb68cda1951d533d4f6a44fdc&amp;dn=%5BEbook-Ita-Pdf-Fantascienza%5DMa+gli+androidi+sognano+pecore+elett&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mitimex","files":1,"time":1253065687,"description":"\n\nLa vicenda si svolge prevalentemente a San Francisco il 3/4 gennaio 1992. In seguito all'Ultima Guerra Mondiale (nucleare), la vita animale e vegetale sulla Terra ÃƒÂ¨ quasi scomparsa, e per questo accudire un vero animale ÃƒÂ¨ considerato un dovere morale oltrechÃƒÂ© un simbolo del proprio benessere. Le piogge di polvere radioattiva ricoprono tutto e portano alla progressiva alterazione mentale e genetica degli individui. Gli uomini e le donne che non hanno subÃƒÂ¬to mutazioni a causa della radioattivitÃƒÂ , non sono troppo vecchi e sono in grado di riprodursi si sono trasferiti quasi tutti nelle colonie extramondo. Per incentivarli a trasferirsi, una legge dell'ONU stabilisce che ad ogni terrestre venga assegnato un androide come servo. ÃƒË† perÃƒÂ² proibito ai droidi abbandonare le colonie per trasferirsi sulla Terra, pena il ritiro immediato.\nIl protagonista ÃƒÂ¨ Rick Deckard, un cacciatore di taglie costretto a ritirare 6 androidi fuggiti da una colonia marziana. Deckard ÃƒÂ¨ spinto dalla volontÃƒÂ  di acquistare un vero animale per sostituire la sua pecora elettrica, ma dovrÃƒÂ  scontrarsi con una nuova generazione di droidi, i Nexus 6. Deckard verrÃƒÂ  sedotto da Rachel, una droide che susciterÃƒÂ  in lui il dubbio di quale sia il confine tra ciÃƒÂ² che ÃƒÂ¨ organico e ciÃƒÂ² che non lo ÃƒÂ¨, ma soprattutto sul senso dell'umano: se ÃƒÂ¨ umano prendersi cura degli altri esseri viventi e proteggerli, fino a che punto ÃƒÂ¨ umano uccidere un androide che si sente vivo? \n\n","torrent":{"xt":"urn:btih:6e724e96f815066fb68cda1951d533d4f6a44fdc","amp;dn":"%5BEbook-Ita-Pdf-Fantascienza%5DMa+gli+androidi+sognano+pecore+elett","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e724e96f815066fb68cda1951d533d4f6a44fdc","infoHashBuffer":{"type":"Buffer","data":[110,114,78,150,248,21,6,111,182,140,218,25,81,213,51,212,246,164,79,220]},"announce":[],"urlList":[]}}