{"title":"Indiana Jones (1981-2008) DVDRip Xvid DutchReleaseTeam [Actie&amp;Av","uid":6131497,"size":3045776745,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6e9f52e3acd78d68ed7cc569ef38d1bcea384cc3&amp;dn=Indiana+Jones+%281981-2008%29+DVDRip+Xvid+DutchReleaseTeam+%5BActie%26Av&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Koedje","files":-1,"time":1296146253,"description":"Indiana Jones Quadrilogy\n\nHardcoded Dutch Subs:\n\n\n\n\nDeel 1:\n\n[img]http://img841.imageshack.us/img841/6524/indiana1.jpg[/img]\n\n\nVerenigde Staten\nActie / Avontuur\n115 minuten\n\ngeregisseerd door Steven Spielberg\nmet Harrison Ford, Karen Allen en John Rhys-Davies\n\nIndiana Jones heeft maar ÃƒÂ©ÃƒÂ©n levensdoel: de wereld afreizen op zoek naar archeologische rijkdommen. Hij is een avonturier die voor niets terugschrikt om zijn doel te bereiken en zijn concurrenten te verslaan. Zijn voornaamste tegenstrever is Belloq, een gewetenloze Franse archeoloog in dienst van Nazi-Duitsland. In 1936 wil Hitler absoluut de Ark des Verbonds in zijn bezit krijgen. Indiana Jones krijgt de opdracht om de Ark te vinden voordat de Nazi's dat doen.\n\n\n\n\n\n\nDeel 2:\n\n[img]http://img692.imageshack.us/img692/107/indiana2.jpg[/img]\n\n\nVerenigde Staten\nActie / Avontuur\n118 minuten\n\ngeregisseerd door Steven Spielberg\nmet Harrison Ford, Kate Capshaw en Ke Huy Quan\n\nIndiana Jones, Short Round en de betoverende nachtclubzangeres Willie Scott, worden door het noodlot in eenzelfde avontuur samengebracht. Op weg naar India ontsnappen ze op het nippertje aan de dood. Later belanden ze in een kinderloos dorp. Indy belooft het dorpshoofd de heilige Sankarasteen te zullen vinden, die het dorp zijn vruchtbaarheid moet teruggeven.\n\n\n\n\n\n\n\nDeel 3:\n\n[img]http://img375.imageshack.us/img375/7065/indiana3.jpg[/img]\n\n\nVerenigde Staten\nActie / Avontuur\n127 minuten\n\ngeregisseerd door Steven Spielberg\nmet Harrison Ford, Sean Connery en Denholm Elliott\n\nAl sedert 1912 zit Indiana Jones een bende achterna die een kostbaar kruis hebben gestolen. Nu het hem uiteindelijk gelukt is het juweel te bemachtigen en aan historicus Brody te overhandigen, kan hij opnieuw zijn baan als leraar oppikken. Op een dag wordt hij na schooltijd opgepikt en meegenomen naar de rijke Donovan. Deze bezit een steen, waarop een soort beschrijving staat die naar de Heilige Graal moet leiden. In het bezit van de notities van zijn vader, reist Jones naar VenetiÃƒÂ«. Met de hulp van dokter Elsa Schneider vindt hij de ontbrekende schakel voor de locatie van de Graal. Eindelijk kan hij samen met zijn vader naar Afrika vertrekken, maar hij is natuurlijk niet de enige die de waardevolle Graal op de kop wil tikken...\n\n\n\n\n\n\n\n\n\n\nDeel 4:\n\n[img]http://img703.imageshack.us/img703/2127/indiana4.jpg[/img]\n\n\nVerenigde Staten\nActie / Avontuur\n122 minuten\n\ngeregisseerd door Steven Spielberg\nmet Harrison Ford, Cate Blanchett en Shia LaBeouf\n\n1957. De Koude Oorlog is op zijn hoogtepunt. Nadat hij op een afgelegen vliegveld ternauwernood ontsnapt aan een groep snode Sovjet agenten, ontmoet de avontuurlijke archeoloog Indiana Jones (Harrison Ford) de jonge, opstandige Mutt (Shia LaBeouf) die zijn hulp nodig heeft bij een persoonlijke missie. In ruil daarvoor maakt Indy grote kans op het vinden van de Crystal Skull van Akator, een legendarisch en fascinerend voorwerp omringd door bijgeloof en gevaar. Indy en Mutt reizen naar de uithoeken van Peru, maar merken al snel dat zij niet de enigen zijn die de Crystal Skull zoeken.\n\n\n\n\nDeze film wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.nl\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:6e9f52e3acd78d68ed7cc569ef38d1bcea384cc3","amp;dn":"Indiana+Jones+%281981-2008%29+DVDRip+Xvid+DutchReleaseTeam+%5BActie%26Av","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e9f52e3acd78d68ed7cc569ef38d1bcea384cc3","infoHashBuffer":{"type":"Buffer","data":[110,159,82,227,172,215,141,104,237,124,197,105,239,56,209,188,234,56,76,195]},"announce":[],"urlList":[]}}