{"title":"Wiley - Teach Yourself VISUALLY Windows 7  (Sept 2009)","uid":5180326,"size":84569027,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ecd26209b3c55c164b53f182a3f09d94180f7b1&amp;dn=Wiley+-+Teach+Yourself+VISUALLY+Windows+7++%28Sept+2009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"citygoer2","files":-1,"time":1259205003,"description":"A practical guide for visual learners who are eager to get started with Windows 7\n\nWindows 7 is Microsoft's highly anticipated operating system used by millions of people around the world. If you're a visual learner and are new to Windows 7, then this book is an ideal introduction to the new features of this operating system. Seasoned author Paul McFedries walks you through the basics and beyond of Windows 7 in a straightforward manner.\n\nYou'll discover how to install and repair programs, maintain your system, set up password-protected accounts, load images from a digital camera, play music and other media files, secure Internet and e-mail accounts, and much more. More than 150 tasks are accompanied by full-color screen shots as they guide you to becoming a confident user of Windows 7.\nExperienced author Paul McFedries walks you through Microsoft's eagerly awaited new operating system: Windows 7\nClear and succinct explanations, step-by-step instructions, and full-color screen shots take you through the newest features of Windows 7\nMore than 150 Windows 7 tasks show you the basics and beyond, including installing and repairing programs, maintaining your system, loading images from a digital camera, and more\n\nThis book is essential if you are a visual learner who is enthusiastic about diving in and exploring all that Windows 7 has to offer!\n\nProduct Details\nPaperback: 352 pages\nPublisher: Visual (September 15, 2009)\nLanguage: English\nISBN-10: 0470503866\nISBN-13: 978-0470503867\n","torrent":{"xt":"urn:btih:6ecd26209b3c55c164b53f182a3f09d94180f7b1","amp;dn":"Wiley+-+Teach+Yourself+VISUALLY+Windows+7++%28Sept+2009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ecd26209b3c55c164b53f182a3f09d94180f7b1","infoHashBuffer":{"type":"Buffer","data":[110,205,38,32,155,60,85,193,100,181,63,24,42,63,9,217,65,128,247,177]},"announce":[],"urlList":[]}}