{"title":"Tesla - Gettin' Better  (2nafish)","uid":5490787,"size":125708292,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6ed2d2ff295f9f93896dd5d87221fd01d84d651b&amp;dn=Tesla+-+Gettin%5C%27+Better++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1270987052,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nMechanical Resonance is the debut album by the American rock band Tesla. It was released in 1986.\n\nTesla is an American hard rock band formed in Sacramento, California  in 1984.They have sold 6 million albums in the United States.\n\nThe band formed in 1984 in Sacramento as City Kidd, and was renamed Tesla during the recording of their first album, 1986's Mechanical Resonance, on the advice of their manager that City Kidd was not a great name (in addition, there was already another band going by that name). The band derived their name, certain album and song titles, and some song content from events relating to inventor and electrical engineer Nikola Tesla.\n\nThe band's original lineup consisted of lead vocalist Jeff Keith, guitarists Frank Hannon and Tommy Skeoch, bassist Brian Wheat, and drummer Troy Luccketta.\n\nTesla's music is often referred to as heavy metal, but is better described as blues metal. The band's lyrics also strayed from the themes popular in heavy metal, particularly in the 1980s at the beginning of their career. A further distinction from their contemporaries was their T-shirt-and-jeans image which was in strong contrast to Glam Metal bands of the time, which were characterized by big hair, leather pants, and flashy makeup. Also in the early days of their career, Tesla toured with David Lee Roth, Def Leppard, and Poison which incorrectly resulted in the band being categorized as a Glam metal band. The band's members resented this labelling.\n\nOn August 11, 2008, it was reported that Tesla's next album, entitled Forever More, would be released on October 7th on their own record label, Tesla Electric Company Recordings. The album was produced by Terry Thomas, who produced Bust a Nut. The band aired the album's first single, &quot;I Wanna Live&quot; on radio stations across the globe on August 18th and kicked off a world tour on October 1st. Forever More debuted No. 33 on The Billboard 200 chart and spawned singles I Wanna Live, Fallin' Apart &amp; Breakin' Free. In 2009, it was announced that Tesla will be among the performers on the cruise ship &quot;ShipRocked&quot; in November 2009.\n\nIn 2010, the band announced that they are working on material for a new album.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:6ed2d2ff295f9f93896dd5d87221fd01d84d651b","amp;dn":"Tesla+-+Gettin%5C%27+Better++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ed2d2ff295f9f93896dd5d87221fd01d84d651b","infoHashBuffer":{"type":"Buffer","data":[110,210,210,255,41,95,159,147,137,109,213,216,114,33,253,1,216,77,101,27]},"announce":[],"urlList":[]}}