{"title":"Historical Dictionary of Jehovah's Witnesses","uid":5133394,"size":2302167,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f667bc284d202cd4d25a3f09cce0e47eceba566&amp;dn=Historical+Dictionary+of+Jehovah%5C%27s+Witnesses&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EdwardTeach","files":-1,"time":1256316273,"description":"DESCRIPTION\n-----------\nOriginating from a small group of Bible students led by Charles Taze Russell in the 1870s, the Watch Tower Society grew into an international society. After Russell's death in 1916, Franklin Rutherford was named his successor and gave the society a new name: &quot;Jehovah's Witnesses.&quot; The Historical Dictionary of Jehovah's Witnesses shows how World War I &amp; II influenced Watch Tower attitudes to civil government, armed conflict, and medical innovations like blood transfusion, as well as to mainstream churches and the development of Jehovah's Witnesses' door-to-door evangelism.\n\nThe theme of prophecy, the doctrine of the 144,000, end-time calculations, Armageddon, and the Witnesses' denial of hell are all considered in the Historical Dictionary of Jehovah's Witnesses, which contains a chronology, an introductory essay, a bibliography, and 250 cross-referenced dictionary entries relating to key people and concepts.\n\nABOUT THE AUTHOR\n----------------\nGeorge Chryssides is currently Head of Religious Studies at the University of Wolverhampton, England. \n\n\nONE READER REVIEW\n-----------------\nChryssides' Historical Dictionary of Jehovah's Witnesses is a well written attempt to describe the Jehovah's Witnesses' community. Written down in brevity, it covers their historical development, keeping the distance resulting to a desirable neutral point of view. The lexicographical part of the book is a well-arranged practical tool. It worths a place at the library of the one that is studying Jehovah's Witnesses' phenomenon.\n\n","torrent":{"xt":"urn:btih:6f667bc284d202cd4d25a3f09cce0e47eceba566","amp;dn":"Historical+Dictionary+of+Jehovah%5C%27s+Witnesses","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f667bc284d202cd4d25a3f09cce0e47eceba566","infoHashBuffer":{"type":"Buffer","data":[111,102,123,194,132,210,2,205,77,37,163,240,156,206,14,71,236,235,165,102]},"announce":[],"urlList":[]}}