{"title":"Fifty Foot Hose - Cauldron  (Acid Rock)","uid":5058074,"size":370265990,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6f6678d07c742e94dc5d378f345ae23ec5f17f82&amp;dn=Fifty+Foot+Hose+-+Cauldron++%28Acid+Rock%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sowingmyseed","files":21,"time":1250528537,"description":"This is a torrent that another Pirate uploaded w/o any track names. I have named the known tracks in correct file structure.\n\nThis is without a doubt one of the most tripped-out albums you will ever hear. Hailing from San Fransisco, Fifty Foot Hose's music is idiosyncratic west coast psychedelia layered with electronic madness similar to that of the United States of America and White Noise. The group consisted of founding member/bassist Louis &quot;Cork&quot; Marcheschi, guitarist David Blossom, vocalist Nancy Blossom (married to David), drummer Kim Kimsey and guitarist Larry Evans. Influenced by experimental composers like Edgard VarÃƒÂ©se, John Cage, Terry Riley, and George Antheil, Cork Marcheschi created his own electronic instrument from various elements like theremins, fuzzboxes, a cardboard tube, and a speaker from a World War II aircraft bomber...what a total fucking badass. His experimentations proved to be worthwhile because some of the noises created on this album sound from anywhere but earth. The rest of the group is on point too. There are some top-notch acid guitar leads and Nancy Blossom's powerful vocals are reminiscent of Grace Slick without being too derivative. There are some male vocals as well that are good, but Nancy Blossom's contributions are more compelling and confident. The vast experimental explorations of the album never seem to hinder the quality of the songs, making for one beast of an album. The last four songs are bonus tracks, which includes Cork Maraschi's wild atonal experiment, &quot;Bad Trip,&quot; which foreshadows the directions noise bands would be headed a decade later. Another thing worth noting is that the song &quot;God Bless the Child&quot; is a Billie Holiday cover, which I've yet to check out.","torrent":{"xt":"urn:btih:6f6678d07c742e94dc5d378f345ae23ec5f17f82","amp;dn":"Fifty+Foot+Hose+-+Cauldron++%28Acid+Rock%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f6678d07c742e94dc5d378f345ae23ec5f17f82","infoHashBuffer":{"type":"Buffer","data":[111,102,120,208,124,116,46,148,220,93,55,143,52,90,226,62,197,241,127,130]},"announce":[],"urlList":[]}}