{"title":"Iron Maiden - Live After Death (resequenced and expanded by Heyw","uid":6206780,"size":882195074,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6f80c163216c209e5173d4e21176156e0c7452a4&amp;dn=Iron+Maiden+-+Live+After+Death+%28resequenced+and+expanded+by+Heyw&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Flyfisher61","files":39,"time":1298836837,"description":"Iron Maiden\nLive After Death\nOctober 4-10, 1984 Hammersnith Odeon, London, ENG\nMarch 15, 1985 Sports Arena, Los Angeles, CA\n\nWhat we have here is Iron Maiden's first full length live album Live After Death restore to its full length, with bonus tracks added, and in (nearly) the correct order that it was played.\n\nLive After Death was originally released in October 1985 as a rather long LP (over 100 minutes, quite a lot to cram onto 4 LP sides). When it was released on CD that December they wanted to keep it down to a single disc, so the fourth album side went bye-bye. So did the long audience participation section of Running Free. Then, for one year (1995), Maiden re-released all of their album with a second CD of b-sides and charged a bargain price of $10 each for them. The songs &quot;Sanctuary&quot;, &quot;Murders in the Rue Morgue&quot;, and &quot;Losfer Words&quot; came from that disc. In 1998 they then re-re-released it as an enhanced CD with a second disc containing the lost fourth album side. The album you now see is a hybrid of all those versions (as well as some audience noise I snatched from the DVD version to smooth out transitions).\n\nThis album has been resequenced to follow the setlist of the tour a bit more closely that it was before. The only liberties I took were because the Hammersmith show that originally was the fourth album side had a very different setlist than the American shows did. At this show Murders in the Rue Morgue was played between &quot;Revelations&quot; and &quot;Flight of Icarus&quot;, but with the sources provided there wasn't enough room between those songs to properly segue it in. Therefore it is now placed after &quot;Icarus&quot;. Also, Bruce Dickinson likes to tell stories during Maiden shows. These shows are no different, but the stories before &quot;Rime of the Ancient Mariner&quot; and &quot;Losfer Words&quot; were cut from the album. This makes the intro of &quot;Losfer Words&quot; seem like it comes out of nowhere, but that's all I had to work with. I have included the edited version of &quot;Running Free&quot; as a bonus at the end of the album.\n\n01 Intro: Churchill's Speech\n02 Aces High\n03 2 Minutes To Midnight\n04 The Trooper\n05 Revelations\n06 Flight Of Icarus\n07 Murders in the Rue Morgue\n08 Rime of the Ancient Mariner\n09 Losfer Words (Big 'Orra)\n10 Powerslave\n11 Wrathchild\n12 Die With Your Boots On\n13 The Number of the Beast\n14 Hallowed Be Thy Name\n15 22 Acacia Avenue\n16 Children Of The Damned\n17 Phantom of the Opera\n18 Iron Maiden\n19 Run to the Hills\n20 Running Free\n21 Sanctuary\n22 Running Free (single edit)","torrent":{"xt":"urn:btih:6f80c163216c209e5173d4e21176156e0c7452a4","amp;dn":"Iron+Maiden+-+Live+After+Death+%28resequenced+and+expanded+by+Heyw","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f80c163216c209e5173d4e21176156e0c7452a4","infoHashBuffer":{"type":"Buffer","data":[111,128,193,99,33,108,32,158,81,115,212,226,17,118,21,110,12,116,82,164]},"announce":[],"urlList":[]}}