{"title":"Duran Duran - The Reflex [Bananas tv show 1984].VOB","uid":6279339,"size":144771072,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:70bf34b8a997a0a02644cd6ca8a319072985d2f3&amp;dn=Duran+Duran+-+The+Reflex+%5BBananas+tv+show+1984%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1301381766,"description":"Duran Duran - The Reflex [Bananas tv show 1984].VOB\n\n\nVery HQ Bananas tv show promo music video from an outstanding and very rare 1980's tv show from Germany, broadcasted from 1981 to 1984, this is practically unknown in America, but this show has very well known artists of the 1980's.\n\nThe rarity of this show is that, all the appearances of very well known guests are a whole new promo music video production that easly could be considered as never seen before videos or second versions of several classic 80's videos.\n\n&quot;The Reflex&quot; is the eleventh single by Duran Duran, released worldwide on 16 April 1984. The song was heavily remixed for single release and was the third and last to be taken from their third album Seven and the Ragged Tiger.\n\n&quot;The Reflex&quot; became the band's most successful single. It was their second single to top the UK singles chart, after &quot;Is There Something I Should Know?&quot; in 1983, and would prove to be their last UK #1. It was also Duran Duran's first single to hit number one on the U.S. Billboard Hot 100 (for two weeks) on 23 June 1984, and became a huge hit internationally. The band wanted it to be the lead single from Seven and the Ragged Tiger, but their label didn't like the warbling singing during the &quot;why don't you use it&quot; segments, thinking this would hinder its success as a stand alone single track.\n\nThe remixes for both the 7&quot; and 12&quot; singles were done by Nile Rodgers, of Chic fame. It was his first work with the band, and he would later go on to produce &quot;The Wild Boys&quot; single as well as the album Notorious (1986) and several tracks on Astronaut (2004).\n\nProducer Ian Little recalls the sound Nick Rhodes came up with on his Roland Jupiter-8 keyboard: &quot;...whenever I hear that steel-drum part it always brings a smile to my face because it's so out of tune. Steel drums always are, but it was exactly right in terms of rhythm and tone. So a wood-block sound was mixed in to make it even more percussive and, Bob's your uncle, it did the job.&quot;\n(video has a semi-transparent white &quot;festival&quot; logo at the top right)\n\n\n     &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Reflex&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Reflex&lt;/a&gt; \n       &lt;a href=&quot;\nhttp://bayimg.com/CAEAeaADL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/CAEAeaADL&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25.00fps 9640kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:02:59\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated January 31, 2011\n\n*Media Player Classic Home Cinema*          &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n","torrent":{"xt":"urn:btih:70bf34b8a997a0a02644cd6ca8a319072985d2f3","amp;dn":"Duran+Duran+-+The+Reflex+%5BBananas+tv+show+1984%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70bf34b8a997a0a02644cd6ca8a319072985d2f3","infoHashBuffer":{"type":"Buffer","data":[112,191,52,184,169,151,160,160,38,68,205,108,168,163,25,7,41,133,210,243]},"announce":[],"urlList":[]}}