{"title":"Isabella, She Wolf of France  (Abridged)  -  Alison Weir","uid":5043668,"size":24975115,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7115da493221244a053731e18122aebce33694cc&amp;dn=Isabella%2C+She+Wolf+of+France++%28Abridged%29++-++Alison+Weir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sheila6","files":8,"time":1249512500,"description":"Audio Books : General : MP3/Variable : English\n\n\nIsabella of France, born in 1292, was married to Edward II at the age of 12. Unfortunately for her the king was not only homosexual but was already entrenched in a relationship with Piers Gaveston. (What a perfect name for the gay king's favourite!) \n\nAt a time of constant strife and savage reprisals, it is unlikely that the intelligent and beautiful Isabella would have lived out her natural life span had she been less well endowed with a strong and cunning instinct for self preservation. During her life time, two of her sisters were caught in adultery, both they and their lovers suffering the sternest penalty. \n\nIsabella herself survived the era of Gaveston, (who was pierced through the heart and beheaded), and appears to have been a true wife, bearing her husband four children - but before long her husband had found another male lover, Hugh Despenser, who became a threat to her very existence. Taking a lover herself, Isabella was runing the highest risk of all in medieval times when women were seen as very much subservient to men, and the authority of the king was seen as absolute. \n\nIsabella and her lover Roger Mortimer eventually invaded England from France to shake England free from the tyranny of the errant king and Despenser. Hers was the first succesful invasion of England since the Norman Conquest of 1066, and it was also one of the most succesful coups in English history. \n\nThe most hideous revenge was exacted on Despenser, who was half hanged, his privates cut off and thrown into a fire, and finally eviscerated and beheaded. Edward II met a similarly horrible end, with a &quot;hot brush put through the secret place posterial&quot;. Edward III, as soon as he was old enough, avenged his father by putting Mortimer to death in his turn. Isabella was fortunate to be allowed to live out the rest of her life in quietness but she seems never to have fully recovered from the horror of her lover's death. \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:7115da493221244a053731e18122aebce33694cc","amp;dn":"Isabella%2C+She+Wolf+of+France++%28Abridged%29++-++Alison+Weir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7115da493221244a053731e18122aebce33694cc","infoHashBuffer":{"type":"Buffer","data":[113,21,218,73,50,33,36,74,5,55,49,225,129,34,174,188,227,54,148,204]},"announce":[],"urlList":[]}}