{"title":"National Building Code Of India 2005","uid":5019751,"size":95599716,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71655832f6c0ef6555c231b8d659369f7bfd99b4&amp;dn=National+Building+Code+Of+India+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ptmp","files":3,"time":1248396061,"description":"The National Building Code of India (NBC), a comprehensive building Code, is a national instrument providing guidelines for regulating the building construction activities across the country. It serves as a Model Code for adoption by all agencies involved in building construction works be they Public Works Departments, other government construction departments, local bodies or private construction agencies. The Code mainly contains administrative regulations, development control rules and general building requirements; fire safety requirements; stipulations regarding materials, structural design and construction (including safety); and building and plumbing services.\n\nThe Code was first published in 1970 at the instance of Planning Commission and then revised in 1983. Thereafter three major amendments were issued, two in 1987 and the third in 1997.\n\nConsidering a series of further developments in the field of building construction including the lessons learnt in the aftermath of number of natural calamities like devastating earthquakes and super cyclones witnessed by the country, a Project for comprehensive revision of NBC was taken up under the aegis of National Building Code Sectional Committee, CED 46 of BIS and its 18 expert Panels; involving as many as 400 experts. As a culmination of the Project, the revised NBC has now been brought out as National Building Code of India 2005 (NBC 2005).\n\nThe comprehensive NBC 2005 contains 11 Parts some of which are further divided into Sections totalling 26 chapters (see Annex 1). The salient features of the revised NBC (see Annex 2) include, apart from other changes made, the changes specially in regard to further enhancing our response to meet the challenges posed by natural calamities and reflecting the state-of-the-art and contemporary applicable international practices. \n\n\n\n\nCONTENTS OF NBC 2005\n\n\nPART 0 INTEGRATED APPROACH - PREREQUISITE FOR APPLYING\nPROVISIONS OF THE CODE\n\nPART 1 DEFINITIONS\n\nPART 2 ADMINISTRATION\n\nPART 3 DEVELOPMENT CONTROL RULES AND GENERAL BUILDING REQUIREMENTS\n\nPART 4 FIRE AND LIFE SAFETY\n\nPART 5 BUILDING MATERIALS\n\nPART 6 STRUCTURAL DESIGN\nSection 1 Loads, Forces and Effects Section 2 Soils and Foundations\nSection 3 Timber and Bamboo\n3A Timber\n3B Bamboo\nSection 4 Masonry Section 5 Concrete\n5A Plain and Reinforced Concrete\n5B Prestressed Concrete\nSection 6 Steel\nSection 7 Prefabrication, Systems Building and Mixed/ Composite Construction\n7A Prefabricated Concrete\n7B Systems Building and Mixed/Composite Construction\n\nPART 7 CONSTRUCTIONAL PRACTICES AND SAFETY\n\nPART 8 BUILDING SERVICES\nSection 1 Lighting and Ventilation\nSection 2 Electrical and Allied Installations\nSection 3 Air conditioning, Heating and Mechanical Ventilation\nSection 4 Acoustics, Sound Insulation and Noise Control\nSection 5 Installation of Lifts and Escalators\n\nPART 9 PLUMBING SERVICES\nSection 1 Water Supply, Drainage and Sanitation (including\nSolid Waste Management)\nSection 2 Gas Supply\n\nPART 10 LANDSCAPING, SIGNS AND OUTDOOR DISPLAY STRUCTURES\nSection 1 Landscape Planning and Design\nSection 2 Signs and Outdoor Display Structures ","torrent":{"xt":"urn:btih:71655832f6c0ef6555c231b8d659369f7bfd99b4","amp;dn":"National+Building+Code+Of+India+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71655832f6c0ef6555c231b8d659369f7bfd99b4","infoHashBuffer":{"type":"Buffer","data":[113,101,88,50,246,192,239,101,85,194,49,184,214,89,54,159,123,253,153,180]},"announce":[],"urlList":[]}}