{"title":"Chris Standing - Soul Express (2006) [Smooth Jazz][mp3 320][h33t","uid":5000575,"size":129797155,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:71ddae17c866512031ba98a13cb47a214d8e0139&amp;dn=Chris+Standing+-+Soul+Express+%282006%29+%5BSmooth+Jazz%5D%5Bmp3+320%5D%5Bh33t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":17,"time":1247496530,"description":"Chris Standing - Soul Express \nOriginal Release Date: May 9, 2006 \nAudio CD: May 9, 2006 \nLabel: Trippin 'n Rhythm \nBitrate: 320 Kbps\n\nI recently got XM radio and I kept hearing this tune, looking at the display and by the 3rd time, this name Chris Standring soaked in.  I've actually heard of hm before but this is the first of his CDs I purchased.  Now that I have listened to the whole thing, I didn't even need to listen to a 2nd time to heartily recommend it for anyone who likes a jazz guitar CD.  I can't say it is this or that, This guy has a distinctive sound.  The first tune Catwalk is simple but resonates.  The title track Soul Express has a quiet sophisticated mood.  And the tune that caught my attention on XM was I Can't Help Myself.  This was money well spent!!!! ~ G.  Bates\n\nChris Standring's latest CD, &quot;Soul Express&quot; is truly awesome.  If you like smooth jazz, smooth techno music, and some acid jazz, this CD is a highly recommend for your collection.  It's a mix of groovy, funky, and melodic music.  This CD is mostly instrumental with some melodic background vocals.  If you like George Benson, Ronny Jordan, or Avenue Blue, you will enjoy this CD.  \n\n&quot;Catwalk&quot; has groovy beats with soul guitar licks.  &quot;Kaleidocscope&quot; is little more like chill music.  &quot;Constellation&quot; is pretty much like ambient club music.  &quot;A Method to the Madness&quot; has a funky smooth jazz sound with George Benson-like background vocal.  &quot;I Can't Help Myself&quot; is a smash hit on smooth jazz radio.  The title track, &quot;Soul Express&quot; is hypnotic with a lyrical guitar synthesizer.  &quot;Through the Looking Glass&quot; is a song that he recorded back in the 90's as a single and was not available on any of his CD's in the U. S.  until now with improved re-mixed version.  &quot;Mumbo Jumbo&quot; also has a melodic George Benson-like vocal sound along with deep rhythmic bass.  Stevie Wonder's &quot;As&quot; has a harmonica added to the mix, and you'll hear soothing vocals in the background.  The swinging rhythmic of &quot;Shooting Stars&quot; is filled with a dexterous guitar.  John Coltrane's &quot;Giant Steps&quot; is kind of like a smooth electronica with an acid jazz guitar in the foreground.  \n\nI really enjoy listening to &quot;Soul Express,&quot; and it can be addicting.  I probably will never take this CD out of my CD changer.  It's perfect for your workplace, driving, playing fun games, or else that keep you going smoothly.  Grade: A ~ Tamara Hammerand\n\nPersonnel:\nCHRIS STANDING - Guitars/Vocoder/Keyboard Programming\nRICO BELLED - Bass Guitars\nROBERTO VALLY - Bass Guitars \nANDRE BERRY - Bass Guitars\nLARRY STEEN -Acoustic Bass \nSTAN SARGENT -Acoustic Bass\nJEFF ROBINSON- Vocals\nC.  C.  WHITE - Vocals\nRODNEY LEE - Keyboards, Programming\nCHUCK CYMONE -Programming\nPAUL BROWN - Percussion\nDINO SOLDO - Harmonica\nDAVE KARASONY - Drums\n\nChris Standing - Soul Express Tracks. \n01  Catwalk \n02  Kaleidoscope \n03  Constellation \n04  A Method to the Madness \n05  I Can't Help Myself \n06  Soul Express \n07  Through the Looking Glass \n08  Mumbo Jumbo \n09  As \n10  Shooting Stars \n11  Giant Steps \n\n","torrent":{"xt":"urn:btih:71ddae17c866512031ba98a13cb47a214d8e0139","amp;dn":"Chris+Standing+-+Soul+Express+%282006%29+%5BSmooth+Jazz%5D%5Bmp3+320%5D%5Bh33t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71ddae17c866512031ba98a13cb47a214d8e0139","infoHashBuffer":{"type":"Buffer","data":[113,221,174,23,200,102,81,32,49,186,152,161,60,180,122,33,77,142,1,57]},"announce":[],"urlList":[]}}