{"title":"La reliquia de Yahveh [ebook].","uid":6160958,"size":3853239,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:720d4dfd5d95189358203b494771e3be0652ed68&amp;dn=La+reliquia+de+Yahveh+%5Bebook%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1297210756,"description":"En una excursiÃƒÂ³n por el desierto egipcio, una arqueÃƒÂ³loga, Marie Mariette, descubre la lÃƒÂ¡pida de entrada a una tumba aparentemente intacta. Toma unas fotografÃƒÂ­as y vuelve a tapar su descubrimiento con vistas a una exploraciÃƒÂ³n posterior.\n\nUna vez analizadas las fotos llega a la conclusiÃƒÂ³n que el enterramiento pertenece a Sheshonk I, un legendario faraÃƒÂ³n de los tiempos de SalomÃƒÂ³n que, segÃƒÂºn la Biblia, consiguiÃƒÂ³ invadir y saquear la ciudad de JerusalÃƒÂ©n en el siglo X antes de Cristo. Y eso no es todo, en la puerta de entrada al complejo subterrÃƒÂ¡neo tambiÃƒÂ©n aparece nÃƒÂ­tidamente representada el Arca de la Alianza, el cofre de oro puro donde los israelitas guardaban las Tablas de los Diez Mandamientos y sus mÃƒÂ¡s preciados tesoros religiosos.\n\n\nAnte tamaÃƒÂ±o hallazgo, se organiza secretamente una expediciÃƒÂ³n relÃƒÂ¡mpago de la que tambiÃƒÂ©n formarÃƒÂ¡n parte un detective de Scotland Yard experto en jeroglÃƒÂ­ficos y en las Sagradas Escrituras, John Winters, y un conservador del Museo de El Cairo, AlÃƒÂ­ Khalil.\n\nSin embargo, no serÃƒÂ¡ tan fÃƒÂ¡cil recuperar el sagrado vestigio: la tumba estÃƒÂ¡ llena de enigmÃƒÂ¡ticos acertijos y numerosas trampas mortales, el Arca se revela como algo mÃƒÂ¡s que un simple e inofensivo objeto de culto y los servicios secretos de varios paÃƒÂ­ses pugnan por hacerse con tan preciada y terrible reliquia.\n\n ","torrent":{"xt":"urn:btih:720d4dfd5d95189358203b494771e3be0652ed68","amp;dn":"La+reliquia+de+Yahveh+%5Bebook%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"720d4dfd5d95189358203b494771e3be0652ed68","infoHashBuffer":{"type":"Buffer","data":[114,13,77,253,93,149,24,147,88,32,59,73,71,113,227,190,6,82,237,104]},"announce":[],"urlList":[]}}