{"title":"House of Secrets (DC Comics)","uid":5115355,"size":2997515288,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:721318d0ce6e52636b1c7158b3d7f20e1326ad2d&amp;dn=House+of+Secrets+%28DC+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"brodahisou","files":-1,"time":1255032507,"description":"The House of Secrets was a horror and suspense anthology comic book series published by DC Comics. It was the companion series to House of Mystery.\n\nThe original Silver Age series ran 80 issues, from November/December 1956 to September/October 1966.  In addition to short, 'one-off' stories, several issues beginning with No. 23, August, 1959 featured the adventures of modern-dress sorcerer Mark Merlin. The dual-personality Eclipso was introduced in issue #61 (Aug. 1963), continuing to the series' end.  Prince Ra-Man the Mind-Master bowed in #73 (Oct. 1965) (later retconned into being the same person as Mark Merlin).  Other, lesser continuing features included &quot;Peter Puptent, Explorer&quot;; &quot;Dolly and the Professor&quot;; &quot;Doctor Rocket&quot;; and &quot;Moolah the Mystic&quot;. The title was cancelled after #80, dated September-October 1966.\n\nThe series was revived three years later beginning with issue #81 (Aug.-Sept. 1969).  Now its horror and suspense tales were introduced by a host named Abel, who would also host the satirical comic Plop!.  His brother Cain hosted House of Mystery.\n\nThis revival, sporting many covers by Neal Adams, Bernie Wrightson and Mike Kaluta.  The series became a victim of the DC Implosion and ended with #154, but was 'merged' into The Unexpected with issue #189, through issue #199. \n\nThe House of Secrets also came to be the name of the actual edifice in which Abel lives.  Mike Friedrich (writer) and Jerry Grandenetti (artist) introduced the house and explained its origins.  Neil Gaiman's The Sandman series revealed it exists both in the real world of the DC Universe and in the Dreaming, as a repository for secrets of all kinds.\n\nDC's Vertigo imprint revived the name House of Secrets as a new title and concept.  Starting afresh with a new #1 (October 1996), this book ran 25 issues, plus a two-part House of Secrets: Facade special.  Here the House of Secrets was a mobile manor, appearing in different places.  The building itself is haunted by the Juris, a group of ghosts who summon those with secrets in order to judge them and pass sentence.  To the Juris, all offenses carry the same weight, from rape and murder to simply lying at a crucial moment.  A runaway named Rain Harper stumbled upon the House of Secrets and took up a position as an unwilling witness to the Juris trials, validating the judgments and either condemning the tried souls to imprisonment in the basement, or setting them free to live their life purged of their secret.\n\nThis House of Secrets series was creator-owned (except for its title which was kind of &quot;licensed&quot; by DC to the series' creators) and therefore is not part of the DC Universe continuity. Indeed, the letters column in issue #6 indicates that they could not, for legal reasons, include Cain and Abel in the stories.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:721318d0ce6e52636b1c7158b3d7f20e1326ad2d","amp;dn":"House+of+Secrets+%28DC+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"721318d0ce6e52636b1c7158b3d7f20e1326ad2d","infoHashBuffer":{"type":"Buffer","data":[114,19,24,208,206,110,82,99,107,28,113,88,179,215,242,14,19,38,173,45]},"announce":[],"urlList":[]}}