{"title":"Bukka White - Fixin' to Die (Blues)","uid":5187698,"size":56141869,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:72271502be6b3ea85b8e28c6e66b2d33df9341de&amp;dn=Bukka+White+-+Fixin%5C%27+to+Die+%28Blues%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"muzik62","files":-1,"time":1259538049,"description":"Fixin' to Die - Bukka White\n\nmp3 192 kbits\n\n01 Shake 'em on down\n02 Parchaman farm Blues\n03 Fixin' train Blues\n04 District atterney Blues\n05 Aberdeen Mississippi Blues\n06 Pinebluff Arkansas\n07 Black train Blues\n08 Bukka's jitterbug swing\n09 When can i change my clothes\n10 Special streamline\n11 Strange place Blues\n12 High fever Blues\n13 Sleepy man Blues\n14 Good gin Blues\n\nHe was born Booker T. Washington White (Bukka became his name due to a mistake in one of his recording sessions many years later) in 1909, and had a career lasting until 1977. His first recording session was in 1930; he didn't make much of an impression since he did not record anything else until 1937. This CD features his early recordings, made in 1930, 1937, 1939, and 1940.\n\nThe liner notes identify him as one of the early greats, the end of the line of blues players originating with Charley Patton and Son House (with Tommy Johnson thrown in for good measure). From this early generation came later well know blues players such as Robert Johnson and Muddy Waters.\n\nAnyhow, what about his craft and his art? Three cuts illustrate:\n\n&quot;The New Frisco Train&quot; comes from his first recording session. Early on, he did railroad songs as one of his genres, and this song comes from that set of works. He shows very good guitar playing, comparing very favorably with the guitar work of others early blues singers. His blues voice is mighty fine, too. The song's focus is trains. There is a second vocalist, identified as &quot;Miss Minnie.&quot; The back and forth banter between the two works nicely. The recording quality isn't great, but it's better than some other early blues recordings.\n\n&quot;Shake 'em on down&quot; is a 1937 cut, from his second recording session. This is much more blues oriented than the song previously mentioned. Again, nice guitar work and some good blues vocal wailing.\n\n&quot;Fixin' to Die&quot; was later covered by Bob Dylan, according to the notes. There is the recurring line:\n\n&quot;I know I was born to die. . . .&quot;\n\nGood guitar work again and fine singing. He's backed on washboard by &quot;Washboard Sam.&quot;\n\nThis is the first work of Bukka White that I have ever listened to(if my memory is correct). And I'm pretty happy with what I have listened to! White is an important part of the early blues, ranking with some of the other greats of the era. \n\nmuzik62","torrent":{"xt":"urn:btih:72271502be6b3ea85b8e28c6e66b2d33df9341de","amp;dn":"Bukka+White+-+Fixin%5C%27+to+Die+%28Blues%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72271502be6b3ea85b8e28c6e66b2d33df9341de","infoHashBuffer":{"type":"Buffer","data":[114,39,21,2,190,107,62,168,91,142,40,198,230,107,45,51,223,147,65,222]},"announce":[],"urlList":[]}}