{"title":"Deep Purple - Deep Purple (1969) WMA320","uid":6292025,"size":112716495,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:723ca3b2df0999247b3b2deead519e645f9aa028&amp;dn=Deep+Purple+-+Deep+Purple+%281969%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1301854112,"description":"Fans of good ole' DP Mark II may roll their eyes. But I rate this album as an all-time classic up there with &quot;In Rock&quot; and &quot;Machine Head&quot;. Aside from some heavy classical music influences on &quot;Blind&quot; and &quot;April&quot;, and the fact that Rod Evans isn't a &quot;screamer&quot;, this VERY MUCH sounds like a 70's Deep Purple album. &quot;Chasing Shadows&quot; is a percussional tour de force for Ian Paice. &quot;The Painter&quot; is an absolutely rippin' hard rock number with tremendous organ and guitar solos and frenzied rhythm section. &quot;Why Didn't Rosemary&quot; is a classic bluesy shuffle in the vein of &quot;Wring That Neck&quot; or &quot;Strange Kind Of Woman&quot;. Rod Evans has a terrific voice for the ballads. He's a genuine crooner!!! Their beautiful cover of Donovan's &quot;Lalena&quot; is one of the best things he ever sang. (Which is saying a lot if you've ever heard Captain Beyond). &quot;April&quot; is a long, three movement track that dips DEEPLY into classical music. But it's hauntingly sad and beautiful. The interweaving of Ritchie's superb guitar and Jon's sombre organ is a classic moment that reveals the VERY high caliber musicianship of this group. Musicianship is what this album is all about! It is the best album this lineup did. There are no weak tracks and the beauty is that it will appeal as much to fans of progressive rock as hard rock. Lord and Blackmore are way to talented to just limit to straight &quot;heavy metal&quot;. This work showcases every dimension of the group, and is a great fusion of classical, blues, jazz, progressive and hard rock music. It has a &quot;depth&quot; that their heavier albums never captured. The bonus tracks on the CD are all very good. The alternate version of &quot;Bird Has Flown&quot; is more punchy and aggressive. A real treat. The BBC versions of &quot;Emmaretta&quot; and &quot;Lalena&quot; are solid. The singles version of &quot;Emmeretta&quot; also surfaces in remastered glory. This tune had &quot;hit single&quot; written all over it. The detailed booklet is full of great historical info. For anybody who thinks that &quot;Hush&quot; was what the 1st DP lineup was all about, you really need to hear this CD. If you only ever listen to one album by Mark I, this is the one.\n\nby Chris Gerbig\n\nTRACKLIST:\n\n01 - Chasing Shadows.wma                                         \n02 - Blind.wma                                                   \n03 - Lalena.wma                                                  \n04 - A) Fault Line, B) The Painter.wma                           \n05 - Why Didn't Rosemary.wma                                     \n06 - Bird Has Flown.wma                                          \n07 - April.wma   \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!","torrent":{"xt":"urn:btih:723ca3b2df0999247b3b2deead519e645f9aa028","amp;dn":"Deep+Purple+-+Deep+Purple+%281969%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"723ca3b2df0999247b3b2deead519e645f9aa028","infoHashBuffer":{"type":"Buffer","data":[114,60,163,178,223,9,153,36,123,59,45,238,173,81,158,100,95,154,160,40]},"announce":[],"urlList":[]}}