{"title":"Der var engang aka Once Upon a Time (1922)","uid":4990867,"size":734152249,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:724c941f711b44273175fbea6c005dfb3dbc1683&amp;dn=Der+var+engang+aka+Once+Upon+a+Time+%281922%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Willams","files":4,"time":1247031705,"description":"Der var engang aka Once Upon a Time (1922)\n\n\nDer var engang aka Once Upon a Time it's a Danish film directed by Carl Theodor Dreyer.\n\nFrom Imdb: &quot;It is said that Dreyer himself thought that the movie was a failure, because he relied too much on atmosphere, rather than personalities (all his great movies are character dramas). It is true that the dimensionality of the characters in this charming little fairytale is very limited. But you know what, some of the cinematography is awesome, really awesome. A lot of the shots are very painterly, and the costume design is really rather good. My favourite shot is of the princess and her ladies in their fineries looking out of a castle window at sunset on the sea. The longing is palpable because of course there are no adventures in far-flung lands to be had for women at court. (There is cold hard cash available for anyone who can provide me with a print of the shot). It reminded me very much of a place in the ruins of the castle Tintagel in Cornwall. Tintagel was a geographically impregnable fortress on the Cornish coast where King Arthur is reputed to have been born. The part that I am referring to is a walled garden for the ladies of the court perched high up on the cliffs overlooking the sea. There is indeed true atmosphere in much of the film, it is a fairytale for adults. There is much escapism to be had: some of the slapstick antics of the hero's squire, Kasper RÃƒÂ¸ghat, are truly amusing (including a couple of laugh-out-loud moments).\n\nIt is true that the taming of the shrew theme of the plot is a bit tedious. It is also a problem that the movie peters out, and that it is very fragmented towards the end because of missing reels. However it is still very much required viewing. Not necessarily a film to recommend to fans of other Dreyer movies, it stands very much alone. It reminds me of the Crucifixion by Cimabue in the Santa Croce in Florence, which was massively damaged by flooding in 1966 but still has lost none of its essence and is one of the cities most treasured relics. &quot;\n\nThis torrent contains some posters of the film and a external Spanish subtitle. \n\nIMDB: 7.3/10\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0013059/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0013059/&lt;/a&gt;\n\n*****************************FREAKYFLICKS*****************************\n\nFreakyFlicks is a free and open community dedicated to preserving and\nsharing cinematic art in the digital era. Our goal is to disseminate\nsuch works of art to the widest audience possible through the channels\nprovided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played\nan exceptional role in the history of cinema and its progression in\nbecoming a great art. Films that are usually described as classic,\ncult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them\nand participate in our community. All you need do is include this tag\nin your upload and join us at the forum to announce your release.\n       \n \n            &lt;a href=&quot; http://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com&lt;/a&gt;\t\n\t\n\n*****************************FREAKYFLICKS*****************************\t","torrent":{"xt":"urn:btih:724c941f711b44273175fbea6c005dfb3dbc1683","amp;dn":"Der+var+engang+aka+Once+Upon+a+Time+%281922%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"724c941f711b44273175fbea6c005dfb3dbc1683","infoHashBuffer":{"type":"Buffer","data":[114,76,148,31,113,27,68,39,49,117,251,234,108,0,93,251,61,188,22,131]},"announce":[],"urlList":[]}}