{"title":"coast to coast am. 2011-03-15 - Brain Stimulation","uid":6249071,"size":55840006,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:728040525f6ac76c691eb8a923773a7aeedac6e4&amp;dn=coast+to+coast+am.+2011-03-15+-+Brain+Stimulation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mscowlove","files":5,"time":1300340402,"description":"\n\nBrain Stimulation\n-----------------\nDate: 03-15-2011\nHost: George Noory\n\nGuests: Neil Slade, Chris Kacher\n\n\nResearcher Neil Slade discussed the part of the brain called the amygdala, which controls anti-anxiety, anti-fear, and your advanced positive emotions. He likened the amygdala to a &quot;junction box&quot; inside the brain, which can be switched back and forth between the powerful frontal lobe region and the &quot;less advanced part&quot; which spawns depression, anger, and the &quot;fight or flight&quot; response. In their everyday life, Slade observed, people are constantly facing challenges and stresses that force their amygdala backward and cause negative emotions. However, by stimulating the amygdala forward and activating the frontal lobe, Slade said, it can power &quot;creativity, imagination, cooperation, intuition, and logic.&quot; He contended that, with proper techniques, a person can develop control over their amygdala's direction and &quot;smile all day long, instead of frowning.&quot; \n\nSlade shared one such method for stimulating the amygdala, which he dubbed &quot;tickling.&quot; In this process, one imagines that they are holding a feather and pushing the tip of it into the front of the forehead. &quot;Look for this little button on the left side of your brain,&quot; Slade advised, &quot;just behind your eyeball and just in from your ear.&quot; At that point, one should imagine tickling that spot with the feather, which will &quot;click your amygdala forward right there.&quot; Claiming that the results will be immediate, he said that the effect would be different for each person, ranging from relaxation to simply being friendlier. &quot;You become aware that you don't have to be bored, angry, or frustrated,&quot; he said, &quot;it just turns the key in the engine.&quot; \n\nHe also talked about his mentor, T.D.A. Lingo, who taught him about the amygdala. Slade recalled how Lingo was studying the brain and became intrigued by the question of why mankind waged war. His professor, who could not answer the question, told Lingo that he could stay at the university to research this concept, but the fastest way to find an answer would be to start his own facility. This advice inspired Lingo to buy 250 acres of &quot;pristine wilderness&quot; in Colorado where he created the Dormant Brain Lab. His goal, Slade said, was to try and find &quot;the one thing that was in common with people that were struggling with issues.&quot; Ultimately, this investigation led Lingo to understanding the power of the amygdala. Slade marveled that Lingo was &quot;connecting the dots thirty years before anyone else was doing it.&quot; \n\nJapan's Nuclear Crisis:\nIn the first hour, stock trader Chris Kacher talked about nuclear power and the misconceptions surrounding the dangers of nuclear power. While he acknowledged that the nuclear crisis in Japan is a tragedy, he opined that the &quot;situation is not as bad&quot; as it is being portrayed in the media. To that end, he cited a nuclear engineer from UC Berkley who believes that the current high levels of radiation are &quot;unlikely to be a long term health hazard, because these levels will drop.&quot; On the dangers of nuclear power, in general, Kacher noted that all of the plants around the world constitute 14,000 cumulative years of operation and that the Japanese crisis accounts for only the third disaster. He contrasted this with coal power plants, which he called the &quot;silent killer,&quot; because they cause far more health problems, but take years for their effects to become apparent.\n\n\nWebsites:\nneilslade.com\nvirtueofselfishinvesting.com\nmokainvestors.com\n\nBooks:\nThe Frontal Lobes Supercharge\nTrade Like an O'Neil Disciple\n\nANY SEEDERS PLEASE? THANKS FOR HELPING SEED!\n","torrent":{"xt":"urn:btih:728040525f6ac76c691eb8a923773a7aeedac6e4","amp;dn":"coast+to+coast+am.+2011-03-15+-+Brain+Stimulation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"728040525f6ac76c691eb8a923773a7aeedac6e4","infoHashBuffer":{"type":"Buffer","data":[114,128,64,82,95,106,199,108,105,30,184,169,35,119,58,122,238,218,198,228]},"announce":[],"urlList":[]}}