{"title":"About Adam [2000] Stuart Townsend","uid":6276805,"size":1522599777,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:72a574ce5353791e046d4a45819393fba8427dd7&amp;dn=About+Adam+%5B2000%5D+Stuart+Townsend&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1301294183,"description":" &lt;a href=&quot;http://bayimg.com/NAeiAaadJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/NAeiAaadJ&lt;/a&gt;\n\nAbout Adam (2000) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0199314/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0199314/&lt;/a&gt;\n\nAbout Adam is a 2000 Irish/British/American romantic comedy film written and directed by Gerard Stembridge. The screenplay focuses on the effect a seductive young man has on four siblings.\n\n  Tommy Tiernan  ...  Simon  \n  Kate Hudson  ...  Lucy Owens  \n  Frances O'Connor  ...  Laura Owens  \n  Stewart Roche  ...  Customer #1  \n  Aoife Maloney  ...  Customer #2  \n  Donal Beecher  ...  Andy  \n  Stuart Townsend  ...  Adam  \n  Rosaleen Linehan  ...  Peggy Owens  \n  Charlotte Bradley  ...  Alice Owens Rooney  \n  Alan Maher  ...  David Owens  \n  Brendan Dempsey  ...  Martin Rooney  \n  Cathleen Bradley  ...  Karen  \n  Kathy Downes  ...  Dympna  \n  Mark Smith  ...  Dracula  \n  Roger Gregg  ...  Prof. Harry McCormick  \n\nKate Hudson performs The Man I Love by George and Ira Gershwin, You Do Something to Me by Cole Porter, and All the Way by Sammy Cahn and Jimmy Van Heusen. During the closing credits, Peggy Lee performs Sisters by Irving Berlin.\n\nThe film premiered at the Sundance Film Festival in January 2000 and was shown at the Karlovy Vary Film Festival in the Czech Republic in July 2000 but wasn't released theatrically until it opened in Ireland in January 2001. It was given a very limited release in the U.S., where it grossed $159,668\n\nStephen Holden of the New York Times said Guilt-free and nearly devoid of erotic angst, About Adam is the flip side of movies like Teorema, Something for Everyone and those slogging Tennessee Williams dramas in which an irresistible, omnisexual stud is often an angel of death. Here he is an angel of sexual health in an impossibly euphoric world where sibling rivalry and sexual jealousy are only passing twinges of discomfort, not consuming passions. The movie's blissful spirits coincide with its portrait of modern, freshly-scrubbed-looking Dublin as the closest thing to Fun City the British isles have to offer nowadays.\n\nEmanuel Levy of Variety called the film smartly sexy, a brightly observed narrative, and a frolic free of any judgments ... marked by Stembridge's sparkling wit. He added, Stembridge plays with shifting perspectives in a fresh manner that defies expectations of the romantic genre ... This literate ensembler is propelled by talent behind and in front of the camera. Townsend, who physically resembles the young Terence Stamp, is perfectly cast as the dark, spirited outsider. Rest of the mostly female cast is equally deft and attractive.\n\nMaitland McDonagh of TV Guide rated it three out of four stars, calling it sweet, likable and consistently engaging, if so insubstantial that it's always on the verge of blowing away and adding, Townsend pulls off the unenviable job of making Adam a chameleon-like seducer without allowing him to seem like a cad or a callous sexual opportunist ... Stembridge deftly balances genre expectations with just enough stylistic flourishes to make it feel surprisingly fresh. The movie starts to fade from memory as soon as it's over, but for an hour and a half it's a pleasantly diverting lark.\n\n","torrent":{"xt":"urn:btih:72a574ce5353791e046d4a45819393fba8427dd7","amp;dn":"About+Adam+%5B2000%5D+Stuart+Townsend","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72a574ce5353791e046d4a45819393fba8427dd7","infoHashBuffer":{"type":"Buffer","data":[114,165,116,206,83,83,121,30,4,109,74,69,129,147,147,251,168,66,125,215]},"announce":[],"urlList":[]}}