{"title":"Stereophonic Space Sound Unlimited","uid":5010017,"size":89308244,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:74079da20904d537312ba816fec5330788b1e3fb&amp;dn=Stereophonic+Space+Sound+Unlimited&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gard71","files":-1,"time":1247939972,"description":"stereophonic space sound unlimited &quot;the spacesound effect&quot; 2000 release. Dionysus Records.\nFour Dimensional Sound\nDescription from inside cover: Switzerland's most dynamic and prolific composers. Ernest Maeschi and Karen Diblitz, offer a sparkling set of scores, themes and variations. Over a year's worth of recording (at their own, Zurich-based Spooky Studios, occupying the second-highest floor of the city's second-highest building) has gone into this collection. Like scientists hard at work creating a new space-age plastic. Maeschi &amp; Diblitz, have assembled 15 masterful songs, each unique and beautiful in its own way. With the help of their collection of strange vintage musical gadgets (perhaps the largest in Europe). the composers now present their recorded masterwork: THE SPACESOUND EFFECT.\n\nAmazon Review: This, the third CD by this Swiss duo, is by far their best effort yet. It does not fit in any particular category and therefore does not get much airplay. This is a real tragedy when ninety percent of what does get airplay is nothing but assembly line commercially manufactured garbage.\n\nSSSU, on the other hand, takes images of sci-fi, lounge, spy, surf, and add their own special sauce to create an irresistible cocktail that is pure fun, highly danceable and unlike anything you've heard before. Let some fresh musical air come in your soul. Listen to the Space Sound Effect. You'll thank yourself for it.\t\t","torrent":{"xt":"urn:btih:74079da20904d537312ba816fec5330788b1e3fb","amp;dn":"Stereophonic+Space+Sound+Unlimited","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74079da20904d537312ba816fec5330788b1e3fb","infoHashBuffer":{"type":"Buffer","data":[116,7,157,162,9,4,213,55,49,43,168,22,254,197,51,7,136,177,227,251]},"announce":[],"urlList":[]}}