{"title":"windows xp mode (voor windows 7 profesional NL)","uid":6163550,"size":479025657,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7434ae712741d0947f529b3823a978af03b8da31&amp;dn=windows+xp+mode+%28voor+windows+7+profesional+NL%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"crazymeny","files":1,"time":1297303382,"description":"\t\nWindows 7: Windows XP Mode.\nSpeciaal voor gebruikers van oudere programma's kan Windows 7 Professional, Enterprise en Ultimate worden voorzien van de Windows XP Mode. Hiermee kunt u verouderde programma's waar u (nog) niet zonder kunt, zoals bijvoorbeeld aan een speciaal voor uw bedrijf gemaakt facturatieprogramma, gewoon blijven gebruiken.\n\nDraai oudere applicaties onder Windows 7 dankzij Windows XP Mode\nWindows XP Mode voor Windows 7 is een uitbreiding waarmee u oudere programma's toch kunt blijven gebruiken. Hoe dat kan? Simpelweg door een complete versie van Windows XP in een venster te draaien. Dergelijke technologie bestond al in de vorm van Virtual PC 2007. Voor Windows 7 is nu onder de naam Windows XP Mode een compleet voorbereide virtuele machine met daarin opgenomen een legale versie van Windows XP Professional SP3 gratis beschikbaar. Om gebruik te kunnen maken van Windows XP Mode dient u wel Windows 7 Professional, Enterprise of Ultimate hebben draaien, want alleen deze versies ondersteunen Windows XP Mode.\n\nInstaleer eerst de windows xp mode, en daarna de twee updates die er bij zitten.","torrent":{"xt":"urn:btih:7434ae712741d0947f529b3823a978af03b8da31","amp;dn":"windows+xp+mode+%28voor+windows+7+profesional+NL%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7434ae712741d0947f529b3823a978af03b8da31","infoHashBuffer":{"type":"Buffer","data":[116,52,174,113,39,65,208,148,127,82,155,56,35,169,120,175,3,184,218,49]},"announce":[],"urlList":[]}}