{"title":"Eagles - Greatest Hits Volume 2 (1982) [CD Rip] vtwin88cube","uid":6222194,"size":116434203,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:74afca5cba816e47ebd7ff13d6eba100913f28ee&amp;dn=Eagles+-+Greatest+Hits+Volume+2+%281982%29+%5BCD+Rip%5D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1299371896,"description":"Eagles\nEagles Greatest Hits\nVolume 2 (1982)\n\n\nWith five number one singles, fourteen Top 40 hits, and four number one albums, the Eagles were among the most successful recording artists of the 1970s. At the end of the 20th century, two of those albums -- Their Greatest Hits (1971-1975) and Hotel California -- ranked among the ten best-selling albums ever, and the popularity of 2007's Long Road Out of Eden proved the Eagles' staying power in the new millenium. Though most of its members came from outside California, the group was closely identified with a country- and folk-tinged sound that initially found favor in Los Angeles during the late '60s, as championed by such bands as the Flying Burrito Brothers and Poco (both of which contributed members to the Eagles). But the band also drew upon traditional rock &amp; roll styles and, in their later work, helped define the broadly popular rock sound that became known as classic rock. As a result, the Eagles achieved a perennial appeal among generations of music fans who continued to buy their records many years after they had split up, which helped inspire the Eagles' reunion in the mid-'90s. \n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nGrabber:\t\tdBpoweramp Release 14\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tRock\t\nSource:\t\t\tRetail CD\t\nLabel:\t\t\tAsylum\n\n\nWith the Eagles having officially disbanded in May 1982, leaving behind eight Top 40 hits that followed the release of the spectacularly successful Eagles: Their Greatest Hits 1971-1975, Asylum Records naturally compiled a second hits collection for fall 1982 release. Seven of those hits were included (the exception being the seasonal &quot;Please Come Home for Christmas&quot;), along with three LP tracks, one each from One of These Nights, Hotel California, and The Long Run. Disdained by longtime fans and by the Eagles themselves, the collection was perfect for listeners who knew the band through number one radio hits like &quot;New Kid in Town,&quot; &quot;Hotel California,&quot; and &quot;Heartache Tonight.&quot; It also spared them having to buy mediocre albums like The Long Run and Eagles Live just to have copies of the best-known songs from those releases. No wonder, then, that over the years Eagles Greatest Hits, Vol. 2 achieved multi-platinum status. \n\n\nTrack List:\n\n01.Hotel California\n02.Heartache Tonight\n03.Seven Bridges Road (Live)\n04.Victim Of Love\n05.The Sad CafÃƒÂ©\n06.Life In The Fast Lane\n07.I Can't Tell You Why\n08.New Kid In Town\n09.The Long Run\n10.After The Thrill Is Gone\n\n\n\nCheers!","torrent":{"xt":"urn:btih:74afca5cba816e47ebd7ff13d6eba100913f28ee","amp;dn":"Eagles+-+Greatest+Hits+Volume+2+%281982%29+%5BCD+Rip%5D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74afca5cba816e47ebd7ff13d6eba100913f28ee","infoHashBuffer":{"type":"Buffer","data":[116,175,202,92,186,129,110,71,235,215,255,19,214,235,161,0,145,63,40,238]},"announce":[],"urlList":[]}}