{"title":"Gifted Hands: The Ben Carson Story (2009)(NL SUBS) TBS","uid":6208582,"size":4324091288,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:75028ea1e86f72c9061b920ea7ca7f1b77d57da1&amp;dn=Gifted+Hands%3A+The+Ben+Carson+Story+%282009%29%28NL+SUBS%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Vlinder2","files":-1,"time":1298901621,"description":"Gifted Hands: The Ben Carson Story (2009)       \n\n \n\nEen indrukwekkende film reregisseerd door Thomas Carter, die genomineerd werd voor 4 Emmy Awards. De film is gebaseerd op het levensverhaal van de wereldberoemde neurochirurg Ben Carson. Hoofdrolspeler Cuba Gooding Jr. zette als Dr. Ben Carson eindelijk weer een rol neer waar hij trots op kon zijn. Zijn collega's van de Screen Actors Guild waardeerden zijn optreden en nomineerden hem voor een SAG Award in de categorie beste acteur in een film.\n\nBenjamin S. Carson is een van de bekendste en beste hersenchirurgen ter wereld. Al op 33 jarige leeftijd werd hij hoogleraar en directeur van de afdeling kinderneurologie van het Johns Hopkins ziekenhuis in Baltimore, dat in 2009 benoemd werd tot het beste ziekenhuis in de Verenigde Staten. Het leven van Ben Carson is uiteraard hier en daar in deze film wat geromantiseerd, maar in grote lijnen volgt men zijn daadwerkelijke levenswandel. Het kost geen enkele moeite om mee te leven met deze bijzondere man. Het acteerwerk is van een hoog niveau, en de show wordt gestolen door Kimberly Elise. Ook de kleine Jaishon Fisher doet het erg goed.\n\n\nDe briljante Dr. Ben Carson verdiende absoluut zijn eigen film. Gifted Hands, een bescheiden en mooie biografische dramafilm.\n\nBenjamin S. Carson heeft geen gemakkelijke jeugd. Hij groeit op zonder vader en op school bakt hij er weinig van, terwijl hij zeker niet dom is. Zijn moeder is vastbesloten hier iets aan te doen en zet haar zoon er toe aan per week minimaal twee boeken te lezen en hem te leren rekenen. Benjamin heeft ook nog te kampen met een slecht temperament en dit maakt het leren alleen maar moeilijker. Uiteindelijk weet hij zichzelf er toch toe te zetten om iets te maken van zijn leven. Hij begint aan een studie geneeskunde studie en werkt zich op tot beroemd en succesvol neuroloog.\n\nVerenigde Staten\nDrama\n90 minuten\n\ngeregisseerd door Thomas Carter\nmet Cuba Gooding Jr., Kimberly Elise en Aunjanue Ellis\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/59143&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/59143&lt;/a&gt;\n\nEnglish\n\nFrom Amazon.com: Oscar winner Cuba Gooding Jr. (Actor in a Supporting Role, Jerry Maguire, 1996) stars in this true story about a renowned brain surgeon who overcame obstacles to change the course of medicine forever. Young Ben Carson didn't have much of a chance. Growing up in a broken home amongst poverty and prejudice, his grades suffered and his temper flared. And yet, his mother never lost her faith in him. Insisting he follow the opportunities she never had, she helped to grow his imagination, intelligence and, most importantly, his belief in himself. That faith would be his gift - the thing that would drive him to follow his dream of becoming one of the world's leading neurosurgeons. \n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1295085/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1295085/&lt;/a&gt;\n\nBron: Retail \nTaal: Engels\nAudio: DD 5.1\nOndertitels: Nederlands\n\n \n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Drama\n \nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt1295085/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt1295085/&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.moviemeter.nl/film/59143&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/59143&lt;/a&gt; \n\nTBS\n ","torrent":{"xt":"urn:btih:75028ea1e86f72c9061b920ea7ca7f1b77d57da1","amp;dn":"Gifted+Hands%3A+The+Ben+Carson+Story+%282009%29%28NL+SUBS%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75028ea1e86f72c9061b920ea7ca7f1b77d57da1","infoHashBuffer":{"type":"Buffer","data":[117,2,142,161,232,111,114,201,6,27,146,14,167,202,127,27,119,213,125,161]},"announce":[],"urlList":[]}}