{"title":"The Noisettes - Never Forget You","uid":5085146,"size":113623044,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:754251712c8edd5ba83e2a4c39685b8922855b27&amp;dn=The+Noisettes+-+Never+Forget+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1252661248,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Never Forget You&quot; is the third single off the album Wild Young Hearts by the Noisettes and was released on June 21, 2009. The single was self produced and written by the Noisettes, as well as them performing on the single. The single will follow their album, Wild Young Hearts, which charted at 7 in the UK and their single, Don't Upset The Rhythm (Go Baby Go), which charted at 2 in the UK.\n\nThe video has three concurrent themes. The primary setting begins as Shingai Shoniwa (The Noisettes lead singer) exits a factory/warehouse type building via blue doors. She sips a drink from a bottle, puts the bottle down and pulls on a gold bass-guitar over her shoulder. The camera pans down to her silver Dr. Marten boots, which feature in the song lyrics. After singing the first few lines of the song, her attention shifts to a black convertible car, which she then walks over to, climbing into the passenger seat. After sitting there, as if almost pondering on past memories, she takes off her silver boots, and places them on the back seat of the car. After walking barefoot back into the building, almost closing the door, she peeks through the gap to see an anonymous male get into the vehicle and drive off with the boots still in the back. While this scene plays out, which primarily relates to the lyrics of the song, the camera frequently cuts to The Noisettes, complete with orchestral accompaniments and backing singers, practicing in what appears to be a derelict theatre, lit with a soft red light. Shoniwa is dressed in a kitsch, white tasseled dress, dancing barefoot (from removing the boots previously). Towards the end of the video, the camera begins to frequently cut to the circle balcony above the rehearsal space, where Shoniwa can be seen again, this time dressed in black, singing out over the balcony. As the music ends, the final shot shows a silhouette of Shoniwa in front of a giant red orb, as the camera pans out slightly and fades to black.\n\nThe video was released on the official Noisetteschannel on May 1, 2009 and received over 150,000 views up until June 21, 2009 when it was officially released as a single.It is being shown on VHI's noctornal state \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:754251712c8edd5ba83e2a4c39685b8922855b27","amp;dn":"The+Noisettes+-+Never+Forget+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"754251712c8edd5ba83e2a4c39685b8922855b27","infoHashBuffer":{"type":"Buffer","data":[117,66,81,113,44,142,221,91,168,62,42,76,57,104,91,137,34,133,91,39]},"announce":[],"urlList":[]}}