{"title":"Misterios de la iglesia [ebook].","uid":6212187,"size":7061890,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:760766af6b4d61d4025a9a069c5e6a93517bacb9&amp;dn=Misterios+de+la+iglesia+%5Bebook%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1299024555,"description":"La Iglesia es para todos nosotros un misterio de proporciones interesantes. Incluso para aquellos que se mueven en su seno, desde los que forman parte de sus jerarquÃƒÂ­as en su base hasta aquellos que se mueven en las mÃƒÂ¡s altas instancias.\n\nComo toda instituciÃƒÂ³n importante, asentada casi en la prÃƒÂ¡ctica totalidad del planeta, y que lleva existiendo desde hace unos dos mil aÃƒÂ±os, muchos son los secretos que guarda de forma hermÃƒÂ©tica. Algunos que no interesan que se conozcan por ser supuestamente perjudiciales para la instituciÃƒÂ³n y otros, en cambio, que sin duda guardan con ahÃƒÂ­nco por ser fuente de fe.\n\nPues bien, de todo esto y mucho mÃƒÂ¡s va el libro de Carmen Porter, &quot;Misterios de la Iglesia&quot;. Un trabajo periodÃƒÂ­stico exhaustivo y profundo que se adentra en ese mundo tan desconocido que se esconde tras la religiÃƒÂ³n.\n\nCarmen Porter hace un buen trabajo con ÃƒÂ©ste su primer libro. Como buena investigadora no supone nada, no intenta influir en conductas del lector. Simplemente nos cuenta hechos. Unos hechos que, a todas luces, harÃƒÂ¡n pensar al lector.\n\n&quot;Misterios de la Iglesia&quot; es un libro que no puede dejarse al margen. No sÃƒÂ³lo hay que leerlo, sino que analizarlo. Muchos de los acontecimientos ahÃƒÂ­ reflejados suponen encontrarse de forma clara y concisa con la forma de actuaciÃƒÂ³n de la iglesia ante, por ejemplo, exorcismos, apariciones marianas, estigmas, supuestos milagros donde las imÃƒÂ¡genes sangran... Pocas veces nos vamos a encontrar con un libro que nos muestre este tipo de cosas.","torrent":{"xt":"urn:btih:760766af6b4d61d4025a9a069c5e6a93517bacb9","amp;dn":"Misterios+de+la+iglesia+%5Bebook%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"760766af6b4d61d4025a9a069c5e6a93517bacb9","infoHashBuffer":{"type":"Buffer","data":[118,7,102,175,107,77,97,212,2,90,154,6,156,94,106,147,81,123,172,185]},"announce":[],"urlList":[]}}