{"title":"NoMeansNo -[1994]- Mr. Right &amp; Mr. Wrong","uid":5073872,"size":427403589,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:76fb065dc4424ec7faa98daab4f96ad5fafd680d&amp;dn=NoMeansNo+-%5B1994%5D-+Mr.+Right+%26+Mr.+Wrong&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kislithepothead","files":22,"time":1251646427,"description":"A collection of rarities, oddities, and other things that just didn't want to surface until the impulse came along, Mr. Right &amp; Mr. Wrong covers everything from late-1979 recordings at home to then-recent efforts, even including a Hanson Brothers take on the Kinks' &quot;Victoria&quot; (reworked to be about the Canadian city in question). The band's skew-whiff sense of humor sticks in place from the start with the mock-festival cheering arena rock wank and sludge/backstage interview freakout of the untitled lead track, and from there it's a randomly organized peek into the Wright brothers' minds. The bulk of the songs were fairly recent in reference to the release date and thus capture the frenetic, inventive rage of the band with little loss of quality compared to what had already come out -- &quot;Red on Red,&quot; &quot;Widget,&quot; and &quot;Sitting on Top of the World&quot; could have surfaced on any number of albums without a worry. &quot;Who Fucked Who?,&quot; in particular, really stands out, a near-perfect example of the band's sharp combination of belligerence, tight arranging, and implicit drama, all spiked with a musical ability well beyond straightforward crash and bash. Then there's &quot;I'm Doing Well,&quot; an almost straightforward piece of acoustic blues (though the singing still has that confrontational yawp to it). The turn-of-the-'80s recordings make for a bemusing peek into the band's early days, where the ambition was often clear but the results a bit odd. Take the &quot;Jean Genie&quot;-quoting stomp and swing of &quot;Pigs and Dogs&quot; (which transforms into a straight-up punk thrash at the end), the barrelhouse piano on &quot;More ICBMs,&quot; the giddy, almost XTC-like hyper-guitar pop of the hilarious &quot;Canada Is Pissed.&quot; Then there's the simply titled &quot;Baldwang Must Die,&quot; which somehow says it all with its name alone. \n- Ned Raggett @ AllMusic\n\nRelease date .... 1994\nGenre ........... Punk Rock\nLength .......... 63:33\nLabel ........... Wrong Records\n\n\nPersonnel:\nRob Wright (bass, vocals)\nJohn Wright (drums, keyboards)\n\n\nNMR, verified, tagged (incl. replay gain), has log and cue, no scans.\n\nEnjoy and seed.\n","torrent":{"xt":"urn:btih:76fb065dc4424ec7faa98daab4f96ad5fafd680d","amp;dn":"NoMeansNo+-%5B1994%5D-+Mr.+Right+%26+Mr.+Wrong","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76fb065dc4424ec7faa98daab4f96ad5fafd680d","infoHashBuffer":{"type":"Buffer","data":[118,251,6,93,196,66,78,199,250,169,141,170,180,249,106,213,250,253,104,13]},"announce":[],"urlList":[]}}