{"title":"Partition Wizard Home Edition 4.0 Portable","uid":5049488,"size":11912556,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7720aa3b4b055aff60f474e37e5c0065e7763bc9&amp;dn=Partition+Wizard+Home+Edition+4.0+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoExcuses","files":2,"time":1249898359,"description":"Partition Wizard Home Edition 4.0 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup is included. The program is free for Home users.\n\nPartition Wizard is a Windows based partition manager.  It supports both MBR and GUID partition table format running on 32/64 bits Operating System including Windows XP, Vista, Windows Server 2000/2003/2008 and latest Windows 7. \n\nWorking as partition magic, Partition Wizard provides powerful and professional functions to manage partition including Move/Resize Partition, Copy Partition, Create Partition, Delete Partition, Format Partition, Convert File System, Hide/Unhide Partition, Explore Partition, Partition Recovery and much more.\n\nBy using Partition Wizard, home users, business users, system administrators can easily perform partition operations safely and quickly. The Enhanced Data Protecting technology keeps your data safe even in case of power outages or hardware failure. Even better, Partition Wizard is FREE for home and business.\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.partitionwizard.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.partitionwizard.com/&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=34&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=34&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:7720aa3b4b055aff60f474e37e5c0065e7763bc9","amp;dn":"Partition+Wizard+Home+Edition+4.0+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7720aa3b4b055aff60f474e37e5c0065e7763bc9","infoHashBuffer":{"type":"Buffer","data":[119,32,170,59,75,5,90,255,96,244,116,227,126,92,0,101,231,118,59,201]},"announce":[],"urlList":[]}}