{"title":"Teleport Pro v1.60","uid":5132849,"size":821624,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7724cc37b2854e18d4be243341e557ae6c7e89aa&amp;dn=Teleport+Pro+v1.60&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UllaLee","files":1,"time":1256249278,"description":"\n\tTeleport Pro\nVersion 1.60\n\nAbout Teleport Pro\n\nPC Magazine's Editors' Choice for offline browsers, Teleport Pro is an all-purpose high-speed tool for getting data from the Internet.  Launch up to ten simultaneous retrieval threads, access password-protected sites, filter files by size and type, search for keywords, and much more.  The most fully-featured and robust webspider available, Teleport Pro handles today's more complex websites flawlessly.  Capable of reading HTML 4.0, CSS 2.0, and DHTML, Teleport is the only webspider that really finds all of the files on all of the sites.  And with server-side image map exploration, automatic dial-up connecting, Java applet support, variable exploration depths, project scheduling, and relinking abilities, Teleport Pro is quite simply the best there is.  Teleport Pro can--\n\n    * Download all or part of a website to your computer, enabling you to browse the site directly from your hard disk at much greater speeds than if you were to browse the site online\n    * Create an exact duplicate, or mirror of a website, complete with subdirectory structure and all required files\n    * Search a website for files of a certain type and size\n    * Download a list of files at known addresses\n    * Explore every website linked from a central website\n    * Search a website for keywords\n    * Make a list of all pages and files on a website \n\nNo more waiting for slow pages to download.  No more clicking on links for hours, only to find garbage at the end of your trail.","torrent":{"xt":"urn:btih:7724cc37b2854e18d4be243341e557ae6c7e89aa","amp;dn":"Teleport+Pro+v1.60","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7724cc37b2854e18d4be243341e557ae6c7e89aa","infoHashBuffer":{"type":"Buffer","data":[119,36,204,55,178,133,78,24,212,190,36,51,65,229,87,174,108,126,137,170]},"announce":[],"urlList":[]}}