{"title":"Korn - Take A Look In The Mirror (2003) WMA320","uid":6264483,"size":140039926,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:774701e36bae4567e35791a1565e7894d4a203b0&amp;dn=Korn+-+Take+A+Look+In+The+Mirror+%282003%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1300862888,"description":"Korn are absolutely one of the best bands around. Not only are they original and innovative, but they are an extremely important band in music. This album was brilliant. It was, in essence, a return to the bands roots, which contained a more raw, gritty, intense nature than which existed on the last couple albums (which were brilliant as well, but that's another story). \n\nThere are the blistering, angry, intense songs which are reminiscent of earlier KoRn albums, such as &quot;Right Now,&quot; &quot;Break Some Off,&quot; &quot;When Will This End,&quot; and &quot;Let's Do This Now,&quot; and there are the melodic but still heavy songs which remind one of Issues and Untouchables (even Follow The Leader to a cetain extent) such as &quot;I'm Done,&quot; &quot;Everything I've Known,&quot; and &quot;Did My Time.&quot; They even remade their old song &quot;Alive&quot; which until this album hit stores in November of 2003, only the hardcore Korn fans were familiar with. It originally appeared on their demo album way back in 1993. It was a real treat for the true fans. Although, thematically and musically, this album takes a trip down memory lane, it nevertheless, explores new territory and has a very fresh feel about it. One thing's for sure. Korn are an extremely diverse band-musically and lyrically, and they are definitely innovators. While many of the terrible and cheap imitations of them continue to fall off the radar, KoRn remain at the top because they dare to experiment, develop, grow, and mature. They continually evolve. Their sights are on the music and their fans, and it most definitely shows. I couldn't be more happy with Take A Look In The Mirror. In my personal opinion, although this is arguable, it is very possible that Take A Look In The Mirror is KoRn's heaviest record to date. I highly recommend this album. \n\nSIDE NOTE: \nI must say I am absolutely astonished at the idiocy displayed by the supposed former fans of KoRn. These people claim they were once fans and yet they haven't got the first clue what their music is about. Teen angst is inaccurate and a typical generalization that comes from those who aren't familiar with their music. Their music has nothing specifically to do with &quot;kids.&quot; Korn fans consist of nearly all ages...anywhere from people ages 13 to 40 (and I'm sure there are fans even older than that). I especially love the generalizations regarding KoRn's lyrics. For example, one moron made a complete clown out of himself below by stating certain KoRn's lyrics discuss raping women. What song is that? I've heard EVERYTHING they've ever put out and there has never been one implication at all regarding raping women. Not to mention claiming the band's lyrics &quot;always&quot; are about any given subject whenever that subject was only in one, maybe two songs. If only people could state OPINIONS instead of outright lies. Mallcore??? You've got to be kidding me. Please understand that MOST of the people who read these reviews know better-you see they have actually *gasp* LISTNED to KoRn's music. Whenever you actually know what you're talking about, then you may have a little credibility and qualify to speak of KoRn's music.\n\nby T. Bazzano\n\nTRACKLIST:\n\n01 - Right Now.wma                                               \n02 - Break Some Off.wma                                          \n03 - Counting On Me.wma                                          \n04 - Here It Comes Again.wma                                     \n05 - Deep Inside.wma                                             \n06 - Did My Time.wma                                             \n07 - Everything I've Known.wma                                   \n08 - Play Me (Featuring Nas).wma                                 \n09 - Alive.wma                                                   \n10 - Let's Do This Now.wma                                       \n11 - I'm Done.wma                                                \n12 - Y'all Want A Single.wma                                     \n13 - When Will This End + One (Live Cover On Metallica).wma\n\nWMA 320Kbps 44100Hz STEREO\n\nFollow Me On Facebook Pages: MarcelodrgzTPB","torrent":{"xt":"urn:btih:774701e36bae4567e35791a1565e7894d4a203b0","amp;dn":"Korn+-+Take+A+Look+In+The+Mirror+%282003%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"774701e36bae4567e35791a1565e7894d4a203b0","infoHashBuffer":{"type":"Buffer","data":[119,71,1,227,107,174,69,103,227,87,145,161,86,94,120,148,212,162,3,176]},"announce":[],"urlList":[]}}