{"title":"Saint Monica (2002) - Genevieve Buechner","uid":5193546,"size":842910220,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:77cfd1424cd0f6c3409ae5027fc71b0261ffb5d8&amp;dn=Saint+Monica+%282002%29+-+Genevieve+Buechner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ForAnAngel","files":1,"time":1259815765,"description":"Saint Monica is the story of a young girl who is intrigued with her Roman Catholic upbringing. Monica likes to play with angel and Blessed Virgin Mary figurines the way other girls play with dolls. She sneaks out of the house to go to church.\n\nSet in Toronto's Portuguese-Canadian community, Monica lives with her mother Icelia (Brigitte Bako) and lethargic uncle Albert (Maurizio Terrazzano) in a basement suite. Icelia has just gotten out of an abusive relationship and has recently moved to a new neighborhood to avoid her ex.\n\nGenevieve Buechner plays the title character, a lonely and less-than-saintly 10-year-old girl. Her uncle is in charge of watching her while her mom is at work, which is most of the time. Albert hates looking after his niece and would rather watch movies in peace. One day, Monica blackmails him into giving her a ride to her old church. She finds them in the midst of organizing their annual procession and, even though she wasn't invited, she sneaks in. When she lived in her old neighborhood she had her heart set on playing an angel in her church's parade. Unfortunately, since she moved away, she is not allowed to participate anymore.\n\nLeft without a place in the procession, the distraught girl steals a pair of archangel wings from the church's costume department as compensation--only to lose them on the streetcar home.\n\nA little searching reveals them to have landed in the hands of a homeless woman named Mary (Clare Coulter); Mary is also obsessed with collecting religious artifacts. She spends her time reciting Hail Marys and challenging her faith in a God by crossing busy lanes of traffic while clad in the wings.\n\nMary's importance to Monica is obvious as she is the one who has the young girl's wings. After they form a bond that goes beyond friendship, it's a certainty that she's also a mentor. With Mary in the picture, Monica is better in touch with herself but she's also getting into more trouble.\n\nThe rest of the movie concerns the girl's lies to cover up her deeds, her attempts to recover the wings in time to return them, and her unique relationship with Mary. ","torrent":{"xt":"urn:btih:77cfd1424cd0f6c3409ae5027fc71b0261ffb5d8","amp;dn":"Saint+Monica+%282002%29+-+Genevieve+Buechner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77cfd1424cd0f6c3409ae5027fc71b0261ffb5d8","infoHashBuffer":{"type":"Buffer","data":[119,207,209,66,76,208,246,195,64,154,229,2,127,199,27,2,97,255,181,216]},"announce":[],"urlList":[]}}