{"title":"Cleopatra - Last Queen of Egypt  (BBC Audio)","uid":5102264,"size":65926974,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:784b3b1ebeed4243facf88b62f0e5737a8286230&amp;dn=Cleopatra+-+Last+Queen+of+Egypt++%28BBC+Audio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eddie1969","files":-1,"time":1254079157,"description":"Cleopatra - Last Queen of Egypt - BBC Radio Audiobiography\n\n\nThe Romans regarded her as 'fatale monstrum', a female Saddam Hussein. Pascal said the shape of her nose changed the history of the world. Shakespeare and Tiepolo (and Elizabeth Taylor) portrayed her as an icon of tragic beauty. But who was Cleopatra, really?\n\nShe was the last ruler of the Macedonian dynasty of Ptolemies who had ruled Egypt for three centuries. Highly educated (she was the only one of the Ptolemies to read and speak ancient Egyptian as well as the court Greek) and very clever (her famous liaisons with Julius Caesar and Mark Antony were as much to do with politics as the heart), she steered her kingdom through impossibly taxing internal problems and against greedy Roman imperialism.\n\nStripping away our preconceptions, many of them as old as her Roman enemies, Joyce Tyldesley uses all her skills as an Egyptologist to give us a rich picture of a country and its Egyptian queen in this magnificent biography.\n\nThis book was first published on 24 Jan 2008.\n\nRead by Haydn Gwynne.\n\nFive episodes of 15 minutes each. \n\nFirst broadcast from 28/1/2008 to 1/2/2008 as BBC Radio 4 Book of the Week.\n\n\n\nEpisode 1:\nAfter the death of her father, Cleopatra VII is forced to share the throne with her ten-year-old brother Ptolemy.\n\nEpisode 2: \nIs there any truth in the legend that Cleopatra had herself delivered to Julius Caesar rolled up in a carpet?\n\nEpisode 3:\nWhy did Julius Caesar spend so much time in Egypt and why did Cleopatra linger in Rome?\n\nEpisode 4:\nCleopatra recognises a kindred spirit in Mark Antony. But is their relationship one of passion or political expediency?\n\nEpisode 5:\nCleopatra's liaison with Mark Antony is legendary, but what are the facts behind it? And how easy is it to self-inflict a snake bite?\n\n\n\n\nRipped from the audio torrent site - radioarchive.cc - Registration is FREE!!","torrent":{"xt":"urn:btih:784b3b1ebeed4243facf88b62f0e5737a8286230","amp;dn":"Cleopatra+-+Last+Queen+of+Egypt++%28BBC+Audio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"784b3b1ebeed4243facf88b62f0e5737a8286230","infoHashBuffer":{"type":"Buffer","data":[120,75,59,30,190,237,66,67,250,207,136,182,47,14,87,55,168,40,98,48]},"announce":[],"urlList":[]}}