{"title":"Fuck Buttons - Tarot Sport (2009) [Lossless/FLAC]","uid":5188325,"size":451964413,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:785b793c98e718f90711dc9ce3d2c7eea7ead500&amp;dn=Fuck+Buttons+-+Tarot+Sport+%282009%29+%5BLossless%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cenkota","files":10,"time":1259569914,"description":"Email me if you are looking for an album in Lossless/FLAC (even obscure ones). I'd be willing to send you a link to it if you would share the album on publicbt/thepiratebay after you finish downloading it. My email: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;2c4f4942585e4345485f1d6c4b414d4540024f4341&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;1a3737373737373737373737373737373737373737373737373737373737373737373737373737373737373737373737373737373737373737373737373737373737&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;-------\n\nLossless/FLAC\nIncludes: Log/Cue\n\n01 - Surf Solar\n02 - Rough Steez\n03 - The Lisbon Maru\n04 - Olympians\n05 - Phantom Limb\n06 - Space Mountain\n07 - Flight Of The Feathered Serpent\n\nWritten By:\nBrad Kelly\n\nThere's a certain pleasure in witnessing artists manipulate and push sound beyond its normal constraints and, nowadays, you can't really talk about that kind of musical expertise without mentioning Fuck Buttons.\n\nTheir dÃƒÂ©but full-length, last years Street Horrrsing kicked up a storm upon release, leaving both critics and fans half-deaf and astounded at what machinery and the right kind of musical talent can do in this day and age. A sigh of relief then, comes in the form of their follow-up, an LP that once again delivers a snapshot of how far we've come digitally and how far artists are willing to push the art of music .\n\nThe ten minute beast of an introduction Surf Solar revels in a lo-fi, searing hiss and a mechanical, robotic melody that grinds dissonantly atop the screeching cacophony behind. It's speaker tearingly loud and scorches the senses with an audible glow brighter than the god damned sun. It's one hell of a beginning and shows Tarot Sport at one of its highest peaks. It ends in a brief spell of white noise that undulates directly into track two Rough Steez. It's the musical equivalent of a printer-testing factory gone awry with undefinable blips, screeches and somehow melodic clicks and claps shooting off in every direction. The steady rhythm is nothing but a piercing, fuzzy key progression that almost gets lost underneath the infinite noise. It's breathless but brief (the shortest in fact, at just four-minutes forty four) leaving just before it gets too much.\n\nWhilst it's a wonder to revel in the pandemonium created by the English duo, there are times that drag a little too much, never really frustrating but becoming noticeably repetitive on future listens. The Lisbon Maru relies too much on a simple distorted chord for it's near ten minute duration and whilst it is fantastically structured, becomes suitably more epic as it progresses, it can become tedious enduring six minutes of piercing music for a three-minute pay off at the end. Again, it all seems very focused but they never seem quite sure what to mainly focus on.\n\nFor all of its minor but noticeable faults, it has to be said that it's still a pretty damn exhilarating experience when heard through the right sound-system. Not a single solitary speck of emptiness can be found for the entire near-hour duration and each song unfolds in it's own separate way, some slower, some much more immediate. The production is near-flawless the entire time, ranging from sparklingly clear to equally as fucked-up at any given moment and whilst it is most definitely still the Fuck Buttons you've all grown to love, there is definitely maturity in the musics sonic intent and progression.\n\nIt's the little differences that make-up the bigger picture; the almost unnoticeable things that benefit the listening without the listener even noticing. Organic beats thump behind the static, the builds and breaks have become tighter and a little larger and everything seems just that little bit more sun-scorched. Sparse but thick with sound, the record is a barren desert with a night sky painted manically with aurora borealis.\n\nIt's a touch trancier than we would have liked and they still sure as hell enjoy screwing around with mind-numbing noises and buckets-worth of distortion but if the mood happens to take you, there's honestly nothing else like it.","torrent":{"xt":"urn:btih:785b793c98e718f90711dc9ce3d2c7eea7ead500","amp;dn":"Fuck+Buttons+-+Tarot+Sport+%282009%29+%5BLossless%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"785b793c98e718f90711dc9ce3d2c7eea7ead500","infoHashBuffer":{"type":"Buffer","data":[120,91,121,60,152,231,24,249,7,17,220,156,227,210,199,238,167,234,213,0]},"announce":[],"urlList":[]}}