{"title":"The War Bride - (2001)(Anna Friel)[DTVRip-Divx-English]","uid":5026088,"size":915634137,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:78ba3dce2293559cd2b9ec685ae122072d7de7fa&amp;dn=The+War+Bride+-+%282001%29%28Anna+Friel%29%5BDTVRip-Divx-English%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Kuthumi","files":2,"time":1248701738,"description":"The War Bride - (2001)(Anna Friel)[DTVRip-Divx-English]\n\n\nStaring\n\nAnna Friel\nBrenda Fricker\nAden Young\nLoren Dean\nMolly Parker\nJulie Cox\n\nFile Size = 873MB\nLanguage = English\nSubs = None\nDuration = 01:40:57\nResolution = 688 x 336\nVideo Codec = Divx\nAudio = English AC3 (2ch)\nFrame Rate = 25 Fps\n\nIMDB Rating =\n6.8/10\n\n\nPlot\n\nAnna Friel plays a plucky Cockney girl sent to live with her new Canadian in-laws during World War II in this romantic drama\nIt's 1940, and while London endures the Blitz, chirpy Lily (Friel) begins a whirlwind romance with a dashing Canadian soldier Charlie (Young). Soon after, they're married and she's pregnant. The couple part, however, when Charlie is sent to the front and Lily goes to live with her new Canadian in-laws.\n\nAn icy reception from Charlie's widowed mother (Fricker) and sister (Parker) only hints at the hard work Lily has ahead, as she has to try and ingratiate herself into their insular community in rural Alberta. But Lily's optimism and determination remain intact as she makes every effort to adjust and win over her embittered in-laws.\n\nA Second World War movie told from a previously overlooked perspective, The War Bride focuses on the emotional toll levied on those who stayed at home, as Lily aspires to overcome the challenges thrown at her by her new life and hostile new family.\n\nAmazon.co.uk Review\n\nMarry in haste, repent at leisure, goes the old adage. Certainly, The War Bride sees the chirpy Cockney Lily (Anna Friel) with plenty of time to regret her lot. After a whirlwind romance in wartime Britain she marries her handsome Canadian hunk, Charlie (Aden Young). Finding herself pregnant and alone, Charlie having been sent back to the front, she jumps at the chance of a new life abroad when she receives a one-way ticket to Canada.\nUnfortunately Charlie's tales of his family ranch in Alberta are more fanciful than factual and when she gets there her natural ebullience is tested to the limit by a crumbling shack and a frostbite-inducing welcome from his widowed mother (Brenda Fricker, superbly dour) and his crippled sister (Molly Parker). They view her townie ways, her penchant for picture houses and scarlet lipstick, with deep suspicion. The only light in these dark days is derived from visits from her longstanding best friend Sophie (who also married a Canadian, but one with rather more to offer) and a burgeoning friendship with Joe, her sister-in-law's boyfriend.\nThe film was inspired by the experiences of screenwriter Angela Workman's mother, one of 48,000 war brides who immigrated to Canada during World War II, and it vividly demonstrates that for the unlucky ones the future was far from rosy. The result could have been mawkish but it's saved by fine performances from Friel--who is increasingly showing herself to be an actress of some versatility--and the always splendid Brenda Fricker.","torrent":{"xt":"urn:btih:78ba3dce2293559cd2b9ec685ae122072d7de7fa","amp;dn":"The+War+Bride+-+%282001%29%28Anna+Friel%29%5BDTVRip-Divx-English%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78ba3dce2293559cd2b9ec685ae122072d7de7fa","infoHashBuffer":{"type":"Buffer","data":[120,186,61,206,34,147,85,156,210,185,236,104,90,225,34,7,45,125,231,250]},"announce":[],"urlList":[]}}