{"title":"Burl Ives - 20th Century Masters The Best Of (2001) [CDRip FLAC]","uid":6233931,"size":144284808,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:78fff96d899c0ad31be2e56ac83e6dfe6d417707&amp;dn=Burl+Ives+-+20th+Century+Masters+The+Best+Of+%282001%29+%5BCDRip+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1299804980,"description":"Burl Ives\n20th Century Masters\nThe Millennium Collection\nThe Best Of Burl Ives (2001)\n\n\nWith his grandfatherly image, Burl Ives parlayed his talent as a folksinger into a wide-ranging career as a radio personality and stage and screen actor. After spending his early twenties traveling the country as an itinerant singer, Ives moved to New York City in 1937. By the end of 1938, he had made his Broadway debut, and he also sang folk songs in Greenwich Village clubs. In 1940, Ives began to appear regularly on radio, including on his own show, The Wayfarin' Stranger, on CBS. Ives made his first records for Stinson, a small folk label, then was signed to Decca, a major label. He made his movie debut in Smoky in 1946. In 1948, his first book, Wayfaring Stranger, was published. In 1949, he had his first chart hit with &quot;Lavender Blue (Dilly Dilly).&quot; The same year, he moved to Columbia Records. With the advent of the long-playing record, Ives suddenly had a flurry of LP releases from his three labels: The Wayfaring Stranger on Stinson; three volumes of Ballads &amp; Folk Songs, Women: Folk Songs About the Fair Sex, Folk Songs Dramatic and Humorous, and Christmas Day in the Morning on Decca; and Wayfaring Stranger, Return of the Wayfaring Stranger, More Folk Songs, American Hymns, The Animal Fair, and Mother Goose Songs on Columbia. He also recorded a series of albums for Encyclopedia Britannica Films under the overall title Historical America in Song. In 1951, he hit the Top Ten with &quot;On Top of Old Smoky.&quot; In 1952, he returned to Decca. While continuing to publish books and to act on Broadway and in the movies, Ives made a series of albums that included Coronation Concert, The Wild Side of Life, Men, Down to the Sea in Ships, In the Quiet of the Night, Burl Ives Sings for Fun, Songs of Ireland, Old Time Varieties, Captain Burl Ives' Ark, Australian Folk Songs, and Cheers, all released in the second half of the '50s. In 1961, Ives oriented himself toward country music, resulting in the hit &quot;A Little Bitty Tear,&quot; which made the Top Ten in both the pop and country charts. The single was contained on The Versatile Burl Ives. &quot;Funny Way of Laughin'&quot; was another pop and country Top Ten in 1962; it appeared on It's Just My Funny Way of Laughin' and won Ives a Grammy Award for Best Country Western Recording. He turned his attention primarily to movie work from 1963 on, especially with the Walt Disney studio. But he charted with Pearly Shells in 1964 and made a children's album, Chim Chim Cheree and Other Children's Choices, for Disney Buena Vista Records. At the end of the '60s, Ives returned to Columbia Records for The Times They Are A-Changin' and Softly and Tenderly. He gave up popular recording, but returned in 1973 with the country album Payin' My Dues Again. He also continued to record children's music and released several religious albums on Word Records. Turning 70 in 1979, he became less active and finally retired to Washington State. In the '90s, Decca and the German Bear Family label reissued many of his recordings. \n\n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\n\nAudio Quality:\t\tPerfect (Lossless)\nGrabber:\t\tdBpoweramp Release 14\nEncoder:\t\tFlac 1.2.1\nEncoder Settings:\tHigh\t\nContains:\t\tAlbum Art, CRC, ID Tag [Vorbis Comments]\nM3U File:\t\tYes\n\nFormat:\t\t\tFlac\nGenre:\t\t\tFolk\t\nSource:\t\t\tRetail CD\nLabel:\t\t\t20th Century Masters\n\n\nTrack List:\n\n01.A Little Bitty Tear\n02.Funny Way Of Laughin'\n03.Lavender Blue (Dilly Dilly)\n04.Blue Tail Fly (With The Andrew Sisters)\n05.Wild Side Of Life\n06.Call Me Mr. In-Between\n07.Pearly Shells (Popo O Ewa)\n08.Mary Ann Regrets\n09.The Same Old Hurt\n10.Big Rock Candy Mountain\n11.Foggy, Foggy Dew\n12.Goober Peas\n\n\n\nCheers!","torrent":{"xt":"urn:btih:78fff96d899c0ad31be2e56ac83e6dfe6d417707","amp;dn":"Burl+Ives+-+20th+Century+Masters+The+Best+Of+%282001%29+%5BCDRip+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78fff96d899c0ad31be2e56ac83e6dfe6d417707","infoHashBuffer":{"type":"Buffer","data":[120,255,249,109,137,156,10,211,27,226,229,106,200,62,109,254,109,65,119,7]},"announce":[],"urlList":[]}}