{"title":"Cal Tjader - Black Orchid (1993) [Jazz][mp3 320][schon55]","uid":5088330,"size":187868036,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:790fc20912db4e1e241f4c0971871c10d88e767c&amp;dn=Cal+Tjader+-+Black+Orchid+%281993%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"schon55","files":26,"time":1252908886,"description":"Cal Tjader - Black Orchid \nYear: March 21, 1993\nLabel: Fantasy Inc.\nQuality: 320 kbps\n\n&quot;This CD has all of the music originally on the two LPs Cal Tjader Goes Latin and The Cal Tjader Quintet.  Since each album had two sessions apiece, the CD does a fine job of giving one a sampling of the influential vibraphonist's popular Latin jazz groups of the era.  Among the key sideman are flutist Paul Horn; Jose &quot;Chombo&quot; Silva on tenor; pianists Lonnie Hewitt, Vince Guaraldi, and Manuel Duran; and Mongo Santamaria and Willie Bobo on percussion.  The music (a mixture of Latinized standards and newer originals) is quite appealing, showing why this infectious blending of bop with Latin rhythms has always been one of the most accessible styles of jazz.&quot;\n\nDiverse collection of made for vibes standards. I equate CT's playing with the vocals of Sinatra, not a whole lot going on at cetain tracks but WATCHOUT for those long lyrical scatting sounds that come from his &quot;right on cue&quot; vibes. Can you believe The Lady Must Be a Tramp, is in this super-long track listing? I don't remember a time when I left a CD in my player for so long. Everything sounds modern and &quot;up front&quot; via good miking, so don't be put off by the N/A in the stereo/mono column. We audioclub members in Dallas can't wait for the SACD of these and other Fantasy labels. ~ Martin Montes\n\nThis is one of the best Cal Tjader CDs. The first part in stereo from 1959 is my favorite Tjader album. The quiet pieces have that cool breeze effect on your mood. This is small group jazz at its most intimate. Its a smooth, gorgeous sound they make that will make you feel you're right there at your most relaxed. ~ Robert Cruce\n\nTo be fair, and truthful really, you pick any of Tjader's Fantasy releases from the 50's and early 60's and you cannot go wrong. Even his early releases like &quot;Plays Mambo&quot; are absolutely stellar. But after he stole away the team of Willie Bobo and Mongo Santamaria from Tito Puente, and he obtained Cuban tenor man Jose &quot;Chombo&quot; Silva, he started producing some real absolute gems. This is one of them. Right there with &quot;Blackhawk Nights,&quot; &quot;Latin Concert&quot; and even &quot;Ritmos Calientes&quot; this is Tjader at his finest, doing what he did best. It never, and I mean, NEVER, fails to please anyone I play it for, and has even silenced many who might otherwise accuse Tjader for being another gringo trying to rip off what Fania so aptly called, &quot;our Latin thing.&quot; But, he solidly proved to anyone who doubts, he has what it takes and, since I mentioned Puente, even Puente was envious of what Tjader could do on the vibes and what he could lay down with his group. When he got Bobo and Mongo from Puente, fughettaboutit. \n\nGet this, get this, get this. You'll kick yourself for waiting this long. ~ Jack Dempsey\n\nPersonnel:\nCal Tjader - vibraphone\nAl McKibbon - bass\nPaul Horn\nLonnie Hewitt\nLuis Miranda\nBayardo Velarde\nJose &quot;Chombo&quot; Silva\nManuel Duran\nCarlos Duran\nLuis Kant\nGene Wright\nWillie Bobo\nVince Guaraldi\nRamon &quot;Mongo&quot; Santamaria \n\nCal Tjader - Black Orchid Tracks:\n01  Mi China\n02  Close Your Eyes\n03  Mambo At The 'M'\n04  Contigo\n05  Bonita\n06  The Lady Is A Tramp\n07  Black Orchid\n08  Happiness Is A Thing Called Joe\n09  I've Waited So Long\n10  Out Of Nowhere\n11  Guajira At The Blackhawk\n12  I Want To Be Happy\n13  The Nearness Of You\n14  Pete Kelly's Blues\n15  A Minor Goof\n16  Undecided\n17  Philadelphia Mambo\n18  Flamingo\n19  Stompin' At The Savoy\n20  Laura\n21  Lullaby Of Birdland","torrent":{"xt":"urn:btih:790fc20912db4e1e241f4c0971871c10d88e767c","amp;dn":"Cal+Tjader+-+Black+Orchid+%281993%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"790fc20912db4e1e241f4c0971871c10d88e767c","infoHashBuffer":{"type":"Buffer","data":[121,15,194,9,18,219,78,30,36,31,76,9,113,135,28,16,216,142,118,124]},"announce":[],"urlList":[]}}