{"title":"Flyleaf - Missing  (2nafish)","uid":5504828,"size":131311620,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:796f4e2edface57a652ac7beb5b8a8c0821241a0&amp;dn=Flyleaf+-+Missing++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1271758691,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Missing&quot; is the third single by Flyleaf from their second album, Memento Mori.\n\nThe music video premiered on vevo on March 18, 2010. Once again, it featured artwork designs in the background, rather than actual live performance, such as in &quot;All Around Me&quot; and &quot;I'm So Sick&quot;. The video featured Lacey Mosely as a girl left by her parents in a ship. She frees herself from pain by jumping into the water, symbolizing how she found God's love is the only true love after her loved ones &quot;left her to bleed alone&quot;.\n\nMemento Mori is the second studio album by American rock band Flyleaf, released through A&amp;M/Octone Records on November 10, 2009. The title is a Latin phrase meaning &quot;be mindful of death&quot; or &quot;remember you will die.&quot; Memento Mori debuted at number eight on the Billboard 200, selling 56,000 units in its opening week.\n\nFlyleaf is an American rock  band, formed in the Belton and Temple, Texas regions in 2000. They performed around the United States in 2003 until releasing their eponymous debut album, Flyleaf, in 2005. The album went platinum after selling more than one million copies. The band won an online poll on yahoo.com  and was named Yahoo!'s Who's Next band of the month in March 2006 and they were named MTV's artist of the week on December 24, 2007. Flyleaf released their second album Memento Mori on November 10, 2009.\n\nOn November 2, 2009, the band released a short Webisode  for their new album.\n\nFlyleaf's other video, &quot;Beautiful Bride,&quot; was shot in early August 2009 by director Don Tyler. The video was originally released at the Memento Mori listening events, but was later featured on Yahoo! the day Memento Mori came out. The video features James' sister/Sameer's wife, April, as the bride and Joshua Sturm, Lacey's husband, as the groom. Like &quot;Again,&quot; this video features Pat's artwork throughout the video. Future singles are set to include &quot;Chasm&quot; for rock stations and &quot;Missing&quot; for pop/alternative.\n\nAs of January 2010, Flyleaf is touring throughout the United States with Breaking Benjamin and Three Days Grace.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:796f4e2edface57a652ac7beb5b8a8c0821241a0","amp;dn":"Flyleaf+-+Missing++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"796f4e2edface57a652ac7beb5b8a8c0821241a0","infoHashBuffer":{"type":"Buffer","data":[121,111,78,46,223,172,229,122,101,42,199,190,181,184,168,192,130,18,65,160]},"announce":[],"urlList":[]}}