{"title":"MailWasher Pro v6.5.4 Portable","uid":5602891,"size":19496578,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7980cff21ba9455381a035ed3c8a059557650903&amp;dn=MailWasher+Pro+v6.5.4+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoExcuses","files":4,"time":1275409174,"description":"MailWasher Pro v6.5.4 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Crack are included...\n\n\nTake back control of your email\n\nMailWasher has deservedly earned its reputation as one of the worlds top Anti-Spam products. With over 8 million users around the world and features in both BBC and CNN you can be confident that it will rid you of spam for good.\n\n    * Stop all spam getting to your computer. MailWasher is your first line of defense and you'll never suffer from spam in your inbox again.\n    * Read all your email before it gets to your computer. You'll love this feature.\n    * Unbeatable spam tools do all the hard work for you. Real-time spam tools work to catch the latest spam.\n    * Rescue accidentally deleted email. You'll never lose an email with MailWasher.\n    * You get the best customer support.\n    * Works with all email programs, whether it is Outlook, GMail, Hotmail, Windows Live Mail, Thunderbird etc and an unlimited number of email accounts.\n    * No brainer setup. You'll be blocking spam in seconds\n    * 100% Money back guarantee. No questions asked.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.firetrust.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.firetrust.com/&lt;/a&gt;\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista/W7 machine. It's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you like it and it's useful for you, show your support buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:7980cff21ba9455381a035ed3c8a059557650903","amp;dn":"MailWasher+Pro+v6.5.4+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7980cff21ba9455381a035ed3c8a059557650903","infoHashBuffer":{"type":"Buffer","data":[121,128,207,242,27,169,69,83,129,160,53,237,60,138,5,149,87,101,9,3]},"announce":[],"urlList":[]}}