{"title":"Spyware Terminator v. 2.6.0.110","uid":5074793,"size":646879,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:799a9a81a6cfebc67cf4f081d265115ba0f8719f&amp;dn=Spyware+Terminator+v.+2.6.0.110&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"spotted_jackal","files":-1,"time":1251731953,"description":"Key Features of Spyware Terminator\nSpyware Terminator - Free spyware removal tool\n\nFree Spyware Removal\n\nSpyware Terminator will scan your computer for known threats and report findings in a manner that is easy to read and interpret. Every entry is given a rating and a classification, which makes it very easy to decide if a detected item should be removed. Unlike some free software titles, Spyware Terminator will remove all threats for free.\n\nFree Automatic Updates\n\nSpyware Terminator offers the ability to download and install updates automatically. Users are free to dictate how often Spyware Terminator checks for updates and how they are applied.\n\nFree Scheduled Scans\n\nSpyware Terminator gives users the ability to schedule spyware scans on a regular basis to ensure computer integrity. Scans can be scheduled on either a daily or a weekly basis at any hour of the day.\n\nFree AntiVirus Integration\n\nSpyware Terminator has included the popular award winning open-source antivirus, Clam AntiVirus (ClamAV), for optional integration to achieve a higher level of security. ClamAV can be integrated into spyware scans, updates and the real-time protection.\n\nFree Support\n\nNot only is the Spyware Terminator free, but support is included for free as well. Support is provided through e-mail and our public forum. Our highly qualified support team responds to all issues in a timely manner.\n\nFree for Personal &amp; Commercial Use\n\nSpyware Terminator is licensed for free for both home and business use.\n\nInstallation tips\n\nJust double click and install it. No need for keys and stuff, it's free. ","torrent":{"xt":"urn:btih:799a9a81a6cfebc67cf4f081d265115ba0f8719f","amp;dn":"Spyware+Terminator+v.+2.6.0.110","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"799a9a81a6cfebc67cf4f081d265115ba0f8719f","infoHashBuffer":{"type":"Buffer","data":[121,154,154,129,166,207,235,198,124,244,240,129,210,101,17,91,160,248,113,159]},"announce":[],"urlList":[]}}