{"title":"The Blues A Very Short Introduction","uid":6238752,"size":1889106,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a6578e66d53a63e6cc6fdbecff29dc9f5b9c5a3&amp;dn=The+Blues+A+Very+Short+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lkk100","files":-1,"time":1299974934,"description":"# Paperback: 152 pages\n# Publisher: Oxford University Press, USA (August 5, 2010)\n# Language: English\n# ISBN-10: 9780195398939\n# ISBN-13: 978-0195398939\n\nPraised as &quot;suave, soulful, ebullient&quot; (Tom Waits) and &quot;a meticulous researcher, a graceful writer, and a committed contrarian&quot; (New York Times Book Review), Elijah Wald is one of the leading popular music critics of his generation. In The Blues, Wald surveys a genre at the heart of American culture.\n\nIt is not an easy thing to pin down. As Howlin' Wolf once described it, &quot;When you ain't got no money and can't pay your house rent and can't buy you no food, you've damn sure got the blues.&quot; It has been defined by lyrical structure, or as a progression of chords, or as a set of practices reflecting West African &quot;tonal and rhythmic approaches,&quot; using a five-note &quot;blues scale.&quot; Wald sees blues less as a style than as a broad musical tradition within a constantly evolving pop culture. He traces its roots in work and praise songs, and shows how it was transformed by such professional performers as W. C. Handy, who first popularized the blues a century ago. He follows its evolution from Ma Rainey and Bessie Smith through Bob Dylan and Jimi Hendrix; identifies the impact of rural field recordings of Blind Lemon Jefferson, Charley Patton and others; explores the role of blues in the development of both country music and jazz; and looks at the popular rhythm and blues trends of the 1940s and 1950s, from the uptown West Coast style of T-Bone Walker to the &quot;down home&quot; Chicago sound of Muddy Waters. Wald brings the story up to the present, touching on the effects of blues on American poetry, and its connection to modern styles such as rap.\n\nAs with all of Oxford's Very Short Introductions, The Blues tells you--with insight, clarity, and wit--everything you need to know to understand this quintessentially American musical genre. ","torrent":{"xt":"urn:btih:7a6578e66d53a63e6cc6fdbecff29dc9f5b9c5a3","amp;dn":"The+Blues+A+Very+Short+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a6578e66d53a63e6cc6fdbecff29dc9f5b9c5a3","infoHashBuffer":{"type":"Buffer","data":[122,101,120,230,109,83,166,62,108,198,253,190,207,242,157,201,245,185,197,163]},"announce":[],"urlList":[]}}