{"title":"Up the Down Staircase [1967] Sandy Dennis","uid":6303571,"size":878832368,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7a9b95f649e46056244e71e50acdf7765743d0e4&amp;dn=Up+the+Down+Staircase+%5B1967%5D+Sandy+Dennis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1302248278,"description":" &lt;a href=&quot;http://bayimg.com/PaHjeaaDH&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/PaHjeaaDH&lt;/a&gt;\n\nUp the Down Staircase (1967) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0062425/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0062425/&lt;/a&gt;\n\nUp the Down Staircase is a 1967 drama film about the first, trying assignment for a young, idealistic teacher played by Sandy Dennis. Tad Mosel wrote the screenplay adaptation of the novel of the same name by Bel Kaufman.\n\n  Sandy Dennis  ...  Sylvia Barrett  \n  Patrick Bedford  ...  Paul Barringer  \n  Eileen Heckart  ...  Henrietta Pastorfield  \n  Ruth White  ...  Beatrice Schacter  \n  Jean Stapleton  ...  Sadie Finch  \n  Sorrell Booke  ...  Dr. Bester  \n  Roy Poole  ...  Mr. McHabe  \n  Florence Stanley  ...  Ella Friedenberg  \n  Vinnette Carroll  ...  The Mother  \n  Janice Mars  ...  Miss Gordon  \n  Loretta Leversee  ...  Social Studies Teacher  \n\nWe need more American films like Up the Down Staircase. We need more films that might be concerned, even remotely, with real experiences that might once have happened to real people. And we need more actresses like Sandy Dennis, who looks as if she may be alive and not a plastic robot turned out by the little elves who constructed Doris Day and Sandra Dee. Here, at last, is a film made in America by Americans in which no one is murdered by a cigarette lighter.\n\nThe film's setting is Calvin Coolidge High School, one of those vast blocks of stone and brick in which our cities educate 3,000 students at a shot. Coolidge High is apparently located somewhere in a low income, racially mixed New York neighborhood, and it is a problem school. That makes it bait for an idealistic naive new teacher who wants to expand vistas.\n\nAs the teacher, Sandy Dennis is perfectly cast. She doesn't know how to teach, what to teach or, in the end, even why she wants to teach. Her first lesson comes in the first two minutes of her first class, when she quotes Emily Dickinson (There is no frigate like a book) and the students hoot with laughter. A veteran teacher suggests maybe she should have substituted steamship. These are the things you have to think about if you propose to reach real kids. \n\nUp the Down Staircaseis an above-average teacher-helps-troubled-students film. If the plot sounds familiar, then you've probably seen Stand and Deliver, Take the Lead, Freedom Writers, or a number of other films with the same setup. What sets Up the Down Staircase apart is its refusal to deal with these problems in a typical or predictably easy manner. Yes, Dennis makes progress as she attempts to cope with these students. But it's not 100 percent effective, and some students continue to struggle and ruin their lives despite the teacher's best efforts. For every step forward, there's another step back.\n\nUp the Down Staircase is a positive and uplifting film, but it's not a sentimental one, and it's aged surprisingly well over the past forty years. The film's second half, which contains a great deal of thoughtful dialogue about education and learning, stands as a model of how this sort of motion picture should be made. The first half, while a bit more familiar and typical, is nonetheless effective. The picture isn't great on this one, but pristine images might not do any favors to this modestly gritty setting.\n","torrent":{"xt":"urn:btih:7a9b95f649e46056244e71e50acdf7765743d0e4","amp;dn":"Up+the+Down+Staircase+%5B1967%5D+Sandy+Dennis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a9b95f649e46056244e71e50acdf7765743d0e4","infoHashBuffer":{"type":"Buffer","data":[122,155,149,246,73,228,96,86,36,78,113,229,10,205,247,118,87,67,208,228]},"announce":[],"urlList":[]}}