{"title":"Classic Albums: Iron Maiden - The Number of the Beast DVD","uid":5599026,"size":3741444096,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7ab2385a3d5a1146744a7fda766f374764e8d3d1&amp;dn=Classic+Albums%3A+Iron+Maiden+-+The+Number+of+the+Beast+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Sanantta","files":1,"time":1275182966,"description":"Screen Format: 16:9\nNTSC\nDolby Digital Stereo\nAudio: English\nSubtitles: None\n\n\nFrom the back cover of the DVD:\n\n1982 was a momentous year for Iron Maiden. Following the addition of brilliant new vocalist Bruce Dickinson, their third album The Number of the Beast was released to universal acclaim from both critics and rock fans. The album topped the UK charts for 2 weeks, launched them into the US Top 40 for the first time, and invaded the Top 10 album charts worlwide achieving a plethora of gold and platinum awards. The Number of the Beast, is regarded as one of the greatest and most influential Heavy Metal albums of all time, including, along with demonic title track, such classic metal anthems as Run to the Hills, Hallowed Be Thy Name, The Prisoner and Children of the Damned.\n\nThis exclusive film tells the full and vibrant story behind the making of the album. It is packed with exclusive interviews with the entire band - Bruce Dickinson, Steve Harris, Adrian Smith, Dave Murray - with the first interview for many years with drummer Clive Burr who left the band after the massive Beast on the Road World Tour. Producer Martin Birch takes us through the original multi-track tapes and long time manager Rod Smallwood adds his own anecdotes from that period. Current drummer Nicko McBrain, who at that time played with the support band, adds his tales from the road and guitarist Adrian Smith contributes exclusive acoustic guitar renditions of Children of the Damned and The Number of the Beast.\n\nFeaturing masses of previously unseen footage from the 1982 Hammersmith Odeon show on Beast on the Road PLUS an exciting preview of the forthcoming state of the art DVD shot at Rock in Rio in 2001, this program provides a unique insight into how The Number of the Beast propelled Iron Maiden into international superstar status and came to be a Classic Album.","torrent":{"xt":"urn:btih:7ab2385a3d5a1146744a7fda766f374764e8d3d1","amp;dn":"Classic+Albums%3A+Iron+Maiden+-+The+Number+of+the+Beast+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ab2385a3d5a1146744a7fda766f374764e8d3d1","infoHashBuffer":{"type":"Buffer","data":[122,178,56,90,61,90,17,70,116,74,127,218,118,111,55,71,100,232,211,209]},"announce":[],"urlList":[]}}