{"title":"Girl, Interrupted[2000]DVDrip--rEACTOr--","uid":5030479,"size":736948882,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7ac2d49ebb78f055c9f228d6bf7ce94b95cd40fe&amp;dn=Girl%2C+Interrupted%5B2000%5DDVDrip--rEACTOr--&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"reactor90","files":-1,"time":1248890992,"description":"Based on Susanna Kaysen's acclaimed journal-memoir, Girl, Interrupted bears inevitable resemblance to One Flew Over the Cuckoo's Nest, and pale comparison to that earlier classic is impossible to avoid. The mental institution settings of both films guarantee a certain degree of dÃƒÂ©jÃƒÂ  vu and at least one Oscar winner (in this case, Angelina Jolie), since playing a loony is any actor's dream gig. Unfortunately, director James Mangold seems to have misplaced the depth and delicacy of his underrated debut, Heavy, despite a great deal of earnest effort by everyone involved. It's easy to see why Winona Ryder chose to star in (and executive-produce) this nearly worthy adaptation of Kaysen's book, since it's a strong vehicle for female casting and potent drama. Mangold certainly got the former; whether he succeeded with the latter is not so clear.\n\nTo be sure, Ryder conveys the confusion and chaos that signified Kaysen's life during nearly 18 months of voluntary institutionalization beginning in 1967. But the film seems too eager to embrace the clichÃƒÂ© that the &quot;crazies&quot; of the Claymoore women's ward are saner than the war-torn world outside, and lack of narrative focus gives way to semipredictable character study. Susanna (Ryder) is labeled with &quot;borderline personality disorder,&quot; a diagnosis as ambiguous as her own emotions, and while Jolie chews the scenery as the resident bad-girl sociopath, Ryder effectively conveys an odyssey from vulnerable fear to self-awareness and, finally, to healing. The ensemble cast is uniformly superb, making this drama well worthwhile, even as it treads familiar territory. If it ultimately lacks dramatic impact, Girl, Interrupted makes it painfully clear that the boundaries of dysfunction are hazy in a world where everyone's crazy once in a while.\n\nJoin Us At PAP! Help Fight Pedo's! &lt;a href=&quot;\nhttp://joinusatpap.isa-geek.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://joinusatpap.isa-geek.org&lt;/a&gt;","torrent":{"xt":"urn:btih:7ac2d49ebb78f055c9f228d6bf7ce94b95cd40fe","amp;dn":"Girl%2C+Interrupted%5B2000%5DDVDrip--rEACTOr--","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ac2d49ebb78f055c9f228d6bf7ce94b95cd40fe","infoHashBuffer":{"type":"Buffer","data":[122,194,212,158,187,120,240,85,201,242,40,214,191,124,233,75,149,205,64,254]},"announce":[],"urlList":[]}}