{"title":"First Part Last- Angela Johnson 1998","uid":6177207,"size":659438,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b7f4c7545d8f523486d287d962ad36089b8d3dc&amp;dn=First+Part+Last-+Angela+Johnson+1998&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hatshepsut23389","files":1,"time":1297811803,"description":"Bobby, the teenage artist and single-parent dad in Johnson's Coretta Scott King Award winner, Heaven (1998), tells his story here. At 16, he's scared to be raising his baby, Feather, but he's totally devoted to caring for her, even as she keeps him up all night, and he knows that his college plans are on hold. In short chapters alternating between &quot;now&quot; and &quot;then,&quot; he talks about the baby that now fills his life, and he remembers the pregnancy of his beloved girlfriend, Nia. Yes, the teens' parents were right. The couple should have used birth control; adoption could have meant freedom. But when Nia suffers irreversible postpartum brain damage, Bobby takes their newborn baby home. There's no romanticizing. The exhaustion is real, and Bobby gets in trouble with the police and nearly messes up everything. But from the first page, readers feel the physical reality of Bobby's new world: what it's like to hold Feather on his stomach, smell her skin, touch her clenched fists, feel her shiver, and kiss the top of her curly head. Johnson makes poetry with the simplest words in short, spare sentences that teens will read again and again. The great cover photo shows the strong African American teen holding his tiny baby in his arms.","torrent":{"xt":"urn:btih:7b7f4c7545d8f523486d287d962ad36089b8d3dc","amp;dn":"First+Part+Last-+Angela+Johnson+1998","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b7f4c7545d8f523486d287d962ad36089b8d3dc","infoHashBuffer":{"type":"Buffer","data":[123,127,76,117,69,216,245,35,72,109,40,125,150,42,211,96,137,184,211,220]},"announce":[],"urlList":[]}}