{"title":"El lado oscuro de la fama.(Docu).","uid":5132668,"size":990412234,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7bc0f061cf76d897df6a936aeeb1692d6d7afe74&amp;dn=El+lado+oscuro+de+la+fama.%28Docu%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cholo24","files":2,"time":1256224768,"description":"El lado oscuro de la fama\n\nGÃƒÂ©nero: Documentales / Cine\nTitulo original: (Piers Morgan's dark side of fame: )\nNacionalidad: R.U\nDirector: Colin Lennnox\nProductora: Productions for BBC Scotland\nCalificaciÃƒÂ³n moral: No rec. menores de 13 aÃƒÂ±os\ncolaboracion: Piers Morgan\n\nCap.1 - Pamela Anderson\n\nSINOPSIS: \nLa actriz y modelo multimillonaria Pamela Anderson es uno de los grandes sÃƒÂ­mbolos sexuales, que saltÃƒÂ³ a la fama con el famoso traje de baÃƒÂ±o rojo en &quot;Los vigilantes de la playa&quot;. En una entrevista divertida y brutalmente sincera, nos habla del lado oscuro de haber alcanzado su sueÃƒÂ±o del estrellato: su primer y tempestuoso matrimonio y su posterior divorcio del chico malo del rock Tommy Lee, las batallas legales sobre la infame cinta de vÃƒÂ­deo y lo que sintiÃƒÂ³ despuÃƒÂ©s de contraer el virus de la hepatitis C. Durante la entrevista, averiguaremos si todo esto le ha merecido la pena a Pamela. Nos hablarÃƒÂ¡ del momento en que llamÃƒÂ³ a la policÃƒÂ­a temiendo por su seguridad y la de sus hijos cuando Tommy Lee se puso fuera de sÃƒÂ­. TambiÃƒÂ©n nos contarÃƒÂ¡ cÃƒÂ³mo la famosa cinta saliÃƒÂ³ a la luz y cÃƒÂ³mo numerosos acosadores la persiguen. Asimismo, en una declaraciÃƒÂ³n memorable nos asegurarÃƒÂ¡ que nunca ha visto un Ã‚Â¡pene pequeÃƒÂ±o!\n\nCap.2 - Mickey Rourke\n\nSINOPSIS: \nUna entrevista increÃƒÂ­blemente reveladora con la infame estrella de Hollywood Mickey Rourke. Tuvo el mundo del cine a sus pies cuando protagonizÃƒÂ³ &quot;Nueve semanas y media&quot; y &quot;El corazÃƒÂ³n del ÃƒÂ¡ngel&quot;, pero nos cuenta que ahora sus novias son tan jÃƒÂ³venes que ni siquiera han oÃƒÂ­do hablar de las pelÃƒÂ­culas que le hicieron famoso. Con su carrera, que estÃƒÂ¡ experimentando en la actualidad un renacimiento con pelÃƒÂ­culas como &quot;El luchador (The Wrestler)&quot; y &quot;Sin City&quot;, el chico malo nos habla de cÃƒÂ³mo cayÃƒÂ³ en desgracia en Hollywood y pasÃƒÂ³ de ser una estrella de cine a convertirse en un boxeador de competiciÃƒÂ³n que estuvo cinco aÃƒÂ±os en el ring, durante los cuales sufriÃƒÂ³ una transformaciÃƒÂ³n de su antigua y famosa apariencia. En su bar favorito de Nueva York, nos hablarÃƒÂ¡ de cÃƒÂ³mo perdiÃƒÂ³ al amor de su vida, todo su dinero, su casa e incluso sus amigos. En una entrevista llena de emociÃƒÂ³n, Mickey Rourke nos revela lo cerca que estuvo de quitarse la vida, cÃƒÂ³mo no espera encontrar el amor otra vez y cÃƒÂ³mo, despuÃƒÂ©s de quemar todas las naves de la Ciudad de las Estrellas, lucha de nuevo por volver a estar en la cima.\n","torrent":{"xt":"urn:btih:7bc0f061cf76d897df6a936aeeb1692d6d7afe74","amp;dn":"El+lado+oscuro+de+la+fama.%28Docu%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bc0f061cf76d897df6a936aeeb1692d6d7afe74","infoHashBuffer":{"type":"Buffer","data":[123,192,240,97,207,118,216,151,223,106,147,106,238,177,105,45,109,122,254,116]},"announce":[],"urlList":[]}}