{"title":"Pinkly Smooth - Unfortunate Snort (mp3 format)(190-320kbps)","uid":5556748,"size":54611136,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7bda76a0239fcb9a15690bbb26946883824cc2e5&amp;dn=Pinkly+Smooth+-+Unfortunate+Snort+%28mp3+format%29%28190-320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitja93","files":6,"time":1273711878,"description":"I found and downloaded each of these songs separately and, because as far as I know there are no torrents with seeders on this site, I'm putting this on Piratebay.\n\nThere is a word &quot;preview&quot; in songs' names, but it doesn't mean a thing. Rename it if you want to.\n\nI'll be seeding all of the time, but be kind and help others by seeding after you've downloaded. Thank you. :D\n\n\n\nPinkly Smooth is an american avant-garde metal band, and sideproject of &quot;Rathead&quot; also known as Avenged Sevenfold drummer (The Rev), in which he is the primary vocalist.\n\nThe band was formed in the summer of 2001 in Huntington Beach, California, with The Rev (under the name Rathead) as singer, fellow Avenged Sevenfold guitarist Synyster Gates as guitarist and ex-Ballistico members: Buck Silverspur (under the name El Diablo) on bass and D-Rock (under the name Super Loop) on drums.\n\nSince then, the band has released only one album, Unfortunate Snort on Bucktan Records, which features a crossover sound of mostly punk, ska and avant-garde. Former Avenged Sevenfold bassist Justin Meacham was also featured on keyboards and piano on the album, but left the band soon after.\n\nAlthough the band is on hiatus ever since the release of the album and had never reunited since then, members have hinted on possible works of the band in the future.\n\n-Wikipedia.org\t\t","torrent":{"xt":"urn:btih:7bda76a0239fcb9a15690bbb26946883824cc2e5","amp;dn":"Pinkly+Smooth+-+Unfortunate+Snort+%28mp3+format%29%28190-320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bda76a0239fcb9a15690bbb26946883824cc2e5","infoHashBuffer":{"type":"Buffer","data":[123,218,118,160,35,159,203,154,21,105,11,187,38,148,104,131,130,76,194,229]},"announce":[],"urlList":[]}}