{"title":"Blade 2(2002)DVDRip.AC3(ENG)-DROCK","uid":6137675,"size":1468418048,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7bed4fcf4b05880a052a4df48e8864494a6d0e00&amp;dn=Blade+2%282002%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"drock232","files":-1,"time":1296374804,"description":"Four years after scoring a box-office touchdown with Blade (1998), actor Wesley Snipes returns to portray the Marvel Comics character again in this sequel that teams him with Mexican horror director Guillermo del Toro. A half-vampire, half-human hybrid, Blade (Snipes) is a merciless vampire hunter bent on destroying the bloodsuckers that feed on humanity. The keys to Blade's success are a serum that allows him to resist the urge for blood and an array of inventive, deadly weapons, both of which were once supplied by his mentor, Whistler (Kris Kristofferson). Since Whistler's death, Blade has relocated to Prague and recruited the pot-smoking slacker Scud (Norman Reedus) to take the place of his father figure, but then he discovers that Whistler's not dead after all: He's been infected with the vampire virus. Reunited with Whistler, Blade is dealt an even bigger surprise: His greatest enemy, vampire leader Damaskinos (Thomas Kretschmann), wants to make peace with him. It seems that the vampires are facing a greater threat than Blade and hope to persuade him to fight the Reapers, a mutated super-race of vampires on a rampage of murder, indiscriminately killing both humans and their fellow bloodsuckers while sucking their victims dry. Blade agrees to a truce and joins the Bloodpack, an elite squad of commandos originally formed to fight Blade himself. Soon, the vampire soldiers discover that the virus responsible for creating their enemies is spreading rapidly and can be traced back to a mysterious &quot;Patient Zero.&quot; Blade 2 (2002) co-stars Ron Perlman, Leonor Varela, Donnie Yen, and Matt Schulze.\n\nRipped with DVD Decrypter and Autogk.","torrent":{"xt":"urn:btih:7bed4fcf4b05880a052a4df48e8864494a6d0e00","amp;dn":"Blade+2%282002%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bed4fcf4b05880a052a4df48e8864494a6d0e00","infoHashBuffer":{"type":"Buffer","data":[123,237,79,207,75,5,136,10,5,42,77,244,142,136,100,73,74,109,14,0]},"announce":[],"urlList":[]}}