{"title":"Bling-A-Long - 3 Days on the Road with a Crackhead","uid":5558736,"size":466372182,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7bfcb11720cb598929832202b18ba6984273ac91&amp;dn=Bling-A-Long+-+3+Days+on+the+Road+with+a+Crackhead&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bdog78","files":-1,"time":1273761287,"description":"Bling-A-Long \n\nBling Bling, the lovable crackhead from Bumfights, gets time to shine in his own thirty-minute DVD. He was supposedly locked up for his drug usage, and during his time behind bars, he wrote an albums worth of songs. Now that he's back on the streets, we see a few videos that have been made for the songs along with the usual hijinks from Bling and the Indecline crew. If you've seen Bumfights, this one runs pretty much along the same lines... except, without all of the fighting bums. If you're one of the three people out there who haven't seen Bumfights, imagine Jackass turned up a notch or two or fifty. Some of the highlights of the disc include the crew getting in trouble at their local Wal*Mart, a discussion about Bling's inability to get an erection, watching Bling attempt to get to a plate of crack while chained to a pole, Bling's hypnosis-induced alien abduction story, the grand finale consisting of Bling's turning to God, and of course, the music videos dreamt up by, shot by, sung by, and starring a genuine crackhead.\n\nIf you want a preview of Bling-A-Long search for &quot;bling-a-long&quot; on\n","torrent":{"xt":"urn:btih:7bfcb11720cb598929832202b18ba6984273ac91","amp;dn":"Bling-A-Long+-+3+Days+on+the+Road+with+a+Crackhead","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bfcb11720cb598929832202b18ba6984273ac91","infoHashBuffer":{"type":"Buffer","data":[123,252,177,23,32,203,89,137,41,131,34,2,177,139,166,152,66,115,172,145]},"announce":[],"urlList":[]}}