{"title":"Ry Cooder &amp; Manuel Galban - Mambo Sinuendo  [2003]  [Robbie60] [","uid":6220656,"size":314055600,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7c1948a93871fdd2c2a811d31805308deb239dde&amp;dn=Ry+Cooder+%26+Manuel+Galban+-+Mambo+Sinuendo++%5B2003%5D++%5BRobbie60%5D+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robbie6ty","files":-1,"time":1299316451,"description":"Ry Cooder &amp; Manuel Galban\nMambo Sinuendo\n\nLabel: Nonesuch\nReleased: 2003\nSource: Original CD \nSize Torrent: 299 MB\nFormat: FLAC\n\n\n\n\n\nThe excitement of the Buena Vista Social Club phenomenon has passed, though not without converting more than a few people eager to hear more from that influential little island 90 miles away from us. On Ry Cooder's latest release he not only takes us back to Cuba, but he takes us back in time to futuristic Cuban lounge. \n\n\nManuel GalbÃƒÂ¡n played with Ry Cooder on Buena Vista Social Club, and though there are a few echoes of that effort, the sound is far from being a &quot;Volume 2&quot;. Instead, imagine being back in 1950's Havana, Esquivel has been born Cuban instead of Mexican, and he decides to throw in a little surfing music to complement his space-age Cuban lounge for good measure. The endeavor is a lighthearted sonic escape of guitars complemented by Cuban congas. \n\nSteel guitar, drums and congas dominate with their seductive playfulness to set the tone on opening track &quot;Drume Negrita&quot;. The bossa nova-inspired &quot;Monte Adentro&quot; features the siren sounds of Juliette and Carla Commagere, while &quot;Los Twangueros&quot; is as quirky as the title implies. &quot;Mambo Sinuendo&quot; is one of the more experimental tracks on the album combining 60's organ, Herb Alpert on trumpet along with electric bass and modern experimental riffs. &quot;Bolero SonÃƒÂ¡mbulo, like &quot;Bodas De Oro&quot;, is seductive, dreamy and swaying with intensity, but also more melancholic than the other songs. \n\nSome names on this record will be familiar. Orlando &quot;CachaÃƒÂ­to&quot; Lopez on bass, the mighty Herb Alpert on trumpet, Joachim Cooder on drums and Miguel &quot;AngÃƒÂ¡&quot; Diaz on congas. \n\nWhile the cover photo of a 1959 Cadillac certainly shows what Cuba and the U.S. shared before the Revolution and subsequent blockade, it's really Cooder and Galban's Esquivelesque version of Perez Prado's &quot;Patricia&quot; that sums up the album. It sounds like what a lazy summer day at the pool should look like: cocktails, smiles, bikinis and blue blue water. \n\n\n''You can look at this as a road trip through different worldless fantasy landscapes. Sometimes you're in bright daylight, sometimes the streets are dark &amp; empty. You're riding with the Conjunto Sinuendo - drummers Jim Keltner &amp; Joachim Cooder, Conga-player ''Anga'' Diaz, &amp; bassist Cachaito Lopez, to hold you on the road. High performance Twang!''  Ry Cooder\n\n\nRecorded at Egram Studios, Havana, Cuba; Capitol Studios and Sound City Studios, Los Angeles, California.\n\n\n\nPersonnel\n\nRy Cooder (guitar, slide guitar, steel guitar, electric piano, vibraphone, tres); \nManuel Galban (guitar); \nHerb Alpert (trumpet); \nOrlando Cachaito Lopez (bass); \nJim Keltner, Joachim Cooder (drums); \nGregorio Hernandez Rios &quot;Goyo&quot;, Maximino Duquesne Martinez, Marcos H. Scull, Yosvani Diaz (bata drums); \nMiguel &quot;Anga&quot; Diaz (conga); \nJuliette &amp; Carla Commagere (background vocals).\n\n\n\nTrack Listing\n\n1. Dru Me Negrita \n2. Monte A Dentro \n3. Los Twangueros \n4. Patricia \n5. Caballo Viejo \n6. Mambo Sinuendo \n7. Bodas De Oro \n8. Echale Salsita \n9. La Luna En Tu Mirada \n10. Secret Love \n11. Boleros Sonambulo \n12. Maria La Lo \n","torrent":{"xt":"urn:btih:7c1948a93871fdd2c2a811d31805308deb239dde","amp;dn":"Ry+Cooder+%26+Manuel+Galban+-+Mambo+Sinuendo++%5B2003%5D++%5BRobbie60%5D+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c1948a93871fdd2c2a811d31805308deb239dde","infoHashBuffer":{"type":"Buffer","data":[124,25,72,169,56,113,253,210,194,168,17,211,24,5,48,141,235,35,157,222]},"announce":[],"urlList":[]}}