{"title":"Encyclopedia of White-Collar &amp; Corporate Crime","uid":5103252,"size":37298317,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d91d5776cf696267b52cfa8932ad30c1585e23a&amp;dn=Encyclopedia+of+White-Collar+%26+Corporate+Crime&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1254164584,"description":"Editorial Reviews\nFrom Booklist\nArthur Andersen, WorldCom, Ken Lay, and Martha Stewart are just a few of the names tarnished by their involvement with white-collar crimes. Each is discussed in this work, which covers events from the 1863 passage of the False Claims Act to the indictments and trials of public figures in 2004. Along the way, it addresses white-collar crimes such as Bribery, Check kiting, and Embezzlement as well as harm caused by allegedly unethical or immoral behavior that has not been punished through the penal system (the Challenger disaster, the sale of the antinausea drug Bendectin, racial discrimination). Fraud of various types, from Counterfeiting to Sweepstakes fraud, constitutes a large number of the entries.\nThe time line included in volume 1 helps provide some historical perspective even though it does not reflect the majority of entries in the set. For example, six entries focus on political scandals, yet only one (ABSCAM) is listed on the time line. Numerous federal statutes are included on the time line; entries helpfully place their passage in historical context and lead the reader to other entries discussing the events or abuses that led to their enactment. For example, the entry Computer Fraud and Abuse Act cross-references Computer hacking, Cyberstalking, and Wire fraud.\n\nWritten predominantly by active or retired academicians, the signed entries cover more than 500 individuals, corporations, places, events, crimes, and scandals. Entries on 35 countries and regions incorporate an international component into a work that is otherwise mainly centered on the U.S. Varying from a column to more than four pages in length, entries conclude with brief bibliographies, which contain references to Web sites and popular publications in addition to books and journal articles. This focus fits well with the intended audience of high-school, college, and public libraries. Appendixes include a &quot;Resource Guide&quot; listing selected materials for more information, a glossary, and summaries of several key laws.\n\nThis source complements Sage's more scholarly Encyclopedia of Crime and Punishment (2002), with very little overlap. In addition to criminal justice students, it will be of interest to students researching political science, popular culture, legal, and occupational safety issues. Jan Lewis\nCopyright Ã‚Â© American Library Association. All rights reserved \n\nReview\n&quot;This excellent set covers corporate, organizational, governmental, financial, and political crimes, as well as important legislation and laws related to the subject. An impressive title on a neglected field of criminal justice. Highly Recommended.&quot; (CHOICE )\n\n&quot;Lawrence Sallinger's Encyclopedia of White-Collar and Corporate Crime is an impressive two-volume reference work in a class by itself.&quot; (REFERENCE &amp; USER SERVICES QUARTERLY )\n\n&quot;Salinger has edited a well-researched and clearly written collection of articles about the types of white collar crime and cites some of the more notorious players. . . . What makes the book truly accessible is a timeline, resource guide, glossary of terms, summary of laws, and a detailed index. . . . Ideal for general use, this resource is most suitable and recommended for academic libraries.&quot; (Harry Charles LIBRARY JOURNAL ) \n\namazon.com","torrent":{"xt":"urn:btih:7d91d5776cf696267b52cfa8932ad30c1585e23a","amp;dn":"Encyclopedia+of+White-Collar+%26+Corporate+Crime","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d91d5776cf696267b52cfa8932ad30c1585e23a","infoHashBuffer":{"type":"Buffer","data":[125,145,213,119,108,246,150,38,123,82,207,168,147,42,211,12,21,133,226,58]},"announce":[],"urlList":[]}}