{"title":"Sex, Bombs and Burgers: How War, Porn and Fast Food Shaped Techn","uid":5621175,"size":1796785,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7da2908bb2076c175556f0f15917e4711e55f9cd&amp;dn=Sex%2C+Bombs+and+Burgers%3A+How+War%2C+Porn+and+Fast+Food+Shaped+Techn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1276283152,"description":" Peter Nowak, &quot;Sex, Bombs and Burgers: How War, Porn and Fast Food Shaped Technology As We Know It&quot;\nViking Canada | 2010 | ISBN: 0670069663 | 384 pages | PDF | 1,3 MB\n\nWar, porn and fast food - these are three of the most maligned facets of our civilization, and rightly so - war is responsible for untold human suffering and death; porn is often deemed responsible for everything from marital infidelity to the erosion of society's morals; and fast food, meanwhile, is frequently blamed for rising obesity levels, not to mention the increasing uniformity and blandness of western culture. So why celebrate them? Well, according to Peter Nowak, if it wasn't for war, porn and fast food, we might all still be living in caves.\n\nSex, Bombs and Burgers is a pacy, accessible history of technology based on fascinating research into the histories of all three industries and including extensive interviews with inventors, experts, academics, executives and commentators. It is also a chronicle of popular culture, chock-full of surprising 'fancy that?' moments. From cars to high-definition televisions, from website logins to microwave popcorn and slinkies, it reveals how our everyday lives have been shaped - hopefully for the most part indirectly - by war, porn and fast food.\n\namazon.com","torrent":{"xt":"urn:btih:7da2908bb2076c175556f0f15917e4711e55f9cd","amp;dn":"Sex%2C+Bombs+and+Burgers%3A+How+War%2C+Porn+and+Fast+Food+Shaped+Techn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7da2908bb2076c175556f0f15917e4711e55f9cd","infoHashBuffer":{"type":"Buffer","data":[125,162,144,139,178,7,108,23,85,86,240,241,89,23,228,113,30,85,249,205]},"announce":[],"urlList":[]}}