{"title":"The Break-Up(2006)DVDRip.AC3(ENG)-DROCK","uid":6164830,"size":734039626,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7e1653e43a89770970e72aa4160fd56a414a48a6&amp;dn=The+Break-Up%282006%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1297349596,"description":"A once-loving Chicago couple whose happily-ever-after quickly turned into a never-again finds their crumbling romance complicated when both parties refuse to move out of the pair's recently purchased condo. The Break-Up is a romantic comedy that starts where all the others end. The future once looked promising for thirtysomething couple Brooke (Jennifer Aniston) and Gary (Vince Vaughn), but lately it seems like a series of increasingly petty and intolerable squabbles have snuffed any semblance of romance in their relationship. Their confrontation endlessly fueled by mean-spirited suggestions of revenge tactics from friends and family and their stubborn refusal to budge resulting in an excruciating stalemate, Brooke and Gary ultimately decide to spitefully stick it out as hostile roommates until the weaker party eventually admits defeat. As the competition to drive one another out grows increasingly intense and outrageous, however, Brooke eventually comes to the realization that she's not fighting for possession of the condominium as much as she is fighting to salvage her relationship with the man she once viewed as the love of her life. \n\nRipped with DVD Decrypter and Handbrake.","torrent":{"xt":"urn:btih:7e1653e43a89770970e72aa4160fd56a414a48a6","amp;dn":"The+Break-Up%282006%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e1653e43a89770970e72aa4160fd56a414a48a6","infoHashBuffer":{"type":"Buffer","data":[126,22,83,228,58,137,119,9,112,231,42,164,22,15,213,106,65,74,72,166]},"announce":[],"urlList":[]}}