{"title":"Metric - Help I'm Alive","uid":5174334,"size":126072836,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7f2421d883d72b274b929d227b037fe80482b1ba&amp;dn=Metric+-+Help+I%5C%27m+Alive&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1258875053,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Help I'm Alive&quot; is the lead single from Canadian rock group Metric's fourth studio album Fantasies. The song was released digitally on December 23, 2008.\n\nThe song was written by Emily Haines and produced by John O'Mahony. The song was born in Buenos Aires, Argentina, being one of the first songs Haines had written in months.\n\nOn November 5, 2008 Metric updated their website with a video on how Haines writes a song. The video follows Haines through Argentina on a soul searching journey to find creativity and herself. &quot;The songs that I wrote here were the simplest and clearest writing that I've done in I think in my whole life&quot;, said Haines. &quot;Help I'm Alive&quot; was one of the first songs Haines had written in Buenos Aires.\n\nThe song has been very well-received by contemporary rock music critics.\n\nOn January 28, 2009, the band made the acoustic version of the single available for download from their website. The acoustic version features Emily Haines on piano and James Shaw on acoustic guitar.\n\nThe song reached #1 on CBC Radio 3's R3-30 chart the week of February 5, 2009.\n\nThe song is currently on its eleventh week on the Canadian Hot 100, and first made a &quot;Hot Shot Debut&quot; at #21 based on high digital sales, falling just short of the Top 20. Had the song reached #20, it would have been Metric's third Top 20 single in Canada, following &quot;Monster Hospital&quot; and &quot;Poster of a Girl&quot;. \n\nDownloads helped pushed the song onto the Hot Canadian Digital Singles chart, where it peaked at #18.\n\nThe song was also their first ever chart appearance in the United States, where it has risen to #17 on the Billboard Alternative Songs chart and to #30 on the Rock Songs chart.\n\nFantasies is the fourth album released by the Canadian indie rock band Metric. It was released on April 7, 2009. In the U.S. it debuted at #1 on Billboard's Top Heatseekers, and peaked at #76 on the Billboard 200. In Canada it debuted at #8 on the Canadian Albums Chart and peaked at #6. In Australia, the album debuted at #48.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:7f2421d883d72b274b929d227b037fe80482b1ba","amp;dn":"Metric+-+Help+I%5C%27m+Alive","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f2421d883d72b274b929d227b037fe80482b1ba","infoHashBuffer":{"type":"Buffer","data":[127,36,33,216,131,215,43,39,75,146,157,34,123,3,127,232,4,130,177,186]},"announce":[],"urlList":[]}}