{"title":"Puzzle collection","uid":5088450,"size":44533821,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7fa31b6c24be4cdc7f1a312b0ab8904079e7c23f&amp;dn=Puzzle+collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"spotted_jackal","files":-1,"time":1252920851,"description":"\n\nMicrosoft Entertainment pack: The puzzle collection \n\n\n\nDescription:\n\nPower up your gray matter for The Puzzle Collection -featuring games by Alexey Pajitnov, the Russian mastermind behind Tetris. 10 original mind-twisting puzzles with infinite variations - you do the math. They are easy to play, but to master them is another story. You'll find they are so challenging and addictive your brain will beg for more. The Puzzle Collection includes a full spectrum of multi-level quick fixers and strategic sticklers. Just see if you can stop after one level!   \n\n\n\nFringer\n-- Untangle knots in a mad scramble against time. Fall behind and you'll be at the end of your rope. Stay ahead and be tied up for hours.  \n\nMixed Genetics\n-- Cure bizarre mutant animals by mixing and matching common traits. Use your analytical skills and fast thinking to create genetic order out of chaos.  \n\nRat Poker\n-- Quickly trap rats and combine them into winning poker hands. Anticipate the next move or get lost in the rat race.  \n\nColor Collision\n-- Dodge obstacles at breakneck speeds in pursuit of the color target. Think you've got it mastered? Try the next level and you'll be seeing red.  \n\nJewel Chase\n-- Logic is the key to this gem. Plan your moves carefully in this unique twist of cat and mouse and treasures are yours for the taking.  \n\nFinty Flush\n-- Fill the grids with the correct combination of marbles. The clock is your adversary but logic rules. Lose your cool and it's gridlock.  \n\nCharmer\n-- Dancing snakes are too entranced to see their doom. Stay alert to save them before the last pot is sealed -and they're hisssssstory.  \n\nLineup\n-- Take a time-out with this new ball game. Sharp eyes and sound thinking will give you command of the playing field.  \n\nspring Weekend\n-- Use shrewd decision-making to match garden patterns in as few moves as possible. You'll need more than a green thumb to conquer this one!  \n\nMuddled Casino\n-- Deductive reasoning and endless strategizing are required to win the jackpot. WARNING: There's no bluffing in this casino! \n\n\n\n\nHow to install.\n\n1.Mount the imagefile, and install the game\n2.Fill in the serial (txt file in upload)\n4.Play the game! (there is NO, no-cd crack! this means you need to mount always if you want to play!)\n\n","torrent":{"xt":"urn:btih:7fa31b6c24be4cdc7f1a312b0ab8904079e7c23f","amp;dn":"Puzzle+collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fa31b6c24be4cdc7f1a312b0ab8904079e7c23f","infoHashBuffer":{"type":"Buffer","data":[127,163,27,108,36,190,76,220,127,26,49,43,10,184,144,64,121,231,194,63]},"announce":[],"urlList":[]}}