{"title":"House of Mystery v1 (DC Comics)","uid":5113036,"size":6438953976,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8031a9b89d8a420cb8331c2c47860f5a1bff03c7&amp;dn=House+of+Mystery+v1+%28DC+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"brodahisou","files":-1,"time":1254922476,"description":"House of Mystery started out as a horror anthology, published by DC Comics from 1951.  It featured tales of the supernatural as well as supernatural-themed mystery stories.  However, with the growing backlash against horror comics in the mid-1950s, as well as the advent of the Comics Code Authority and its restrictions on horror-themed storylines (banning stories dealing with such supernatural fare as werewolves, vampires, and such), the series quietly was revamped into dealing with science-fiction type monsters and other mystery-suspense type tales that were permitted by the comic code.\n\nIn the mid-1960s, the series was revamped to include super-hero stories: From House of Mystery #143 (June 1964) through #158 (April, 1966), the Martian Manhunter headlined the series, as his back-up feature from Detective Comics was moved to &quot;House of Mystery&quot;.  This was also followed up with the introduction of Dial H for Hero, who was introduced in House of Mystery issue #156 (January, 1966) and took over as headliner until #173 (March-April 1968).\n\nWith issue #174, EC Comics veteran Joe Orlando was hired by DC to take over as editor of &quot;House of Mystery&quot;.  As the Comic Code Authority was now being challenged, by both DC and Marvel over content restrictions, the series returned to its overt horror themes.  The first issue (House of Mystery #174) under Orlando would be a reprint issue of old horror/suspense stories as the new direction would truly begin with House of Mystery #175 (May-June 1968).  The issue would introduce a new figure to the series, Cain, the &quot;able care taker&quot; of the House of Mystery who would introduce nearly all stories that would run in the series before its cancellation (Cain would also host the spin-off series Plop! and ultimately become a recurring character in The Sandman).\n\nUnder Orlando's stewardship, the series won a good deal of recognition in the comics industry, including the Shazam Award for Best Individual Short Story (Dramatic) in 1972 for &quot;The Demon Within&quot; in #201 by John Albano and Jim Aparo, and the Shazam Award for Best Humor Story in 1972 for &quot;The Poster Plague&quot; by Steve Skeates and Sergio Aragones.  The series also featured stories by writers T. Casey Brennan (#260, 267, 268 and 274) and Scott Edelman (#257, 258, 260, 264, 266, 270, 272, 273).\n\nOrlando would ultimately step down from the series, appointing Karen Berger as editor of the book, her first for DC Comics.  Under Berger, the series experimented with long-form storyline with the popular I...Vampire serial. &quot;I... Vampire&quot; revolved around the heroic vampire, Andrew Bennett, who sought to defeat his nemesis and former lover Mary, the Queen of Blood.  This series began in #290 (March, 1981) and would last until #319 (August, 1983), two issues before the title ended with #321 (October, 1983).\n\nThe classic &quot;House of Mystery&quot; series is widely regarded as one of the cornerstones of the Vertigo comic line.  A one shot reprint (in color), Welcome Back to the House of Mystery, featured ten of the most highly-regarded stories as selected by Alisa Kwitney in a Cain wraparound by Neil Gaiman and Sergio AragonÃƒÂ©s, under the Vertigo imprint.  The first issue from 1951 was also reissued as a Millenium Edition under the Vertigo imprint.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:8031a9b89d8a420cb8331c2c47860f5a1bff03c7","amp;dn":"House+of+Mystery+v1+%28DC+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8031a9b89d8a420cb8331c2c47860f5a1bff03c7","infoHashBuffer":{"type":"Buffer","data":[128,49,169,184,157,138,66,12,184,51,28,44,71,134,15,90,27,255,3,199]},"announce":[],"urlList":[]}}