{"title":"Lento - Icon (2011)","uid":6254942,"size":89444970,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:81550fd05dac00523830c8478e46817f318476ef&amp;dn=Lento+-+Icon+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Baphom3t","files":11,"time":1300540594,"description":"Lento is an instrumental band from Rome, Italy. The former members joined in 2004 and started working out a sort of introspective and implosive approach, taking their cue from a wide range of influences including seminal bands such as Neurosis, Swans and Godspeed You! Black Emperor. In late 2005, Lento began structuring the basement of a more elaborate mood. Incorporating elements of ambient, doom and hardcore, Lento has created a perfect opposition between sludge heavy riffs and ambient psychedelic suites.Lento\\'s tone is a blend of heavily down tuned guitars, apocalyptic slow tempos, systematic drones and resonant feedbacks, their live sets alternate from hardcore assaults to intimate collapses of the signals. \n\nIn June 2007 they released \\&quot;Supernaturals record one\\&quot; with Ufomammut for italian indie label Supernaturalcat, a super hypnotic and telluric monster in which the two bands play around repetitive atmosphere broken by fragile openings. In November 2007 they released their first full lenght Earthen for Supernaturalcat, distributed in USA by Relapse.They toured a lot Italy and Europe, sharing the stage with bands such as Baroness, Pelican, Torche, Nomeansno, Amenra, Liars, Zu, Ufomammut and many more. Their brand new album has been recorded and mixed this year by Lorenzo Stecconi and Matteo SpinazzÃƒÂ¨ at LRS Studio in Rome and mastered by Khanate member James Plotkin. It will be released by german Denovali Records in Spring 2011.\n\nCurrent line-up\nGiuseppe Caputo - Guitar\nLorenzo Stecconi - Guitar\nDonato Loia - Guitar\nEmanuele Massa - Bass\nFederico Colella - Drums and live samples\n\nGenre = Doom / Atmospheric Sludge Metal \nFormat = mp3\nBitrate = 320 kbps\nFile Size = 85.30 MB\n\nTracklist\n1. Then\t\t\n2. Hymn\t\n3. Limb\t\t\n4. Hymen\t\n5. Still\n6. Throne\t\n7. Least\n8. Dyad\t\n9. Icon\t\n10. Admission","torrent":{"xt":"urn:btih:81550fd05dac00523830c8478e46817f318476ef","amp;dn":"Lento+-+Icon+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81550fd05dac00523830c8478e46817f318476ef","infoHashBuffer":{"type":"Buffer","data":[129,85,15,208,93,172,0,82,56,48,200,71,142,70,129,127,49,132,118,239]},"announce":[],"urlList":[]}}