{"title":"Entrapment(1999)DVDRip.AC3(ENG)-DROCK","uid":6266260,"size":733295820,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8170ce7e4fe088af3fddfa691a7983d24fe73ad2&amp;dn=Entrapment%281999%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1300918386,"description":"After a long career playing good guys, Sean Connery gets to have some fun playing a crook for a change in the romantic crime thriller Entrapment -- and he even gets to break the law with the lovely Catherine Zeta-Jones. When a priceless Rembrandt painting is stolen from a New York skyscraper in a daring and technically sophisticated robbery, ace insurance investigator Virginia &quot;Gin&quot; Baker (Catherine Zeta-Jones) begins looking into the matter and is soon convinced it's the work of master art thief Robert &quot;Mac&quot; MacDougal (Sean Connery). Gin thinks the best way to get the goods on Mac (and perhaps recover the painting) is to work her way inside his operation, so she locates him in London and, posing as a fellow art thief, offers to work as his partner. While Mac is smart enough to not accept an offer like that from just anyone, most thieves don't look as good as Gin does in a leotard, and she soon proves an able assistant in a shakedown robbery where they pinch a rare Chinese mask from a British museum. After this success, Mac agrees to join forces with Gin for what is literally the heist of the millenium -- as Midnight rolls around in Kuala Lumpur on December 31, 1999, the security computers in a major multinational banking facility will be breached for a split second as the computers roll over to a new program for Y2K. Is that long enough for Gin and Mac to nab $8 billion in bank transfers? Is 14 days long enough to prepare for a robbery of this scale? And will Mac and Gin's professional relationship pave the way for some capers in the bedroom? In addition to playing the male lead, Sean Connery also co-produced this film; the supporting cast includes Ving Rhames and Maury Chaykin. \n\nRipped with Handbrake.\n\nLength: 1 Hour 53 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:8170ce7e4fe088af3fddfa691a7983d24fe73ad2","amp;dn":"Entrapment%281999%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8170ce7e4fe088af3fddfa691a7983d24fe73ad2","infoHashBuffer":{"type":"Buffer","data":[129,112,206,126,79,224,136,175,63,221,250,105,26,121,131,210,79,231,58,210]},"announce":[],"urlList":[]}}