{"title":"Transformers Prime-108-Con-Job-Divx-[Oj]","uid":6203351,"size":183921498,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:82174388a3b99472e06ffd8c863562974081772f&amp;dn=Transformers+Prime-108-Con-Job-Divx-%5BOj%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"despo1ler","files":-1,"time":1298703358,"description":"[center]\n[URL=http://img202.imageshack.us/i/tprimelogo.jpg/][IMG]http://img202.imageshack.us/img202/8368/tprimelogo.jpg[/IMG][/URL]\n[URL=http://img269.imageshack.us/my.php?image=transformersprimelogo.jpg][IMG]http://img269.imageshack.us/img269/295/transformersprimelogo.jpg[/IMG][/URL]\n\n[URL=http://img547.imageshack.us/my.php?image=transformersoptimusprim.jpg][IMG]http://img547.imageshack.us/img547/694/transformersoptimusprim.jpg[/IMG][/URL]\n\n-----------------------------------------------------------------------------------------\nStory\n====== \n8  &quot;Con Job&quot;  February 25, 2011   108 \n\nWhen the Autobots recieve a signal from a starship which has entered the Earth's Solar System \nthe owner of the starship is intentified as Wheeljack. Wheeljack is Bulkhead's best friend back on Cybertron.\n Bulkhead and Wheeljack went on many adventures together and were part of the Autobot warrior fighting group The Wreckers.\n Meanwhile, Starscream sends a Decepticon named Makeshift on a mission, to pretend he is Wheeljack \nin order to locate the Autobot Base. When Wheeljack arrives somewhere on Earth he is attacked by Vehicons. \nThe Autobots pick up his signal, once again and Arcee, Bumblebee and Bulkhead Groundbridge to where Wheeljack is to save him.\n But, Wheeljack defeated all the Vehicons before the other Autobots could help him. Then,\n it is shown that the real Wheeljack has been captured by Starscream and is held personer. Later, \nBulkhead and Wheeljack (who is Makeshift) party. When Bulkhead and Wheeljack play a game of ball\n they acciently destroy the Groundbridge. Wheeljack asks Ratchet how long it would take for the Groundbridge\n to be repaired. After, Bulkhead tells stories about his adventures with Wheeljack.\n To Bulkhead for some reason Wheeljack doesn't seem like himself. Miko takes Wheeljack on a tour of the base. \nHe asks Miko where is the Autobot Base is located. She tells him the correct answer, outside Jasper, Nevada. \nBulkhead thinks something's wrong with Wheeljack so he tells him to tell the story about Darkmount Pass.\n Wheeljacks tells the story correctly, except for one thing he said Bulkhead was there and Bulkhead wasn't.\n Makeshift's cover is blown and he threatens if the Autobots do anything he'll kill Miko.\n The real Wheeljack escapes and he defeats some of Starscream's army that he has prepaired on Groundbridge to the Autobot Base.\n He Groundbridges to the Autobot Base and has a fight with Makeshift. Makeshift loses and is sent back to the Nemisis.\n Just before he tells where the Autobot Base is he realizes there is a bomb on him and he blows up. The next day, \nWheeljack leaves, but asks Bulkhead if he wants to come with him.\n Bulkhead says no and the last scene shows Miko taking a picture of Wheeljack and Bulkhead.\n\nFirst Appearances: Wheeljack, Makeshift  \n\n\n\n====================================================================================\n\n\nCast\n===========\nSeries cast summary: \n----------------------\n\n  Kevin Michael Richardson  ...  Bulkhead (7 episodes, 2010-2011)  \n  Peter Cullen  ...  Optimus Prime (6 episodes, 2010-2011)  \n  Frank Welker  ...  Megatron (6 episodes, 2010-2011)  \n  Steve Blum  ...  Starscream (6 episodes, 2010-2011)  \n  Jeffrey Combs  ...  Ratchet (6 episodes, 2010-2011)  \n  Sumalee Montano  ...  Arcee (6 episodes, 2010-2011)  \n  Tania Gunadi  ...  Miko Nakadai (6 episodes, 2010-2011)  \n  Josh Keaton  ...  Jack Darby (6 episodes, 2010-2011)  \n  Andy Pessoa  ...  Rafael 'Raf' Esquivel (6 episodes, 2010-2011)  \n  Ernie Hudson  ...  Agent Fowler (5 episodes, 2010-2011)  \n\n----------------------------------------------------------------\nIMDB\n========\nSeries:  h**p://www.imdb.com/title/tt1659175/\nEpisode: h**p://www.imdb.com/title/tt1825614/\n\n--------------------------------------------------------------\n              ===== File Info ===== \nFileSize           : 175M\nPlayTime           : 00:21:28.355\nVideoCount         : 1\nAudioCount         : 1\n              ===== Video Info ===== \nVideo 0# Stream\nVideoCodec         : DX50\nVideoWidth         : 720 piexs\nVideoHeight        : 400 piexs\nVideoFrameRate     : 29.970fps\nVideoFrameCount    : 38612\nVideoBitRate       : 1001054\n              ===== Audio Info ===== \nAudio 0# Stream\nAudioCodec         : MP3\nAudioBitRate       : 128000\nAudioChannels      : 2\nAudioSampleRate    : 48000\n\n-------------------------------------------------\n\nHash\n=====\n82174388A3B99472E06FFD8C863562974081772F\n\nScreens:\n========\n[URL=http://img195.imageshack.us/i/transformersprime108con.jpg/][IMG]http://img195.imageshack.us/img195/3302/transformersprime108con.jpg[/IMG][/URL]\n\n-------------------------------------------------\n\nCharacters\n===========\n\nAutobots\n----------\nOptimus Prime: Leader of the Autobots. Transforms into a red semi-trailer truck. \nIt was also shown in the &quot;Introducing The Hub&quot; commercial that Optimus Prime has a mouth feature, \nlike in Transformers Animated and the live action films, but Prime can also access\n a mouth plate feature as seen in most of the pictures on the internet.\n\nArcee: A female Autobot. Transforms into a blue motorcycle. Arcee is the smallest and most \nagile of the Autobot team. Acts as vice commander of the team.\n\nBumblebee: Transforms into a camaro similar to the live action movie except with an engine block in the hood.\n As in the live action movies, Bumblebee communicates through electronic sound effects rather than specific human languages.\n\n\nRatchet: Team medic. Transforms into a hybrid medical truck. His appearance and attitude is \nsimilar to his Transformers Animated character.\n\nBulkhead: Transforms into a giant green ATV. Like Ratchet, Bulkhead's appearance is similar \nto the Transformers Animated character.\n\nCliffjumper: Transforms into a red Dodge Challenger, killed off in the first episode with\n his body used in testing Dark Energon.\n\nDecepticons\n--------------\nMegatron: Leader of the Decepticons, transforms into a Cybertronian jet, similar the live action\n version. He believes that Earth-style forms are beneath him and attempts to utilize the Dark Energon \nhe acquired from his time in space to end these &quot;War Charades&quot; with the\n Autobots in his favor.\n\nStarscream: Transforms into a silver gray a F-16 Fighting Falcon-like fighter. He is colored silver\n instead of the frequently used red and blue. Starscream shows respect for his commander, but waits for\n a chance to kill Megatron and take over leadership of the Decepticons.\n\nSoundwave: Transforms into a blue MQ-9 Reaper-type aircraft. His arms become the wings, resulting in \nthem becoming very thin. According to his bio, he can use &quot;deployers&quot; that come out from his chest along \nwith mechanical tentacles. Soundwave's robotic appearance is similar\n to Jetstorm from Beast Machines.\n\nRatbat: (no info atm)\n\nEradicons: Troops (also known as drones) who serve as foot soldiers for the Decepticons.\n They transform into purple muscle cars.\n\nOthers\n----------\nUnicron: Only mentioned in the series so far, this is also where the Dark Energon Megatron uses eminates\n from. Dark Energon can revive the dead.\n\nHumans\n--------------\nJackson &quot;Jack&quot; Darby: a 16 year old boy who accidentally encounters Arcee in her motorcycle form and enters\n into the Transformer War as a strong ally.\n\nMiko Nakadai: Miko's last name is Nakadai, but at Comic Con 2010, it said that Miko's last name was Tezuka.\n 15 year old female Japanese exchange student who seeks to be &quot;in on the action&quot; after seeing Arcee.\n Later shows mechnical aptitude.\n\nRafael &quot;Raf&quot; Esquivel: A very young computer whiz who is able to provide Ratchet the technical support \nfor human technical devices that Ratchet cannot develop. Ratchet comes to respect Raf rather than a &quot;fleshy&quot;,\n becoming actual friend who actively support each other in later episodes. \nSeems to be the only one who understands Bumblebee.\n\nSpecial Agent Fowler: The Autobots' liaison to the outside world who only visits when there are &quot;issues&quot;\n like that of the Autobots failing to keep their fight with the Decepticons off the radar.\n\nJune Darby: Jack's mother.\n\nmisc\n-----------\nScraplets:\nScraplets feed on other robotic lifeforms, which makes them very dangerous to them. \nScraplets generally travel in large packs in search for robots, and upon finding one,\n they eagerly jump onto it, fastening themselves on the robot's armour plating. \nOnce fastened, the Scraplets release some kind of corrosive agent that both allows \nthem to sink partly underneath the armour plating and make them impossible to remove. \nUsing the raw materials of the host, a single Scraplet can multiply itself many times over, \ncreating further Scraplets and rapidly overwhelming the host\n==========================================================================================\n[/center]\n\nTracker info:\nJoin us at #Cartoon_Palace on irc.cartoonpalace.info for more Cartoons and Anime.\n &lt;a href=&quot;\nhttp://www.cartoonpalace.info/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cartoonpalace.info/&lt;/a&gt;","torrent":{"xt":"urn:btih:82174388a3b99472e06ffd8c863562974081772f","amp;dn":"Transformers+Prime-108-Con-Job-Divx-%5BOj%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82174388a3b99472e06ffd8c863562974081772f","infoHashBuffer":{"type":"Buffer","data":[130,23,67,136,163,185,148,114,224,111,253,140,134,53,98,151,64,129,119,47]},"announce":[],"urlList":[]}}