{"title":"love actually","uid":5037202,"size":4680810496,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:82a2958ce7753552c118c8fbf44f72f376a8ae60&amp;dn=love+actually&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"antonio111111","files":30,"time":1249176672,"description":"El nuevo primer ministro (Hugh Grant) se ena-mora de un miembro de su gabinete (Martine McCutcheon) a los pocos minutos de tomar posesiÃƒÂ³n de su despacho en el 10 de Downing Street. Un escritor (Colin Firth) escapa al Sur de Francia para reponerse de una desilusiÃƒÂ³n amorosa y se enamo-ra de nuevo en un lago. Una mujer felizmente casada (Emma Thompson) sospecha que estÃƒÂ¡ perdiendo a su marido (Alan Rick-man). Una reciÃƒÂ©n casada (Keira Knightley) interpreta mal la actitud del mejor amigo de su marido. Un escolar quiere despertar el inte-rÃƒÂ©s de la chica mÃƒÂ¡s deseada del colegio. Un padrastro que se ha quedado viudo (Liam Neeson) trata de conectar con un hijo al que apenas conoce. Una ejecutiva (Laura Linney) se arriesga a dar el primer paso con un compaÃƒÂ±ero de trabajo de quien lleva tiempo enamorada. Un viejo rockero (Bill Nighy) que ha vivido mucho pero no se acuerda de nada prepara su reapariciÃƒÂ³n final a su peculiar manera. El amor, el gran enredador, a todos los iguala a la hora de complicarles la vida. Los amores y las vidas de todos estos ciuda-danos de Londres se mezclan y entrecruzan en el dÃƒÂ­a de Navidad, con resultados romÃƒÂ¡nticos, divertidos y agridulces para todos los que han tenido la fortuna (o el infortunio) de enamorarse.","torrent":{"xt":"urn:btih:82a2958ce7753552c118c8fbf44f72f376a8ae60","amp;dn":"love+actually","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82a2958ce7753552c118c8fbf44f72f376a8ae60","infoHashBuffer":{"type":"Buffer","data":[130,162,149,140,231,117,53,82,193,24,200,251,244,79,114,243,118,168,174,96]},"announce":[],"urlList":[]}}