{"title":"RIDDLES IN STONE - History of USA Part 2 [2007] - DivX","uid":5060200,"size":1757098910,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:83c0e575d8cb83754bb95bb8597b6751d1734f04&amp;dn=RIDDLES+IN+STONE+-+History+of+USA+Part+2+%5B2007%5D+-+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"verifire","files":-1,"time":1250678857,"description":"Hi there..\n\nThen it finally happened. TPB's trackers are down. But I've been anticipating something like this for a while. So for those who'll want to download torrents I've made and will make in the future, I'm moving nearly all of them to another torrent-site, maybe two. I guess it'll be at least: &lt;a href=&quot;\nhttp://www.torrentbox.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentbox.com&lt;/a&gt;\n\nJust browse for the torrents on that site, and all uploads will come up, just give me some days.. :-)\n\nAnd you can still start your download from this site!! Just add these trackers to the torrent, and we'll find each other again.\n &lt;a href=&quot;\nhttp://tracker.publicbt.com:80/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.publicbt.com:80/announce&lt;/a&gt;\n &lt;a href=&quot;\nhttp://tracker.torrentbox.com:2710/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.torrentbox.com:2710/announce&lt;/a&gt;\n \nNow don't click on the &quot;links&quot; above, that won't work. Copy and paste them to add them to your trackers in the torrent-file.\n\nAnd be sure to enable DHT. It tracks too..\n  \nAnyway, they should also all be available by search on my alias, verifire, on for instance: &lt;a href=&quot;\nhttp://www.isoHunt.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.isoHunt.com&lt;/a&gt;\n \n- because they search the contents and comments on the upload for tags as well as the title of the torrent.. Just give me some time..\n\nSee you later, when things are settled and (maybe) there's a working tracker on the site again, and I'll miss it terribly, but I hope for, and guess this isn't the last word on the matter. I'll upload stuff here anyway, as well as on the other sites...\n\nTPB WILL ALWAYS RULE!! THANK YOU, GUYS. YOU'VE BEEN A PLEASURE TO BE SHIPWRECKED WITH. IT'S AN HONOUR...\n\nVerifire.\n____________________________________________________________________________\n\nPlease; bear with me when I beg of you to leave this stuff seeding on your machine for the benefit of others, who just like you, would like to watch this stuff. My machine is being hindered by &quot;someone&quot; closing ports for me, so I have to monitor and change ports constantly, just so that YOU will get a copy.. Please help me. Thank you.\n\nThis is part two of (so far) three, about the hidden history of USA's beginnings. Then there's the third one, &quot;Eye of the Phoenix&quot;, who deals with the Dollar bill.\n\nPart one can be downloaded from here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5060188&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5060188&lt;/a&gt;\n \nAnd part three from here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5067438/EYE_OF_THE_PHOENIX_-_History_of_USA_Part_3_[2009]_-_DivX&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5067438/EYE_OF_THE_PHOENIX_-_History_of_USA_Part_3_[2009]_-_DivX&lt;/a&gt;\n \nThe torrent you're about to download now, however, deals with the subject of the architecture of Washington DC, which Freemasons claim are not at all built after the principles of Freemasonry..\n\nBut of course it is, all you have to do is start 'Google Earth', zoom in on the White House and the Washington Monument, and you'll see the five-pointed star or pentagram right there in the street layout, minus a line or two.. ..and this documentary reveals many quite mind-blowing things about both that, and things related to the construction of both Washington and it's buildings, as well as the power-lines running around the globe, and what lies built directly aligned along them..\n\nI more than suspect that these movies are approved and made for public viewing by the higher councils of Freemasonry, because these days, they're blowing the lid off many of their former secrets, preparing us for the fact that we live in a hidden fascist state within the state.. well, maybe not so hidden anymore (or ever), but nevertheless. One person who is appearing in the series is a Co-Masonic historian, and He states: &quot;Fifteen years ago I would have been killed for revealing this material..&quot; But not only does he live on, he is allowed to reveal certain things to the world now. So don't be astonished..\n\nI, however do of course upload these things to show the accuracy of Gods Word, the Bible, when it says that this world has a god, and his name is Lucifer. And those who rule this world at present, but not for much longer now, are his true followers.\n\nIf you don't believe that, checkfor instance. Search phrase suggestions: Shriner Lucifer, Famous Freemasons Exposed, The World Sold Out To Lucifer, etc etc..\n\nBut brace yourselves, you that are Christians, because many of those you'll see in the flicks are people like Kenneth Copeland, or the Pope for that matter, flashing the satanic hand-signs, and many more..\n\nThey pretend to be Christian, along with many, many others, and they say that Jesus is the Messiah, but when the anti-christ is revealed, they will line up behind him and pledge their allegiance. That's the purpose of preaching the &quot;gospel&quot;, or their version of it, that you'll follow them when they at last bring you to your knees before the false messiah.\n\nSo if you trust in men, from the &quot;anointed one&quot;, Benny Hinn, to the &quot;good old&quot; Billy Graham, you'll upon inspection find them to be Freemasons and Jesuits, initiated into the higher ranks of occult practices..\n\nGet back to reading your own Bibles, and stop listening to, and reading all the interpretations people make books out of. For it is written: &quot;And they shall all be learned by God&quot;. And the teacher is the Holy Spirit, &quot;whom God gave to all those who obey Him.&quot; Trust the Spirit, if you've fulfilled the criteria for receiving it, and you'll be fine.. That's what the Bible teaches..\n\nJoh 14:23) Jesus answered and said to him, &quot;If anyone loves Me, he will keep My word; and My Father will love him, and We will come to him and make Our home with him. \n24) &quot;He who does not love Me does not keep My words; and the word which you hear is not Mine but the Father's who sent Me. \n25) &quot; These things I have spoken to you while being present with you. \n26) &quot;But the Helper, the Holy Spirit, whom the Father will send in My name, He will teach you all things, and bring to your remembrance all things that I said to you. \n27) &quot;Peace I leave with you, My peace I give to you; not as the world gives do I give to you. Let not your heart be troubled, neither let it be afraid.&quot; \n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;2b5d4e59424d42594e464a42476b4c464a424705484446&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:83c0e575d8cb83754bb95bb8597b6751d1734f04","amp;dn":"RIDDLES+IN+STONE+-+History+of+USA+Part+2+%5B2007%5D+-+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83c0e575d8cb83754bb95bb8597b6751d1734f04","infoHashBuffer":{"type":"Buffer","data":[131,192,229,117,216,203,131,117,75,185,91,184,89,123,103,81,209,115,79,4]},"announce":[],"urlList":[]}}