{"title":"Deity and Saint Angel (Hyperwerks)","uid":5008297,"size":421692282,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8455251164d727582b4303601c7ca898e2a3121f&amp;dn=Deity+and+Saint+Angel+%28Hyperwerks%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"brodahisou","files":-1,"time":1247859659,"description":"Deity follows the adventures of Jamie, a teenage girl who lives in the L.A. of tomorrow.  When Jamie turns 16 she learns a shocking secret: she's actually the Deity, a goddess of immense power.  Aided by a hot-blooded Gunslinger, a young Shaolin Monk and a Dragon Prince, she tries to cope with her destiny and maintain some semblance of a normal life in the face of constant danger from the Ma'Shiva: savage aliens bent on her destruction.\n\nAlso included is Saint Angel, which features a number of Deity back-up stories.\n\nIn a distant galaxy, on an alien world, floating island nations fight endlessly in bloody conflicts.  On one such island state, a truce is declared between the humans and a flying bird-like race. A member of each race is forced into an uneasy alliance and sent to the super-island of Neamis to investigate a new threat.  \nDuring their travels, the unlikely duo encounter the legendary Saint Angel; a mythic warrior who is waging a private war against ominous invaders.  Together, these warriors bury ancient blood feuds to save their world from certain destruction.\n\n\nReleased on http://ComicPirates.info\n","torrent":{"xt":"urn:btih:8455251164d727582b4303601c7ca898e2a3121f","amp;dn":"Deity+and+Saint+Angel+%28Hyperwerks%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8455251164d727582b4303601c7ca898e2a3121f","infoHashBuffer":{"type":"Buffer","data":[132,85,37,17,100,215,39,88,43,67,3,96,28,124,168,152,226,163,18,31]},"announce":[],"urlList":[]}}