{"title":"The Beatles - Complete Box Set (Remastered by den0izer)","uid":5187521,"size":3962558060,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:84f87b888ae171fe034343fb48c8b03efbc59713&amp;dn=The+Beatles+-+Complete+Box+Set+%28Remastered+by+den0izer%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"hamsteroid","files":420,"time":1259530839,"description":"Although 9.09.2009 EMI / Capitol issued a collection of fully remasterirana albums of The Beatles, the expectations of fans of the group is fully covered.\n  \nAfter more than 20 years of waiting, after the first issue of the albums on compact disc, the fans wanted to hear a truly contemporary sound, thanks to new technologies remasterirane.\n  \nUnfortunately conservative respect to EMI's catalog of The Beatles and this time they played a bad joke.\n  \nOf course, the sound is much better than that of the discs of 80 years but has not used the full potential and did not get the best quality. Fortunately, there is anecdotal remasterirani versions of the catalog.\n  \nWe present one of the best made by Den0izer.\n  \nInterestingly, it is alleged that he had access to the original studio recordings, but did not use compact discs or plates as the source.\n  \nThe result of the processing of entries was incredible - it has no intrinsic record analog sound, the sound is thick and clear with a strong bass, but without excessive compression.\n  \nThe overall impression is that the group recorded in the studio yesterday, not 40 years ago. This is the FLAC version of the album!","torrent":{"xt":"urn:btih:84f87b888ae171fe034343fb48c8b03efbc59713","amp;dn":"The+Beatles+-+Complete+Box+Set+%28Remastered+by+den0izer%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84f87b888ae171fe034343fb48c8b03efbc59713","infoHashBuffer":{"type":"Buffer","data":[132,248,123,136,138,225,113,254,3,67,67,251,72,200,176,62,251,197,151,19]},"announce":[],"urlList":[]}}