{"title":"Jeong-beom Lee - Yeolhyeol-nama aka Cruel Winter Blues (2006)","uid":5103763,"size":1620981816,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:853f702d9198e7e1f213fc59b54fde999a6c1100&amp;dn=Jeong-beom+Lee+-+Yeolhyeol-nama+aka+Cruel+Winter+Blues+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"lord_terabyte","files":-1,"time":1254207120,"description":"Jeong-beom Lee - Yeolhyeol-nama aka Cruel Winter Blues (2006)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0969367&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0969367&lt;/a&gt;\n\nJae-moon, an antisocial, cynical gangster reaching middle age, wants to kill a man. After losing his closest friend at the hands of a rival gangster named Dae-shik, his life loses much of its meaning, save for a stubborn desire to extract some revenge. Teaming up with a younger taekwondo expert who has turned to gang life to pay for his mother's hospital fees, Jae-moon heads down to Dae-shik's hometown, a rural village called Bulkyo, to wait for an opportunity to strike.\n\nBulkyo is a drab little town, especially in winter, but as Jae-moon settles in and establishes a stop-and-go friendship with a local hostess, he starts to be reminded of his own birthplace. Dae-shik doesn't show up for quite a while, but in the meantime Jae-moon starts to frequent a small restaurant run by Dae-shik's sharp-tongued mother. Hoping to glean some information on his target's whereabouts, he starts to spend more time with her, while she in turn starts to develop a fondness for this stranger who reminds her of her wayward son.\n\nCruel Winter Blues Director/screenwriter Lee Jeong-beom's debut feature, like the now-classic Korean melodrama Failan, drags us deep into the pysche of an emotionally shattered gangster in the hopes of uncovering a hint -- but perhaps only a hint -- of human warmth. In this sense, it's a work that relies more than anything on the performance of its lead actors. In this, the film has been fortunate.\n\nFans of Korean cinema will be well acquainted with Sul Kyoung-gu, who has gained a reputation as one of Korea's most talented actors in Lee Chang-dong's Peppermint Candy (2000) and Oasis (2002) as well as big-budget productions such as Public Enemy (2002), Silmido (2003), and Rikidozan (2004). Here his performance shows fewer of the emotional peaks and valleys of Choi Min-shik in Failan, and as viewers it takes us a long time to warm up to him, but he is always convincing and engaging to watch because of the realistic details he incorporates into the character.\n\nBut in a way the film's most important performance is that of Na Moon-hee as Dae-shik's mother. (Much of the screen time that passes before her appearance feels like wasted time, to be honest). Originally appearing mostly on TV, Na's first film role was in Kim Jee-woon's The Quiet Family (1998) and in recent years she has won praise for key supporting performances in Crying Fist (2005) and You Are My Sunshine (2005). A gifted actress, she is able to bring her characters alive without the slightest hint of artifice or exaggeration. Here, she projects a tough-as-nails exterior brought on by a life of hardship, but combines this with a subtly-expressed vulnerability that is seldom spoken in words.\n\nThe film itself is directed with an earthy appreciation for Korea's half-developed, concrete-filled countryside. The polar opposite of the bright colors and glossy cinematography that characterize most contemporary Korean films, Cruel Winter Blues adopts an aesthetic that many Koreans might associate with fermented bean paste (doenjang) -- a food that sometimes comes across as stinky and unappetizing, until one develops a taste for its salty charms.\n\nIf Cruel Winter Blues contains any optimism, it is not in a hope that the world will someday become a better place, or that people will learn from their mistakes and lead happier lives. Instead, we are led to take heart from the presence of an unexpressed humanity in places where we don't expect to find it. Some viewers may consider this scant comfort in a world where there is much that needs fixing, but there's an honesty about this film that gives even the smallest glint of hope an added force.  \n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/vlcsnap-2009-09-28-17h43m07s75.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/vlcsnap-2009-09-28-17h43m07s75.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/vlcsnap-2009-09-28-17h43m59s70.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/vlcsnap-2009-09-28-17h43m59s70.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/vlcsnap-2009-09-28-17h44m23s38.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/vlcsnap-2009-09-28-17h44m23s38.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/vlcsnap-2009-09-28-17h45m36s46.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/vlcsnap-2009-09-28-17h45m36s46.png&lt;/a&gt;\n\n~~~~~~ Yeolhyeol-nama.avi ~~~~~~                                     \n\n                                                               \n\nFile Size (in bytes):...........................1,612,142,592                     \n\n                                                                                \n\n--- Video Information ---                                                       \n\nVideo Codec Name:...............................XviD 1.1.2 Final              \n\nDuration (hh:mm:ss):............................1:57:09                \n\nFrame Count:....................................168519             \n\nFrame Width (pixels):...........................640                  \n\nFrame Height (pixels):..........................352                  \n\nAspect Ratio:...................................1.818                     \n\nFrames Per Second:..............................23.976          \n\nVideo Bitrate (kbps):...........................1633                 \n\n......MPEG-4......B-VOP........................                    \n\nQuality Factor (bits/pixel)/frame:..............0.302&quot;                     \n\n                                                                                \n\n--- Audio Information ---                                                       \n\nAudio Codec:....................................0x0055 MPEG-1 Layer 3                   \n\nAudio Sample Rate (Hz):.........................48000             \n\nAudio Bitrate(kbps):............................192                 \n\nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \n\nAudio Channel Count:............................2   \n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE \n","torrent":{"xt":"urn:btih:853f702d9198e7e1f213fc59b54fde999a6c1100","amp;dn":"Jeong-beom+Lee+-+Yeolhyeol-nama+aka+Cruel+Winter+Blues+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"853f702d9198e7e1f213fc59b54fde999a6c1100","infoHashBuffer":{"type":"Buffer","data":[133,63,112,45,145,152,231,225,242,19,252,89,181,79,222,153,154,108,17,0]},"announce":[],"urlList":[]}}