{"title":"Autograph 2010 (bengali)","uid":6180567,"size":722089754,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:85835d371b59e6bbea91df79f9f1ab52c780ceff&amp;dn=Autograph+2010+%28bengali%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rubel83","files":1,"time":1297937935,"description":"Many fans of Satyajit Ray would recoil in revulsion on hearing that someone is attempting to remake one of the grandmasters movies. Of course 'Autograph' is not a remake of the great 'Nayak' but rather a tribute to it. Having been curious to what a movie like 'Nayak' would look today, I was contented with the brief glimpses of it throughout the movie. The movie didn't attempt to remake the complexities of the Nayak but wanted to pinch on the nostalgia of Nayak lovers.\n\nProsenjit's rendition of Uttam Kumar's most appreciated role of Arun Chatterjee was portrayed with delicate restraint as he gently snares the audience with the bewitchery of a Superstar! Indraneil Sengupta also performed his role to a viewer's satisfaction though he did lack in consistency at points. Nandana Sen looked somewhat unsure at points but as her role wasn't as complex as the male leads, one can overlook this weakness.\n\nThe music of the movie stands out the most. Songs like Beche Thakar Gaan and Amake Amar Moto Thakte Dao are both well penned and placed in the movie.\n\nHaving missed the last three decades of Bengali movies, autograph presented me an excellent bridging opportunity to witness the recent development of Bangla Films. F","torrent":{"xt":"urn:btih:85835d371b59e6bbea91df79f9f1ab52c780ceff","amp;dn":"Autograph+2010+%28bengali%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85835d371b59e6bbea91df79f9f1ab52c780ceff","infoHashBuffer":{"type":"Buffer","data":[133,131,93,55,27,89,230,187,234,145,223,121,249,241,171,82,199,128,206,255]},"announce":[],"urlList":[]}}