{"title":"Written By (2009) DVDR-sailo1","uid":5091778,"size":4584376320,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:85e64a072d2b8e5a54bba3b45c5ad7c632b3a13a&amp;dn=Written+By+%282009%29+DVDR-sailo1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sailo","files":-1,"time":1253208361,"description":"iMDB Rating : 6.2/10 (43 votes)\n\n &lt;a href=&quot; http://www.imdb.com/title/tt1451620/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt1451620/&lt;/a&gt;\n\nTrailer : \n\n\nDVD Link : \n &lt;a href=&quot;\nhttp://www.yesasia.com/1020582671-0-0-0-en/info.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.yesasia.com/1020582671-0-0-0-en/info.html&lt;/a&gt;\n\nAudio : DD5.1 - Cantonese (1st track) , Mandarin\n\nSubs : Chinese, English (slow by 1/4 sec. after about 35 mins. into the movie, it is the retail sub from the dvdrip, the whole movie only has about 380 lines of full dialog.)\n\nNTSC, 16:9\n\n&quot; Helmed by Johnnie To's frequent writer and co-director Wai Ka Fai, fantasy drama Written By layers on different levels of fiction and reality by telling a story within a story within a story. Undoubtedly one of the most unique and worthwhile films of the year, Written By's clever narrative device unfolds a family's attempts to cope with loss by writing their own alternate realities. Award-winning actor Lau Ching Wan delivers a magnificently understated performance as a blind man desperate to hold on to his family, while Milkyway regular Kelly Lin (The Sparrow) plays his wife and Mia Yam (It's a Wonderful Life), his daughter whose writing writes the movie. Whimsical art direction and imaginative flights of fancy keep the meta film light on its feet as it sensitively explores themes of life, death, and loss through an emotionally gripping adventure of the mind.\n\nMelody (Mia Yam) lost her eyesight at a young age in a terrible car accident that also claimed the life of her father (Lau Ching Wan). Ten years later, Melody, her brother Oscar (Chung Ying Kit), and her grieving mother Mandy (Kelly Lin) still haven't let go of the past. To help her mother find closure, Melody begins to write a book in which the reality is reversed. In her story, her grieving father Tony is alive and blind while the rest of the family is dead, and he too begins to write a book in which his reality is reversed. Young Melody has become an afterlife messenger, and she brings Mandy and Oscar back to the world of the living to visit Tony. Her attempts to rewrite life and death, however, cause people, places, and times to cross over, and the overlapping stories begin to merge as the line between reality and fantasy blurs. &quot;","torrent":{"xt":"urn:btih:85e64a072d2b8e5a54bba3b45c5ad7c632b3a13a","amp;dn":"Written+By+%282009%29+DVDR-sailo1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85e64a072d2b8e5a54bba3b45c5ad7c632b3a13a","infoHashBuffer":{"type":"Buffer","data":[133,230,74,7,45,43,142,90,84,187,163,180,92,90,215,198,50,179,161,58]},"announce":[],"urlList":[]}}