{"title":"LMFAO - La La La","uid":5120777,"size":178321412,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8640416e628201bf3efd42416c5ce6175213f5cf&amp;dn=LMFAO+-+La+La+La&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1255339631,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;La La La&quot; is a song performed by American electro recording duo LMFAO. It was released as the second single from the album Party Rock and first sent to airplay on September 15, 2009.\n\nThe song was used in a dance performance choreographed by Napoleon and Tabitha D'umo during the 61st Primetime Emmy Awards featuring Karina Smirnoff and Maksim Chmerkovskiy from Dancing With The Stars; Joshua Allen, Katee Shean, and Mark Kanemura from So You Think You Can Dance, and Quest Crew from America's Best Dance Crew.\n\nThe song garnered average commercial outcomes for LMFAO in the U.S., compared to those of their previous single &quot;I'm in Miami Bitch.&quot; The song reached it's highest peak on the Billboard Hot 100, at number fifty-five.\n\nThe music video was released by Universal Music Group on August 20, 2009. The video starts with LMFAO playing a game on their computer called &quot;La La La Experience&quot;. They stare at pictures of American pop group Paradiso Girls, especially at group member Chelsea Korka. They take her picture and add it into the game. The music video then start the song with a different intro of 17 added intro. The video features a colorful neo-space theme that fits the songs lyrics off euphoria and love of a woman. The video also includes Jonna Mannion from The Real World: Cancun.\n\nLMFAO is an electro-hop group from the Los Angeles, California that consists of DJ/rappers Redfoo and Sky Blu, who were made famous by repeating single word lyrics. The group's name comes from an internet conversation that Sky Blu had with his grandmother. LMFAO is currently signed to Interscope Records. They have a single titled &quot;I'm in Miami Bitch&quot; (alternate title &quot;I'm In Miami Trick&quot;) which peaked at #51 on the Billboard Hot 100.. On July 1, 2008, LMFAO released Party Rock EP on the iTunes music store. Their full album Party Rock was released on July 7, 2009, containing 15 tracks, only 5 of which were unheard. They have recently produced a single for Pitbull entitled &quot;Back to the Future&quot;, which samples Fergie's verse from &quot;Boom Boom Pow&quot; as the hook. Their second single, &quot;La La La&quot; debuted at #61 on the Billboard 100.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8640416e628201bf3efd42416c5ce6175213f5cf","amp;dn":"LMFAO+-+La+La+La","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8640416e628201bf3efd42416c5ce6175213f5cf","infoHashBuffer":{"type":"Buffer","data":[134,64,65,110,98,130,1,191,62,253,66,65,108,92,230,23,82,19,245,207]},"announce":[],"urlList":[]}}