{"title":"David Guetta - One Love (Remixes) CDRip 2009 [Cov+CD][Bubanee]","uid":5169989,"size":131182532,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8686333072142607b48803fd7dcb13be96dd5086&amp;dn=David+Guetta+-+One+Love+%28Remixes%29+CDRip+2009+%5BCov%2BCD%5D%5BBubanee%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bubanee","files":22,"time":1258592141,"description":"This is CD2 of the One Love Deluxe Edition..\n\nIn this CDRip i have provided the Deluxe Covers and CD JPegs [Pictures]\nAlong with EAC Log/Cue File and M3U Playlist.\nPlease SEED for others to Enjoy!\nCheers, Bubanee\n\nDavid Guetta (born 6:37 p.m. On the 7 November 1967 in Paris) is a French DJ. In 2005, his single &quot;The World Is Mine&quot;, which contains a sample of Simple Minds &quot;Someone Somewhere In Summertime&quot;, topped European dance charts.[citation needed] The vocals for his songs are performed by a variety of artists including Chris Willis, Cozi Costi, Kelly Rowland, Akon, and will.i.am. In 2009, Guetta produced the Black Eyed Peas song I Gotta Feeling For their album The E.N.D. A remix Of the song is also included on his most recent album One Love. He Also remixed another single from the album, Boom Boom Pow for the single of I Gotta Feeling Titled Boom Boom Guetta. In 2008, he was elected as World DJ No. 5 and best house DJ by the British DJ Mag.\nHe has also been playing in many countries around the world to promote his 2007 album Pop Life. He played in Mauritius on the 12th of January 2008 accompanied by French rapper JoeyStarr of the French rap group NTM. In the same year, he and his wife Cathy also planned a new event which took place in the Stade de France on 5 July 2008. He performed with TiÃƒÂ«sto, Carl Cox, Joachim Garraud and Martin Solveig in front of 40,000 spectators.\n\n1. \t&quot;When Love Takes Over (Electro Extended Version)&quot; (featuring Kelly Rowland) \tKelly Rowland, Miriam Nervo, Olivia Nervo, Fred Rister \t4:24\n2. \t&quot;Sexy Bitch (Club Version Mixee)&quot; (featuring Akon) \t  \t3:43\n3. \t&quot;Memories (Version Mixee)&quot; (featuring Kid Cudi) \t  \t4:42\n4. \t&quot;I Wanna Go Crazy (Extended Version Mixee)&quot; (featuring will.i.am) \tDavid Guetta, Jean Claude Sindres, Sandy Vee \t4:55\n5. \t&quot;I Gotta Feeling (FMIF Remix Edit Version Mixee)&quot;   \tWilliam Adams, Allen Pineda, Jaime Gomez, Stacy Ferguson, David Guetta \t4:19\n6. \t&quot;Choose (Version Mixee)&quot; (featuring Ne-Yo &amp; Kelly Rowland) \t  \t3:17\n7. \t&quot;On the Dancefloor (Extended Version Mixee)&quot; (featuring will.i.am &amp; apl.de.ap) \t  \t4:16\n8. \t&quot;Missing You (Club New Version Mixee)&quot; (featuring Novel) \t  \t4:59\n9. \t&quot;Gettin' Over (Club Version Mixee)&quot; (featuring Chris Willis) \t  \t3:31\n10. \t&quot;It's the Way You Love Me (Final Version Mixee)&quot; (featuring Kelly Rowland) \t  \t4:12\n11. \t&quot;One Love (Extended Version Mixee)&quot; (featuring Estelle) \t  \t4:42\n12. \t&quot;It's Your Life (Version Mixee)&quot; (featuring Chris Willis) \t  \t3:53\n13. \t&quot;Sound of Letting Go (Version Mixee)&quot; (featuring Chris Willis) \t  \t3:13\n14. \t&quot;I Need You Now (Version Mixee)&quot; (featuring Samantha Jade) \t  \t3:14\n15. \t&quot;How Soon Is Now (Version Mixee)&quot; (featuring Sebastian Ingrosso, Dirty South &amp; Julie McKnight) \t  \t5:59\n16. \t&quot;Toyfriend (Version Mixee)&quot; (featuring Wynter Gordon) \t  \t2:52","torrent":{"xt":"urn:btih:8686333072142607b48803fd7dcb13be96dd5086","amp;dn":"David+Guetta+-+One+Love+%28Remixes%29+CDRip+2009+%5BCov%2BCD%5D%5BBubanee%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8686333072142607b48803fd7dcb13be96dd5086","infoHashBuffer":{"type":"Buffer","data":[134,134,51,48,114,20,38,7,180,136,3,253,125,203,19,190,150,221,80,134]},"announce":[],"urlList":[]}}