{"title":"Coast to Coast AM - Oct 24 2009 - Philosophy &amp; Mortality","uid":5135895,"size":56553249,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:88bdc81879cf74e21d955ba245952533b4f1a6c0&amp;dn=Coast+to+Coast+AM+-+Oct+24+2009+-+Philosophy+%26+Mortality&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"0vercast","files":-1,"time":1256478534,"description":"Philosophy &amp; Mortality\n\nDate: 10-24-09\nHost: Ian Punnett\nGuests: Thomas Cathcart, Daniel Klein, Richard Bach\n\nIan Punnett welcomed authors Tom Cathcart and Daniel Klein for a conversation about the varying philosophical points of view regarding mortality as well as how humor allows us to express our fears about death. &quot;We tell jokes about it to relieve the anxiety,&quot; Klein said of the duo's propensity for death-related humor. He explained that this style is contrary to some classic philosophers, who espouse the idea that &quot;you have to face your mortality straight in the face, otherwise you won't realize the glory of life.&quot; Supporting this lighthearted perspective, Klein said that, when he considers the daunting finality of death, he &quot;needs to tell a joke.&quot;\n\nIn discussing the various philosophical perspectives on mortality, Cathcart noted the musings of Arthur Schopenhauer, who &quot;thought you should be indifferent to death.&quot; According to this point of view, the indifference would, in turn, alleviate anxieties about dying. However, Cathcart also noted the work of philosopher Ernest Becker who observed that much of the constructs of civilization, such as religion and nationality, are based upon this anxiety about death. On where such philosophical thought is heading today, Cathcart lamented that contemporary philosophy has gotten very technical, focusing on &quot;the meaning of meaning rather than the meaning of life.&quot;\n\nThe pair also addressed the philosophical debate over the pros and cons of immortality. Cathcart pointed out that one prevalent point of view, amongst philosophers, is that &quot;immortality would be the worst possible news.&quot; According to him, this perspective is based on the idea that having a truly fulfilled life is predicated upon knowing that your lifetime is limited, otherwise one would fall into a pattern of &quot;everydayness.&quot; Looking at the contrasting side of the debate, Klein opined that &quot;my feeling is that sometimes I'd rather be a couch potato for eternity than live this time-limited life with full intensity.&quot; Acknowledging that this perspective may make him &quot;sort of a moral and spiritual coward,&quot; he justified by exclaiming, &quot;but I don't want to die!&quot;\n\nThe Power of Suggestion\n\nDuring the 1st hour, bestselling author Richard Bach talked about his latest book Hypnotizing Maria, an exploration of the nature of reality and the power of suggestion. He detailed how the book examines the idea that hypnosis, as we know it, is merely suggestion and, in turn, the populace is being hypnotized on a regular basis as they are bombarded with a litany of suggestions. Rather than dwell on the negative aspects behind that idea, Bach stressed that, upon realization of this state, people can dehypnotize themselves and improve their lives by accepting different, and more positive, suggestions.\n\nWebsite(s):\nplatoandaplatypus.com\n\nBook(s):\nAristotle and an Aardvark Go to Washington\nPlato and a Platypus Walk into a Bar: Understanding Philosophy Through Jokes\nHeidegger and a Hippo Walk Through Those Pearly Gates\nHypnotizing Maria\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:88bdc81879cf74e21d955ba245952533b4f1a6c0","amp;dn":"Coast+to+Coast+AM+-+Oct+24+2009+-+Philosophy+%26+Mortality","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88bdc81879cf74e21d955ba245952533b4f1a6c0","infoHashBuffer":{"type":"Buffer","data":[136,189,200,24,121,207,116,226,29,149,91,162,69,149,37,51,180,241,166,192]},"announce":[],"urlList":[]}}