{"title":"Ozzy Osbourne - Ozzman Cometh (2002) 320 vtwin88cube","uid":6150753,"size":184363715,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:890bbbdddd377fa2e999618fe24bcc1b69869e61&amp;dn=Ozzy+Osbourne+-+Ozzman+Cometh+%282002%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1296870128,"description":"Ozzy Osbourne\nOzzman Cometh (2002)\n\nThough many bands have succeeded in earning the hatred of parents and media worldwide throughout the past few decades, arguably only such acts as Alice Cooper, Judas Priest, and Marilyn Manson have tied the controversial record of Ozzy Osbourne. The former Black Sabbath frontman has been highly criticized over his career, mostly due to rumors denouncing him as a psychopath and Satanist. Despite his reputation, no one could deny that Osbourne has had an immeasurable effect on heavy metal. While he doesn't possess a great voice, he makes up for it with his good ear and dramatic flair. As a showman, his instincts are nearly as impeccable; his live shows have been overwrought spectacles of gore and glitz that have endeared him to adolescents around the world. Indeed, Osbourne has managed to establish himself as an international superstar, capable of selling millions of records with each album and packing arenas across the globe, capturing new fans with each record.\n\nJohn Michael Osbourne began his professional career in the late '60s, when he teamed up with guitarist Tony Iommi, bassist Geezer Butler, and drummer Bill Ward to form Black Sabbath. The band, made unique by their slow, gloomy melodies and themes, released their self-titled album in 1970 and went on to release classic platinum records such as Paranoid and Master of Reality throughout the rest of the decade. After the 1978 album Never Say Die, Osbourne was fired from Black Sabbath, which led him to form his own solo project. With his new manager and wife, Sharon, Osbourne formed his own band, the Blizzard of Ozz, with guitarist Randy Rhoads, bassist Bob Daisley, and drummer Lee Kerslake. The group's self-titled first album was released in September 1980 in the U.K. and early 1981 in the U.S. Blizzard of Ozz had some of the same ingredients of Black Sabbath: the lyrics focused on the occult and the guitars were loud and heavy, yet the band was more technically proficient and capable of pulling off variations on standard metal formulas. Featuring the hit singles &quot;Crazy Train&quot; and &quot;Mr. Crowley,&quot; Blizzard of Ozz reached number seven on the U.K. charts; it peaked at number 21 in the U.S., continuing to sell for over two years and becoming a huge success. Kerslake and Daisley were replaced with Tommy Aldridge and Rudy Sarzo shortly before the subsequent November release of Diary of a Madman. This album, which included the drug ode &quot;Flying High Again,&quot; charted at number 16 in the U.S. and became another huge seller. As the Diary tour went underway, sales for the album continued to improve as those of Black Sabbath waned.\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nGenre:\t\t\tMetal\t\t\nM3U Playlist:\t\tYes\n\n01.Black Sabbath (Basement Tape)\n02.War Pigs (Basement Tape)\n03.Goodbye To Romance\n04.Crazy Train\n05.Mr. Crowley\n06.Over The Mountain\n07.Paranoid (Live)\n08.Bark At The Moon\n09.Miracle Man\n10.Crazy Babies\n11.No More Tears (Edit)\n12.Mama, I'm Coming Home\n13.I Don't Want To Change The World (Live)\n14.I Just Want You\n15.Back On Earth\n\n\nCheers!","torrent":{"xt":"urn:btih:890bbbdddd377fa2e999618fe24bcc1b69869e61","amp;dn":"Ozzy+Osbourne+-+Ozzman+Cometh+%282002%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"890bbbdddd377fa2e999618fe24bcc1b69869e61","infoHashBuffer":{"type":"Buffer","data":[137,11,187,221,221,55,127,162,233,153,97,143,226,75,204,27,105,134,158,97]},"announce":[],"urlList":[]}}