{"title":"Terminator.Salvation.2009-ViTALiTY","uid":6283532,"size":6570447093,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:899034655f34fcac2fba437933e9a919561c9c39&amp;dn=Terminator.Salvation.2009-ViTALiTY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"RealSB","files":68,"time":1301530452,"description":"\nTerminator.Salvation.2009-ViTALiTY\n\nSCENE RELEASE: 2009-05-28 11:32:03\n\n\nTerminator Salvation players take the near-futuristic, shoot-'em-up role of John Connor, who will become humanity's greatest leader in its time of deepest despair. Released to retail alongside the theatrical debut of the feature film in May of 2009, the game is set two years before the movie, in the year 2016, just after the SkyNet cyber-entity has launched nuclear missiles and committed Judgment Day. The enemy is an army of relentless, overpowered robots from the established Terminator franchise. Available weapons include shotguns, machine guns, mounted weapons, and rocket launchers. Players are regularly challenged to assess dangerous areas for the best path of advance or assault, making use of cover and high-ground advantages where possible. Cover can be temporary, as destructible environments make for dynamic battlefields under heavy fire. Other sequences put players at the controls of armored vehicles. A local co-op mode lets players face the fight of the future with a friend. The game's John Connor is not based on Christian Bale's portrayal in the film, but actors Common and Moon Bloodgood lend their voices and likenesses as the game's Barnes and Blair Williams.\n\n\nFeatures:\n\n    High-definition third-person shooting through an apocalyptic future ruled by machines\n    Take the role of John Connor in the aftermath of Judgment Day, two years before the film\n    Take cover in the destructible environments of dynamic battlefields under heavy fire\n    Featuring voice-acting by Common, Moon Bloodgood, and Rose McGowan as Angie Salter\n\n\nSystem Requirements:\n\nWindows XP\n\nMINIMUM:\n\nIntel Pentium Dual CPU E2180 or AMD Athlon X2 Dual Core 4200+ 2GHz Processor\n1024MB RAM\n8GB Hard Disk Space\nDirectX 9.0c\n256MB Nvidia Series 86xx/Radeon 38xx Video Card\nDirectX 9.0c Compatible Sound Card\nDVD-ROM Drive\n\nRECOMMENDED:\n\nIntel Pentium D CPU or AMD Athlon 64 X2 Dual Core 6000+ 2.8GHz Processor\n2048GB RAM\n8GB Hard Disk Space\nDirectX 9.0c\nGeForce 8xxx/ATI Video Card\nEAX Compatible Sound Card\nDVD-ROM Drive\n\n\n          EnJoY iT ! :)","torrent":{"xt":"urn:btih:899034655f34fcac2fba437933e9a919561c9c39","amp;dn":"Terminator.Salvation.2009-ViTALiTY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"899034655f34fcac2fba437933e9a919561c9c39","infoHashBuffer":{"type":"Buffer","data":[137,144,52,101,95,52,252,172,47,186,67,121,51,233,169,25,86,28,156,57]},"announce":[],"urlList":[]}}