{"title":"Fernandez-Checkmate(Catholic orders as wolves in sheeps clothing","uid":4990121,"size":543948,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89b27dc759fb4e6a66e13333c0090823cdafb727&amp;dn=Fernandez-Checkmate%28Catholic+orders+as+wolves+in+sheeps+clothing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"red_gonzo","files":1,"time":1246993713,"description":"This is Daniel R. Fernandez' shocking book Checkmate (1985) which uncovers Catholic priestly orders as &quot;wolves in sheeps clothing&quot; who are using very &quot;legal and honest&quot; methods and institutions in order to acheive their evil goals. What is your role in the game? This is what the author asked himself when he embarked on a journey of research into the various Catholic orders that have their priests spread all over the world. What he discovered would remind him of a finishing move in chess, namely checkmate. But for whom? The tale might first surprise you, but as you become engrossed in the course of reading these facts, you will be able to clearly see and understand the great move of checkmate. Maybe it has never crossed your mind that the powerful mechanism, skillfully conceived, prepared and directed, will be what will put the false prophet in the Papal Seat. This mechanism which has been functioning for some time now, becomes stronger each day in the control and management of social-economic, military-politic and religious affairs, so that when the time is ripe, the Biblical figure of the new Babylon, which is nothing else but the conversion of these powers under the direction of one man and the word of God will be fulfilled. This has taken years of hard and constant work, but the end can already be seen. Many people could never imagine that their life is part of a game, much less a game of chess. Find out who the players are and what they are up to. 60 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:89b27dc759fb4e6a66e13333c0090823cdafb727","amp;dn":"Fernandez-Checkmate%28Catholic+orders+as+wolves+in+sheeps+clothing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89b27dc759fb4e6a66e13333c0090823cdafb727","infoHashBuffer":{"type":"Buffer","data":[137,178,125,199,89,251,78,106,102,225,51,51,192,9,8,35,205,175,183,39]},"announce":[],"urlList":[]}}