{"title":"A Century of War","uid":6291307,"size":1077815,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89d18266997aec4a8e0117f766e971899093357d&amp;dn=A+Century+of+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lionzbay","files":1,"time":1301822898,"description":"Author(s): John V. Denson\nPublisher: Ludwig Von Mises Institute\nDate: 2006-06-16\nFormat: PDF\nLanguage: Other\nISBN10: 1933550066\nPages: 207\nQuality: Good\nISBN13: 9781933550060\n\nJohn Denson, in a book that covers the history of America's large wars from 1860 through the Cold War, describes the twentieth century was the bloodiest in all history not coincidentally a century of statism.\n\nMore than 170 million people were killed by governments with 10 million having been killed in World War I and 50 million killed in World II. Of the 50 million killed in World War II, nearly 70 percent were innocent civilians, many as a result of the bombing of cities by Great Britain and America.\n\nThe horror of the twentieth century could hardly have been predicted in the nineteenth century, which saw the eighteenth century end with the American Revolution bringing about the creation of the first classical liberal government in the world. What bought it about? How can it be prevented in the future? These are the concerns that animate this work.\n\nDenson recounts how the wars that destroyed American liberty came about through a series of deceitful political ploys. He discusses how Lincoln worked to provoke the South into firing the first shot, and how he used that shot as the pretext for total war. Wilson learned from this experience in working to get the US involved in World War I, which established a precedent for the planning state. FDR similarly engaged in political maneuvering to prepare a reluctant public for war.\n\nDenson provides a close examination of the rise of executive dictatorship, and demonstrates how far from the founders' vision of government we have come. It explains how world peace can only come through the practice of free trade and free markets, and why large government can only create conflict both domestic and international.\n\nThe Denson book is a wonderful presentation of a position that was more mainstream in the 1930s and the 1990s: the unity of libertarian economics with a pro-peace foreign policy position. This position is far too rare in American life. This eye-opening treatment of history will go a long way toward restoring this proper libertarian perspective in American life. ","torrent":{"xt":"urn:btih:89d18266997aec4a8e0117f766e971899093357d","amp;dn":"A+Century+of+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89d18266997aec4a8e0117f766e971899093357d","infoHashBuffer":{"type":"Buffer","data":[137,209,130,102,153,122,236,74,142,1,23,247,102,233,113,137,144,147,53,125]},"announce":[],"urlList":[]}}