{"title":"Black Sabbath - Discography @(320)","uid":5033696,"size":2768842209,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:89eca0b635eb73875e00cf2f912e95258fd2f687&amp;dn=Black+Sabbath+-+Discography+%40%28320%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rustyjerk","files":420,"time":1249012478,"description":"Black Sabbath - Discography @(320)\nArtist...............: Black Sabbath\nAlbum................: Discography\nGenre................: Metal\nSource...............: 23 Alblums / 24 CDs\nYear.................: 1970-2007\nRipper...............: Exact Audio Copy (Secure mode)\nCodec................: LAME 3.96\nVersion..............: MPEG 1 Layer III\nQuality..............: Insane, (avg. bitrate: 320kbps)\nChannels.............: Stereo / 44100 hz\nTags.................: , ID3 v2.3\nInformation..........: Redacted\n\nRipped by............: SmurfCo on 5/3/2009\nPosted by............: gc1966 on 5/3/2009\nNews Server..........: Redacted\nNews Group(s)........: Redacted\n\nIncluded.............: NFO, PLS, M3U, SFV, Lyrics\nCovers...............: Front Back CD Inside\nTracklisting\n01. [1970] Black Sabbath - Black Sabbath\n02. [1970] Black Sabbath - Paranoid\n03. [1971] Black Sabbath - Master Of Reality\n04. [1972] Black Sabbath - Vol. 4\n05. [1973] Black Sabbath - Sabbath Bloody Sabbath\n06. [1975] Black Sabbath - Sabotage\n07. [1976] Black Sabbath - Technical Ecstasy\n08. [1978] Black Sabbath - Never Say Die!\n09. [1980] Black Sabbath - Heaven And Hell\n10. [1980] Black Sabbath - Live At Last\n11. [1981] Black Sabbath - Mob Rules\n12. [1982] Black Sabbath - Live Evil\n13. [1983] Black Sabbath - Born Again\n14. [1986] Black Sabbath - Seventh Star\n15. [1987] Black Sabbath - The Eternal Idol\n16. [1989] Black Sabbath - Headless Cross\n17. [1990] Black Sabbath - Feels Good To Me (Single)\n18. [1990] Black Sabbath - Tyr\n19. [1992] Black Sabbath - Dehumanizer\n20. [1994] Black Sabbath - Cross Purposes\n21. [1995] Black Sabbath - Cross Purposes Live\n22. [1995] Black Sabbath - Forbidden\n23. [2007] Black Sabbath - Live At Hammersmith Odeon\n\nTotal Size...........: 2.57 GB\n\nNFO generated on.....: 5/3/2009 7:37:29 AM Biography\n\nMixing equal parts bone-crushing volume, catatonic tempos, and ominous\npronouncements of gloom and doom delivered in Ozzy Osbournes keening\nvoice, Black Sabbath was the heavy-metal king of the 1970s. Often despised\nby mainstream rock critics and ignored by radio programmers, the group still\nmanaged to sell over 8 million albums before Osbourne departed for a solo\ncareer in 1979. The bands original lineup reunited for a two-year tour in\n1997.\n\nThe four original members, schoolmates from a working-class district of\nindustrial Birmingham, England first joined forces as the Polka Tulk Blues\nCompany, a blues band. They quickly changed their name to Earth, then, in\n1969, to Black Sabbath; the name came from the title of a song written by\nbassist Geezer Butler, a fan of occult novelist Dennis Wheatley. It may also\nhave been an homage to a Boris Karloff film. The quartets eponymously titled\n1970 debut, recorded in two days, went to Number Eight in England and\nNumber 23 in the U.S. A single, Paranoid, released in advance of the album\nof the same name, reached Number 4 in the U.K. later that year; it was the\ngroups only Top 20 hit.\n\nThe single didnt make the U.S. Top 40, but Paranoid, issued in early 1971,\nsold four million copies with virtually no radio airplay. Beginning in December\n1970 Sabbath toured the States relentlessly. Despite the band members\nintense drug and alcohol abuse, the constant road work paid off, and by\n1974 Black Sabbath was considered peerless among heavy-metal acts, its\nfirst five LPs all having sold at least a million copies apiece in America alone.\n\nIn spite of their name, the crosses erected onstage, and songs dealing with\napocalypse, death, and destruction, the band members insisted their interest\nin the black arts was nothing more than innocuous curiosity (the sort that led\nOzzy Osbourne to sit through eight showings of The Exorcist), and in time\nBlack Sabbaths princes-of-darkness image faded. Eventually, so did its\nrecord sales. Aside from a platinum best-of, We Sold Our Soul for Rock n Roll\n(1976), not one of three LPs from 1975 to 1978 went gold. Osbourne, racked\nby drug use and excessive drinking, quit the band briefly in late 1977 (ex\nSavoy Brown and Fleetwood Mac vocalist Dave Walker filled his shoes for\nsome live dates). In January 1979 he was fired. Ronnie James Dio, formerly\nof Ritchie Blackmores Rainbow, replaced Osbourne.\n\nAlthough Dio could belt with the best of them, Sabbath would never be the\nsame. Its first album with Dio, Heaven and Hell (1980), went platinum; its\nsecond, Mob Rules (1981), gold. But thereafter, the groups LPs sold fewer\nand fewer copies, as Black Sabbath went through one personnel change\nafter another. Ill health forced Bill Ward out of the band in 1980; Carmine\nAppices brother Vinnie took his place. Friction between Iommi and Dio led the\nsinger to quit angrily in 1982; he took Appice with him to start his own band,\nDio. Vocalists over the years have included Dave Donato; Deep Purple singer\nIan Gillan; Glenn Hughes, another ex-member of Purple; Tony Martin; and Dio\nagain.\n\nBy 1986s Seventh Star, only Iommi remained from the original lineup. He had\nto wince when Geezer Butler teamed up with the phenomenally successful\nOsbourne in 1988, though the bassist did return to the fold three years later.\nDespite bitterness expressed in the press between Osbourne and Iommi, the\noriginal foursome reunited in 1985 at the Live Aid concert in Philadelphia, and\nagain in 1992, at the end of what was supposedly Osbournes last tour.\nThroughout 1993 word had it that Osbourne, Iommi, Butler, and Ward would\ntour, but by years end Osbourne had backed out, allegedly over money. The\nindefatigable Tony Iommi went right back to work with Butler, rehiring vocalist\nTony Martin and adding former Rainbow drummer Rob Rondinelli. That lineup\nproved as unstable as the previous one, with drummers coming, going, and\nreturning over the following years. Despite hiring Body Counts Ernie C to\nproduce 1995s Forbidden (and inviting guest vocalist Ice-T to sing on a\ntrack), Black Sabbath seemed increasingly out of touch with the times, and at\nthe end of the Forbidden Tour, the band unofficially went on hiatus.\n\nBut not for long, as Iommi, Butler, and Osbourne reunited to headline 1997s\nOzzfest. Ward was not invited (he was replaced by Faith No Mores Mike\nBordin), but he did participate in two shows in the bands hometown of\nBirmingham, England, in December 1997. The resulting live album, Reunion\n(Number 11, 1998), also featured two new studio tracks, including the single\nPsycho Man. The album went platinum in the U.S., and the live version of\nIron Man earned the band its first Grammy for Best Metal Performance\nnearly 30 years after the song was originally released. The ensuing tour\nlasted two years and ended in December 1999. Tony Iommi released his first\nsolo album in 2000; a prestigious roster of guest singers (Osbourne, Billy\nCorgan, Henry Rollins, Dave Grohl) handled the vocals. Among metalheads,\nIommi is something of a guitar god, due in part to the fact that he plays\nspectacularly despite having lost the tips of two right fingers in a welding\naccident at age 17. His hero was the great jazz guitarist Django Reinhardt,\nwho also lost two fingers and yet continued to play. In mid-2001 it was\nannounced that all original members were writing material for a new Black\nSabbath album.\n\nIn mid-2001 it was announced that all four original members were writing\nmaterial for a new Black Sabbath album to be produced by Rick Rubin. The\nband scrapped all the material and the album never materialized, although\nSabbath performed one new song, Scary Dreams, on that years Ozzfest.\nThe band was put on hold throughout 2002 as Osbourne refocused on his\nsolo music and new MTV reality show, The Osbournes, in which his family was\nportrayed as a sort of real-life Munsters. The band came back together for\nthe 2004 and 2005 Ozzfest tours. In 2005, Black Sabbath was inducted into\nthe UK Music Hall of Fame, and the following year, after many years of\neligibility, the band made it into the US Rock and Roll Hall of Fame. In 2007,\nIommi and Butler reunited with Appice and Dio to record new material for the\ncompilation Black Sabbath: The Dio Years (Number 54); that configuration of\nthe group toured as Heaven and Hell (to avoid being confused with the\nOsbourne-fronted Black Sabbath) into the year 2008. A new Heaven and Hell\nalbum is slated for 2009. ","torrent":{"xt":"urn:btih:89eca0b635eb73875e00cf2f912e95258fd2f687","amp;dn":"Black+Sabbath+-+Discography+%40%28320%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89eca0b635eb73875e00cf2f912e95258fd2f687","infoHashBuffer":{"type":"Buffer","data":[137,236,160,182,53,235,115,135,94,0,207,47,145,46,149,37,143,210,246,135]},"announce":[],"urlList":[]}}