{"title":"Hell in the Pacific [en,ru]","uid":5068719,"size":835570174,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8a2328676ba9451b3be60bb2cc97cca9011a9980&amp;dn=Hell+in+the+Pacific+%5Ben%2Cru%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"s05122004","files":4,"time":1251224046,"description":"Two men, one American and one Japanese, are marooned on an uninhabited Pacific island. In order to survive they must accept their differences and work together, despite their two countries being at war.\n\nContaining little dialogue, this film is not dubbed or sub-titled, thus authentically portraying the frustration of restricted communication between the two characters. The film was entirely shot in the Rock Islands of Palau in the north Pacific Ocean, near the Philippines in the Philippine Sea.\n\nThe film was originally released with a rather abrupt ending, one that left many dissatisfied with the outcome of the struggle these men endured. The subsequent DVD release has an alternative ending, which while leaving the eventual destiny of the two ambiguous, was much more in line with the overall direction of the movie.\n\nMarvin and Mifune are the only two actors in the entire film. Both actors had real-life World War II combat experience: Marvin served with the US Marines in the Pacific, where he was wounded and received the Purple Heart; meanwhile Mifune served in the Imperial Japanese Air Force.","torrent":{"xt":"urn:btih:8a2328676ba9451b3be60bb2cc97cca9011a9980","amp;dn":"Hell+in+the+Pacific+%5Ben%2Cru%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a2328676ba9451b3be60bb2cc97cca9011a9980","infoHashBuffer":{"type":"Buffer","data":[138,35,40,103,107,169,69,27,59,230,11,178,204,151,204,169,1,26,153,128]},"announce":[],"urlList":[]}}