{"title":"Angel and the Ape","uid":5175977,"size":362786650,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8a9b21afbaf7f9aed42422bbed9409eaf377a124&amp;dn=Angel+and+the+Ape&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1258936685,"description":"Angel and the Ape was a humour comic book created by E. Nelson Bridwell and published by DC Comics. The characters first appeared in 1968 in Showcase #77 then graduated to their own title, with art by comic artist Bob Oksner, most often inked by Wally Wood. The title lasted for seven issues, changing its name to Meet Angel for its final appearance.\n\nAngel O'Day is a private investigator who manages the O'Day and Simeon Detective Agency with her partner, Sam Simeon. Sam differs from many stereotypical detectives; besides helping Angel, Sam is both a comic book artist and a talking gorilla.\n\nThe series has been revived twice. The first was by Phil Foglio in the 1990s, where Angel and the Ape stuck true to its zany roots. In Phil Foglio's 1991 mini-series, Angel is revealed to be the half sister of Dumb Bunny, a member of the super-heroic group the Inferior Five, also created by Bridwell. Sam is changed, too; he is not only employed by &quot;DZ Comics&quot; as an artist, but is also the grandson of Gorilla Grodd, a nemesis of The Flash. \n\nA second attempt at a revival was made in early 2001 under DC's Vertigo imprint, with a vastly different take. It was written by Howard Chaykin and David Tischman, with art by Philip Bond.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:8a9b21afbaf7f9aed42422bbed9409eaf377a124","amp;dn":"Angel+and+the+Ape","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a9b21afbaf7f9aed42422bbed9409eaf377a124","infoHashBuffer":{"type":"Buffer","data":[138,155,33,175,186,247,249,174,212,36,34,187,237,148,9,234,243,119,161,36]},"announce":[],"urlList":[]}}