{"title":"Ally McBeal Stagione 4 Completa - Tutti i Torrent [SATrip ITA] T","uid":6210998,"size":512774,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8ade2ff41170330e77db7892cc432f18029e3f5f&amp;dn=Ally+McBeal+Stagione+4+Completa+-+Tutti+i+Torrent+%5BSATrip+ITA%5D+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"l.diliberto","files":4,"time":1298985801,"description":"Ally McBeal Stagione 4 Completa - Tutti i Torrent [SATrip ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=242145&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=242145&lt;/a&gt;\n\n.: Trama :.\n\nAlly McBeal ÃƒÂ¨ stata una popolare serie televisiva statunitense trasmessa negli USA dal 1997 al 2002. La sit-com narra di una giovane avvocatessa in carriera, Ally McBeal (interpretata da Calista Flockhart), che opera nello studio legale di Cage &amp; Fish di Boston: all'interno di questo contesto, parallelamente alla sua attivitÃƒÂ  in tribunale, si sviluppano intrecci amorosi e rivalitÃƒÂ  che interesseranno la vita di Ally fino all'ultima stagione.\n\nAlly McBeal ÃƒÂ¨ una giovane avvocatessa neo-laureata che, nell'episodio pilota, viene assunta dall'ex-compagno di universitÃƒÂ  Richard Fish nello studio legale di cui egli ÃƒÂ¨ da poco diventato dirigente. Una volta ingaggiata dalla Cage &amp; Fish, Ally comincia a destreggiarsi in un contesto reso acceso da rivalitÃƒÂ  e frustrazioni. Perennemente alla ricerca di un fidanzato &quot;perfetto&quot;, nel corso delle stagioni si trova spesso trascinata dagli strani eventi della giornata.\n\nCaratterizzato da un'insolita frustrazione derivante dall'accumulo di fallimenti in amore e dallo stress lavorativo, il personaggio Ally McBeal viene presto indicato dai mass-media come il nuovo simbolo del mondo delle donne in carriera, che non riescono a conciliare vita privata e lavoro [1].\n\nIl fatto che tutto ciÃƒÂ² che passava per la testa di Ally fosse mostrato sullo schermo (i suoi stessi pensieri sono espressi ad alta voce) e la comicitÃƒÂ  non-sense hanno contribuito in modo determinante alla popolaritÃƒÂ  della serie.\n\nCiononostante nel corso delle stagioni la serie perse smalto per la scarsa originalitÃƒÂ  della trama e ripetitivitÃƒÂ  di alcune situazioni e non fu risollevata neanche da importanti novitÃƒÂ  del cast: si optÃƒÂ² pertanto per la chiusura anticipata della stessa.\n\nNegli Stati Uniti Ally McBeal ha riscosso un grandissimo successo, tuttavia dalla quarta serie gli ascolti iniziarono a calare notevolmente. Questo probabilmente derivÃƒÂ² dal disorientamento che il continuo cambio di cast poteva aver causato nel pubblico. Molti dei personaggi cardine della serie uscirono di scena, alcuni secondo la sceneggiatura, altri per scelta personale, altri ancora per dissapori con la produzione; cosÃƒÂ¬ dopo la morte di Billy, Georgia diventa un personaggio sempre piÃƒÂ¹ marginale che sparirÃƒÂ  completamente; anche Lisa Nicole Carson e Lucy Liu abbandoneranno il telefilm.\n\nInvece il personaggio di Larry dovette fare i conti con la &quot;vera&quot; giustizia: Robert Downey Jr. venne infatti arrestato per droga durante la realizzazione della serie, costringendo gli sceneggiatori a riscriverne la storia.\n\nLa loro sostituzione con altri personaggi piÃƒÂ¹ o meno riusciti non convinse il pubblico e, per non subire un flop, la produzione si trovÃƒÂ² costretta a chiudere la serie prematuramente, con un finale volutamente forzato.\n\nAlly, per risolvere l'esaurimento nervoso della figlia, sarÃƒÂ  costretta a trasferirsi, trovandosi improvvisamente ad abbandonare il suo lavoro e gli amici. L'ultimo episodio di fatto consiste nei suoi saluti agli altri personaggi e termina con Ally in lacrime che si allontana a piedi, mentre alle sue spalle i suoi amici la guardano, anch'essi in lacrime.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img518.imageshack.us/img518/1589/allymcbealcs0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img518.imageshack.us/img518/1589/allymcbealcs0.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nPremi: * 4 Golden Globes\n* 7 Emmy Awards\n* 2 Screen Actors Guild Awards\n\nPaese: Stati Uniti d'America\nAnno: 1997-2002\nFormato: serie TV\nGenere: Legale, giudiziario, commedia\nStagioni: 5\nEpisodi: 112\nDurata: 42 min (episodio)\nLingua originale: inglese\nCaratteristiche tecniche\nAspect ratio:\nColore: colore\nAudio: stereo\nCrediti\nIdeatore: David E. Kelley\nInterpreti e personaggi\n\n* Calista Flockhart: Ally McBeal\n* Peter MacNicol: John Cage\n* Greg Germann: Richard Fish\n* Jane Krakowski: Elaine Vassal\n* Lisa Nicole Carson: Renee Raddick\n* Lucy Liu: Ling Woo\n* Portia de Rossi: Nelle Porter\n* Robert Downey Jr.: Larry Paul\n* James LeGros: Mark Albert\n\n0=============================0\n\n.: Dati tecnici del ripping :.\n\nDimensione: 350 MB\nDurata: 00:39:34\n\nVideo Codec: DX50\nVideo Bitrate: 1099 kb/s\nRisoluzione: 768 x 570\nFPS (Frames/sec): 25.000\nQF (Frame quality): 0.100 bits/pixel\n\nAudio Codec: 0x0055 MPEG-1 Layer 3\nAudio Bitrate: 128 kb/s tot , Joint Stereo\nFreq Audio: 48000Hz ","torrent":{"xt":"urn:btih:8ade2ff41170330e77db7892cc432f18029e3f5f","amp;dn":"Ally+McBeal+Stagione+4+Completa+-+Tutti+i+Torrent+%5BSATrip+ITA%5D+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ade2ff41170330e77db7892cc432f18029e3f5f","infoHashBuffer":{"type":"Buffer","data":[138,222,47,244,17,112,51,14,119,219,120,146,204,67,47,24,2,158,63,95]},"announce":[],"urlList":[]}}