{"title":"Sym-Bionic Titan Season 1 episodes 01-11 {C_P}","uid":6165661,"size":1961964502,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8b5dae3de656da93914b38f87067ddede020aec6&amp;dn=Sym-Bionic+Titan+Season+1+episodes+01-11+%7BC_P%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"despo1ler","files":-1,"time":1297376823,"description":"[center][URL=http://img703.imageshack.us/i/symbioniclogo.png/][IMG]http://img703.imageshack.us/img703/39/symbioniclogo.png[/IMG][/URL]\n\n[URL=http://img806.imageshack.us/i/symlog2.png/][IMG]http://img806.imageshack.us/img806/7552/symlog2.png[/IMG][/URL]\n\n-------------------------------------------------------\n\nI realised that due to the {C_P} tracker going down their \nback episodes of this series were no longer widely available\nSo I thought this collection would be appreciated and will allow \nanyone new to the series to catch up :) enjoy\n\n========================================================\n\nThree young alien beings with the ability to form a giant robotic warrior attempt to \nblend into suburbia, all while battling the tyrannical forces that ravaged their home world. \n\n\nCreator: Genndy Tartakovsky\n\nStars:Tara Strong, Kevin Thoms and Brian Posehn  \n\nSeason 1: 2010  \n===============\n\nEP# Title Airdate Prod. Code Viewers (millions) \n==================================================\n\n1 &quot;Escape to Sherman High&quot; September 17, 2010 101 1.7\n-----------------------------------------------------\nLance, Ilana, and Octus crash-land on Earth while fleeing the evil General Modula, who has conquered their home planet, Galaluna. They try to blend in to Earth society by \n\ngoing to high school. During their first day at school, Modula sends a fire monster to kill the princess. While battling the beast, Lance, Ilana, and Octus form &quot;Titan&quot; with \n\ntheir robotic suits and defeat the monster, with some help from the mysterious Solomon. Series Premiere.  \n\n2 &quot;Neighbors in Disguise&quot; September 24, 2010 102 1.8 \n----------------------------------------------------\nIlana visits the mall to buy furniture for their new home, but Lance sees everyone around them as enemies, leading to a confrontation with mall security. Lance activates his \n\narmor in Ilana's defense, attracting the attention of a five-headed robot beast sent by Modula. Lance tries to redeem himself for the mess he has caused by being swallowed so \n\nhe can destroy the beast's power core from within. Later, Solomon takes security footage of Lance transforming.  \n\n3 &quot;Elephant Logic&quot; October 1, 2010 103 1.7 \n------------------------------------------\nIlana and Lance are having a hard time working as a team, so Octus consults childrens' television in an attempt to find a solution. Meanwhile, General Steel comes into \n\npossession of a mysterious rock. In his rush to uncover its secrets, he unleashes the monster within, a massive, electrical storm creature. Taking advice from the shows he's \n\nbeen watching, Octus gets Ilana and Lance to work together to defeat the storm creature.\n  \n4 &quot;The Phantom Ninja&quot; October 8, 2010 104 1.3 \n---------------------------------------------\nModula sends a squid-like Mutraddi assassin named Xeexi to find Ilana and kill her and the &quot;other two&quot;. Meanwhile, Lance takes up vigilantism to spice up his boring life. One \n\ncrime fight forced Lance to turn on his armor. This leads Xeexi to him and capturing him. Xeexi then finds Ilana and is about to kill her when Lance breaks free and saves \n\nIlana. Though Xeexi is defeated, knowledge of Titan's existence reaches Modula. \n \n5 &quot;Roar of the White Dragon&quot; October 15, 2010 105 1.8 \n-----------------------------------------------------\nLance develops a rivalry with a street-racing gang leader named Mike Chan, also called the White Dragon. When Lance's rivalry gets him arrested, Ilana forces him to get a \n\ndriver's license -legally- if he wants to race Chan again. During the test, he is harassed by Chan's gang, followed by a long limbed Mutraddi monster. Lance manages to escape \n\nthe monster, and his instructor passes him in gratitude. Lance, Ilana and Octus defeat the monster and Chan is taken into police custody by the detective who was trying to \n\ncatch him.  \n\n6 &quot;Shaman of Fear&quot; October 22, 2010 106 1.5 \n-------------------------------------------\nIlana and Lance suffer from nightmares induced by a shaman-like Mutraddi who preys upon their fear. Ilana sees visions of her people dying, while Lance relives the experiment \n\nwhich claimed his father's life. They face and overcome their fears to beat him and upon returning home, both Ilana and Lance begin to have a new outlook at their mission on \n\nEarth. \n \n7 &quot;Showdown at Sherman High&quot; October 29, 2010 107 1.5 \n-----------------------------------------------------\nUsing Sym-Bionic Titan, the group defeats a Mutraddi blob monster. However, a small piece survives and follows them to school, where it reassembles itself and attacks while \n\nthey are vulnerable. The creature encompasses the school taking the whole student body prisoner. While Lance and Ilana fight for their lives and the other students, Octus has \n\nto devise a means to defeat the creature- which turns out to be cell phone signals.  \n\n8 &quot;Shadows of Youth&quot; November 5, 2010 108 1.9 \n---------------------------------------------\nLance flashes back to his time at the Galalunan military academy shortly after the death of his father. While at the academy, he is bullied and proves he is better than them \n\nby achieving the Medal of Excellence. In doing so, his bullies try to kill him and they end up destroying the school.  \n\n9 &quot;Tashy 497&quot; November 12, 2010 109 1.5 \n---------------------------------------\nWhen Modula finds a cute but deadly new alien to unleash upon the group, Lance, Ilana and Octus find the cuddly little alien and decide to keep it as a pet. However, they \n\nsoon discover that the cute creature isn't all what it seems. The creature is generating enough energy to wipe out Earth, so the trio reluctantly let their beloved pet die \n\npeacefully in a glorious burst of energy. At an astronomy center, Octus locates a nebula cluster where they let their pet go, which the scientist of the station allows them \n\nto name for discovering it. In agreement, they come to name the cloud Tashy 497, as a mix of the names they wanted to name the creature.  \n\n10 &quot;Lessons in Love&quot; November 19, 2010 110 1.6 \n----------------------------------------------\nWhen Kimmy the cheerleader comes over, she becomes infatuated with Octus' human student disguise and studies with him. Meanwhile, Lance and Ilana encounter a manta-like \n\nMutraddi creature that is absorbing electrical energy that also causes their armor activators/communicators to shut down.  \n\n11 &quot;The Fortress of Deception&quot; December 3, 2010 111 1.6 \n-------------------------------------------------------\nWhen Lance and Ilana are captured by G3, Octus has to discover the location of their base. Meanwhile Ilana and Lance are locked up in some sort of Galalunian like cell at the \n\nG3 base. When Lance is taken in to be interrogated Ilana meets a seemingly fellow prisoner, Lance takes a beating from his interrogator and breaks out to get Ilana. They all \n\nrun to get out and after being reunited with their communicators and Octus, they form Titan and break free.  \n\n\n\n=================================================\nCast\n \n  Tara Strong  ...  Ilana (9 episodes, 2010)  \n  Kevin Thoms  ...  Lance (8 episodes, 2010)  \n  Brian Posehn  ...  Octus (8 episodes, 2010)  \n  John Di Maggio  ...  King (8 episodes, 2010)  \n  Don Leslie  ...  General Mondula (6 episodes, 2010)  \n  Tim Russ  ...  Solomon (5 episodes, 2010) \n \n\n\n=========================================\nExample file info:\n\n              ===== File Info ===== \nFileSize           : 165M\nPlayTime           : 00:23:13.435\nVideoCount         : 1\nAudioCount         : 1\n              ===== Video Info ===== \nVideo 0# Stream\nVideoCodec         : DX50\nVideoWidth         : 640 piexs\nVideoHeight        : 360 piexs\nVideoFrameRate     : 23.976fps\nVideoFrameCount    : 33409\nVideoBitRate       : 852555\n              ===== Audio Info ===== \nAudio 0# Stream\nAudioCodec         : MP3\nAudioBitRate       : 128000\nAudioChannels      : 2\nAudioSampleRate    : 48000\n\n\nExample Screens:\n[URL=http://img148.imageshack.us/i/symbionictitan101escape.jpg/][IMG]http://img148.imageshack.us/img148/1002/symbionictitan101escape.jpg[/IMG][/URL]\n\n===============================\nIMDB  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1709198/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1709198/&lt;/a&gt;\n\nHash:\n8B5DAE3DE656DA93914B38F87067DDEDE020AEC6\n=========================\n[/center]\n\n\n\nJoin us at #Cartoon_Palace on irc.cartoonpalace.info for more Cartoons and Anime.\n\n[url]http://www.cartoonpalace.info/[/url]\n","torrent":{"xt":"urn:btih:8b5dae3de656da93914b38f87067ddede020aec6","amp;dn":"Sym-Bionic+Titan+Season+1+episodes+01-11+%7BC_P%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b5dae3de656da93914b38f87067ddede020aec6","infoHashBuffer":{"type":"Buffer","data":[139,93,174,61,230,86,218,147,145,75,56,248,112,103,221,237,224,32,174,198]},"announce":[],"urlList":[]}}