{"title":"[DvdRip-Xvid-Ita-AC3]Gomorra[survivalofmisa]","uid":5061247,"size":1463062528,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8c076ffbe30cb0ba102084fc9314a39ff459238e&amp;dn=%5BDvdRip-Xvid-Ita-AC3%5DGomorra%5Bsurvivalofmisa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":2,"time":1250714442,"description":"\n\n\n\nPotere, soldi e sangue. In un mondo apparentemente lontano dalla realtÃƒÂ , ma ben radicato nella nostra terra, questi sono i &quot;valori&quot; con i quali gli abitanti della provincia di Caserta, tra Aversa e Casal di Principe, devono scontrarsi ogni giorno. Quasi sempre non puoi scegliere, quasi sempre sei costretto a obbedire alle regole del Sistema, la Camorra, e solo i piÃƒÂ¹ fortunati possono pensare di condurre una vita &quot;normale&quot;.\nGomorra ÃƒÂ¨ un viaggio nel mondo affaristico e criminale della camorra si apre e si chiude nel segno delle merci, del loro ciclo di vita. Le merci &quot;fresche&quot;, appena nate, che sotto le forme piÃƒÂ¹ svariate - pezzi di plastica, abiti griffati, videogiochi, orologiarrivano al porto di Napoli e, per essere stoccate e occultate. E le merci ormai morte che, da tutta Italia e da mezza Europa, sotto forma di scorie chimiche, morchie tossiche, fanghi, addirittura scheletri umani, vengono abusivamente &quot;sversate&quot; nelle campagne campane, dove avvelenano, tra gli altri, gli stessi boss che su quei terreni edificano le loro dimore fastose e assurde - dacie russe, ville hollywoodiane, cattedrali di cemento e marmi preziosi - che non servono soltanto a certificare un raggiunto potere, ma testimoniano utopie farneticanti. ","torrent":{"xt":"urn:btih:8c076ffbe30cb0ba102084fc9314a39ff459238e","amp;dn":"%5BDvdRip-Xvid-Ita-AC3%5DGomorra%5Bsurvivalofmisa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c076ffbe30cb0ba102084fc9314a39ff459238e","infoHashBuffer":{"type":"Buffer","data":[140,7,111,251,227,12,176,186,16,32,132,252,147,20,163,159,244,89,35,142]},"announce":[],"urlList":[]}}