{"title":"The Jim Jones Revue - The Jim Jones Revue","uid":5109609,"size":73432780,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8c0b99a84d6d2f0d9fd9a8c326bea6f67029f416&amp;dn=The+Jim+Jones+Revue+-+The+Jim+Jones+Revue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neon","files":-1,"time":1254616106,"description":"&quot;Rock n Roll is dead&quot; is an oft used diatribe - the ultimate in nihilistic reproach when the mutterer suspects that they just weren't made for these times. Jim Morrison was yelling it at arena audiences back in '68 and the idea wasn't lost on Elvis fans a decade earlier as he shouldered his kit bag up the gangplank en route to Der Fatherland. You only have to glance at the covers of the music `glossies' with the same old tired stories of how Zeppelin tamed America, of Rick Rubins' Johnny Cash resurrection and yet another account of the Beatles White Album sessions. Pop may well eat itself but It appears that rock forgets, remembers and reassess itself - every month!!. \nBut just as the natural order of things supply the human race with nurses, soldiers and criminals, every generation defaults to a glimmer of hope.But from an era which considers Coldplay important and Madonna a feminist icon... cometh The Jim Jones Revue. \nNot to be confused with the religious idiot who preached Kool-Aid and suicide this Jim Jones - an epiphany of velvet waistcoats, sideburns and great shoes - wouldn't be out of place in a Tombstone gin joint. If Edgar Allan Poe had a band The Jim Jones Revue would be it.The Revue' are a primary mover in this `secret revolution' and thirty seconds into their self-titled debut album you'll be all wised up and killing for tickets.\n \nRecorded onto a four track Tascam their opening volley is a crash-course in anti-production and probably the best British debut since The Who's My Generation. Searing vocals, torrid guitar runs and cut-throat piano have been jammed into a meat grinder and have come out the other end sounding like Little Richard's voice. In fact a cover of Richard's Hey Hey Hey is a welcome nod to what is clearly a starting point and new single Rock n Roll Psychosis is at once a standout and outstanding. \nUltimately The Jim Jones Revue is just that - a review and a `bringing it all back home' endeavour referencing Jerry Lee's 50's blueprint and employing the crash-clatter chaos of The Cramps, MC5 and The Birthday Party. \nThe only gnat in the Brylcreem is that they're nearly upstaged by their own opener. Princess &amp; the Frog,it raises the bar so high that it takes another couple of listens to realise the rest of the album more than lives up to it.Fantastic rock'n'roll album that you will enjoy listening to many times, i'm looking forward to the next one already.  \nRock n roll is dead? ....Sometimes - but not today.\n\n\n\n   1. Princess &amp; The Frog                \n   2. Hey Hey Hey Hey                 \n   3. Rock n Roll Psychosis                \n   4. Fish 2 Fry                \n   5. 512                                                                       \n   6. Another Daze                  &lt;a href=&quot; http://www.jimjonesrevue.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.jimjonesrevue.com/&lt;/a&gt;             \n   7. The Meat Man                              \n   8. Make It Hot                \n   9. Who's Got Mine?                \n   10.Cement Mixer \n\n   320 kbs     Thank you for seeding :o)\n\n                                                  \n \n","torrent":{"xt":"urn:btih:8c0b99a84d6d2f0d9fd9a8c326bea6f67029f416","amp;dn":"The+Jim+Jones+Revue+-+The+Jim+Jones+Revue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c0b99a84d6d2f0d9fd9a8c326bea6f67029f416","infoHashBuffer":{"type":"Buffer","data":[140,11,153,168,77,109,47,13,159,217,168,195,38,190,166,246,112,41,244,22]},"announce":[],"urlList":[]}}