{"title":"Un.Estate.ai.Caraibi.2009.iTALiAN.DVDRiP.XviD-SiLENT.avi","uid":5057557,"size":729418825,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8c0c98c7dc9a0d41a9be31483819b2463d4920a4&amp;dn=Un.Estate.ai.Caraibi.2009.iTALiAN.DVDRiP.XviD-SiLENT.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1250505211,"description":"Regia: Carlo Vanzina\nSceneggiatura: Enrico Vanzina, Carlo Vanzina\nAttori: Gigi Proietti, Enrico Brignano, Martina Stella, Maurizio Mattioli, Alena Seredova, Carlo Buccirosso, Biagio Izzo, Paolo Ruffini, Enrico Bertolino, Paolo Conticini, Sascha Zacharias\n\nTrama del film Un'estate ai Caraibi: \nRoby ÃƒÂ¨ un bancario meridionale, single, che lavora a Pavia. E' ipocondriaco ed ogni sei mesi va in ospedale, dal suo amico medico Giacomo che gli diagnostica un male incurabile. Gli resta un solo mese di vita e Roby decide di spenderlo nel miglior modo possibile partendo alla volta dei Caraibi, destinazione Antigua... Vincenzo ÃƒÂ¨ un dentista napoletano sposato con una donna gelosissima che lo marca stretto circondandolo di infermiere bruttissime. Vincenzo ha un'amante bellissima, Anna che decide di portare con sÃƒÂ¨ in vacanza ad Antigua... Angelo fa l'autista per un ricco e cafone palazzinaro romano, Remo che a ridosso delle vacanze estive gli chiede di accompagnarlo ad Antigua, dove ha appena comprato, con dei guadagni truffaldini in Russia, una villa sfarzosissima... Max lavora in una radio privata di Livorno. Fa il disc jockey, in coppia con un simpatico coetaneo, Tommy ed ÃƒÂ¨ fidanzato con Laura, una giovane e bellissima commessa. Proprio nel giorno del loro primo anniversario, Max scopre che Laura ha un altro e ha deciso di lasciarlo. Per dimenticarla Max decide di partire per i Caraibi; anche lui si ritrova ad Antigua... Alberto ÃƒÂ¨ un romano trapiantato ad Antigua, costretto anni prima a scappare da Roma perchÃƒÂ¨ oberato dai debiti. Anche adesso non se la passa per niente bene. Per sbarcare il lunario fa delle piccole truffe ai danni dei turisti di passaggio. Il suo compare ÃƒÂ¨ Morgan, un bambino di colore, orfano, con il quale Alberto divide una misera casetta in un quartiere di poveracci.","torrent":{"xt":"urn:btih:8c0c98c7dc9a0d41a9be31483819b2463d4920a4","amp;dn":"Un.Estate.ai.Caraibi.2009.iTALiAN.DVDRiP.XviD-SiLENT.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c0c98c7dc9a0d41a9be31483819b2463d4920a4","infoHashBuffer":{"type":"Buffer","data":[140,12,152,199,220,154,13,65,169,190,49,72,56,25,178,70,61,73,32,164]},"announce":[],"urlList":[]}}