{"title":"Travelling the Path of Love - Sayings of Sufi Masters (pdf ebook","uid":6301152,"size":959427,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8c3394d7b4745c0264144859467dae81723379ca&amp;dn=Travelling+the+Path+of+Love+-+Sayings+of+Sufi+Masters+%28pdf+ebook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"inst23","files":-1,"time":1302159712,"description":"Travelling the Path of Love: Sayings of Sufi Masters (by Llewellyn Vaughan-Lee)\n\nThe Golden Sufi Center | ISBN: 096345742X | PDF | 245 pages\n\n\n\nEditorial Review and Description:\n\nIn the late 20th century, Sufism, the mystical path of Islam, has attracted great interest on the part of spiritual seekers. Central to Sufism is the belief that God is Beloved Truth and that all seekers are lovers of God. This fine anthology collects sayings of the Sufi Masters ranging from the ninth century to the present. Sayings deal with matters such as the nature of the Sufi, the lover and the beloved, and union with God. Because of its range and its completeness, this is the one book that all libraries should have as they build their collections on Sufism.\n\nWith the passion and depth of feeling that belong to lovers, Sufi masters through the centuries have described the soul's journey toward union with God. This collection of sayings, dating from the ninth century to the present day, follows the stages of the journey, allowing the masters to beckon us along this ancient path.\n\nCustomer Reviews:\n\nLlewellyn Vaughan Lee is a Sufi Master for whom I have tremendous respect, and this book is an absolute gem. He quotes Sufi Masters from throughout the tradition, starting with the hadith of the Prophet. Rumi &amp; Hafiz are among many quoted. The quotes are arranged thematically, by topics roughly reflecting the order of the spiritual path. For many of these selections, just an individual quote would be ample to ponder for week of meditation. This book is unbelievably dense with wisdom and insight. I cannot highly enough recommend this book to spiritual seekers of all traditions! \n\nIf you love Sufi Sayings these a great collection of sayings from different masters. Read any page from the book, don't have to read this in order. \n\nThese gems of great Sufi teachers between the 7th and 20th centuries, arouse the heart through its states of longing, separation and union. \nWherever I dive in I always find an echo, an affirmation, an inspiration.","torrent":{"xt":"urn:btih:8c3394d7b4745c0264144859467dae81723379ca","amp;dn":"Travelling+the+Path+of+Love+-+Sayings+of+Sufi+Masters+%28pdf+ebook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c3394d7b4745c0264144859467dae81723379ca","infoHashBuffer":{"type":"Buffer","data":[140,51,148,215,180,116,92,2,100,20,72,89,70,125,174,129,114,51,121,202]},"announce":[],"urlList":[]}}