{"title":"Bring it on 3 All or nothing (2006 NLsubs) 2Lions-Team","uid":5097054,"size":2840110992,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8cee6b2ea355268730cc0b5f481d5cdda1399633&amp;dn=Bring+it+on+3+All+or+nothing+%282006+NLsubs%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rocco64","files":-1,"time":1253657665,"description":"Verenigde Staten\nKomedie\n99 minuten\n\ngeregisseerd door Steve Rash\nmet Hayden Panettiere, Solange Knowles en Marcy Rylan\n\nNederlands:\n\nBritney Allen (Hayden Panettiere) is de teamleider van het cheerleader team op de hoog aangeschreven Pacific Vista High School. Wanneer zij te horen krijgt dat er een auditie komt om in een programma van zangeres Rihanna op te treden schrijft ze haar team in. Echter, haar vader krijgt een nieuwe baan en ze verhuizen naar L.A. waar Britney naar de multi-etnische Crenshaw High School moet gaan. Hier is het nog niet zo makkelijk haar cheerleader-carriÃƒÂ¨re opnieuw op te pikken.\n\nEngels:\n\nBritney Allen is living the dream -- the cheerleader's dream. At the elite seaside campus of Pacific Vista High School, Britney is captain of the cheerleading squad and the envy of everyone at school -- including one overly-ambitious teammate. When Britney hears about a forthcoming audition for a top cheer squad to appear in recording star Rihanna's upcoming television special, she is determined that her Pirates cheer squad will capture the coveted spot. But Britney's life turns from cheer-topia to cheer-tastrophe when her father's job takes her family to Crenshaw Heights, a multi-ethnic working-class neighborhood east of Los Angeles. At her new school, Britney is viewed with suspicion by most of the students, especially by Camille, the overly confident and acerbic leader of the Crenshaw Heights Warriors cheerleading squad. No one is more surprised than Camille, however, when Britney proves herself and secures a spot on the Warriors' cheer squad. Britney and her new teammates work feverishly to prepare for the audition for Rihanna, incorporating some edgy new moves into their performance. Now the pressure is on, as the Warriors find themselves locked in a high-stakes cheer-off with Pacific Vista, Britney's old school! During the no-holds-barred fight to the finish, friendships, loyalties and talents are tested -- but only one team can come out on top\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DivX \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Komedie\n\n\n\n\n******************************************\n\nBrought to you by Rocco van\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n******************************************\n\n\n","torrent":{"xt":"urn:btih:8cee6b2ea355268730cc0b5f481d5cdda1399633","amp;dn":"Bring+it+on+3+All+or+nothing+%282006+NLsubs%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cee6b2ea355268730cc0b5f481d5cdda1399633","infoHashBuffer":{"type":"Buffer","data":[140,238,107,46,163,85,38,135,48,204,11,95,72,29,92,221,161,57,150,51]},"announce":[],"urlList":[]}}