{"title":"Willing-American Caliphate of BIZWOG(British Israel)(2010)","uid":6174474,"size":16597349,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d2b54cb7ff0f34c2a5fe0846fea3e3838579aff&amp;dn=Willing-American+Caliphate+of+BIZWOG%28British+Israel%29%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1297717818,"description":"This is R. Duane Willing's explosive book The American Caliphate of BIZWOG - The Final New World Order (2010) which exposes the United States as a country under foreign occupation of BIZWOG - British-Israel Zionist World Occupation Government. The mystery of a new world order driven by market forces is no longer secret. The primary power is to be an America under foreign occupation - a &quot;caliphate&quot; - controlled by the forces of BIZWOG. This modern version of the ancient Byzantine style of foreign control has come about gradually and secretly. The actual but unspoken objective of the &quot;American Caliphate&quot; under BIZWOG occupation is quite simple. Aside from being the military brute power to intimidate other countries, the American Caliphate has the agenda of providing BIZWOG with a steady income from a permanent flow of monthly payments from a mind-controlled, politically correct, multicultural consumer burdened with permanent installment debt. The high technological science possessed by world governments provides benefits for organizing the American Caliphate. The talk of mind control and hypnotic amnesia pales before the reality of the Biblical &quot;Holpen&quot; of the Great Merchants and the occult &quot;Egregore&quot; that makes central banking possible. BIZWOG is an imperial empire that worships the Moloch, god of perpetual debt, money at interest and stock exchange Swindle finance. BIZWOG is a vision for a central bank control of the world based upon the Bible myth of a reconstructed Third Temple in Jerusalem. Initially money would be US Federal Reserve notes to eventually be replaced by a currency based upon pollution filth called carbon emission credits. 185 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:8d2b54cb7ff0f34c2a5fe0846fea3e3838579aff","amp;dn":"Willing-American+Caliphate+of+BIZWOG%28British+Israel%29%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d2b54cb7ff0f34c2a5fe0846fea3e3838579aff","infoHashBuffer":{"type":"Buffer","data":[141,43,84,203,127,240,243,76,42,95,224,132,111,234,62,56,56,87,154,255]},"announce":[],"urlList":[]}}