{"title":"The Secret Bible  (National Geographic)","uid":5055454,"size":2203202792,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8d9f65b624eee3b51e99b7170f8dfa161797c947&amp;dn=The+Secret+Bible++%28National+Geographic%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sheila6","files":5,"time":1250385499,"description":"TV : Documentary : TV quality : English\n\n\n\nNational Geographic: The Secret Bible\n\n\nA three-part series which shines a questing light on the secrets of Christianity.\n\nKnights Templar:\nDelve into the myths and mysteries of the legendary medieval order - the Knights Templar. The Templar have recently attracted global attention following Dan Brown's best selling novel The Da Vinci Code, where they are presented as mysterious protectors of the Holy Grail. Modern Conspiracy theorists suggest that the Knights Templar still exists in secret to this day and still protects a vast and mysterious treasure. Using historical re-enactments of battles and long secret rituals, we separate fact from fiction behind these legendary warriors.\n\nRivals of Jesus:\nThere was a man who cured the sick, performed miracles, was called the son of God and rose from the grave three days after his death. His name was Apollonius of Tyana and he was not unique. We ask why so many preachers and supposed miracle workers appeared by the Mediterranean around the 1st Century AD and why the cult of Jesus won out in Rivals of Jesus.\n\nApocalypse:\nThese are the days of miracles and wonders, disasters and destruction, hurricanes and tsunamis....but are these the 'end days' as prophesied in the Bible? Many people believe that The Apocalypse is at hand. We explore the prophesies of the end of the world and compare them to newly uncovered scientific facts. Is 'The Apocalypse' simply a first Century poetic description of an internal religious state as some theologians insist or the prophecy of impending doom?\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:8d9f65b624eee3b51e99b7170f8dfa161797c947","amp;dn":"The+Secret+Bible++%28National+Geographic%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d9f65b624eee3b51e99b7170f8dfa161797c947","infoHashBuffer":{"type":"Buffer","data":[141,159,101,182,36,238,227,181,30,153,183,23,15,141,250,22,23,151,201,71]},"announce":[],"urlList":[]}}