{"title":"Operation Flashpoint Dragon Rising[X360][Region Free][gamerguuy]","uid":5111614,"size":6780240350,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:8dda0c575c5fd2a4e77f5e01a029bb64570d5688&amp;dn=Operation+Flashpoint+Dragon+Rising%5BX360%5D%5BRegion+Free%5D%5Bgamerguuy%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gamerguuy","files":-1,"time":1254848305,"description":"Category: XBOX360\nLanguage: EspaÃƒÂ±ol,English,French,Italian,German\nType:Action\nFormat: ISO\nSize: 6.31 GB\nDate: 06-10-2009\n\n\nOperation Flashpoint: Dragon Rising, the long awaited second installment of war simulator which was a landmark in the genre, puts the player in the war more real environment than might be desired. This game, which strives to offer a full war experience, will challenge players to survive the chaos and fast pace of today's battles in a current scenario. \n\nThe player will experience the intensity, diversity and oppression of modern warfare more realistic from the perspective of an infantry soldier, a helicopter pilot, a special forces soldier and a tank commander who face the rush of the Army Chinese People's Liberation to a scale not seen in a military action game. This game simulates a massive conflict between armies advanced and offers a variety of military disciplines, vehicles and equipment second to none. \n\nOperation Flashpoint: Dragon Rising is the complete antithesis to the shooters on track of &quot;run and shoot. Instead, players have the freedom to manage its discretion military crisis, spreading at will the weapons, vehicles and equipment of a modern fighting force. Having established the objectives, the player decides how to meet them in challenging missions totally improvised. Armed with cutting edge military hardware, players will need to combine brute force with intelligent use of strategy. \n\nNo item will be identical to another thanks to advanced and reactive AI that uses real-world military strategies. In battle, the brutal effects of modern weapons systems come alive with huge explosions and permanent damage to buildings, as players battle without truce in this battle unmistakable.\n\nOriginal credit goes to the original uploader and remember to seed....\n\n\n\n","torrent":{"xt":"urn:btih:8dda0c575c5fd2a4e77f5e01a029bb64570d5688","amp;dn":"Operation+Flashpoint+Dragon+Rising%5BX360%5D%5BRegion+Free%5D%5Bgamerguuy%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dda0c575c5fd2a4e77f5e01a029bb64570d5688","infoHashBuffer":{"type":"Buffer","data":[141,218,12,87,92,95,210,164,231,127,94,1,160,41,187,100,87,13,86,136]},"announce":[],"urlList":[]}}