{"title":"The Lost is Found (Animated Christian Movie)","uid":4998882,"size":266098407,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8e1534af481aa3b6a405d43b61d89f7776f7982f&amp;dn=The+Lost+is+Found+%28Animated+Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IndianChristian","files":3,"time":1247420881,"description":"The Lost is Found (Animated Christian Movie)\n\nJesus uses the lives of Miriam, Jonah and Matthew along with the parables of the lost coin and the lost sheep to show how mercy, forgiveness and love are generously extended to all sinners. One sinner's repentance is rejoiced by many. The Lost is Found is the story of three sinners, Miriam the harlot, Jonah, a sick man, and Matthew the publican. The parables of the lost coin and the lost sheep are weaved into these three stories to show forgiveness for all sinners who repent. The video opens with Miriam working in a pub as a waitress and harlot. She is trapped in this life due to debt and guilt. A letter comes from her brother, Jonah, to the house of a scribe. The scribe reads the letter which tells of her brother's expected death. The scribe does not invite Miriam inside his house because he believes a sinner should not enter the house of the righteous. He goes to Miriam in the streets to offer her ten coins so that she might start a new life. The parable of the lost coin is weaved into the story of Miriam as she loses one coin, and all rejoice when the coin is found. Miriam tries to escape her life only to be betrayed. The video moves to the story of Jonah. He is lying sick in a bed and cannot be moved, so his friends carry him on his bed to see Jesus. They have heard of Jesus' many miracles. Once they are at the home where Jesus is teaching, the crowd will not allow them to enter. The friends climb up on the roof and lower the bed with Jonah down into the house through an opening in the roof. Jesus knows of the faith of Jonah and his friends and forgives Jonah of his sins. The teachers in the home think Jesus is committing blasphemy by forgiving sins. Jesus asks the teachers which is more difficult, to forgive sins or to tell the sick man to rise, take your bed and walk? In order to show that the Son of Man has authority to forgive sins. Jesus tells Jonah to rise, take his bed and walk. Jonah does as commanded by Jesus and thanks Him for his forgiveness. Jonah and his friends rejoice. Jonah leaves to find his sister, Miriam, and tell her of the miracle and the forgiveness of Jesus. The last story is of Matthew and the tax collectors. Jesus invites Matthew to follow him. Matthew follows Jesus and invites the tax collectors to his house to meet Jesus at a great feast. Some teachers cannot believe that Jesus, a holy man, eats with sinners. One teacher goes up to the home and asks to see Jesus. When the teacher is inside, Jesus knows of his question and tells him that the doctor goes to the sick, and He goes to the sinners. The video ends with the parable of the lost sheep. This parable is weaved into the story of Jonah trying to find his sister, Miriam. After many hardships, the boy shepherd finds his lost sheep, and Jonah finds his lost sister. Jonah tries to persuade his sister to go and see Jesus. At first she refuses because she thinks of her many sins. While Jesus was having dinner at the home of a scribe whom questions Jesus actions, Miriam appears and washes Jesus' feet with oils and her hair. As she is crying and worshiping Jesus, the scribe wonders why Jesus does not rebuke her. Jesus tells the story of the debtors who were forgiven by the lender, and how they loved their lender for forgiving them. Miriam's faith saved her, and her sins were forgiven. In the end, Miriam is seen traveling to Jonah's home, free of the pub owner, and they rejoice together.\n \nRuntime: 29 mins\nLanguage: English (No-Subtitles)\nYear: 1999\nMy Rating: 8/10\nQuality: 8/10 \n\nIf financially possible, please buy this CD/DVD to keep Christian films in business. If Christians won't buy Christian films then who will?\n\nPlease seed. Let each one of us who call ourself Christians seed 2-3 movies each. So that these movies may become a blessing to all those who are hungry for God's word &amp; grace. May Jesus bless all those who are seeding the christian torrents.\n\nPS: If you need any specific christian movie or have something to say then kindly send a mail to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;41282f2528202f22293328323528202f73717178013820292e2e6f222e6f282f&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n&quot;Don't ask me what Christ can do for you! \nHe has done all he could. \nTell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\t\t\n\t\t\t","torrent":{"xt":"urn:btih:8e1534af481aa3b6a405d43b61d89f7776f7982f","amp;dn":"The+Lost+is+Found+%28Animated+Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e1534af481aa3b6a405d43b61d89f7776f7982f","infoHashBuffer":{"type":"Buffer","data":[142,21,52,175,72,26,163,182,164,5,212,59,97,216,159,119,118,247,152,47]},"announce":[],"urlList":[]}}