{"title":"Digital Infrared Photography 2009 - (Malestrom)","uid":5170370,"size":39891784,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e1f7779e9a7f06f6ea78c20b3e26bcdfbfcd7de&amp;dn=Digital+Infrared+Photography+2009+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1258655353,"description":" &lt;a href=&quot;http://bayimg.com/eaePBaaco&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/eaePBaaco&lt;/a&gt;\n\n\nDeborah Sandidge, &quot;Digital Infrared Photography&quot;\nWiley | 2009-05-26 | ISBN: 047040521X | 256 pages | PDF\n\n&quot;Digital Infrared Photography,&quot; an all new guide that illustrates and explores the enchantingly beautiful world of infrared images.\n\nBy simply adding a filter to the camera lens, or using a converted camera, digital photographers can capture infrared (IR) images featuring expressive skies, dramatic clouds, and intriguing white foliage. Illustrated with hundreds of striking IR images taken from around the world, this unique guide shows photographers how to get started and get creative with IR. Each chapter covers IR basics as well as imaginative techniques that produce eye-catching images. Subjects such as long exposures, multiple exposures, and image enhancement with hand coloring, mirroring, toning, and layering as well as HDR, Photomerge, and other creative Photoshop techniques are illustrated and explained in easily understood detail. The book also includes an inspirational gallery showcasing IR work from top photographers such as Kathleen Carr, Joe Farace, and Lewis Kemper, and engages the reader with interactive online end-of-chapter assignments.\n\nDeborah Sandidge is a professional award winning photographer, highly skilled in her ability to artistically capture unique images of birds, wildlife, landscapes, and scenic areas of the world. Her photos continue to be featured in many gallery exhibits and events such as PhotoExpo Plus, MacWorld, and PMA. Her work has also appeared in several instructional books, magazines, and calendars. Deborah is co-founder and Creative Director of the League of Creative Infrared Photographers, an online group of photographers who do innovative and creative infrared work. Deborah is a guest instructor at the Harmon School of Photography in Orlando. She frequently teaches workshops and does specialized presentations on creative photography.","torrent":{"xt":"urn:btih:8e1f7779e9a7f06f6ea78c20b3e26bcdfbfcd7de","amp;dn":"Digital+Infrared+Photography+2009+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e1f7779e9a7f06f6ea78c20b3e26bcdfbfcd7de","infoHashBuffer":{"type":"Buffer","data":[142,31,119,121,233,167,240,111,110,167,140,32,179,226,107,205,251,252,215,222]},"announce":[],"urlList":[]}}