{"title":"ESET Smart Security Business 4.2.40 (32 - 64bits)","uid":5490259,"size":91919172,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8e6d2997221ea320c3d010747fd8d79caf84e4d8&amp;dn=ESET+Smart+Security+Business+4.2.40+%2832+-+64bits%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"nahla","files":6,"time":1270947707,"description":"Consola de AdministraciÃƒÂ³n | Antivirus | Antispyware | Cortafuegos | Antispam\n\nVersiÃƒÂ³n Comercial - EspaÃƒÂ±ol Oficial\n\nCon una potente combinaciÃƒÂ³n de herramientas de administraciÃƒÂ³n fÃƒÂ¡ciles de utilizar para usuarios finales y un sistema novedoso de detecciÃƒÂ³n proactiva de amenazas, ESET Smart Security es la forma mÃƒÂ¡s efectiva para proteger la informaciÃƒÂ³n de su empresa mientras mejora su imagen corporativa.\nEl producto ESET Smart Security es muy apreciado por su facilidad de uso. TodavÃƒÂ­a es mÃƒÂ¡s fÃƒÂ¡cil de usar, ya que ayudarÃƒÂ¡ al administrador a mantener toda su red segura. La versiÃƒÂ³n Business de ESET Smart Security incluye todas las caracterÃƒÂ­sticas y beneficios descritos anteriormente, ademÃƒÂ¡s de una funcionalidad y flexibilidad adicional para todo negocio en crecimiento.\n\nBeneficios Adicionales\nÃ‚Â· Nuevas CaracterÃƒÂ­sticas:\nESET Smart Security aÃƒÂ±ade caracterÃƒÂ­sticas especiales, tales como los anÃƒÂ¡lisis a unidades externas de acceso, compatibilidad con Cisco Network AdmisiÃƒÂ³n Control (NAC) y la funciona para crear informes especÃƒÂ­ficos.\nÃ‚Â· Basado en &quot;Host Intrusion Prevention System&quot;:\nESET Smart Security protege de intrusos el host con protecciÃƒÂ³n a travÃƒÂ©s de una combinaciÃƒÂ³n de capacidades de autodefensa, heurÃƒÂ­stica avanzada, acceso web y el protocolo de protecciÃƒÂ³n de filtrado. En particular, se detienen muchos cÃƒÂ³digos maliciosos con la heurÃƒÂ­stica avanzada de mediante el anÃƒÂ¡lisis de su comportamiento y de este modo inutilizarlos antes de que ÃƒÂ©stos puedan hacer daÃƒÂ±o. ESET Smart Security previene cualquier malware que intente desactivarlo o debilitar la seguridad del usuario del sistema. Ã‚Â· FÃƒÂ¡cil de Manejar:\nESET Remote Administrator proporciona una consola de gestiÃƒÂ³n para el control de toda una red desde una ÃƒÂºnica pantalla, la cual puede administrar miles de ordenadores. La instalaciÃƒÂ³n, las actualizaciones, alertas y otras funciones son fÃƒÂ¡ciles de gestionar a partir de los diferentes menÃƒÂºs intuitivos. Para gestionar eficazmente sus sistemas en red, la integraciÃƒÂ³n de la consola con el Active Directory, suaviza y simplifica la creaciÃƒÂ³n de polÃƒÂ­ticas de seguridad. Con soporte para las bases de datos Oracle, MySQL y MS-SQL. Muy utilizado en grandes redes debido a su rÃƒÂ¡pido funcionamiento. ESET Smart Security se puede configurar como se desee, tanto el antispam y/o el cortafuegos personal a partir de dos opciones, para poder garantizar la mÃƒÂ¡xima compatibilidad con las soluciones de seguridad de la red. La versiÃƒÂ³n de ESET SysInspector integrada hace que sea mÃƒÂ¡s fÃƒÂ¡cil para los administradores de TI diagnosticar un sistema y resolver los problemas, que ÃƒÂ©ste pueda tener.\nÃ‚Â· Mejoras en la usabilidad\n- Para los administradores, la versiÃƒÂ³n 4 ofrece:\n\n* El administrador de licencias simplificado con diferentes herramientas para gestionar mÃƒÂºltiples licencias con diferentes tÃƒÂ©rminos.\n* El acceso de sÃƒÂ³lo lectura para la Consola de administraciÃƒÂ³n que permite que mÃƒÂºltiples administradores puedan compartir tareas sin correr el riesgo de sobrescribir las configuraciones.\n* Administrador de notificaciÃƒÂ³n para mantener informado a los administradores de todos los eventos con alertas personalizables.\n* Soporte completo de Cisco Network AdmisiÃƒÂ³n Control (NAC).\n* Un uso mÃƒÂ¡s eficiente de ancho de banda de la red y mejora de la escalabilidad de almacenamiento de los registros.\n* Ventanas de estado que le informa de forma detallada sobre cualquier amenaza.\n* La protecciÃƒÂ³n por contraseÃƒÂ±a que previene que ESET Smart Security pueda ser manipulado por los empleados o visitantes.\n\n\nIncluye nueva versiÃƒÂ³n de Nodlogin y compatible con Windows 7\n","torrent":{"xt":"urn:btih:8e6d2997221ea320c3d010747fd8d79caf84e4d8","amp;dn":"ESET+Smart+Security+Business+4.2.40+%2832+-+64bits%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e6d2997221ea320c3d010747fd8d79caf84e4d8","infoHashBuffer":{"type":"Buffer","data":[142,109,41,151,34,30,163,32,195,208,16,116,127,216,215,156,175,132,228,216]},"announce":[],"urlList":[]}}