{"title":"These Three (1936) Joel McCrea","uid":4987599,"size":911987613,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8eaede0a2ba7685c8badb27d6a8343a9b154db17&amp;dn=These+Three+%281936%29+Joel+McCrea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"johnefp","files":3,"time":1246833583,"description":"Lillian Hellman's 1934 Broadway play The Children's Hour was such a hot potato that film producer Samuel Goldwyn was denied Production Code permission to use the play's original title. The reason was the story's lesbian theme, a factor that also blocked The Children's Hour from winning a Pulitzer Prize. In the original story, lifelong friends Martha Dobie and Karen Wright manage an exclusive girl's boarding school. Spoiled rotten student Mary Tilford, angered at being disciplined, fabricates a story that casts a questionable light on the women's friendship. In attempting to defend themselves against the accusations of the little girl's wealthy and powerful aunt, Martha and Karen lose everything in court. By the time the girl has admitted her lie and the aunt has come to apologize, it is too late. After confessing that she has harbored &quot;unnatural&quot; feelings towards Martha, Karen commits suicide. In adapting her play to the screen, Lillian Hellman expertly weeded out all hints of lesbianism, and also eliminated Karen's self-inflicted death (&quot;suicide as a plot solution&quot; was another Production Code no-no). In the revised version, Mary Tilford (played with unbridled venom by Bonita Granville) spreads a rumor that Martha (Miriam Hopkins) has been carrying on an illicit affair with doctor Joseph Cardin (Joel McCrea), the boyfriend of Karen (Merle Oberon). The end result is essentially the same -- the school is destroyed, along with Martha and Karen's reputation -- but Karen manages to survive to fade-out time. In defending the evisceration of her play, Hellman defended herself by noting that her original point was not to force a lesbian subtext down the throats of the audience, but to show how a vicious lie -- any vicious lie -- can have disastrous consequences. While it makes a good story, it is probably not true that, when informed that the leading characters in The Children's Hour were lesbians, producer Goldwyn replied, &quot;Who cares? We'll make them Americans.&quot; These Three was refilmed in 1961 by its director William Wyler, under its original title The Children's Hour, with Hellman's original text -- lesbianism and all -- intact; ironically, the censor-ridden earlier film is the far superior version. \n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0028356/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0028356/&lt;/a&gt;\n\n\nPort/Br  Subtitles\n\n &lt;a href=&quot;\nhttp://www.5sub.com/movie.aspx?m=114f5cba-b5c5-414c-82a1-5e0d78bce1b2&amp;k=these&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.5sub.com/movie.aspx?m=114f5cba-b5c5-414c-82a1-5e0d78bce1b2&amp;k=these&lt;/a&gt; three\n\n\n\n\nDirector:William Wyler\n\n\n\n\n Miriam Hopkins ...  Martha Dobie \n\n Merle Oberon ...  Karen Wright \n Joel McCrea ...  Dr. Joseph &quot;Joe&quot; Cardin \n Catherine Doucet ...  Mrs. Lily Mortar (as Catharine Doucet) \n Alma Kruger ...  Mrs. Amelia Tilford \n\n\nMovie]\nValid : Yes [AVI]\nDuration : 01:30:40\nMovie complete : Yes\n\n[Video]\nResolution : 512x400\nCodec : DivX (4 / 5 / 6)\nFPS : 23,98\nBitRate : 940 Kbps\nQuality Factor : 0,20 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n","torrent":{"xt":"urn:btih:8eaede0a2ba7685c8badb27d6a8343a9b154db17","amp;dn":"These+Three+%281936%29+Joel+McCrea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8eaede0a2ba7685c8badb27d6a8343a9b154db17","infoHashBuffer":{"type":"Buffer","data":[142,174,222,10,43,167,104,92,139,173,178,125,106,131,67,169,177,84,219,23]},"announce":[],"urlList":[]}}