{"title":"Twilight New Moon XviD-RCBv + Subtitrare in limba ROMANA","uid":5176135,"size":1483088036,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8ee58be744db7f7241c0700445867e3616fc4a0a&amp;dn=Twilight+New+Moon+XviD-RCBv+%2B+Subtitrare+in+limba+ROMANA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kiss1911","files":-1,"time":1258988125,"description":"Protagonista Bella Swan implineste optsprezece ani iar Alice si Edward ,vampirul pe care il iubeste ii pregatesc o petrecere surpriza, doar ca la acesta petrecere are loc cel mai mare cosmar a lui Edward in timp ce acesta deschide un cadou se taie in hartie iar Jasper nu isi poate stapani instinctele si o ataca insa Edward o salveaza impingand-o din calea lui Jasper acesta cazand pe o masa de sticla unde se ranaste mai rau Carlise fiind nevoit sa ii coase ranile. Dupa acesta intamplare Edward vrea sa o protejeze pe aceasta asa ca pleaca din orasul Forks impreuna cu toata familia lui gandindu-se ca fiind om va putea trece peste iubirea care o purta pentru el &quot; va fi ca si cum nu as fi existat &quot;. La aflarea vestii Bella este distrusa si intra intr-o depresie severa si nu isi poate reveni,avand serioase probleme de comportament la scoala si in relatia ei cu Charile. Astfel ca la patru luini de la plecare lui Edward isi gaseste sfarsit linistea langa Jacob Black un prieten de familie, dar si acesta are un secret la fel de mare ca al familiei Cullen.Bella se gandeste in continuare la Edward si cauta noi metode pentru al putea simiti mai aproape astfel ea descopera ca de cate ori isi risca viata ea putea sa ii auda voce vampirului pe care ea il iubea mai mult decat viata sa.La un moment dat Bella va trebui chiar sa il salveze pe Edward.","torrent":{"xt":"urn:btih:8ee58be744db7f7241c0700445867e3616fc4a0a","amp;dn":"Twilight+New+Moon+XviD-RCBv+%2B+Subtitrare+in+limba+ROMANA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ee58be744db7f7241c0700445867e3616fc4a0a","infoHashBuffer":{"type":"Buffer","data":[142,229,139,231,68,219,127,114,65,192,112,4,69,134,126,54,22,252,74,10]},"announce":[],"urlList":[]}}