{"title":"The Battle for Palestine 1917 (Warfare in History)","uid":5617307,"size":6042219,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f03cecd6c80bc2a32d5fe3e77bf72402103ba69&amp;dn=The+Battle+for+Palestine+1917+%28Warfare+in+History%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1276115227,"description":"Editorial Reviews\nReview\nGrainger's analysis is informed, critical, readable and supported by a wealth of unpublished and printed primary material. (...) Makes good use of soldiers' experiences bringing to life the human dimension to the fighting in southern Palestine. ENGLISH HISTORICAL REVIEWInformed, critical, readable and supported by a wealth of unpublished and printed primary material. JOURNAL OF MILITARY HISTORYExtremely good value as it is, like all books from this publisher, of high quality. (...) The one book on Palestine in the Great War that I would select. THE BULLETIN OF THE MILITARY HISTORICAL SOCIETYAt last a brilliant detailed work on Palestine which explains the whole campaign and uses the words of the British, Anzac and Turkish forces who were there. An excellent and very informative read. ARMCHAIR AUCTIONSGrainger's analysis of battle tactics, from both British and Turkish perspectives, will captivate military buffs. Recommended. CHOICE\nProduct Description\nThree battles for the control of the key fortress-city of Gaza took place in 1917 between the `British' force (with units from across the Empire, most notably the ANZACs) and the Turks. The Allies were repulsed twice but on their third attempt, under the newly-appointed General Allenby, a veteran of the Western Front where he was a vocal critic of Haig's command, finally penetrated Turkish lines, captured southern Palestine and, as instructed by Lloyd George, took Jerusalem in time for Christmas, ending 400 years of Ottoman occupation. This third battle, similar in many ways to the contemporaneous fighting in France, is at the heart of this account, with consideration of intelligence, espionage, air-warfare, and diplomatic and political elements, not to mention the logistical and medical aspects of the campaign, particularly water. The generally overlooked Turkish defence, in the face of vastly superior numbers, is also assessed. Far from laying out and executing a pre-ordained plan, Allenby, who is probably still best remembered as T. E. Lawrence's commanding officer in Arabia, was flexible and adaptable, responding to developments as they occurred. JOHN D. GRAINGER is the author of numerous books on military history, ranging from the Roman period to the twentieth century.\nProduct Details\n\n    * Hardcover: 300 pages\n    * Publisher: Boydell Press (October 21, 2006)\n    * Language: English\n    * ISBN-10: 1843832631\n    * ISBN-13: 978-1843832638\n    * Product Dimensions: 9 x 6.4 x 1.2 inches\n    * Shipping Weight: 1.4 pounds (View shipping rates and policies)","torrent":{"xt":"urn:btih:8f03cecd6c80bc2a32d5fe3e77bf72402103ba69","amp;dn":"The+Battle+for+Palestine+1917+%28Warfare+in+History%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f03cecd6c80bc2a32d5fe3e77bf72402103ba69","infoHashBuffer":{"type":"Buffer","data":[143,3,206,205,108,128,188,42,50,213,254,62,119,191,114,64,33,3,186,105]},"announce":[],"urlList":[]}}