{"title":"Unmistaken Child-2009(El NiÃƒÂ±o Correcto).SubEsp.avi","uid":5185622,"size":733668060,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8f47b56ffb227feddbda4de34980ff59e88f9f06&amp;dn=Unmistaken+Child-2009%28El+Ni%C3%83%C2%B1o+Correcto%29.SubEsp.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"samsaraexit","files":1,"time":1259449118,"description":"El documentalista Nati Baratz sigue al tÃƒÂ­mido pero devoto discÃƒÂ­pulo de un maestro tibetano fallecido, en la bÃƒÂºsqueda de la reencarnaciÃƒÂ³n de su maestro bajo ÃƒÂ³rdenes directas del Dalai Lama. En 2001, Lama Konchog falleciÃƒÂ³ luego de 26 aÃƒÂ±os de meditaciÃƒÂ³n, aislado en una remota cueva de montaÃƒÂ±a. Tras la muerte de Konchog Lama, el Dalai Lama dio instrucciones a su discÃƒÂ­pulo Tenzin Zopa para aventurarse en busca de la reencarnaciÃƒÂ³n de su maestro.\n\nPero hay una urgencia en la bÃƒÂºsqueda de Zopa, porque en caso de que no encuentre al &quot;niÃƒÂ±o inequÃƒÂ­voco&quot; en el lapso de apenas cuatro aÃƒÂ±os, serÃƒÂ¡ muy difÃƒÂ­cil quitar al niÃƒÂ±o del cuidado de sus padres. Como un niÃƒÂ±o de siete aÃƒÂ±os de edad, Zopa habÃƒÂ­a entrado voluntariamente al servicio de Lama Konchog, quedÃƒÂ¡ndose fielmente junto a su maestro elegido por los prÃƒÂ³ximos 21 aÃƒÂ±os. Cuando Lama Konchog muriÃƒÂ³, Zopa estaba devastado. Pero mientras que la perspectiva de encontrar su reencarnaciÃƒÂ³n es de hecho una premoniciÃƒÂ³n, el fiel discÃƒÂ­pulo estÃƒÂ¡ decidido a triunfar.\n\nCon poco mÃƒÂ¡s que sueÃƒÂ±os y susurros que lo guÃƒÂ­an, Zopa atraviesa tierras que virtualmente parecen no haber sido tocadas por la civilizaciÃƒÂ³n durante todo un siglo. MÃƒÂ¡s tarde, cuando Tenzin se cruza con un aparente contendiente, se prepara para realizar la prueba que confirme o niegue la reencarnaciÃƒÂ³n.\n\n\n\n\nIn Nepal, a venerable monk, Geshe Lama Konchog, dies and one of his disciples, a youthful monk named Tenzin Zopa, searches for his master's reincarnation. The film follows his search to the Tsum Valley where he finds a young boy of the right age who uncannily responds to Konchog's possessions. Is this the reincarnation of the master? After the boy passes several tests, Tenzin takes him to meet the Dali Lama. Will the parents agree to let the boy go to the monastery, and, if so, how will the child respond? Central to the film is the relationship the child develops with Tenzin","torrent":{"xt":"urn:btih:8f47b56ffb227feddbda4de34980ff59e88f9f06","amp;dn":"Unmistaken+Child-2009%28El+Ni%C3%83%C2%B1o+Correcto%29.SubEsp.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f47b56ffb227feddbda4de34980ff59e88f9f06","infoHashBuffer":{"type":"Buffer","data":[143,71,181,111,251,34,127,237,219,218,77,227,73,128,255,89,232,143,159,6]},"announce":[],"urlList":[]}}