{"title":"Poderoso chefao I","uid":5036816,"size":4677644288,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8faa718dc3a334103321df754c17ca4a13160bfc&amp;dn=Poderoso+chefao+I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiagofavi2612","files":1,"time":1249160865,"description":"A saga da famÃƒÂ­lia Corleone contada pelo diretor Francis Ford Coppola e o roteirista Mario Puzo. Com Marlon Brando, Al Pacino, Robert Duvall, James Caan, Diane Keaton e Talia Shire. Vencedor de 3 Oscars.Don Vito Corleone (Marlon Brando) ÃƒÂ© o chefe de uma &quot;famÃƒÂ­lia&quot; de Nova York que estÃƒÂ¡ feliz, pois Connie (Talia Shire), sua filha, se casou com Carlo (Gianni Russo). PorÃƒÂ©m, durante a festa, Bonasera (Salvatore Corsitto) ÃƒÂ© visto no escritÃƒÂ³rio de Don Corleone pedindo &quot;justiÃƒÂ§a&quot;, vinganÃƒÂ§a na verdade contra membros de uma quadrilha, que espancaram barbaramente sua filha por ela ter se recusado a fazer sexo para preservar a honra. Vito discute, mas os argumentos de Bonasera o sensibilizam e ele promete que os homens, que maltrataram a filha de Bonasera nÃƒÂ£o serÃƒÂ£o mortos, pois ela tambÃƒÂ©m nÃƒÂ£o foi, mas serÃƒÂ£o severamente castigados. Vito porÃƒÂ©m deixa claro que ele pode chamar Bonasera algum dia para devolver o &quot;favor&quot;. Do lado de fora, no meio da festa, estÃƒÂ¡ o terceiro filho de Vito, Michael (Al Pacino), um capitÃƒÂ£o da marinha muito decorado que hÃƒÂ¡ pouco voltou da 2Ã‚Âª Guerra Mundial. UniversitÃƒÂ¡rio educado, sensÃƒÂ­vel e perceptivo, ele quase nÃƒÂ£o ÃƒÂ© notado pela maioria dos presentes, com exceÃƒÂ§ÃƒÂ£o de uma namorada da faculdade, Kay Adams (Diane Keaton), que nÃƒÂ£o tem descendÃƒÂªncia italiana mas que ele ama. Em contrapartida hÃƒÂ¡ alguÃƒÂ©m que ÃƒÂ© bem notado, Johnny Fontane (Al Martino), um cantor de baladas romÃƒÂ¢nticas que provoca gritos entre as jovens que beiram a histeria. Don Corleone jÃƒÂ¡ o tinha ajudado, quando Johnny ainda estava em comeÃƒÂ§o de carreira e estava preso por um contrato com o lÃƒÂ­der de uma grande banda, mas a carreira de Johnny deslanchou e ele queria fazer uma carreira solo. Por ser seu padrinho Vito foi procurar o lÃƒÂ­der da banda e ofereceu 10 mil dÃƒÂ³lares para deixar Johnny sair, mas teve o pedido recusado. Assim, no dia seguinte Vito voltou acompanhado por Luca Brasi (Lenny Montana), um capanga, e apÃƒÂ³s uma hora ele assinou a liberaÃƒÂ§ÃƒÂ£o por apenas mil dÃƒÂ³lares, mas havia um detalhe: nas &quot;negociaÃƒÂ§ÃƒÂµes&quot; Luca colocou uma arma na cabeÃƒÂ§a do lÃƒÂ­der da banda. Agora, no meio da alegria da festa, Johnny quer falar algo sÃƒÂ©rio com Vito, pois precisa conseguir o principal papel em um filme para levantar sua carreira, mas o chefe do estÃƒÂºdio, Jack Woltz (John Marley), nem pensa em contratÃƒÂ¡-lo. Nervoso, Johnny comeÃƒÂ§a a chorar e Vito, irritado, o esbofeteia, mas promete que ele conseguirÃƒÂ¡ o almejado papel. Enquanto a festa continua acontecendo, Don Corleone comunica a Tom Hagen (Robert Duvall), seu filho adotivo que atua como conselheiro, que Carlo terÃƒÂ¡ um emprego mas nada muito importante, e que os &quot;negÃƒÂ³cios&quot; nÃƒÂ£o devem ser discutidos na sua frente. Os verdadeiros problemas comeÃƒÂ§am para Vito quando Sollozzo (Al Lettieri), um gÃƒÂ¢ngster que tem apoio de uma famÃƒÂ­lia rival, encabeÃƒÂ§ada por Phillip Tattaglia (Victor Rendina) e seu filho Bruno (Tony Giorgio). Sollozzo, em uma reuniÃƒÂ£o com Vito, Sonny e outros, conta para a famÃƒÂ­lia que ele pretende estabelecer um grande esquema de vendas de narcÃƒÂ³ticos em Nova York, mas exige permissÃƒÂ£o e proteÃƒÂ§ÃƒÂ£o polÃƒÂ­tica de Vito para agir. Don Corleone odeia esta idÃƒÂ©ia, pois estÃƒÂ¡ satisfeito em operar com jogo, mulheres e proteÃƒÂ§ÃƒÂ£o, mas isto serÃƒÂ¡ apenas a ponta do iceberg de uma mortal luta entre as &quot;famÃƒÂ­lias&quot;.\n","torrent":{"xt":"urn:btih:8faa718dc3a334103321df754c17ca4a13160bfc","amp;dn":"Poderoso+chefao+I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8faa718dc3a334103321df754c17ca4a13160bfc","infoHashBuffer":{"type":"Buffer","data":[143,170,113,141,195,163,52,16,51,33,223,117,76,23,202,74,19,22,11,252]},"announce":[],"urlList":[]}}