{"title":"Bob Gallion - Out Of A Honky Tonk - 1956-1959 - Bear Family CD","uid":5078453,"size":80322968,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9001b6bbce35b919e445dd18dcbd05a0a390f53e&amp;dn=Bob+Gallion+-+Out+Of+A+Honky+Tonk+-+1956-1959+-+Bear+Family+CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bonnie335","files":20,"time":1252073660,"description":"Out of a honky tonk contains tracks recorded for MGM from 1956 to 1959.\n\nThis collection contains Gallion's entire MGM output from the 1950s, including fantastic sides like &quot;Trademark On What I've Found,&quot; &quot;Hey, Mr. Bartender&quot; &amp; &quot;Baby, Love Me,&quot; as well as 4 unreleased sides\n\nBob Gallion never really made much of an impression on the country charts or on country history, but as Bear Family's 2000 compilation Out of a Honky Tonk proves, he didn't deserve to be ignored. He didn't really have any song that stood out from the pack -- perhaps that's the reason why he couldn't score a real hit while he was recording for MGM in the late '60s -- but he was a solid performer with a strong voice in the best honky tonk tradition. His 1956 single &quot;Hey, Mr. Bartender&quot; is an overlooked barroom gem that's ripe for revival, and there are several other songs -- &quot;Out of a Honky Tonk,&quot; &quot;Your Wild Life's Gonna Get You Down,&quot; &quot;You Gotta Have a Heartbreak (To Know How to Love)&quot; -- that are excellent, straight-ahead country in the vein of Hank Williams. Out of a Honky Tonk is augmented by a number of previously unreleased songs -- a total of five -- making this a complete overview of his waxings for MGM. This isn't necessarily revelatory material -- Gallion wasn't a lost major talent, just a singer who was, at his best, nearly excellent and at his worst, quite enjoyable -- but for anyone enamored of hardcore late-'50s country, this is a terrific listen.\n\nBear Family CD. Release:2000. Remastered.","torrent":{"xt":"urn:btih:9001b6bbce35b919e445dd18dcbd05a0a390f53e","amp;dn":"Bob+Gallion+-+Out+Of+A+Honky+Tonk+-+1956-1959+-+Bear+Family+CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9001b6bbce35b919e445dd18dcbd05a0a390f53e","infoHashBuffer":{"type":"Buffer","data":[144,1,182,187,206,53,185,25,228,69,221,24,220,189,5,160,163,144,245,62]},"announce":[],"urlList":[]}}