{"title":"Mystery in Space v1","uid":5086485,"size":2015033193,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:906e4688186512ea12ae83366683f21024587084&amp;dn=Mystery+in+Space+v1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"brodahisou","files":-1,"time":1252715130,"description":"The first volume of Mystery in Space was a science fiction anthology comic book series published by DC Comics.  The series ran for 110 issues from 1951 to 1966 and featured artwork by Murphy Anderson, Gil Kane, and many others, stories by John Broome, Gardner Fox, and others.\n\nMystery in Space published a variety of science fiction stories, and several science-fiction based heroes. It's best known for publishing the adventures of Adam Strange, but other features included Knights of the Galaxy, Interplanetary Insurance, Inc, Space Cabbie, Star Rovers, Hawkman, Space Ranger and Ultra the Multi-Alien.\n\nThe comic won several awards, including the 1962 Alley Award for Best Book-Length Story (&quot;The Planet That Came to a Standstill!&quot; in #75 by Gardner Fox and Carmine Infantino) and the 1963 Alley Award for Comic Displaying Best Interior Color Work.  \n\nIn 1980 and 1981, seven more issues continuing the original numbering were published by DC Comics (#111-117).\n\nAlso included is the Fireside Books 'Mysteries in Space: The Best of DC Science Fiction Comics' which reprints 11 stories from Mystery in Space, plus 13 stories from other DC science fiction comics.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:906e4688186512ea12ae83366683f21024587084","amp;dn":"Mystery+in+Space+v1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"906e4688186512ea12ae83366683f21024587084","infoHashBuffer":{"type":"Buffer","data":[144,110,70,136,24,101,18,234,18,174,131,54,102,131,242,16,36,88,112,132]},"announce":[],"urlList":[]}}