{"title":"Gospel Of John [2003] DivX [Verifire]","uid":5074712,"size":1369829420,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:90d9ee89307b79195103d428b55cbf4698e1ba23&amp;dn=Gospel+Of+John+%5B2003%5D+DivX+%5BVerifire%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"verifire","files":-1,"time":1251723809,"description":"Hi there..\n\nFirstly I'd like to tell you about a new Christian site:\n &lt;a href=&quot;\nhttp://www.blazefire.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.blazefire.org/&lt;/a&gt;\n\nRegistrations are open for a while. Safe, no ads, pure, non-denominational site.\n\nNow about this upload:\n\nLet me state a fact: THIS IS NOT COPYRIGHTED MATERIAL! JESUS PROHIBITED THAT! Let's stand accountable to Him, and not men, when it comes down to sharing the Gospel, right? Let's be men and women of God, and not mice..\n\nI found this rip on TPB, and joined the two chunks into one, consistent movie. Nice either you want to watch it on pc, TV or portable media. Thanks to &quot;bucky katt&quot; for the original upload. Nice rip! :-)\n\nSlightly altered original Upload info: Runtime: 180 min. Audio: English\n\n&quot;This widely acclaimed motion picture is a meticulous recreation of the turbulent era of Jesus and the events that changed the course of history! Narrated by Golden Globe nominee Christopher Plummer (Best Supporting Actor, AMERICAN TRAGEDY, 2000), it is the bold and powerful story of Jesus as told by his disciple John. The best-loved but least understood of the gospels, John presents a uniquely human portrait of courage and passion encompassing Jesus' entire ministry, the final years of his life, and His Ressurection. Intimate and reflective, THE GOSPEL OF JOHN offers an unparalleled opportunity to experience the incomparable life and times of Jesus Christ.&quot;\n\nPlease help us seed this movie further to others, and I don't mean for a day or two.. Leave it there for a month or more, and then it'll be alive by itself. \nBecause by then enough true, Bible-believing born-again Christians who see the value in spreading the Gospel will be aware of the upload and dedicate some broadband and some disk-space for this important task PERMANENTLY.. If you don't think it's that important, you'd better look at yourself and wonder..\n\nNow remember: John was there. He saw it. And it's an eye-witness' account you see in this epic movie, with the details John saw necessary to write down. In my opinion the best movie I've ever seen about Jesus of Nazareth, The Son of Man and God's Only Begotten Son, and the Saviour of this world.\nAll you have to do is call upon Him, and He'll come to you..\n\n&quot;John 20:30  And truly Jesus did many other signs in the presence of His disciples, which are not written in this book; (31) but these are written that you may believe that Jesus is the Christ, the Son of God, and that believing you may have life in His name.&quot;\n\nSo many will, maybe, miss events described by other Evangelists, like for instance Peter walking on the water with Jesus. I guess John didn't think that was so important compared to the other things he had seen and heard from or with Jesus. \n\nOr how the robber on one of the crosses begs Jesus to remember him when He came into His Kingdom. Only Luke mentions the repenting robber, but that doesn't mean that it didn't happen. The Gospel of Matthew doesn't mention that either, and He was a disciple of Jesus too, but he also, like John, says they both cursed and shouted blasphemies at Jesus, like John does. Just add Luke's detail from his Gospel to the other, and the whole picture and full truth become clear.\n\nLuke had interviewed a lot of eyewitnesses and people &quot;carefully investigating it all&quot;, to paraphrase him, and he had obviously heard testimony from someone who was there, that one of those beside Jesus had a change of heart as the process of crucifixion went on, and that's a fantastic story. Imagine the transformation inside this poor man's soul and heart..\n\nThere may be things like that that can make you wonder, but please do remember that John ends his Gospel with the words: &quot;And there are also many other things that Jesus did, which if they were written one by one, I suppose that even the world itself could not contain the books that would be written. Amen.&quot;\n\nThe Word of God says that the summary of His Word is the truth, and the Holy Spirit is ready to guide us on our way to the whole truth.. Jesus said that. In the Gospel of John.. :-)\n\nMay God grant this movie the presence of His Holy Spirit to everyone watching it, so as to present His Son to the hearts of anyone who long for true love, loyalty and understanding and another Kingdom to live in than the one &quot;they&quot; have made for us at present..\n\nThat was after all why the people behind this production collected money from Christians to make and distribute this movie: That the Good News should be spread around everywhere.. Enjoy it, but don't forget your duty, His bidding; to hand it on further.. :-)\n\nHumble, but happy greetings from Verifire.\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;a5d3c0d7ccc3ccd7c0c8c4ccc9e5c2c8c4ccc98bc6cac8&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:90d9ee89307b79195103d428b55cbf4698e1ba23","amp;dn":"Gospel+Of+John+%5B2003%5D+DivX+%5BVerifire%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90d9ee89307b79195103d428b55cbf4698e1ba23","infoHashBuffer":{"type":"Buffer","data":[144,217,238,137,48,123,121,25,81,3,212,40,181,92,191,70,152,225,186,35]},"announce":[],"urlList":[]}}