{"title":"The Covenant(2006)DVDRip.AC3(ENG)-DROCK","uid":6191485,"size":733543614,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:910ba29f2428316f6372e60db170293a00ee2b5d&amp;dn=The+Covenant%282006%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1298302562,"description":"An ancient secret threatens to unleash the powers of darkness on a group of modern prep school students when the sole survivor of a cursed bloodline returns to lay claim to the powers denied to him centuries ago in a supernatural teen thriller from director Renny Harlin and screenwriter J.S. Cardone. The story begins in 1692, when five families from the Ipswich Colony of Massachusetts formed a covenant of silence that would forever protect their remarkable powers. One family went too far, though, and as a result of their transgression they were forever banished from the land. Flash forward to the new millennium and the four Sons of Ipswich are now the student elite at the prestigious Spenser Academy. Bound by their sacred ancestry and sworn to silence, these four teens share a secret so remarkable that it has served to protect their families for hundreds of years. The past has a way of coming back when you least expect it though, and when the fifth Son of Ipswich returns seeking to harness the powers denied him in the past, the battle is on to ensure the safety of The Covenant and lay the one descendent who threatens to reveal their secret to rest once and for all. \n\nRipped with Handbrake.\n\nLength: 1 Hour 37 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:910ba29f2428316f6372e60db170293a00ee2b5d","amp;dn":"The+Covenant%282006%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"910ba29f2428316f6372e60db170293a00ee2b5d","infoHashBuffer":{"type":"Buffer","data":[145,11,162,159,36,40,49,111,99,114,230,13,177,112,41,58,0,238,43,93]},"announce":[],"urlList":[]}}