{"title":"Nazi Hunters van National Geographic Deel 1-4","uid":6223319,"size":1467676672,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:912836a68fa48cd0ff0542d49c79257e5d2a667b&amp;dn=Nazi+Hunters+van+National+Geographic+Deel+1-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"longdutchman2","files":5,"time":1299420799,"description":"In de achtdelige serie Nazi Hunters wordt de jacht op ontsnapte misdadigers uit de Tweede Wereldoorlog geopend, van de gedurfde Mossad-operatie, die leidde tot de ontvoering van Adolf Eichmann tot de arrestatie van Klaus Barbie in Bolivia. In de periode van chaos die volgde op het einde van de oorlog zijn veel nazi's naar het buitenland gevlucht en jarenlang onvindbaar gebleven. Met behulp van slachtoffers en professionele organisaties wordt onderzocht welke misdaden ze hebben begaan, hoe ze ontsnapten en waar ze zich bevonden.\n\n\nDeze torrent bevat deel 1-4\n\n\nOverzicht van de complete serie:\n\n\nNazi Hunters: Cukurs\nHerbert Cukurs, 'de Beul van Riga', vluchtte aan het eind van WWII naar BraziliÃƒÂ« om zijn straf te ontlopen. In 1965 spoorde de Mossad hem op.\n\nNazi Hunters: Eichmann\nAdolf Eichmann was een van de architecten van Hitler's EndlÃƒÂ¶sung. Deze documentaire toont hoe hij werd opgespoord en in IsraÃƒÂ«l werd berecht.\n\nNazi Hunters: Barbie\nNa zijn collaboratie met Amerikaanse spionnen ontsnapte de hoge Gestapo-officier Klaus Barbie na de oorlog. Zou hij ooit worden berecht?\n\nNazi Hunters: Priebke\nABC-verslaggever Sam Donaldson heeft SS-kapitein Priebke opgespoord. Tijdens WWII was hij medeverantwoordelijk voor de moord op 335 Italianen.\n\nNazi Hunters: Mengele\nIn 1985 slaagden de IsraÃƒÂ«li's er eindelijk in de kamparts van Auschwitz, Joseph Mengele, in Zuid-Amerika op te sporen. Maar was het echt Mengele?\n \nNazi Hunters: Lischka\nGestapo-officier Kurt Lischka deporteerde 73.000 Joden uit Parijs. Na de oorlog leefde hij als zakenman, totdat hij werd herkend.\n \nNazi Hunters: Touvier\nPaul Touvier leidde de Franse militaire politiemacht die met de nazi's collaboreerde. Hij stond bekend als de 'beul van Lyon'.\n  \nNazi Hunters: Stangl/Wagner\nNa een tip werd massamoordenaar Franz Stangl in BraziliÃƒÂ« aangehouden. Op zijn beurt leidde hij de detectives naar medecrimineel Gustav Wagner.\n\n","torrent":{"xt":"urn:btih:912836a68fa48cd0ff0542d49c79257e5d2a667b","amp;dn":"Nazi+Hunters+van+National+Geographic+Deel+1-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"912836a68fa48cd0ff0542d49c79257e5d2a667b","infoHashBuffer":{"type":"Buffer","data":[145,40,54,166,143,164,140,208,255,5,66,212,156,121,37,126,93,42,102,123]},"announce":[],"urlList":[]}}