{"title":"Son Volt - American Central Dust","uid":5010102,"size":77901731,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:91472bf4aaa31a6f092f038d7c5b91186105ed6e&amp;dn=Son+Volt+-+American+Central+Dust&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"redpoodle","files":14,"time":1247944399,"description":"Same as the other, just in mp3 this time (Lame V0).\n\n\n\nReview\tby Mark Deming\n\nJay Farrar resurrected Son Volt in 2005 after his solo career seemingly ran out of gas, and the two albums that followed -- Okemah and the Melody of Riot and The Search -- were the best and most compelling music he'd made since Son Volt's masterful debut Trace in 1995. However, the new albums didn't connect with an especially large audience, and the band was dropped by Sony/BMG; 2009's American Central Dust, the third set from Son Volt 2.0, has been released by the venerable independent roots music label Rounder Records, and while there's little telling if it was dictated by finance or esthetics, the album sounds austere in a way its immediate predecessors did not. Okemah and The Search found Farrar and his new bandmates edging into new musical territory while embracing a bigger studio sound; by comparison, American Central Dust feels more organic and intimate, recalling the simplicity of Trace without delivering the bracing rock &amp; roll of songs like &quot;Drown&quot; or &quot;Route.&quot; However, if American Central Dust takes a few steps back in terms of energy and impact, Farrar still sounds thoroughly engaged as both a songwriter and performer, and his band -- Chris Masterson on guitars, Mark Spencer on keyboards and steel guitars, Andrew DuPlantis on bass, and Dave Bryson on drums -- is tight and sympathetic, finding just the right angle to approach this material. And from the fiery love of &quot;Dynamite,&quot; the environmental and economic commentary of &quot;When the Wheels Don't Move,&quot; and &quot;Down to the Wire,&quot; the tribute to the joys of a good honky tonk in &quot;Jukebox of Steel,&quot; and the glimpse into Keith Richards' psyche of &quot;Cocaine and Ashes,&quot; Farrar has rarely spoken his mind so clearly in his songs as he does here, and if he still reaches for a spectral feel, his meanings are more clearly felt than ever. American Central Dust doesn't have the feel of a step into new territory the way Son Volt's past two albums did, but it consolidates old strengths and confirms Jay Farrar is still an artist worth caring about to 20 years after Uncle Tupelo cut their first album. \n\n\n  \t 1 Dynamite \t                2:49\n  \t 2 Down to the Wire     \t4:19\n  \t 3 Roll On \t                3:10\n  \t 4 Cocaine and Ashes \t        4:31\n  \t 5 Dust of Daylight \t        3:07\n  \t 6 When the Wheels Don't Move \t3:21\n  \t 7 No Turning Back         \t3:35\n  \t 8 Pushed Too Far        \t4:25\n  \t 9 Exiles \t                4:22\n  \t10 Sultana \t                3:48\n  \t11 Strength and Doubt   \t3:35\n  \t12 Jukebox of Steel     \t2:56\n\nIf you like it, go and buy a t-shirt from Son Volt!","torrent":{"xt":"urn:btih:91472bf4aaa31a6f092f038d7c5b91186105ed6e","amp;dn":"Son+Volt+-+American+Central+Dust","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91472bf4aaa31a6f092f038d7c5b91186105ed6e","infoHashBuffer":{"type":"Buffer","data":[145,71,43,244,170,163,26,111,9,47,3,141,124,91,145,24,97,5,237,110]},"announce":[],"urlList":[]}}