{"title":"Ballykissangel Series 2 (1997) [DVD Rip (Xvid)]","uid":5027444,"size":2937952256,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9176c2a83656efc5f756ef8dc315667818723664&amp;dn=Ballykissangel+Series+2+%281997%29+%5BDVD+Rip+%28Xvid%29%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"vajkos","files":-1,"time":1248770715,"description":"Ballykissangel's 1997 BBC and PBS season represents the full blossoming of its charming debut. Characters have grown and relationships have deepened in the small Irish village affectionately known among locals as &quot;BallyK.&quot; Despite the pastoral setting, hopes, disappointments, and intrigues flourish with implacable regularity: babies are conceived and miscarried, voices of friends are raised and quieted over pints, priests are both buddies and confessors. Ambition, survival, and the constancy of community are more important in Ballykissangel's thoughtful comedy than eccentricity (though there is certainly plenty of that). Think of this show as an Irish Northern Exposure, including appealing counterparts to some of that American series' key characters.\n\nIn &quot;For One Night Only,&quot; the Manchester, England-born Father Peter Clifford (Stephen Tompkinson) further complicates his ambiguous and professionally forbidden feelings for Assumpta Fitzgerald (Dervla Kirwan), the beautiful and sardonic pub owner, by playing a love scene with her. The ever-observant and long-suffering Father Peter also finds an abandoned baby on his doorstep in &quot;The Facts of Life,&quot; a sour irony for Niamh (Tina Kellegher) and Ambrose (Peter Hanly) Egan, the much-admired young couple who lose their first pregnancy from natural causes. Meanwhile, Niamh's father, the relentless contractor, Brian Quigley (Tony Doyle), continues his quest for the perfect scam, burying profits and inventing creative bribes to sway clients and officials. It speaks well of Ballykissangel's moral, if mellow, complexity that Brian, like Peter's nemesis, Father MacNally (Niall Toibin), can be appreciated for his full humanity regardless of his misdeeds.\n\nOther highlights: &quot;In the Can,&quot; in which the fiercely independent Assumpta goes out with a womanizing pop star despite advice to the contrary. &quot;Money, Money, Money&quot; finds Brian burned in a gambling scheme then seeking revenge through a charity poker tournament. The season finale, &quot;Chinese Whispers,&quot; concerns widespread paranoia when two mysterious government investigators show up. The episode is quite funny, and ultimately reassuring about all that is soulful and good in BallyK. --Tom Keogh\n\nProduct Description\nLife is a challenge for any priest in a small mountain town, and Father Peter Clifford struggles to save his parishioners' souls without falling himself...for the local barkeep, Assumpta Fitzgerald.","torrent":{"xt":"urn:btih:9176c2a83656efc5f756ef8dc315667818723664","amp;dn":"Ballykissangel+Series+2+%281997%29+%5BDVD+Rip+%28Xvid%29%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9176c2a83656efc5f756ef8dc315667818723664","infoHashBuffer":{"type":"Buffer","data":[145,118,194,168,54,86,239,197,247,86,239,141,195,21,102,120,24,114,54,100]},"announce":[],"urlList":[]}}