{"title":"Restless Heart - Big Iron Horses 1992 [FLAC] - Kitlope","uid":5011996,"size":258469075,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:92840d48770a630bda01185e518d8ee4f896c253&amp;dn=Restless+Heart+-+Big+Iron+Horses+1992+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Kitlope","files":14,"time":1248037655,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 92840D48770A630BDA01185E518D8EE4F896C253\nFile Size: 246.49 Mb\nYear: 1992\nLabel:  RCA\nCatalog #: 66049-2RE\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nRestless Heart is an American country music band established in 1984. The band's original members were John Dittrich (drums, background vocals), Paul Gregg (bass guitar, background vocals), Dave Innis (piano, keyboards, rhythm guitar, background vocals), Greg Jennings (lead guitar, background vocals), and Verlon Thompson (lead vocals). Thompson was replaced with Larry Stewart shortly before Restless Heart was signed to a recording contract with RCA Records in 1984.\n\nThroughout the 1980s and into the early 1990s, the band saw considerable crossover success in both country music, pop and adult aontemporary (AC) formats. Stewart and Innis left in 1992 and 1993 respectively, with Stewart beginning a solo career on RCA. By 1996, the three remaining members had disbanded. Except for a brief reunion for one album in 1998, the band remained inactive until 2002, when Dittrich, Gregg, Innis, Jennings, and Stewart all reunited. Two years later, they released Still Restless, the first album since 1990 to utilize the entire five-piece lineup, on Koch Records. This album produced one more country chart single before the label's closure.\n\nOverall, Restless Heart has released seven studio albums, two greatest hits albums, and a live album which is only available on their website. Their second through fifth albums are all certified gold by the RIAA. Twenty-six of their singles have entered the Billboard country charts, including six Number One hits. Two more singles were released only to the Adult Contemporary format, with the higher-peaking of those two being the Number One &quot;Tell Me What You Dream&quot;, a collaboration with saxophonist Warren Hill in 1993. Their greatest crossover hit with country and pop music fans is the single &quot;When She Cries&quot; which was released in late 1992.\n\n\n\n\nBig Iron Horses 1992\n\n\nBig Iron Horses is the fifth studio album by American country music group Restless Heart. It was released by RCA Records in 1992. &quot;When She Cries,&quot; &quot;Mending Fences,&quot; &quot;We Got the Love&quot; and the title track were released as singles. The album reached #26 on the Top Country Albums chart[1] and has been certified Gold by the RIAA.[2] This is also the band's first album not to feature lead singer Larry Stewart, who left in 1991. John Dittrich, Dave Innis, and Paul Gregg alternate as lead vocalists on this album.\n\n\nTracks:\n\n\n1.\t&quot;Mending Fences&quot; (Jim Robinson, Andy Byrd) - 2:51 \n2.\t&quot;We Got the Love&quot; (Steve Bogard, Rick Giles) - 2:49 \n3.\t&quot;As Far as I Can Tell&quot; (Bruce Gaitsch, Dave Innis) - 3:49 \n4.\t&quot;When She Cries&quot; (Marc Beeson, Sonny LeMaire) - 3:43 \n5.\t&quot;Meet Me on the Other Side&quot; (Paul Gregg, Innis) - 4:09 \n6.\t&quot;We're Gonna Be O.K.&quot; (Gaitsch, Innis, Josh Leo, Vince Melamed, Timothy B. Schmit) - 4:04 \n7.\t&quot;Blame It on Love&quot; (Tommy Burroughs, Bernie Leadon, Jimmy Davis) - 3:30 \n8.\t&quot;Born in a High Wind&quot; (Walt Aldridge, Gary Baker, Susan Longacre) - 4:09 \n9.\t&quot;Just in Time&quot; (Gaitsch, Innis) - 4:03 \n10.\t&quot;Big Iron Horses&quot; (John Dittrich, Innis, Carl Marsh, Melamed) - 4:29 \n\n\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:92840d48770a630bda01185e518d8ee4f896c253","amp;dn":"Restless+Heart+-+Big+Iron+Horses+1992+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92840d48770a630bda01185e518d8ee4f896c253","infoHashBuffer":{"type":"Buffer","data":[146,132,13,72,119,10,99,11,218,1,24,94,81,141,142,228,248,150,194,83]},"announce":[],"urlList":[]}}