{"title":"Zeitgeist: Moving Forward Promo DVD5 (custom NLSubs) NLT-Release","uid":6151954,"size":4681306683,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:92d22aa0379b6b6415aae1b9bef6cbec70a48f9f&amp;dn=Zeitgeist%3A+Moving+Forward+Promo+DVD5+%28custom+NLSubs%29+NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nlt-Release-XX-Men","files":-1,"time":1296864053,"description":"Zeitgeist: Moving Forward Promo DVD5 (custom NLSubs) NLT-Release\n\n[img]http://img204.imageshack.us/img204/3884/zeitgeist.jpg[/img]\n\nSinds 2007 is Zeitgeist een ware internet blockbuster. Zeitgeist is een maatschappelijk kritische film serie waarvan tot op heden twee delen van uitgekomen zijn. Deze films hebben op internet meer dan 50 miljoen hits te pakken. De laatste release was in 2008, Zeitgeist Addendum. Het derde deel zal op 15 januari 2011 uitgegeven worden aan bioscopen. Dat vrijgegeven zal worden met de titel: Zeitgeist Moving Forward.\nThe Zeitgeist Movement telt al meer dan 500,000 leden wereldwijd en de mass-awareness groeit exponentieel. Join the movement! Bekijk de homepage of ga direct naar de Nederlandse Chapter van de Zeitgeist Movement op zmnetherlands(.)com\n****************************************\n\nZeitgeist: Moving Forward, by director Peter Joseph, is a feature length documentary work Which presents a case for a compromise Needed transition out of the current socio-economic paradigm Monetary Which Governs the entire world society.\n\nThis subject matter transcends the issues or compromise Cultural Relativism and traditional ideology and move to the related one core, empirical &quot;ground life&quot; attributes of human and social survival, extrapolating Those immutable natural laws enter a new sustainable social paradigm called a &quot;Resource-Based Economy &quot;.\nSince 2007, Zeitgeist, a true Internet blockbuster. Zeitgeist is a socially critical film series which to date have released two parts. These films have more than 50 million hits web address. The last release was in 2008, Zeitgeist Addendum. The third part will be issued on January 15, 2011 to cinemas. This release will be titled: Zeitgeist Moving Forward.\nThe Zeitgeist Movement counts more than 500,000 members worldwide and the mass-awareness is growing exponentially. Join the movement! Check out the homepage or go directly to the Dutch Chapter of the Zeitgeist Movement at zmnetherlands (.) com\nThis is the future! A must see!\n\nIMBD rating: 9.2/10\nMovieMeter: 5.0/5.0\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Promo Retail \nOndertitels : Anders\nNederlands (instelbaar)\nEngels (instelbaar) \nGenre : Documentaire\n \nWeblink : http://www.zeitgeistmovingforward.com/ \n\nEnjoy the movie\n\nBy XX-Men\n\n","torrent":{"xt":"urn:btih:92d22aa0379b6b6415aae1b9bef6cbec70a48f9f","amp;dn":"Zeitgeist%3A+Moving+Forward+Promo+DVD5+%28custom+NLSubs%29+NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92d22aa0379b6b6415aae1b9bef6cbec70a48f9f","infoHashBuffer":{"type":"Buffer","data":[146,210,42,160,55,155,107,100,21,170,225,185,190,246,203,236,112,164,143,159]},"announce":[],"urlList":[]}}