{"title":"Linux Bible 2010 Edition-BBL","uid":5514529,"size":9083245,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93002549b46025ff9c18fba2782ce4848f4e8b62&amp;dn=Linux+Bible+2010+Edition-BBL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MAFIAA.","files":-1,"time":1272205094,"description":"Boot Up to Ubuntu, Fedora, KNOPPIX, Debian,\nopenSUSE, and 13 Other Distributions (c) by Wiley\n\nThe type of the release is: eBook\nIn the PDF format with ISBN: 0470485051 and Pub Date: December 14, 2009\nThe size of the release is: 11mb\nAnd released on: 03/14/2010\n\n\nThe definitive guide to the basics of one of the most popular operating\nsystems in the worldWhether you're a first-time Linux user or you're\nmigrating from another operating system, this book is an ideal\nintroductory guide for getting comfortable with the building-block\nnature of Linux. Written by bestselling author Christopher Negus, this\nguide is packed with in-depth descriptions on the basics of Linux\ndesktops, servers, and programming tools and gets you up to speed on all\nthe new and exciting features of the newest version: Linux 2010.\n\nNegus walks you through transitioning from Windows or Mac and helps you find\nthe Linux distribution that best meets your needs.You'll explore more\nthan 18 Linux distributions, including the latest versions of Ubuntu,\nFedora, Debian, OpenSUSE, Slackware, Knoppix, Gentoo, Mandriva, SLAX,\nand more. Plus, you'll discover how to set up secure, fully functioning\nLinux server systems and get up-to-date installation advice.Topics\nCovered:Getting off the Ground with LinuxRunning a Linux DesktopLearning\nSystem Administration SkillsSetting Up Linux ServersChoosing and\nInstalling Different Linux DistributionsProgramming in LinuxLinux Bible\n2010 Edition walks you through the details of the various Linux\ndistributions and updates you on the latest networking, desktop, and\nserver enhancements.\n","torrent":{"xt":"urn:btih:93002549b46025ff9c18fba2782ce4848f4e8b62","amp;dn":"Linux+Bible+2010+Edition-BBL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93002549b46025ff9c18fba2782ce4848f4e8b62","infoHashBuffer":{"type":"Buffer","data":[147,0,37,73,180,96,37,255,156,24,251,162,120,44,228,132,143,78,139,98]},"announce":[],"urlList":[]}}