{"title":"Bones S06E12 HDTV.XviD DutchReleaseTeam (dutch subs nl)","uid":6155428,"size":367205737,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:935f4d40c2d53ea0ca8a0159077f0914f5e85415&amp;dn=Bones+S06E12+HDTV.XviD+DutchReleaseTeam+%28dutch+subs+nl%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Koedje","files":-1,"time":1297019223,"description":"\n\nPlot:\n\nTemperance Brennan is als forensisch antropologe werkzaam op het Jeffersonian Institute. Samen met haar team van uitermate getalenteerde wetenschappers helpt ze de FBI om moordzaken op te lossen. Niet alleen oude, onopgeloste moordzaken worden opgelost, maar ook recente moordzaken. Tijdens haar werk voor de FBI werkt ze samen met Seeley Booth (David Boreanaz). Tussen de FBI en het Jeffersonian Institute bestaan soms onenigheden, zoals die ook tussen Brennan (en haar team) en Booth bestaan. Maar uiteindelijk lossen de twee partijen de zaken altijd weer op.\n\n\nSeizoen 6 Aflevering 12: The Sin in the Sisterhood\n\n\nA body disguised as a scarecrow is found with a bullet wound in a remote cornfield, and the team is forced to work against the clock to avoid a storm and potential complications that would affect the evidence. Booth and Brennan interrogate the victim's three wives, who are also sisters, and learn that jealousy between the sisters and their desire for their husband's attention had caused a major rift in the family. Booth and Brennan also question one relative who disapproved of the victim's polygamy. Meanwhile, Cam loses confidence in her relationship with her on-call doctor boyfriend, but they both realize they need to make their relationship a priority. \n\n\n\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.nl\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:935f4d40c2d53ea0ca8a0159077f0914f5e85415","amp;dn":"Bones+S06E12+HDTV.XviD+DutchReleaseTeam+%28dutch+subs+nl%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"935f4d40c2d53ea0ca8a0159077f0914f5e85415","infoHashBuffer":{"type":"Buffer","data":[147,95,77,64,194,213,62,160,202,138,1,89,7,127,9,20,245,232,84,21]},"announce":[],"urlList":[]}}