{"title":"America and the Holocaust - Deceit and Indifference (PBS America","uid":4994012,"size":733672339,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:93b8cb08d9e15a8ccbb4e37966b69a7ddf6ca382&amp;dn=America+and+the+Holocaust+-+Deceit+and+Indifference+%28PBS+America&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1247186696,"description":"America and the Holocaust: Deceit and Indifference (1994)\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1025kbps \nDuration.............: 1:25:04\nResolution...........: 528*400 \nFramerate............: 29.970 \nAudio Codec..........: 0x0055 MPEG-1 Layer 3 \nAudio Bitrate........: 110 kbps VBR \nAudio Channels.......: 2 \nFilename.............: America and the Holocaust.avi \nFilesize.............: 733,464,576\nNo Subtitles\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0195518/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0195518/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.pbs.org/wgbh/amex/holocaust/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/wgbh/amex/holocaust/&lt;/a&gt;\n\nIn 1937, a 17-year-old German Jew named Kurt Klein emigrated to the US to escape the growing discrimination against Jews that had become a terrible fact of life following Hitler's rise in 1933. Together with his brother and sister, who had emigrated previously, Klein worked to establish himself so that he could obtain safe passage for his parents out of Germany. America and the Holocaust uses the moving tale of Klein's struggles against a wall of bureaucracy to free his parents to explore the complex social and political factors that led the American government to turn its back on the plight of the Jews. The film is produced by Martin Ostrow. Hal Linden narrates.\n\nIn 1938, American society had its own political, social, and economic problems, including a long-standing--and rising--anti-Semitism. Despite stories coming from Europe about a campaign to force Jews out of Germany and about the horrors of Kristallnacht (&quot;the night of broken glass&quot;), the majority of Americans were fearful that an influx of immigrants would only aggravate the serious unemployment problem brought on by the Depression.\n\nMore than 100 anti-Semitic organizations blanketed the US with propaganda blaming Jews for all America's ills. Businesses discriminated against Jews, refusing them jobs. Signs at private beaches bore the words &quot;No Jews or Dogs allowed&quot; and certain hotels and housing developments proudly proclaimed themselves &quot;Restricted.&quot; Even the government was not immune from anti-Semitic sentiments. While the Kleins were struggling to obtain visas from the American consulate, the State Department ordered its consuls to stall the process.\n\n&quot;Even though we continued our attempts to get our parents out--because we knew that they were in the unoccupied part of France which was still not totally under German control--everything we did for them turned into nothing,&quot; recalls Kurt Klein.\n\n&quot;The State Department probably had a greater degree of anti-Semitism than others, particularly in the immigration section,&quot; says former Treasury Department employee Edward Bernstein. &quot;Their attitude was, `If we're patient, we find that the problems of the Jews in Germany are not really life-threatening.&quot;\n\nBut for Kurt Klein and other German-American Jews with relatives overseas, patience was a commodity they couldn't afford. By the end of 1941, the Nazis had murdered half a million Jews. Although trains regularly headed to fully operational killing centers by the spring of 1942, the &quot;final solution&quot; was still a well-guarded secret. That summer the State Department was advised by Gerhart Reigner, the representative of a Jewish organization in Geneva, of Nazi plans to exterminate all the Jews in Europe. Their response was to dismiss the information, calling it &quot;a wild rumor inspired by Jewish fears.&quot;\n\n&quot;The State Department was actively blocking information about the genocide, &quot; says historian David Wyman. &quot;Roosevelt refused to focus on the issue. The American churches were largely silent...and the press had little to say--and buried that little on the inner pages. So it fell to Jewish activists to bring the information to the American public.&quot;\n\nIt took protests and petitions from Jewish organizations and finally the Treasury Department, headed by Henry Morgenthau, to uncover the State Department's deliberate obstruction of rescue. &quot;Secretary Morgenthau, who valued above all else his relationship with the president, nevertheless felt he had to put himself on the line and be the spokesman on this issue,&quot; recalls John Pehle of the Treasury Department.\n\nAt last, on January 16, 1944, President Franklin Roosevelt met with Morgenthau in the Oval Office. Six days later, Roosevelt officially reversed the government's policy of obstruction. He signed Executive Order 9417, creating the War Refugee Board, which was instructed to &quot;take all measures to rescue victims of enemy oppression in imminent danger of death.&quot;\n\n&quot;In the end, the War Refugee Board played a vital role in saving the lives of 200,000 Jews,&quot; says Wyman, &quot;a very valuable contribution, to be sure. But the number is terribly small compared to the total of six million killed. The Board did prove that a few good people--Christians and Jews--could finally break through the walls of indifference. The great shame is that if Roosevelt had created the board a year earlier [it] could have saved tens of thousands, even hundreds of thousands more--and in the process, have rescued the conscience of the nation.&quot; ","torrent":{"xt":"urn:btih:93b8cb08d9e15a8ccbb4e37966b69a7ddf6ca382","amp;dn":"America+and+the+Holocaust+-+Deceit+and+Indifference+%28PBS+America","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93b8cb08d9e15a8ccbb4e37966b69a7ddf6ca382","infoHashBuffer":{"type":"Buffer","data":[147,184,203,8,217,225,90,140,203,180,227,121,102,182,154,125,223,108,163,130]},"announce":[],"urlList":[]}}