{"title":"SnowFox Total Video Converter 2.8.1","uid":6205305,"size":19610288,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:943841782d8976d784ad6df35d14c3313e1c3736&amp;dn=SnowFox+Total+Video+Converter+2.8.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HobbitGamez","files":-1,"time":1298773661,"description":"SnowFox Total Video Converter 2.8.1\n\n\nSnowFox Total Video Converter is an easy-to-use video converter software with which you could easily convert videos between most popular video formats (including HD/SD video and flash video) with lossless videoand fast conversion speed.\n\nAs a versatile video converter, SnowFox Total Video Converter is expert at converting HD videos like AVCHD, and SD videos like AVI, MP4, WMV, MOV, MPEG, MKV and Xvid with perfect output quality and high conversion speed. With it, you could convert among various video formats for playback on iPad, iPod (including the latest iPod Touch 4), iPhone 4 (iOS 4), Apple TV, PSP, Blackberry, Android Phone, PMP, Xbox 360, Playstation 3, Nintendo Wii and Mobile Phones with superior images and video quality.\n\nThis software for Microsoft Windows XP or later is compatible with 32 and 64-bit operating systems, and no install is required. Just make a shortcut from the executable and place it on your desktop. Several pre-configured profiles are included (all of the devices listed above) and can be utilized with one-click, while more advanced options are also available. If this software works successfully for you, be sure to let others know. Enjoy and please seed!\n\n\n-wiiGM","torrent":{"xt":"urn:btih:943841782d8976d784ad6df35d14c3313e1c3736","amp;dn":"SnowFox+Total+Video+Converter+2.8.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"943841782d8976d784ad6df35d14c3313e1c3736","infoHashBuffer":{"type":"Buffer","data":[148,56,65,120,45,137,118,215,132,173,109,243,93,20,195,49,62,28,55,54]},"announce":[],"urlList":[]}}