{"title":"The Pope in Winter: The Dark Face of John Paul II's Papacy","uid":6154425,"size":253538923,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:94627ce67c38e8a5f9e81241627affdf1a8ea366&amp;dn=The+Pope+in+Winter%3A+The+Dark+Face+of+John+Paul+II%5C%27s+Papacy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":38,"time":1296952600,"description":"John cornwell - The Pope in Winter: The Dark Face of John Paul II's Papacy (unabridged) - Read by Stephen Thorne\n\n\nSource CD\nDuration approx 11:42 hours \nFhG MPEG 1 Layer III 48 Kbps CBR \n44100Hz, 16-bit, Mono\n\n\nThe book\n\nThe Late John Paul II was portrayed by admirers as one of history's great popes. But in The Pope in Winter, leading Vatican expert John Cornwell seriously questions the workings of his papacy and points to fundamental flaws - exacerbated by age and infirmity - that have alarming consequences for both the Catholic Church's future and John Paul II's successor.\n\n\nThe author\n\nJohn Cornwell is the author of two best-selling books on the papacy: A Thief in the Night: the Mysterious Death of John Paul I; and Hitler's Pope: The Secret History of Pius XII. His Breaking Faith, a study of the Catholic Church at the millennium, was widely acclaimed. For fifteen years he has reported the Vatican for the Sunday Times, and for Vanity Fair in New York, and is a regular writer in the Catholic international weekly, The Tablet. He lives in London, Cambridge and Northamptonshire.\n\n\nThe reader\n\nStephen Thorne is a British actor of radio, film, stage and television. He trained at the RADA and after a time in weekly rep. he played several seasons with the Old Vic Company and the RSC in Stratford and London including a tour to Russia. He has worked extensively in radio with over 2000 broadcasts for the BBC including Uncle Mort in the Radio 4 comedy series by Peter Tinniswood. ... His television credits include Z Cars, Crossroads and Doctor Who. In Doctor Who he has played three major villains (Omega, Azal and Eldrad), as well as an Ogron. On radio he appeared in the BBC Radio 4 adaptation of The Lord of the Rings playing the voice of Treebeard, and also in their adaptation of Terry Pratchett's Guards! Guards! in which he portrayed Fred Colon (and also Death). He is also renowned for audio book narration.\n\nOther television work includes Death of an Expert Witness, David Copperfield and Last of the Summer Wine. His was the voice of Aslan in the animated version of The Lion The Witch And The Wardrobe IMDB. He has given many poetry readings on radio, television and tape and in venues from Westminster Abbey to various pubs.\n\nHe has recorded over 300 un-abridged audiobooks which have earned critical acclaim in both the UK and the USA. Awards include a Talkies Award 1996 for Enigma by Robert Harris and several Golden Earphones Awards from Audiofile Magazine.","torrent":{"xt":"urn:btih:94627ce67c38e8a5f9e81241627affdf1a8ea366","amp;dn":"The+Pope+in+Winter%3A+The+Dark+Face+of+John+Paul+II%5C%27s+Papacy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94627ce67c38e8a5f9e81241627affdf1a8ea366","infoHashBuffer":{"type":"Buffer","data":[148,98,124,230,124,56,232,165,249,232,18,65,98,122,255,223,26,142,163,102]},"announce":[],"urlList":[]}}