{"title":"Frank Zappa - The Man From Utopia TQMP","uid":5133488,"size":360802090,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:947face226c7e3495da5886212c2ec4688743ed8&amp;dn=Frank+Zappa+-+The+Man+From+Utopia+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":34,"time":1256318995,"description":"This album presents a mix of studio tracks and altered live recordings from Frank Zappa's hard rock period. The tone is definitely less rock-oriented than on Them or Us, only &quot;Stick Together&quot; and &quot;Cocaine Decisions&quot; qualifying as such. The most noticeable trend here is the half-spoken half-sung free-form numbers &quot;The Radio Is Broken,&quot; &quot;The Dangerous Kitchen,&quot; and &quot;The Jazz Discharge Party Hats.&quot; They all feature Zappa performing a written text or improvising one on the spot, speech-singing while the band wallops around, reacting to his words. A few instrumental tunes round out the set, including the superb &quot;Moggio&quot; and &quot;Tink Walks Amok,&quot; with Arthur Barrow playing multiple bass parts. The album's title comes from a '50s song, included (&quot;The Man From Utopia Meets Mary Lou [Medley]&quot;), while the cover artwork alludes to an infamous Italian tour in 1982 plagued by mosquitoes and riots. There exists two different CD versions of this album. All reissues of the original 1983 LP in digital format before 1992 present a slightly remixed version. Post-1992 CDs feature an extensive remix, the track list has been modified, a bonus track added (&quot;Luigi &amp; The Wise Guys&quot;), and different drum tracks recorded in the mid-'80s by Chad Wackerman have replaced the original live ones in &quot;The Dangerous Kitchen&quot; and &quot;The Jazz Discharge Party Hats.&quot; Despite of these changes, The Man From Utopia retains the cold digital sound of Zappa's albums around this time but is more varied and engaging than Them or Us. \n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:                 &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)\n\t\t","torrent":{"xt":"urn:btih:947face226c7e3495da5886212c2ec4688743ed8","amp;dn":"Frank+Zappa+-+The+Man+From+Utopia+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"947face226c7e3495da5886212c2ec4688743ed8","infoHashBuffer":{"type":"Buffer","data":[148,127,172,226,38,199,227,73,93,165,136,98,18,194,236,70,136,116,62,216]},"announce":[],"urlList":[]}}