{"title":"Rainwater_Collection_for_the_Mechanically_Challenged-DVDRip","uid":6135063,"size":606910560,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:94ab8f04d3f93f2bd500a756bf36d40d40eb6963&amp;dn=Rainwater_Collection_for_the_Mechanically_Challenged-DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"das_wookie","files":-1,"time":1296271215,"description":"Rainwater Collection instructional Video filled with humorous and helpful info from the folks at Tank Town!\n\nDVD Details: &lt;a href=&quot;\nhttps://rainwatercollection.com/store/index.php?searchkey=dvd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://rainwatercollection.com/store/index.php?searchkey=dvd&lt;/a&gt;\n\nRainwater Collection Addendum - Roofwasher Eliminator!\n\nFirst we wrote the hilarious (but very instructional) book; now here comes the DVD. This is a clip from the 43 minute video that you can purchase at http://www.rainwatercollection.com\n\nWHY, OH, WHY? Because...Rainwater has a hardness of ZERO. No chlorine. No salt-spewing softeners. No ground-water contaminants. You'll use less detergent, your skin will feel great, and your heart will soar with freedom and independence.\n\nHOW, OH, HOW? It ain't brain surgery. All it takes for you to install your own rainwater collection system is a combination of common sense, moderate coordination between brain and hands, some money, a good idea where the plumbing supply store is, and this video.\n\nYou'll learn how to size your system, position your tank, install a roof washer, glue together PVC pipe, dig trenches, install a filtration system and SO MUCH MORE!\n\nOh the fun you'll have...\n\n\n\nAfter installing hundreds of systems over the last decade, Tank Town has simplified rainwater collection to five easy pieces:\n\n1. Collection surface and gutters: Metal roofs are ideal collection surfaces, but we've installed systems on houses with asphalt shingles, clay tiles, and even cedar shakes. Remember when you're estimating the size of your collection surface to base it not on the square footage of your house or even the square footage of your roof, but on the square footage of the footprint of your house. As for gutters, the half-round style is best for the smoothest water flow. Also, remember to screen your downspouts to keep as much large debris as possible from entering the system.\n\n2. Roof washer: A roof washer doesn't wash the roof, but instead either screens out debris before it can enter your tank or else diverts the first, dirtiest wash of water from the roof. While the type that screens out gunk is very effective, it is also maintenance intensive; if you don't religiously clean the filter between rain events, you can create a breeding ground for cooties and/or greatly inhibit the flow of rainwater into your collection tank. Cost: $500-$1500.\n\n3. Collection Tank: We have yet to find a more universally appropriate and reliable collection tank than the fiberglass variety. While it may not be as handsome as a metal or stone cistern, it makes up for it with versatility, hardiness and affordability. One great feature is that the fittings are integral to the tank, so there's no risk of leaking at these vulnerable spots. Plus they can be painted with latex house paint to either camouflage or celebrate them. Remember when siting and placing your tank that water weighs over eight pounds per gallon. With a 10,000-gallon tank tipping the scales at a whopping 40 tons, you'll it want it sitting on a smooth, flat surface. Cost: around $6000 for a 10,000-gallon tank approved for potable water storage.\n\n4. Pump: For many residential situations, we recommend a Grundfos MQ. The Grundfos is especially sweet, since it doesn't require a separate pressure tank (it's built in) and it's rated specifically for use with rainwater. In situations requiring greater flow and pressure, we have an arsenal of powerful pumps to choose from. Cost: $550 and up.\n\n5. Filtration and Disinfection: We are devoted fans of the following trio of treatment components: a 5-micron sediment filter, followed by a 3-micron activated charcoal filter, followed by a Atlantic Ultraviolet Light that can handle a flow up to 12 gpm. Once again, proper maintenance is paramount. You must change the sediment filter every month ($3 each), the charcoal filter every three months ($10 each), and the UV light bulb ($75) must be replaced every fourteen months whether you think it's burning brightly or not. Cost: $800 and up.\n","torrent":{"xt":"urn:btih:94ab8f04d3f93f2bd500a756bf36d40d40eb6963","amp;dn":"Rainwater_Collection_for_the_Mechanically_Challenged-DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94ab8f04d3f93f2bd500a756bf36d40d40eb6963","infoHashBuffer":{"type":"Buffer","data":[148,171,143,4,211,249,63,43,213,0,167,86,191,54,212,13,64,235,105,99]},"announce":[],"urlList":[]}}