{"title":"La.Ultima.Estacion.2009.BRSCR.SPANiSH.MiC.XViD.[MazoPelis]","uid":5622651,"size":2073212928,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:94e3b4a9bb6efd4836f014d23f18cd9617dd6ef2&amp;dn=La.Ultima.Estacion.2009.BRSCR.SPANiSH.MiC.XViD.%5BMazoPelis%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"gamolama","files":1,"time":1276340677,"description":"Reparto\nJames McAvoy, Christopher Plummer, Helen Mirren, Anne-Marie Duff, Patrick Kennedy\nDirector\nMichael Hoffman\nProductor\nBonnie Arnold, Chris Curling, Jens Meurer\nDuraciÃƒÂ³n\n01:52:00\nEstreno\nviernes 11 junio 2010\nGÃƒÂ©nero\nDrama\nPaÃƒÂ­s\nAlemania,Reino Unido,Rusia\nDistribuidora\nSony Pictures\n\n\nSinopsis\n\nDespuÃƒÂ©s de casi cincuenta aÃƒÂ±os de matrimonio, la Condesa SofÃƒÂ­a, esposa devota, amante apasionada, musa y colaboradora de LeÃƒÂ³n TolstÃƒÂ³i, descubre de repente que su mundo se tambalea. En nombre de la nueva religiÃƒÂ³n que acaba de crear, el gran novelista ruso renuncia a su tÃƒÂ­tulo nobiliario, a sus propiedades e incluso a su familia en favor de la pobreza, el vegetarianismo y el celibato.\n\nSofÃƒÂ­a se consume con justificada indignaciÃƒÂ³n cuando descubre que el leal discÃƒÂ­pulo de TolstÃƒÂ³i, Vladimir Chertkov, a quien ella desprecia, puede haber convencido a su marido para que haga un nuevo testamento. El documento le darÃƒÂ­a los derechos de sus obras al pueblo ruso en vez de a su propia familia. Utilizando toda su astucia y todas las armas de seducciÃƒÂ³n de su considerable arsenal, SofÃƒÂ­a lucha ferozmente por lo que ella cree que le corresponde. Sin embargo, su comportamiento extremo hace que le sea mÃƒÂ¡s fÃƒÂ¡cil a Cherkov convencer a TolstÃƒÂ³i del daÃƒÂ±o que le harÃƒÂ¡ a su glorioso legado. El conflicto se vuelve tan intenso que TolstÃƒÂ³i, a los 82 aÃƒÂ±os, el personaje mÃƒÂ¡s mediÃƒÂ¡tico del mundo, abandona su casa en mitad de la noche, mientras su mujer alquila un tren para seguirle por toda Rusia.\n\nEn este campo minado se mueve el honorable nuevo ayudante de TolstÃƒÂ³i, el naif ValentÃƒÂ­n Bulgakov, convirtiÃƒÂ©ndose en un tÃƒÂ­tere, primero del intrigante Chertkov y luego de la herida y vengativa SofÃƒÂ­a, en los intentos de ambos por socavar los logros del otro. Complicando aÃƒÂºn mÃƒÂ¡s la vida de ValentÃƒÂ­n estÃƒÂ¡ la irrefrenable pasiÃƒÂ³n que siente por Masha, un alma librepensadora que comparte los ideales de TolstÃƒÂ³i, cuya postura poco convencional respecto al sexo y al amor, le imponen y le confunden. AtraÃƒÂ­do por las ideas de TolstÃƒÂ³i acerca del amor ideal, pero desconcertado por el rico y turbulento matrimonio de ÃƒÂ©ste, ValentÃƒÂ­n no tiene lo que hay que tener para poder lidiar con las complicaciones del amor en el mundo real.","torrent":{"xt":"urn:btih:94e3b4a9bb6efd4836f014d23f18cd9617dd6ef2","amp;dn":"La.Ultima.Estacion.2009.BRSCR.SPANiSH.MiC.XViD.%5BMazoPelis%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94e3b4a9bb6efd4836f014d23f18cd9617dd6ef2","infoHashBuffer":{"type":"Buffer","data":[148,227,180,169,187,110,253,72,54,240,20,210,63,24,205,150,23,221,110,242]},"announce":[],"urlList":[]}}