{"title":"Two and a Half Men, TVSeries (divx), S04E21-24, NL Subs, DMT","uid":6149669,"size":1021444354,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:95c257ddb077d77dec4140bd9782b6a09952d708&amp;dn=Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S04E21-24%2C+NL+Subs%2C+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MeMar","files":-1,"time":1296834510,"description":"Two and a Half Men, TVSeries (divx), S04E21-24, NL Subs, DMT\n\nVerenigde Staten\nCategorie: Beeld\nFormaat: DivX\nOndertitels (ingebakken): Nederlands\nGenre: Sitcom\nBron: Retail\nDuur: ongeveer 20 minuten per aflevering\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0369179/episodes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0369179/episodes&lt;/a&gt; &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&lt;/a&gt;\n\nDe hoofdrollen worden vertolkt door Charlie Sheen, Jon Cryer en Angus T. Jones.\n\nHet begint met een man alleen (Alan gaat scheiden... alweer) en eindigt met een glimmende steen \n(de diamant die Evelyns nieuwe vriend aan de derde vinger van haar linkerhand wil schuiven). In de \ntussentijd is het hippe strandhuis van Charlie Harper in Malibu de perfecte plek voor grappen, mooie \nmeisjes, een eenoudergezin, beroemde buren, familie en nog meer grappen. Charlie (Charlie Sheen) \nkomt dicht in de buurt bij zijn al lang overleden vader. Alan (Jon Cryer) begint met online dating \nnadat hij zijn cv een beetje heeft opgeleukt. Jake (Angus T. Jones) vervangt zijn Harry Potter-posters \ndoor plaatjes van mooie meiden.\n\n\nAflevering 21: Tucked, Taped and Gorgeous\nAlan leert Greg - een homoseksuele man - kennen in een zelfhulpgroep voor alleenstaande ouders. \nDoor veel in het bijzijn van zijn nieuwe vriend te vertoeven, begint hij stilaan te twijfelen aan zijn \neigen seksuele geaardheid. Maar ook Charlie is er helemaal niet gerust in. Hij beseft plots dat hij heel \nwat kenmerken vertoont die doen vermoeden dat hij homo is : hij heeft zich nooit gebonden aan een \nvrouw, besteedt veel tijd aan zijn uiterlijk ÃƒÂ©n hij kan piano spelen\n\nAflevering 22: Mr. McGlue's Feedbag\nAlan vraagt Charlie om een dagje op Jake te passen en hem te helpen met zijn boekbespreking terwijl \nhij zijn rijbewijs gaat vernieuwen. Charlie zegt toe, maar van huiswerk komt er helemaal niets in huis. \nHij neemt Jake mee naar de paardenrennen.\n\nAflevering 23: Anteaters. They're Just Crazy-lookin\nCharlie voelt zich bedreigd door zijn nieuwe klusjesman Fernando, die zijn vriendin Chloe van hem \nlijkt af te snoepen. Hoewel Charlie eigenlijk niet geÃƒÂ¯nteresseerd is in een relatie op lange termijn met \nChloe, wil hij koste wat het kost vermijden dat hij het onderspit moet delven tegen zijn jongere \nrivaal.\n\nAflevering 24: Prostitutes and Gelato\nCharlie en Alans moeder Evelyn heeft een nieuwe vriend, Teddy. Die wil de zonen van zijn nieuwe \nvriendin zo snel mogelijk voor zich winnen en nodigt hen uit om met zijn privÃƒÂ©-vliegtuig naar een \nbokswedstrijd in Las Vegas te gaan. Hoewel ze het komen en gaan van de partners van hun moeder \nmeer dan beu zijn, kunnen ze dit aanbod niet weerstaan. Teddy heeft hen echter niet zomaar \nmeegevraagd : hij vraagt hun goedkeuring om met Evelyn te trouwen.\n\n\n\nDeze serie wordt u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:95c257ddb077d77dec4140bd9782b6a09952d708","amp;dn":"Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S04E21-24%2C+NL+Subs%2C+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95c257ddb077d77dec4140bd9782b6a09952d708","infoHashBuffer":{"type":"Buffer","data":[149,194,87,221,176,119,215,125,236,65,64,189,151,130,182,160,153,82,215,8]},"announce":[],"urlList":[]}}