{"title":"El Topo 1970 Full Untouched NTSC","uid":5607755,"size":7909282754,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:984fbf4a775dd9828abaa30319a09ca54cc0727d&amp;dn=El+Topo+1970+Full+Untouched+NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shango","files":28,"time":1275677807,"description":"This is a full untouched dvd ripped using anydvd. Please do your part and stop sharing 700mb and dvds ripped to fit on dvd5! This is 2010. People can learn how to shrink their own damn dvds and if you are still on dialup stop being a cheap fucker and get a job! If you dont own a dvd burner thats ridiculous.\n\nI will up The Holy Mountain next and Fando y Lis soon after. I dont have Sante Sangre so if someone has that it would be appreciated. Thanks\n\n\nPer IMDB:\n\nI saw this movie about a dozen times from the early to mid '70's. It was labeled &quot;a cult movie.&quot; While I never joined a cult, I was moved to see it a many times as I did because it was a metaphor that spoke strongly to my own spiritual searches at the time. The western motif and travels of our hero/anti hero spoke eloquently of the &quot;mole's search for the light.&quot; While the violence was overwhelming at times, I didn't think is redundant or too much. Western society, perhaps all great civilizations, was built on a tremendous amount of violence. The scenes in the mountain with those marginalized from society and their subsequent &quot;liberation&quot; out of the mountain and into the light was an awesome scene. The violence that took place after wards and our own here's self immolation was very poignant. I continue to look for the movie today and hope that whatever is preventing it from being available in North America will be resolved soon. I am very curious to observe my own responses to this film today. I have seen other movies by Jordorowsky and none equaled the impact that El Topo had upon me. \n\n#  Actors: Alejandro Jodorowsky, Brontis Jodorowsky, JosÃƒÂ© Legarreta, Alfonso Arau, JosÃƒÂ© Luis FernÃƒÂ¡ndez\n# Directors: Alejandro Jodorowsky\n# Format: Color, DVD, NTSC\n# Language: English\n# Region: Region 1 (U.S. and Canada only. Read more about DVD formats.)\n# Aspect Ratio: 1.33:1\n# Number of discs: 1\n# Rating: Unrated\n# Studio: Starz / Anchor Bay\n# DVD Release Date: May 1, 2007\n# Run Time: 125 minutes\n\nLooking for Barfly 1987 with Mickey Rourke. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0092618/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0092618/&lt;/a&gt;\n\nIt is out of print or something. If someone can upload a dvd9 that would be great!","torrent":{"xt":"urn:btih:984fbf4a775dd9828abaa30319a09ca54cc0727d","amp;dn":"El+Topo+1970+Full+Untouched+NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"984fbf4a775dd9828abaa30319a09ca54cc0727d","infoHashBuffer":{"type":"Buffer","data":[152,79,191,74,119,93,217,130,138,186,163,3,25,160,156,165,76,192,114,125]},"announce":[],"urlList":[]}}