{"title":"Lanzmann - Warum Israel - Pourqoui Israel (1973)","uid":6278853,"size":1792558678,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:986f437741481ca5688218589dd404976a8c62f7&amp;dn=Lanzmann+-+Warum+Israel+-+Pourqoui+Israel+%281973%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"manesi","files":3,"time":1301361650,"description":"mkv mit deutscher und englischer tonspur.\nuntertitel als srt-beigabe, aber irgendwie fehlerhaft: bei benutzung der untertitel ruckelt und flackert das bild hÃƒÂ¤ufig.\nwer es besser hinzukriegen glaubt, soll sein interesse am ausgangsmaterial in den kommentaren ÃƒÂ¤uÃƒÅ¸ern!\n\n\n\naus den amazon-rezensionen:\nclaude lanzmann hat anfang der 70er einen sehr umfangreichen (3 stunden sind daraus letztlich zusammengeschnitten worden) blick auf den jungen staat israel geworfen, auch auf die teilweise widerstrebenden krÃƒÂ¤fte in dem sÃƒÂ¤kular-weltlichen staat, der dennoch auf einer religions-motivierten gemeinsamkeit beruht. gezeigt werden sowohl orthodoxe siedler, als auch agnostische politaktivisten, die den israelischen siedlungsbau intern zu bekÃƒÂ¤mpfen versuchen. ferner gibt der film einen guten eindruck von der sozialistischen kibbuz-bewegung und dem zionistischen grÃƒÂ¼ndungsethos, von soldatInnen und polizistInnen, von spannungen mit arabischer bevÃƒÂ¶lkerung innerhalb der grenzen israels. \nkÃƒÂ¼rzlich wurde eine auffÃƒÂ¼hrung der dokumentation in hamburg durch vermeintlich linksgerichtete &quot;antizionisten&quot; gewalttÃƒÂ¤tig unterbunden. diese ÃƒÂ¼berreaktion ist vollkommen unbegrÃƒÂ¼ndet. der film ist sehr fair und schreckt auch vor unfreiwillig komischen sequenzen nicht zurÃƒÂ¼ck. \nein propagandafilm sÃƒÂ¤he sicher anders aus. \ndie dokumentation ist durchaus aufschlussreich, obwohl nur ausschnitte jeweils subjektiver wahrnehmung eingefangen werden. \nauch ist der film heute, ca. 40 jahre spÃƒÂ¤ter, nicht mehr durchgÃƒÂ¤ngig aktuell. \nals zeitdokument der frÃƒÂ¼hen 70er jahre, kurz nach dem &quot;6-tage-krieg&quot;, ist der film aber sehr wertvoll und es ist ÃƒÂ¤uÃƒÅ¸erst lobenswert, daÃƒÅ¸ er endlich eine gelungene dvd-verÃƒÂ¶ffentlichung erfahren hat. \nich finde, er sollte sowohl von freunden, als auch von vermeintlichen &quot;feinden&quot; israels angeschaut werden. obwohl es sich nur um eine jahrzehntelang zurÃƒÂ¼ckliegende momentaufnahme handelt, werden viele gesellschaftliche aspekte berÃƒÂ¼cksichtigt. und deutsche diskussionen ÃƒÂ¼ber den &quot;nahost-konflikt&quot; sind hÃƒÂ¤ufig erschreckend eindimensional. dieser film bemÃƒÂ¼ht sich fÃƒÂ¶rmlich darum, genau das nicht zu sein.","torrent":{"xt":"urn:btih:986f437741481ca5688218589dd404976a8c62f7","amp;dn":"Lanzmann+-+Warum+Israel+-+Pourqoui+Israel+%281973%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"986f437741481ca5688218589dd404976a8c62f7","infoHashBuffer":{"type":"Buffer","data":[152,111,67,119,65,72,28,165,104,130,24,88,157,212,4,151,106,140,98,247]},"announce":[],"urlList":[]}}