{"title":"Escaping Des Jeffrey Pierce","uid":6205394,"size":1902217,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98ac8dbc55954596686813d16a2b2f27d491c17e&amp;dn=Escaping+Des+Jeffrey+Pierce&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bleu11","files":5,"time":1298776920,"description":"Escaping Destiny - Book One of the Tapestry Trilogy\nby Jeffrey Pierce\n\nSynopsis\n\nAn ebony finger points skyward, emerging from the center of Node. Known simply as The Gate, it disappears into the clouds, massive spokes extending from the immense structure to stretch through the streets of the largest human city. No one knows who built the towering obelisk, but all are aware of those who have been entrusted as its caretakers.\n\nThey call themselves The Maat.\n\nOtherworldly creatures, their humanoid forms move with an unholy speed and grace, their bodies little more than quicksilver fluid inside a malleable membrane. Pierce that membrane and they will die. Wielding a living crystalline blade, each warrior of The Maat is encased in patchwork leather armor, the suit carved piece by piece from their vanquished enemies. Once their membrane is shielded in the tanned flesh of their enemies, they become an unstoppable foe.\n\nThe Maat have simply observed the beings of the world Tapestry, watching as threads of fate are woven into patterns only The Maat can comprehend. A prophecy that thirteen mortals will change all of the worlds connected through The Gate has begun to unfold. As the armies of darkness and light struggle to claim the mortals as their own, The Maat begin to interfere with human affairs. One by one, the thirteen mortals are swayed or captured. The lines between good and evil are blurred in the name of power and righteousness.\n\nKai Oakman is one of the thirteen mortals that is spoken of in the prophecy. With his faerie lover, Ko'laru, he seeks a different way. He too gathers those spoken of in prophesy to his side, seeking to thwart fate and live their own lives freely in whatever manner they choose. As the noose around them tightens, as all of reality is swept up in the prophesied change, the mortals seek to escape their destiny but that choice may no longer be theirs to make.\n\nIf you enjoy the book, check out the author's site.\n\nwww.virtual-coffee.com","torrent":{"xt":"urn:btih:98ac8dbc55954596686813d16a2b2f27d491c17e","amp;dn":"Escaping+Des+Jeffrey+Pierce","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98ac8dbc55954596686813d16a2b2f27d491c17e","infoHashBuffer":{"type":"Buffer","data":[152,172,141,188,85,149,69,150,104,104,19,209,106,43,47,39,212,145,193,126]},"announce":[],"urlList":[]}}