{"title":"Sri Nisargadatta Maharaj - Video and Books","uid":5516613,"size":383980805,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9942b8c09e53482a40613db4498884473f5ea6e7&amp;dn=Sri+Nisargadatta+Maharaj+-+Video+and+Books&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ryba777","files":8,"time":1272304083,"description":"About the Author\n\nA simple man, Nisargadatta Maharaj, was a householder and petty shopkeeper in Bombay where he lived, and died in 1981 at the age of 84. He had not been educated formally, but came to be respected and loved for his insights into the crux of human pain and the extraordinary usidity of his direct discourse. Hundreds of diverse seekers traveled the globe and sought him out in his unpretentious home to hear him. To all of them he gave hope that &quot;beyond the real experience is not the mind, but the self, the light in which everything appears...the awareness in which everything happens.&quot;  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Sri_Nisargadatta_Maharaj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Sri_Nisargadatta_Maharaj&lt;/a&gt;\n\nBook Descriptions\n\nI Am That: Talks with Sri Nisargadatta\nThis collection of the timeless teachings of one of the greatest sages of India, Sri Nisargadatta Maharaj, regarded by many as a &quot;modern spiritual classic&quot; is a testament to the uniqueness of the seer's life and work\n\n&quot;I Am That&quot; preserves Maharaj's dialogues with the followers who came from around the world seeking his guidance in destroying false identities. The sage's sole concern was with human suffering and the ending of suffering. It was his mission to guide the individual to an understanding of his true nature and the timelessness of being. He taught that mind must recognize and penetrate its own state of being, &quot;being this or that, here or that, then or now,&quot; but just timeless being. \n\nThe Ultimate Medicine \nCompiled during the last year of Nisargadatta 's life, The Ultimate Medicine provides advanced instruction for spiritual aspirants. Not for those who like their spirituality watered down, but for serious students seeking powerful antidotes to unawareness. Edited by Robert Powell, renowned spiritual author.\n\nConsciousness and the Absolute\nConsciousness and the Absolute were recorded shortly before  Nisargadatta's death in 1981, and translated directly to English with no changes. In a question and answer format the visitors and devotees accompanied this great master during his final teachings. His message uncompromisingly remained the same to the end, to dwell only on our beingness, giving it no attributes, dwelling prior to our thoughts.\n\nThe Nectar Of Immortality\nNisargadatta Maharaj questioning and pushing his listeners and devotees further and further back, into their I-am-ness; asking them to discover who they were 100 years before, dealing with the principle prior to mind, not allowing any concepts to settle there. These books remind us of the non methods of Zen and Chan Masters; and their direct approach to this great matter force us as the reader to go beyond merely reading, and enter into that which we call &quot;I&quot;.\n\nPrior to Consciousness\nThese talks took place between April1980 and July 1981 between seekers from all over the world and Nisargadatta Maharaj. He continues to hammer at our egos, insisting that we can only know through our personal experience, not through the second-hand knowledge of others and of books. His words are used like a surgeons scalpel, used to cut away the concepts we have been given since birth. Before this form came - what was I? He was very sharp with his answers. In the last two years of his life he would not entertain any questions pertaining to this worldly life and it's improvement. He spoke only the plain truth.\n\nSeeds Of Consciousness\nThis collection of talks occurred between July 7th 1979 and April 2nd 1980 in the same setting as the other books. Daily, visitors would enter the ground floor residence in Khetwadi, Bombay, and either remain silent in Maharaj's presence or pose questions to him to bring forth his wisdom. He would say he is not a learned man and therefore can only speak from his own experience, and that whatever he has been able to know about his true being applies to everyone else. This series of questions and answers bears the same stamp of authenticity that all these books share. The editor, Jean Dunn has done the world a great service by bringing these talks to light, in translation from the original Marathi language.\n\nVideo Description\n\nAwaken to the Eternal\nNisargadatta Maharaj: A Journey of Self Discovery\nInner Directions Foundation         \nVHS - 57 Minutes\n   \nTo my knowledge, Awaken to the Eternal is the only VHS video available that contains the footage of  Maharaj. Several people who had the opportunity to be with Maharaj discuss the impact of his teaching. Included are interviews with Jean Dunn, Jack Kornfield, Robert Powell Stephen Wolinsky and others. It's a unique opportunity to peek at Maharaj's loft in Bombay and watch him in the midst of a spirited conversation.","torrent":{"xt":"urn:btih:9942b8c09e53482a40613db4498884473f5ea6e7","amp;dn":"Sri+Nisargadatta+Maharaj+-+Video+and+Books","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9942b8c09e53482a40613db4498884473f5ea6e7","infoHashBuffer":{"type":"Buffer","data":[153,66,184,192,158,83,72,42,64,97,61,180,73,136,132,71,63,94,166,231]},"announce":[],"urlList":[]}}