{"title":"Democracy Now - 31 mar 2011","uid":6285236,"size":444599655,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:99dada75a8b579dffa5e78eddd00205142c393c9&amp;dn=Democracy+Now+-+31+mar+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1301589784,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Mar 31, 2011\n\n- CIA Operating in Libya; Obama Authorized Rebel Arms Shipments\n- Libyan Foreign Minister Resigns Post\n- Gaddafi Troops Advance on Rebels\n- Libyan Infant Killed in U.S.-Led Airstrike\n- U.N. Urges Japan to Widen Evacuation Zone\n- Ohio House Approves Anti-Union Bill\n- Walker Gov. Officials Defy Court Injunction to Implement Anti-Union Law\n- New York Assembly Approves Budget Amidst Protests\n- Obama Energy Plan Calls for Reducing Oil Imports, Affirms Nuclear Use\n- Assad Orders Review of Emergency Law, Blames &quot;Foreign Conspiracy&quot; for Unrest\n- Reuters Journalists Missing in Syria\n- U.N. Backs Sanctions on Gbagbo\n- Egypt to Hold November Elections\n- Carter Calls for End to Cuba Embargo, Release of Prisoners\n- Organic Farmers, Dealers Sue Agri-Giant Monsanto Over Patents\n\n\nSpecial reports\n\n- Jeremy Scahill and Ex-DIA Analyst Joshua Foust on &quot;The Dangerous U.S. Game In Yemen&quot; &amp; CIA Ops in Libya\n\nHundreds of thousands took to the streets of Yemen on Wednesday as part of the unwavering protests for the resignation of U.S.-backed President Ali Abdullah Saleh. We speak to independent journalist Jeremy Scahill, who argues the U.S. secret war has unintentionally played a significant role in weakening Saleh's regime; and Joshua Foust, who recently left his post as Yemen analyst at the Defense Intelligence Agency. We also get their reaction to the latest news CIA operatives are on the ground in Libya as part of a covert Western force to aid the U.S.-led bombing campaign.\n\n\n- Libya's Eman al-Obeidi Remains Missing Since Risking Life to Tell Story of Rape by Gaddafi's Forces\n\nA woman who says she was raped by forces loyal to Libyan Col. Muammar Gaddafi remains missing five days after she was arrested for bursting into a hotel full of international reporters in Tripoli and recounting her ordeal. The woman, Eman al-Obeidi, said she had been held against her will for two days and raped by 15 of Gadaffi's men. Obeidi's face and legs were bruised and she had blood on her right thigh. We speak with journalist Mona Eltahawy about sexual assaults against Libyan women under the Gaddafi regime.\n\n\n- Supreme Court Weighs Massive Suit Accusing Retail Giant Wal-Mart of Sexual Discrimination Against Female Workers\n\nThe U.S. Supreme Court has heard arguments on whether a massive class action sexual discrimination lawsuit can move forward against retail giant Wal-Mart. Current and former female employees say they were given lower pay and promoted less often than their male counterparts. We speak with former Wal-Mart manager and plaintiff Stephanie Odle, who says she is pursuing the case to change the company's corporate culture, and the workers' attorney Joseph Sellers. &quot;We found in this case evidence of gender stereotypes about women I have rarely seen,&quot; says Sellers. &quot;They really are a throwback to the world of the 1950s.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:99dada75a8b579dffa5e78eddd00205142c393c9","amp;dn":"Democracy+Now+-+31+mar+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99dada75a8b579dffa5e78eddd00205142c393c9","infoHashBuffer":{"type":"Buffer","data":[153,218,218,117,168,181,121,223,250,94,120,237,221,0,32,81,66,195,147,201]},"announce":[],"urlList":[]}}