{"title":"Aerosmith - Night In The Ruts *Remaster* (1979) vtwin88cube","uid":6182418,"size":87949642,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9a329ce109b1efec43d813e44255470615cc2369&amp;dn=Aerosmith+-+Night+In+The+Ruts+%2ARemaster%2A+%281979%29+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"vtwin88cube","files":-1,"time":1298003117,"description":"\n\nAerosmith\nNight In The Ruts (1979)\n20 Bit Sony Remaster\n\n\nAerosmith was one of the most popular hard rock bands of the '70s, setting the style and sound of hard rock and heavy metal for the next two decades with their raunchy, bluesy swagger. The Boston-based quintet found the middle ground between the menace of the Rolling Stones and the campy, sleazy flamboyance of the New York Dolls, developing a lean, dirty riff-oriented boogie that was loose and swinging and as hard as a diamond.\n\nIn the meantime, they developed a prototype for power ballads with &quot;Dream On,&quot; a piano ballad that was orchestrated with strings and distorted guitars. Aerosmith's ability to pull off both ballads and rock &amp; roll made them extremely popular during the mid-'70s, when they had a string of gold and platinum albums. By the early '80s, the group's audience had declined as the band fell prey to drug and alcohol abuse. However, their career was far from over -- in the late '80s, Aerosmith pulled off one of the most remarkable comebacks in rock history, returning to the top of the charts with a group of albums that equalled, if not surpassed, the popularity of their '70s albums.\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tRock\nSource:\t\t\tFlac Conversion\n\nBy the time Aerosmith's sixth studio release was issued, 1979's Night in the Ruts, guitarist Joe Perry had finally left the band after years of drug-fueled bickering with singer Steven Tyler (forming the Joe Perry Project by year's end). Most of the tracks were completed before Perry's departure, with replacement Jimmy Crespo filling the few empty spaces. And while the band looks back upon this period as hazy and frustrating, Night in the Ruts is a surprisingly coherent and inspired album. Although it's not up to par with such classics as Toys in the Attic or Rocks (although it could have been if the band weren't in such a state of turmoil at the time), it was definitely leaner and more focused than their last studio release, Draw the Line. Highlights include the striking opening rocker, &quot;No Surprize,&quot; which recounts the band's early history, as well the driving yet melodic &quot;Chiquita,&quot; the jamming &quot;Three Mile Smile,&quot; the furious &quot;Bone to Bone,&quot; and a pair of covers -- the Yardbirds' &quot;Think About It&quot; and the novelty number &quot;Reefer Head Woman.&quot; The only lowlight is a weak cover of the Shangri-Las' &quot;Remember (Walking in the Sand),&quot; which was inexplicably issued as a single and included on 1980's Greatest Hits. While the album performed respectfully on the charts, the ensuing tour did little to boost sales -- it was marred with canceled dates and lackluster performances brought on by Tyler's substance abuse.\n\n\n01.No Surprize\n02.Chiquita\n03.Remember (Walking In The Sand)\n04.Cheese Cake\n05.Three Mile Smile\n06.Reefer Head Woman\n07.Bone To Bone (Coney Island White Fish Boy)\n08.Think About It\n09.Mia\n\n\nCheers!","torrent":{"xt":"urn:btih:9a329ce109b1efec43d813e44255470615cc2369","amp;dn":"Aerosmith+-+Night+In+The+Ruts+%2ARemaster%2A+%281979%29+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a329ce109b1efec43d813e44255470615cc2369","infoHashBuffer":{"type":"Buffer","data":[154,50,156,225,9,177,239,236,67,216,19,228,66,85,71,6,21,204,35,105]},"announce":[],"urlList":[]}}