{"title":"Tron - Uma Odisseia Eletronica (dublado) DVDrip .avi","uid":6131594,"size":1301536348,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9a3a181a9a367509015d50a28e46a40e85c37f34&amp;dn=Tron+-+Uma+Odisseia+Eletronica+%28dublado%29+DVDrip+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Prathero","files":1,"time":1296149513,"description":"Kevin Flynn (Jeff Bridges) ÃƒÂ© um jovem engenheiro de Softwares que trabalha para uma grande corporaÃƒÂ§ÃƒÂ£o chamada ENCOM. Ele fica horas desenvolvendo novas idÃƒÂ©ias para videogames com o objetivo de fundar sua prÃƒÂ³pria companhia, mas seus projetos sÃƒÂ£o encontrados e roubados por outro funcionÃƒÂ¡rio, Ed Dillinger (David Warner), que os apresenta como seus e ÃƒÂ© promovido a Vice-Presidente, enquanto Flynn ÃƒÂ© demitido e forÃƒÂ§ado a abrir um Arcade para continuar a trabalhar.\n\nKevin decide invadir o servidor da ENCOM usando um programa chamado CLU para encontrar provas da fraude de Dillinger. PorÃƒÂ©m, CLU ÃƒÂ© detectado e destruÃƒÂ­do pelo Programa de Controle Mestre (MCP), um programa de computador criado por Dillinger para proteger os sistemas da ENCOM. O cÃƒÂ³digo de acesso usado por Flynn ÃƒÂ© desativado pelo MCP, o que tambÃƒÂ©m desativa o cÃƒÂ³digo de acesso de outro funcionÃƒÂ¡rio da empresa, Alan Bradley (Bruce Boxleitner), que confronta Dillinger e revela que criou um programa chamado Tron para monitorar o MCP. ApÃƒÂ³s Bradley ir embora, o MCP confronta Dillinger e revela que planeja invadir os servidores do PentÃƒÂ¡gono e conquistar o mundo, jÃƒÂ¡ que estÃƒÂ¡ mais apto a fazÃƒÂª-lo do que os humanos. Dillinger ÃƒÂ© forÃƒÂ§ado a ajudÃƒÂ¡-lo.\n\nBradley e sua namorada, a Dra. Lora Baines (Cindy Morgan) descobrem que Flynn foi o Hacker que tentou invadir os servidores da ENCOM e vÃƒÂ£o avisÃƒÂ¡-lo que ele foi detectado. Os trÃƒÂªs decidem invadir o prÃƒÂ©dio da ENCOM e usar o cÃƒÂ³digo de acesso do laboratÃƒÂ³rio de Lora, que vinha trabalhando em um Laser que poderia digitalizar objetos do mundo real e materializÃƒÂ¡-los no mundo digital, para encontrar as formas que Flynn precisa.\n\nFlynn ÃƒÂ© detectado pelo MCP, que usa o Laser para digitÃƒÂ¡lizÃƒÂ¡-lo e transportÃƒÂ¡-lo para o mundo virtual, onde ele conhece outros programas, cujas aparÃƒÂªncias lembram ÃƒÂ s de seus criadores, os UsuÃƒÂ¡rios. Flynn e um programa chamado Ram sÃƒÂ£o levados atÃƒÂ© o programa de Dillinger, Sark, que diz que eles devem aceitar o MCP como seu novo mestre ou competirem atÃƒÂ© a morte em jogos de gladiadores. Flynn recusa-se a servir ao MCP e ÃƒÂ© forÃƒÂ§ado a participar de uma corrida com Lightcycles. Durante a partida, ele conhece o programa de Bradley, Tron.\n\nOs trÃƒÂªs tentam fugir, mas sÃƒÂ£o perseguidos pelos soldados de Sark, que matam Ram e separam Flynn e Tron. Tron entra em contato com Bradley e Lora e, com a ajuda deles e do programa de Lora, Yori, ÃƒÂ© direcionado para o local onde reside a programaÃƒÂ§ÃƒÂ£o do MCP e onde ele pode ser destruÃƒÂ­do. Flynn, que, por nÃƒÂ£o ser um programa e sim um UsuÃƒÂ¡rio, possui superpoderes no mundo virtual, junta-se a ele e os trÃƒÂªs atacam o MCP, que transfere sua programaÃƒÂ§ÃƒÂ£o para Sark, que ataca o trio.\n\nApÃƒÂ³s um longo confronto, Flynn consegue atrasar Sark/MCP por tempo suficiente para que Tron destrua a programaÃƒÂ§ÃƒÂ£o original, destruindo Sark/MCP, libertando o servidor da ENCOM e impedindo que o MCP assume o controle do arsenal nuclear do PentÃƒÂ¡gono.\n\nFlynn despede-se de Tron e Yori e retorna para o mundo real com evidÃƒÂªncias da fraude de Dillinger, que ÃƒÂ© preso. Flynn entÃƒÂ£o torna-se o novo Vice-Presidente da companhia.","torrent":{"xt":"urn:btih:9a3a181a9a367509015d50a28e46a40e85c37f34","amp;dn":"Tron+-+Uma+Odisseia+Eletronica+%28dublado%29+DVDrip+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a3a181a9a367509015d50a28e46a40e85c37f34","infoHashBuffer":{"type":"Buffer","data":[154,58,24,26,154,54,117,9,1,93,80,162,142,70,164,14,133,195,127,52]},"announce":[],"urlList":[]}}