{"title":"City Hunter TV series Complete [H264] [B-A]","uid":5044069,"size":36350383376,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:9ba809444759cc24cd2b6a45193dfbc84c1e2ecf&amp;dn=City+Hunter+TV+series+Complete+%5BH264%5D+%5BB-A%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"harry711","files":140,"time":1249535964,"description":"The original &quot;City Hunter,&quot; which premiered in 1987, was based off of the manga series by the same name. This series by Tsukasa Hojo first hit stands in 1983 as two short stories that later in 1985\nbecame the beginning to the six-year manga &quot;City Hunter.&quot;\nIn short, it's anime royalty.\n\n\n`CH1\n1987-1988, 51 episodes\nAction, Boing, Comedy, Detective, Gunfights, Nudity, Pantsu, Shounen, Slapstick, Underworld, Violence, Violent Retribution for Accidental Infringement\nDirector: Kenji Kodama\nProduction: Sunrise, Magic Bus, Audio Planning U\n\nFILE INFORMATION\n\nBaka-Anime [B-A]\nSource: DVD\nMKV (H264/AVC), 640x480 (4:3),\n23.976 fps (~1270 kBit/s)\nJapanese, 2.0 Stereo AAC (~60 kBit/s)\nEnglish soft unstyled subs (SRT)\n\nSUMMARY\n\nRyo Saeba works the streets of Tokyo as the City Hunter. He's a &quot;sweeper&quot; and with his sidekick Kaori Makimura, he keeps the city clean. People hire the City Hunter to solve their dangerous problems, which he does with a Colt Python. When Ryo's not working on a case, he's working on getting the ladies, and Kaori must keep him in check with her trusty 10 kg hammer. [Source: ANN] \n\n\n`CH2\nSERIES INFORMATION\n\n1988-1989, 63 episodes\nAction, Bounty Hunters, Comedy, Detective, Gunfights, Pantsu, Romance, Shounen, Slapstick, Underworld, Violence, Violent Retribution for Accidental Infringement\nDirector: Kenji Kodama\nProduction: Sunrise\n\nFILE INFORMATION\n\nBaka-Anime [B-A]\nSource: DVD\nMKV (H264/AVC), 640x480 (4:3),\n23.976 fps (~1340 kBit/s)\nJapanese, 2.0 Stereo AAC (~60 kBit/s)\nEnglish soft unstyled subs (SRT)\n\nSUMMARY\n\nThe City Hunter's adventures continue with a complicated case of protecting an up-and-coming young idol from a stalker. Normally this would be like letting the fox guard the hen house, but fortunately even an infamous pervert like Ryo does not go for minors. But when the same culprit goes after Kaori as well, even Ryo is shaken. He finally has to get serious, even if his choice of methods is characteristically unorthodox. [source: Anime-Planet] \n\n\n\n`CH3\nSERIES INFORMATION\n\n1989-1990, 13 episodes\nAction, Comedy, Gunfights, Underworld, Violent Retribution for Accidental Infringement\nDirector: Kenji Kodama\nProduction: Sunrise\n\nFILE INFORMATION\n\nBaka-Anime [B-A]\nSource: DVD\nMKV (H264/AVC), 640x480 (4:3),\n23.976 fps (1350 kBit/s)\nJapanese, 2.0 Stereo AAC (~60 kBit/s)\nEnglish soft unstyled subs (SRT)\n\nSUMMARY\n\nCity Hunter's back! Ryo Saeba and his long-suffering partner Kaori are out to make the streets of Shinjuku safe for the weak, the poor, the down-trodden, the... Well, actually, Ryo's just hoping for a little nookie from a grateful client. And Kaori's just hoping her 100-ton hammer is big enough to get Ryo's mind off the girls and on his job. With a bevy of beautiful women and a host of dastardly villains hanging around, City Hunter's got to be ready for any kind of action! \n\n\n`CH91\nSERIES INFORMATION\n\n1991, 13 episodes\nAction, Comedy, Ecchi, Gunfights, Underworld, Violent Retribution for Accidental Infringement\nDirector: Kiyoshi Egami\nProduction: Sunrise\n\nFILE INFORMATION\n\nBaka-Anime [B-A]\nSource: DVD\nMKV (H264/AVC), 640x480 (4:3),\n23.976 fps (1350 kBit/s)\nJapanese, 2.0 Stereo AAC (~55 kBit/s)\nEnglish soft unstyled subs (SRT)\n\nSUMMARY\n\nIt may not be over till the fat lady sings, but Ryo Saeba would rather make music with a beautiful woman. And mokkori is the sweetest music of all to City Hunter's ears. At least until his partner, Kaori, strikes a sour note with her trusty 100-ton hammer. Then there are the various thugs, crooks and just plain not nice people that want to put a permanent end to Ryo's life. How's a guy supposed to get any satisfaction out of his work with all those distractions? The streets of Shinjuku have never been safer-or more deadly. It's City Hunter's last stand! \n\n\n\n\n\n\n\n\n\nEnjoy, and seed please!","torrent":{"xt":"urn:btih:9ba809444759cc24cd2b6a45193dfbc84c1e2ecf","amp;dn":"City+Hunter+TV+series+Complete+%5BH264%5D+%5BB-A%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ba809444759cc24cd2b6a45193dfbc84c1e2ecf","infoHashBuffer":{"type":"Buffer","data":[155,168,9,68,71,89,204,36,205,43,106,69,25,61,251,200,76,30,46,207]},"announce":[],"urlList":[]}}