{"title":"Pulgarcito Revista Bruguera 3 [citaltras]","uid":6155373,"size":4387283054,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9bd5a8395c2e166f4f8d50d0b9dba9dbf6927d47&amp;dn=Pulgarcito+Revista+Bruguera+3+%5Bcitaltras%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"citaltras","files":213,"time":1297017781,"description":" Pulgarcito Revista Bruguera part 3 of 6\t\nCreated by Ratio: 0.57citaltras 4 weeks ago\nComics : Other : Spanish\nPULGARCITO TORRENT 3/6\nSPANISH COMIC MAGAZINE\n\n\nContents/Indice:\n----------------\n-Pulgarcito sexta epoca (6th series) 1952-1981: #1962-#2250 (212 issues)\n\n\n\nThe third in a series of 6 torrents with all the scanned issues of\nPulgarcito, the famous Spanish comic magazine.\nEvery torrent has 4GB or less, so the collection can be burned in 6 DVDs.\nAll the scans were downloaded from the Comic Release Group.\nFor more information or more Spanish comics visit\nlamansion-crg.net/forum\nThanks to all the scanners.\nEnjoy and seed.\n\n\n\nÃ‚Â¿DE QUE SE TRATA? De todos los nÃƒÂºmeros escaneados de las revistas\nPulgarcito, Super Pulgarcito, Gran Pulgarcito, etc, de Editorial\nBruguera, desde sus inicios. Son mÃƒÂ¡s de 1000 tebeos en total, casi 24\nGB. Cada torrent tiene alrededor de 4GB y cabe en un DVD.\nLos irÃƒÂ© subiendo poco a poco en una serie de torrents. Si tienes\npulgarcitos no incluidos aquÃƒÂ­, Ã‚Â¿a que esperas? escanÃƒÂ©alos.\nGracias a todos los escaneadores.\nDisfruta y sigue compartiendo.\n\n\n\nFrom Wikipedia:\n--------------\nPulgarcito (Spanish for &quot;Tom Thumb&quot;)\nwas a weekly illustrated magazine of Spain that was published by\nEditorial Bruguera (originally named El Gato Negro, though it retained\na black cat as its logo) from June 1921 to 1986.\n\nAn extremely popular periodical in its first years, Pulgarcito offered\nshort stories, articles, pastimes, and jokes, with only a few comic\nstrips. Economic difficulties caused by the Spanish Civil War led to\nonly 13 issues being published between 1945 and 1947, though it\nrecovered after 1952, with more prominence given to comic strips and a\nstable of new comic characters, including: Mortadelo y Filemon, Zipi y\nZape, Las hermanas Gilda, Carpanta, El professor Tragacanto,\n\nBoth IbÃƒÂ¡ÃƒÂ±ez and Jan worked on Pulgarcito during its last years. With\nthe demise of the Editorial Bruguera publishing house, Pulgarcito was\ndiscontinued.\n\n\n\n\nExtraido del hilo Pulgarcito del CRG:\n------------------------------------------------------\nPulgarcito Sexta etapa, publicaciÃƒÂ³n semanal (revista)\n\n\nEn 1952 se le otorga el permiso de publicaciÃƒÂ³n periÃƒÂ³dica, lo que permite un suministro fijo de papel y tinta, y asegura plazos, ventas y suscripciones, que se empiezan a ofertar. El primer ejemplar de esta nueva etapa llevarÃƒÂ¡ el nÃ‚Âº 1091, suma de las numeraciones de 5 etapas anteriores en las que se habÃƒÂ­a renumerado. Como en el mismo ejemplar se especifica, se conserva el nÃ‚Âº de contraportada durante unas semanas mÃƒÂ¡s para guÃƒÂ­a de los lectores, hasta el 1106 (264, clÃƒÂ¡sica y errÃƒÂ³neamente considerado el ÃƒÂºltimo de la 5Ã‚Âª etapa). De esta forma, asume toda su historia pasada y la Editorial lo considerarÃƒÂ¡ como 1Ã‚Âª ÃƒÂ©poca hasta 1981.\n\nComo contrapartida negativa, ese aÃƒÂ±o de 1952, la censura organizada alcanzarÃƒÂ¡ a supervisar los tebeos infantiles, modificando el lenguaje o moderando los comportamientos de los personaje1s, como doÃƒÂ±a Urraca. AdemÃƒÂ¡s, con el lanzamiento de la revista DDT al que se le quiere dar un carÃƒÂ¡cter mÃƒÂ¡s adulto, Pulgarcito se suaviza ÃƒÂ¡un mÃƒÂ¡s en sus contenidos.\n\nEn los primeros aÃƒÂ±os siguieron apareciendo muchos de los personajes recordados como tÃƒÂ­picos de Bruguera: Petra, criada para todo (Escobar), Pascual, criado leal (Nadal), El doctor Cataplasma, Troglodito y El profesor Tragacanto (Schmidt) o La terrible FifÃƒÂ­ (NenÃƒÂ© Estivill).\n\nEn 1957 los dibujantes Escobar, PeÃƒÂ±arroya, CifrÃƒÂ©, Conti y Giner se marchan de Bruguera para crear la empresa autogestionada D.E.R. y la revista Tio Vivo, pero, por la legislaciÃƒÂ³n vigente, los personajes siguen en Bruguera, que repite historietas publicadas sin pestaÃƒÂ±ear. Pero esta marcha provoca la entrada de otra hornada de dibujantes, conocida como 2Ã‚Âª generaciÃƒÂ³n Bruguera, entre los que se encuentran grandes como Gin, IbÃƒÂ¡ÃƒÂ±ez, Raf, Segura, Gosset, NenÃƒÂ© Estivill y SanchÃƒÂ­s. Esto darÃƒÂ¡ lugar a la creaciÃƒÂ³n de toda una baterÃƒÂ­a de nuevas series, entre las que se encuentran las dos mÃƒÂ¡s exitosas del cÃƒÂ³mic espaÃƒÂ±ol: En las de aventuras, El CapitÃƒÂ¡n Trueno (a partir del nÃ‚Âº 1317), y en las de humor, Mortadelo y FilemÃƒÂ³n (a partir del nÃ‚Âº 1394).\n\nDurante los 60, la proliferaciÃƒÂ³n de revistas de Bruguera (incluida la compra de Tio Vivo) y el baile de personajes entre las mismas hace perder parte de la importancia y personalidad de Pulgarcito. En estos aÃƒÂ±os, ademÃƒÂ¡s de los trasvases de series, se producen otras notas negativas en las revistas Bruguera. Desaparece la rotulaciÃƒÂ³n manual, sustituida por la tipografÃƒÂ­a mecÃƒÂ¡nica. Se estanca la creaciÃƒÂ³n de nuevas series, ya que las ventas parecen aseguradas. Como nivel medio, se va abandonando el pÃƒÂºblico adulto (Can Can, DDT 1Ã‚Âª y 2Ã‚Âª ÃƒÂ©poca) para concentrarse en el infantil, que escapa a la censura mÃƒÂ¡s fuerte. Peor aÃƒÂºn para la calidad serÃƒÂ¡ la adulteraciÃƒÂ³n de autor (historietas conocidas como apÃƒÂ³crifas) o la reediciÃƒÂ³n (republicaciÃƒÂ³n o refrito) de historietas antiguas sin el menor aviso de que lo son.\n\nTodo esto uniforma las diferentes revistas y acabarÃƒÂ¡ perjudicando mucho a la revista insignia de Bruguera, convirtiÃƒÂ©ndose en una mÃƒÂ¡s de la editorial, aunque manteniendo sus ventas gracias a nuevas incorporaciones como la de El Sheriff King (Victor Mora). Sin embargo, al final de esta dÃƒÂ©cada, Pulgarcito alcanzarÃƒÂ¡ en tirada al tebeo por antonomasia, el TBO, con la ventaja aÃƒÂ±adida para Bruguera de la venta tambiÃƒÂ©n masiva de sus otras revistas.\n\nEn 1969 Bruguera crea una nueva y ambiciosa revista que poco tiene que ver con la presente pero que utiliza su nombre: Gran Pulgarcito. Al cabo de un aÃƒÂ±o, no habÃƒÂ­a funcionado y desapareciÃƒÂ³. A continuaciÃƒÂ³n, otra revista tirarÃƒÂ­a del nombre, Super Pulgarcito; de la que hay que aclarar que no era un Pulgarcito Super, sino otra revista diferente.\n\nEn los aÃƒÂ±os 70 irÃƒÂ­a perdiendo progresivamente su cuota, no siendo ya la revista donde se publicaban las novedades ni los personajes mÃƒÂ¡s exitosos, sustituida en este sentido por Super Pulgarcito y sobre todo por Mortadelo, que, con sus variantes, se convertirÃƒÂ­a en la principal baza de la editorial. Pulgarcito se sumerge en una decadencia insalvable que ya se habÃƒÂ­a llevado por delante a otros clÃƒÂ¡sicos de Bruguera. Esta 6Ã‚Âª etapa de la revista finalizarÃƒÂ­a a principios de 1981 con el nÃƒÂºmero 2597, por sus escasas ventas.\n\n\n\n\n\n---------------------------------------------------\nIf you liked this torrent be sure to download also:\n-Pulgarcito Revista Bruguera part 1/6\n-Pulgarcito Revista Bruguera part 2/6\n-Mortadelo 0-100\n-Mortadelo 101-200\n-Mortadelo 201-300\n---------------------------------------------------\n\n","torrent":{"xt":"urn:btih:9bd5a8395c2e166f4f8d50d0b9dba9dbf6927d47","amp;dn":"Pulgarcito+Revista+Bruguera+3+%5Bcitaltras%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bd5a8395c2e166f4f8d50d0b9dba9dbf6927d47","infoHashBuffer":{"type":"Buffer","data":[155,213,168,57,92,46,22,111,79,141,80,208,185,219,169,219,246,146,125,71]},"announce":[],"urlList":[]}}