{"title":"Ross Thomas - Voodoo, Ltd","uid":5167691,"size":1075376,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c08f0a3ae9d84cd44fed5d52dd192f3a9ad61a5&amp;dn=Ross+Thomas+-+Voodoo%2C+Ltd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pigeye","files":1,"time":1258500980,"description":"In his 24th book, counting the five he has written as Oliver Beech, Thomas ( Twilight at Mac's Place ; The Fourth Durango ) is in top form; this thriller is stuffed with incident, lively characters and sophisticated wit. On New Year's morning 1991 movie star Ione Gamble is found passed out in the Malibu home of her ex-fiance, a producer who had jilted her. She's holding, and has fired, a gun, killing him, but she can't remember anything because she was wildly drunk the night before. To determine what happened, her lawyer hires an English brother-sister team of hypnotists, who vanish before revealing what they may have gleaned from Gamble. Then the lawyer hires Enno Glimm, specialist in hiring specialists, who hires London-based Americans Artie Wu and Quincy Durant of Wudu, Ltd. And they hire their own helpers: con man Maurice &quot;Otherguy&quot; Overby, academic Booth Stallings and Georgia Blue, a former U.S. Secret Service agent just sprung from five years in a Philippine jail (met before in Out on the Rim ). Once the characters assemble in L.A., the plot takes off, touching down for murder, blackmail, discreet kinky sex and even incest. To this exhilarating, splendidly choreographed caper, Thomas provides a very satisfying ending, capped by a wonderful final line. ","torrent":{"xt":"urn:btih:9c08f0a3ae9d84cd44fed5d52dd192f3a9ad61a5","amp;dn":"Ross+Thomas+-+Voodoo%2C+Ltd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c08f0a3ae9d84cd44fed5d52dd192f3a9ad61a5","infoHashBuffer":{"type":"Buffer","data":[156,8,240,163,174,157,132,205,68,254,213,213,45,209,146,243,169,173,97,165]},"announce":[],"urlList":[]}}