{"title":"Face/Off(1997)DVDRip.AC3(ENG)-DROCK","uid":6289882,"size":734186749,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9c27117eb63eff3e38918109610f65dfedf40737&amp;dn=Face%2FOff%281997%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"drock232","files":-1,"time":1301760106,"description":"The third of John Woo's American-made feature films, Face/Off stars John Travolta as Sean Archer, an FBI agent obsessed with capturing Castor Troy (Nicolas Cage), a criminal genius who years before killed Archer's son while trying to assassinate the agent. Archer's single-minded pursuit of Troy has caused serious harm to his marriage, but Archer thinks the light may have appeared at the end of the tunnel when a seriously wounded Troy is captured in a bloody shootout. However, it turns out that Troy has planted a time bomb, with a biological payload that could destroy the entire city of Los Angeles -- and Troy isn't about to say where it is. The only other person who knows the bomb's location is Troy's brother, Pollux (Alessandro Nivola), who is no more helpful than Castor. FBI scientists hatch a plan: they have developed an experimental surgery which would allow them to graft Troy's face temporarily on Archer's head and allow him to question Pollux as if he were his brother. But after Archer has taken Troy's face, Troy regains consciousness and forces the doctors to give him Archer's face. Now the criminal mastermind has the FBI at his disposal, and the lawman is underground with few places to turn. Along with Woo's usual elaborately choreographed action scenes, Face/Off features a number of notable supporting performances, including Joan Allen as Archer's wife, Colm Feore and C.C.H. Pounder as FBI scientists, and Gina Gershon as Troy's loyal but long-suffering girlfriend.\n\nRipped with Handbrake.\n\nLength: 2 Hours 20 Minutes\n\nFile Type: MKV","torrent":{"xt":"urn:btih:9c27117eb63eff3e38918109610f65dfedf40737","amp;dn":"Face%2FOff%281997%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c27117eb63eff3e38918109610f65dfedf40737","infoHashBuffer":{"type":"Buffer","data":[156,39,17,126,182,62,255,62,56,145,129,9,97,15,101,223,237,244,7,55]},"announce":[],"urlList":[]}}