{"title":"Bones S06E11 HDTV.XviD DutchReleaseTeam (dutch subs nl)","uid":6140376,"size":366151017,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9c9923104292f98ad626f1e36269845bbd8777e3&amp;dn=Bones+S06E11+HDTV.XviD+DutchReleaseTeam+%28dutch+subs+nl%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Koedje","files":-1,"time":1296480137,"description":"\n\nPlot:\n\nTemperance Brennan is als forensisch antropologe werkzaam op het Jeffersonian Institute. Samen met haar team van uitermate getalenteerde wetenschappers helpt ze de FBI om moordzaken op te lossen. Niet alleen oude, onopgeloste moordzaken worden opgelost, maar ook recente moordzaken. Tijdens haar werk voor de FBI werkt ze samen met Seeley Booth (David Boreanaz). Tussen de FBI en het Jeffersonian Institute bestaan soms onenigheden, zoals die ook tussen Brennan (en haar team) en Booth bestaan. Maar uiteindelijk lossen de twee partijen de zaken altijd weer op.\n\n\nSeizoen 6 Aflevering 11: The Bullet In The Brain\n\n\nThe city anxiously anticipates the arrival of Heather Taffet, more notoriously known as &quot;The Gravedigger,&quot; for her final appeal after being sentenced to death for a kidnap-murder and a series of similar coldblooded crimes. But when a bullet targeted at The Gravedigger is fired from a distance and hits her, the Jeffersonian team is tasked to piece together the sniper's precise location as well as identify the suspect and his motives. With the help of probing investigator Caroline Julian, Booth and Brennan put together a list of likely suspects, but the evidence and the remarkable skill needed to pull off the crime leads the team to believe that the crime was an inside, professional job, leaving Brennan's father Max and even Booth as plausible suspects. Meanwhile, Sweets attempts to put on a brave face after being caught in the firestorm just moments following a chilly encounter with The Gravedigger.\n\n\n\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.nl\n\nDutchReleaseteam = Hardcoded Dutch Subs \n","torrent":{"xt":"urn:btih:9c9923104292f98ad626f1e36269845bbd8777e3","amp;dn":"Bones+S06E11+HDTV.XviD+DutchReleaseTeam+%28dutch+subs+nl%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c9923104292f98ad626f1e36269845bbd8777e3","infoHashBuffer":{"type":"Buffer","data":[156,153,35,16,66,146,249,138,214,38,241,227,98,105,132,91,189,135,119,227]},"announce":[],"urlList":[]}}