{"title":"Jenna Confidential (2009 - COMPLETE.NTSC.DVDR) - Jenna Jameson","uid":5115020,"size":4483536536,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9cb53711a422d301732c4cae27c517ff56274271&amp;dn=Jenna+Confidential+%282009+-+COMPLETE.NTSC.DVDR%29+-+Jenna+Jameson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pure_screens","files":7,"time":1255017910,"description":"Jenna Confidential\n\n\n\n4 screens (+ screenshots) + large DVD-covers: &lt;a href=&quot;\nhttp://www.cmylink.com/JennaConfidential&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cmylink.com/JennaConfidential&lt;/a&gt;\n\n\n\n\n\nJenna Jameson is a Mafia Moll who`s living in a gangster`s house. \nWhen a new boss rises to power and threatens to kick Jenna on the street, mayhem and wild sex ensue.\n\n\nActresses\n\n    * Ashley Long \n    * Jana Cova \n    * Jenna Jameson\n    * Michelle Michaels \n    * Sharon Kane \n \n   \nScene Breakdowns\n\n    * Scene 1. Mario Rossi, Manuel Ferrara, Michelle Michaels\n    * Scene 2. Ashley Long, Randy Spears\n    * Scene 3. Sharon Kane, Steven St. Croix\n    * Scene 4. Sharon Kane, Jenna Jameson\n    * Scene 5. Jana Cova, Jenna Jameson\n\n\n\nStudio:          Club Jenna\nReleased:        2002 / 2009\nLanguage:        English\n\nSOURCE: DVD5   \nFORMAT: .ISO   \nASPECT RATIO: 16:9\n\nVideo: MPEG2 Video 720x480 (4:3) 29.97fps 8000Kbps [Video]\nAudio: Dolby AC3 48000Hz stereo 192Kbps [Audio] \n\n\n3,800+ porn torrents: &lt;a href=&quot;\nhttp://thepiratebay.se/user/pure_screens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pure_screens&lt;/a&gt;\n\n(ALWAYS with honest screens &amp; detailed info)\n\n\n\nREVIEW:\n\nClub Jenna's owners announced awhile back that they were ending distribution of movies on disc to follow an internet approach some time ago, limiting how many of their titles I saw to review. Frankly, as a longtime fan of their former owner Jenna Jameson, this did not bug me a whole lot since most of what was left after her departure were small clips and unfinished projects; little of their former contract gal's works really all that interesting to me. Still, deep down inside me, I always adored Jenna so any chance I got to see unreleased footage was an opportunity I had to take, such being the case with her latest movie by director Michael Zen titled Jenna Confidential. Shot way back in 2002, the movie was another period piece about gangsters and gun molls, the initial scene between Jenna and her then-husband Jay not shown before he died off camera. That was indicative of what was going on in the flick, Jenna only having two lesbian scenes, one of them with aged performer Sharon Kane and the other with little hotty Jana Cova, the rest of them tossed in from the looks of it. Here's a brief look at the scenes by cast and action, noting that condoms were used for those still interested:\n\n\nScene One: Michelle Michaels, an average looking blond with beef curtain labia, was up first on the balcony with Manuel Ferrara and Mario Rossi, blowing the two of them in turns as she diddled herself on the beachfront property. The music sucked donkey balls as it was contemporary while the movie was set in the 1940's, the pacing making me think the material was sped up or something, hence the relative lack of vocals here. Once the music slowed down, the vocals present appeared to be dubbed in after the fact, mostly her moaning as she continued to slob their knobs and get vaginally boned by the men in numerous positions. The scene was short but she did engage in a few active moments, ending it by jerking off both of them to her face, their genetic juice landing mostly on her tongue.\n\nScene Two: Ashley Long, a leggy blond who needed to talk to Randy Spears about &quot;making her stay here more permanent&quot;, was soon sucking his cock as he fingered the gal. Randy spent considerable time doing foot fetish stuff, licking her toes and feet before going down on her pussy and ass, preparing both holes for his pecker to penetrate. Ashley provided a steady stream of dirty talk and actively rode him but the camera was often so zoomed in that it could have been anyone screwing most of the time and I'd never have known. She took the facial at the end too.\n\nScene Three: Sharon Kane, a gal best known for her work in the mid 1970's, was up next as she took on Steven St. Croix by the home bar. The music was again a setback and while the quick paced editing did appear to make them look less awkward, I had absolutely no attraction to her here so the oral and vaginal portions were lost on me. Had the feature made more sense, I could have understood her participation but for all her skills, the scene left me limp even though she took the facial and actively rode vaginally.\n\nScene Four: Jenna Jameson and Sharon Kane, the two lead females of the movie, had a stylish lesbian tryst in this next scene, making out with the sun set low in the sky by the beach. I assume this was at sunset given the Pacific coast setting, the ten minutes they spent together showing each go down on the other fairly well as they fingered and even had some decent music initially (before it ended to hear the waves on the surf). Jenna was pretty smoking hot here so even the wasted nature of the scene did not hurt it much.\n\nScene Five: Jana Cova, one of the most beautiful ladies in porn over the last several years, was up next in a much more appealing lesbian scene with Jenna Jameson. Jana was dressed like a man and the screams of Steven could be heard in the background, the big band styled music working far better than the techno-crud it reverted too as the ladies tore off their clothing. The cunnilingus was hot as was the lingerie on the ladies, the use of the champagne bottle to penetrate Jenna a bit much for me though.\n\nSummary: Jenna Confidential by director Michael Zen for Club Jenna gave the appearance of a half finished, minimal effort by the company that was sewed up on a moment's notice and left to languish in the vaults until the end of time. Economic realities forced it to see the light of day and frankly, the only scene I cared for much at all was the one between Jenna and Jana Cova, both of them favorites of mine over the years. Even that scene was too short and limited however, the missing extras probably indicative of company leadership issues and lack of consistent appeal making me label this one as a Skip It. In short, I suppose my expectations were set way too high for a movie shot way back in 2002 when Jenna Jameson was still looking exceptionally hot, her ship having set sail long ago and with far better projects than Jenna Confidential.\n\n\n.\n\n\n","torrent":{"xt":"urn:btih:9cb53711a422d301732c4cae27c517ff56274271","amp;dn":"Jenna+Confidential+%282009+-+COMPLETE.NTSC.DVDR%29+-+Jenna+Jameson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cb53711a422d301732c4cae27c517ff56274271","infoHashBuffer":{"type":"Buffer","data":[156,181,55,17,164,34,211,1,115,44,76,174,39,197,23,255,86,39,66,113]},"announce":[],"urlList":[]}}