{"title":"R.E.M. - Reckoning (1984) WMA320","uid":6153670,"size":140024049,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9d44db755f9d4b9df1c4d4b5cdfe1b82a94253f8&amp;dn=R.E.M.+-+Reckoning+%281984%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1296964817,"description":"There's basically two kinds of REM fans. People who got into the post-Green material, and know them as a big-league stadium rock band, and those who appreciate their earlier indie material on the IRS label. Well, you guessed it, I'm on the IRS side of things. The only post-Document album of theirs which I actually own is &quot;New Adventures in Hi-Fi,&quot; which is not nearly as good as the early work. I frankly don't understand why they gave up this sound at all. They had so much potential here. AARRGGHH!! Well, no use dwelling on it. \n\nI can't begin to describe how great this album is. I first bought it when I was in high school, on cassette, a decade after it was recorded. I updated to a CD copy about five years later. It's only sounded better over that period of time. It has that raw, jangly, murky feel that REM was so good at back then, with abstract lyrics hinting at something big but never giving everything away. It's less staid-sounding than Murmur, but keeps that mysterious feeling that was lost when Mike Stipe became a regular old frontman and started demanding attention and wearing his heart on his sleeve. The whole murky-mumbly thing suited him and the band far better than anything. It is my favorite album of the 80s, even with competition from the Stone Roses, the Pixies, the Replacements, the Clash and Jesus and Mary Chain. It's also a huge influence on one of my favorite songwriters, Stephen Malkmus. So, if you're looking for everything that indie rock can be, look no further. \n\nby Howlinw\n\nTRACKLIST:\n\n01 - Harborcoat.wma                                              \n02 - 7 Chinese Brothers.wma                                      \n03 - Southern Central Rain (I'm Sorry).wma                       \n04 - Pretty Persuasion.wma                                       \n05 - Time After Time (Annelise).wma                              \n06 - Second Guessing.wma                                         \n07 - Letter Never Sent.wma                                       \n08 - Camera.wma                                                  \n09 - (Don't Go Back To) Rockville.wma                            \n10 - Little America.wma  \n\nWMA 320Kbps 44100Hz STEREO\n\nDEDICATED TO azza1969","torrent":{"xt":"urn:btih:9d44db755f9d4b9df1c4d4b5cdfe1b82a94253f8","amp;dn":"R.E.M.+-+Reckoning+%281984%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d44db755f9d4b9df1c4d4b5cdfe1b82a94253f8","infoHashBuffer":{"type":"Buffer","data":[157,68,219,117,95,157,75,157,241,196,212,181,205,254,27,130,169,66,83,248]},"announce":[],"urlList":[]}}