{"title":"Cuentame.Como.Paso.12X11.HDTV.Xvid.Spanish.By.Ainhdesi","uid":6191891,"size":771526768,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9dd51b33ebf1b992e6ef189c65a009ccb7188d9a&amp;dn=Cuentame.Como.Paso.12X11.HDTV.Xvid.Spanish.By.Ainhdesi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ainhdesi","files":-1,"time":1298321020,"description":"12X11 - El Ultimo cartucho\n\nA principios de 1979 los espaÃƒÂ±oles se preparan de nuevo para acudir a las urnas, esta vez para votar en las elecciones generales. Una vez mÃƒÂ¡s, Antonio AlcÃƒÂ¡ntara, tiene que ver como su partido, la UCD, le da de lado sin ningÃƒÂºn tipo de explicaciÃƒÂ³n. Sus esperanzas de convertirse en diputado se esfuman para siempre pero, lejos de resignarse, decide plantar cara al partido para que le aclaren, de una vez por todas, su situaciÃƒÂ³n.\nMercedes intentarÃƒÂ¡ apoyar a su marido en todo momento, mientras ella intenta sacar horas de donde puede para afrontar los exÃƒÂ¡menes de la Universidad. Merche encontrarÃƒÂ¡ la fÃƒÂ³rmula para mantenerse despierta y a pleno rendimiento, aunque luego los resultados no sean los esperados.\nPor su parte, Toni estÃƒÂ¡ mÃƒÂ¡s tranquilo porque ve a InÃƒÂ©s mejor. Ha conseguido alejarse de Jaime y cree que con un poco de ayuda saldrÃƒÂ¡ del mundo en el que se ha metido. Lejos de la realidad, InÃƒÂ©s parece estar interpretando su mejor papel y tiene engaÃƒÂ±ados a todos.\nCarlos empieza a trabajar a ratos en el bistrot con su tÃƒÂ­o, mÃƒÂ¡s que por el dinero porque necesita estar cerca de Karina. Para su sorpresa, Bernardo, el profesor de Literatura de su ex novia, se presenta en la sala de reclutamiento para pedir una prÃƒÂ³rroga del servicio militar. Carlos ve ahÃƒÂ­ la oportunidad de vengarse de ÃƒÂ©l.\nAdemÃƒÂ¡s, Miguel ya no solo tiene que soportar que su hija salga en televisiÃƒÂ³n sino que ademÃƒÂ¡s ahora le llueven ofertas de trabajo de todo tipo. Paquita, que no puede evitar sentir envidia de Francoise, convencerÃƒÂ¡ a Miguel para que se convierta en su representante.","torrent":{"xt":"urn:btih:9dd51b33ebf1b992e6ef189c65a009ccb7188d9a","amp;dn":"Cuentame.Como.Paso.12X11.HDTV.Xvid.Spanish.By.Ainhdesi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dd51b33ebf1b992e6ef189c65a009ccb7188d9a","infoHashBuffer":{"type":"Buffer","data":[157,213,27,51,235,241,185,146,230,239,24,156,101,160,9,204,183,24,141,154]},"announce":[],"urlList":[]}}