{"title":"Touch - Touch (1968)","uid":5010604,"size":59451297,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9df6be829bb998302a6975854e538aacd350f7bd&amp;dn=Touch+-+Touch+%281968%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"teethbvr","files":7,"time":1247971195,"description":"Taken from Wikipedia:\n\n\n\nTouch were a '60s rock group who recorded just one album, 1968's eponymous Touch. They consisted of John Bordonaro (drums, percussion, vocals), Don Gallucci (keyboards, vocals), Bruce Hauser (bass, vocals), Jeff Hawks (vocals), and Joey Newman AKA Vern Kjellberg (guitar, vocals).\n\nGallucci will probably always be best known as the kid who played the keyboard riff on the Kingsmen's classic recording of the song &quot;Louie Louie,&quot; but it was this hit that forced him to leave the group. At the age of 15 he was not old enough to tour with them and thus it was that he later founded Don and the Goodtimes with drummer Bob Holden. (An early version of the band included Jack Ely, the vocalist on &quot;Louie Louie.&quot;) They had a No. 20 pop hit in the US with &quot;I Could Be So Good to You,&quot; produced and arranged by the legendary Jack Nitzsche.\n\nIn his as-yet-unpublished biography, Gallucci recalls that by the end of 1967, following the release of Sgt. Pepper's Lonely Hearts Club Band, they were beginning to feel like they were &quot;just rearranging the deck chairs on the Titanic&quot; and felt the need to move on. Accordingly he wrote what the sleevenotes to the Eclectic Discs CD reissue of the album calls the &quot;Lysergic soaked&quot; epic &quot;Seventyfive,&quot; and Touch was born. The three teamed up with Hauser and Bordonaro and they set themselves up in a Moorish-style castle in the Hollywood Hills where they set to work on writing the songs for the album.\n\nAfter signing with Coliseum Records, but before recording the Touch LP, the group recorded the music tracks for the Elyse Weinberg LP using the name &quot;The Band of Thieves&quot; after Elyse's song of the same name. Gene Shiveley engineered the sessions at Sunset Sound Recorders and the transition from those sessions to the sessions for the Touch LP was nearly seamless.\n\nThe Touch recordings took place in an almost party-like atmosphere with such musical luminaries from the world of rock and psychedelia as Mick Jagger, Grace Slick and Jimi Hendrix all attending the recordings at Sunset Sound studios in Hollywood with Gene Shiveley producing. Exactly how Shiveley and the band created some of the sounds on the album in these pre-synthesiser days is still a matter of conjecture as no one present seems to remember, but with the only unusual instrument on the album being a tone-generator it seems it was all done with the use of real instruments and ingenious production. Unconfirmed reports suggest that &quot;certain substances&quot; and metaphysical philosophy may have been involved, which, given the time of recording, would not be too surprising.\n\nThe band folded soon after the release of the album because they believed that the music contained on it could never be replicated live, which resulted in them being unable to tour to promote it. This one LP has since been credited as the inspiration for the Brit progressive rock band Yes, a major influence on rock bands Kansas and Uriah Heep, and an inspiration for the transformation and rebirth of prog rock band Genesis after the departure of their vocalist, Peter Gabriel.\n\n\n\n\nTrack Listing:\n\n1. We Feel Fine\n2. Friendly Birds\n3. Miss Teach\n4. The Spiritual Death of Howard Greer\n5. Down at the Circe's Place\n6. Alesha and others\n7. Seventy Five\n\n\n\nThis album took me a good 5-6 months to track down, so I hope you enjoy!  Bitrate is 192.","torrent":{"xt":"urn:btih:9df6be829bb998302a6975854e538aacd350f7bd","amp;dn":"Touch+-+Touch+%281968%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9df6be829bb998302a6975854e538aacd350f7bd","infoHashBuffer":{"type":"Buffer","data":[157,246,190,130,155,185,152,48,42,105,117,133,78,83,138,172,211,80,247,189]},"announce":[],"urlList":[]}}