{"title":"CNBC American Originals: BUDWEISER (2008) [PDTV]~Ekolb","uid":4992480,"size":366246940,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9e3d8085f58760e81cced12c980d4de5ded1fa9b&amp;dn=CNBC+American+Originals%3A+BUDWEISER+%282008%29+%5BPDTV%5D%7EEkolb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ekolb","files":3,"time":1247113568,"description":"CNBC PRESENTS &quot;AMERICAN ORIGINALS: BUDWEISER&quot;\nAired on Thursday, July 17th, 2008\n\nORIGINAL CNBC SPECIAL TAKES YOU INSIDE ANHEUSER-BUSCH FOR AN UNPARALLELED, ALL-ACCESS LOOK AT THIS FAMILY RUN BUSINESS AND ITS FIGHT FOR INDEPENDENCE \n\nENGLEWOOD CLIFFS, N.J., July 11, 2008-Nothing is more American than an afternoon baseball game and an ice-cold beer. Not just any beer....A Budweiser. Anheuser-Busch has been brewing Bud for more than 130 years and while other American beer companies have either been bought or merged with breweries overseas, Anheuser-Busch remains a dedicated American company.\n\nCNBC taps into the beer industry with unprecedented access revealing how Anheuser-Busch cultivated its Budweiser brand, how they're losing market share to microbreweries, wine and spirits and imports and facing a hostile takeover, and how the American icon plans to overcome these challenges and stay on top.\n\nThe program tells the history of the largest brewer in the United States. It takes us from the mid 19th century when German immigrant Eberhard Anheuser took over &quot;The Bavarian Brewery&quot; to his son-in-law Adolphus Busch's investment in pasteurization and a mechanized bottling to the creation of Budweiser, the King of Beers. The special also introduces the Anheuser-Busch brewmasters to show the extreme length this admired and desired company goes to make sure their beers maintain consistency and quality. \n\nTo win in the beer wars it is just as much about promotion as it is product and Anheuser-Busch pours hundreds of millions of dollars into U.S. advertising each year. It's the company that brought us the Clydesdales, the bud girls and Spuds MacKenzie, the original party animal and one day a year, Super Bowl Sunday, Anheuser-Bush gets the very biggest bang for its buck. Between Clydesdale appearances and sports sponsorships including Bud being the official beer sponsor of the 2008 Olympics in Beijing, it's not just a beer...it's a brand.\n\nCNBC also takes a look at present day and the company's current CEO, August Busch IV. Anheuser-Busch now has a portfolio of more than 310 products and brews 128 different beers dominating the nation's brewing industry with nearly 50% market share. But, the company is seeing a devastating trend in the 21st century-people just aren't drinking as much beer. With U.S. beer sales flat and its biggest competitors partnering with foreign breweries, the question is will Anheuser-Busch be able to remain an American company after 150 years? \n\nThe King of Beers has learned from experience that a great product and outstanding marketing doesn't give it a lock on the number one slot. Anheuser-Busch is always looking for the next beer breakthrough...\n\nFormat            : AVI\nLength            : 349 MiB for 43mn 28s 975ms\nCodec             : XviD\nSource            : PDTV\n\nVideo #0          : MPEG-4 Visual at 999 Kbps\nAspect            : 432 x 320 (1.350) at 29.970 fps\n\nAudio #0          : MPEG Audio at 110 Kbps VBR\nInfos             : 2 channels, 48.0 KHz\n\nEnjoy!\nEkolb","torrent":{"xt":"urn:btih:9e3d8085f58760e81cced12c980d4de5ded1fa9b","amp;dn":"CNBC+American+Originals%3A+BUDWEISER+%282008%29+%5BPDTV%5D%7EEkolb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e3d8085f58760e81cced12c980d4de5ded1fa9b","infoHashBuffer":{"type":"Buffer","data":[158,61,128,133,245,135,96,232,28,206,209,44,152,13,77,229,222,209,250,155]},"announce":[],"urlList":[]}}