{"title":"Jews Play Good Cop Role in Gaza","uid":6248469,"size":1270229,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e9436263f6df40dad127374f0d8a2dce644dfec&amp;dn=Jews+Play+Good+Cop+Role+in+Gaza&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ImSoJaded","files":2,"time":1300314714,"description":"\n\n\n\nE book.\n\n\n\nJews Play Good Cop Role in Gaza.\n\n\n\n\n\n In an attempt to convince humanity that some jews are good,\nand that only the evil &quot;bad cop&quot; jews are causing our problems many jews are\nemployed in the position of the &quot;good cop&quot;. In this role, jews often take up the\nlead in protests against jewish crimes and subversion, to give us the\nappearance that only really bad ones need to be dealt with, and that\nsomehow the rest are harmless, but this is not the case.\n\n\nThe jews are known to be some of the biggest protesters that ever existed, but\nthat's how you cover up being the biggest perpetrators of crimes against\nhumanity. They protest everything from the price of a loaf of bread, to other\njews who pose as Nazis, or even their own puppet presidential candidates.\nSome jews protest against the jewish plot for world domination, usually\nclaiming &quot;zionists&quot; to be the problem, while other jews protest against\nrepublicans and democrats, for the uninitiated who haven't figured out the\nproblem is jews, not because they have an affinity for one party or the other.\n\nRacism and supremacy are key features of jews, and especially the ones who\npretend to protest the other jews for you. If you are foolish enough to believe\nthat any of them will actually help you stop the rest of the tribe, rest assured\nwhen your back is turned, they laugh at your naivety like hyenas seem to laugh\nat their prey before the kill.\n\n","torrent":{"xt":"urn:btih:9e9436263f6df40dad127374f0d8a2dce644dfec","amp;dn":"Jews+Play+Good+Cop+Role+in+Gaza","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e9436263f6df40dad127374f0d8a2dce644dfec","infoHashBuffer":{"type":"Buffer","data":[158,148,54,38,63,109,244,13,173,18,115,116,240,216,162,220,230,68,223,236]},"announce":[],"urlList":[]}}