{"title":"Enough(2002)DVDRip.AC3(ENG)-DROCK","uid":6265967,"size":733870415,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9eec74e6cb41b04b7428b6ef7ed78db1446a5869&amp;dn=Enough%282002%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1300909632,"description":"A Cinderella story turns into a nightmare when a former waitress' perfect marriage gives way to adultery and physical abuse in this combination of domestic drama and revenge thriller. Motherless young woman Slim (Jennifer Lopez) works in a San Francisco diner with her best friend, Ginny (Juliette Lewis). After almost succumbing to the slick flirtation of an insincere customer (Noah Wyle), she is rescued by another dashing diner named Mitch (Bill Campbell). A few years later, the now happily married couple seem to have it all -- a perfect house, a precocious daughter (Tessa Allen), and a comfortable life. Then, Slim discovers that Mitch is actually a lothario who has been sleeping with other women behind her back. When she protests, he slaps her around and uses daughter Gracie as leverage to keep her in line. Slim enlists the help of her friends to escape with her child, though Mitch attacks and very nearly kills her in the process. Going on the lam, Slim adopts a series of new identities, wigs, and residences to avoid the goons Mitch has sent to retrieve her. Along the way, she receives help from Joe (Dan Futterman), a friend and old flame from college. Ultimately, Mitch and his unexpected allies so terrify Slim that she must turn the tables and transform herself from hunted to hunter. In doing so, she receives some surprise assistance of her own -- from Jupiter (Fred Ward), the rich father who abandoned her mother years ago. Although the soundtrack to Enough features the music of star J. Lo, the title song was written especially for the film by Magnolia tunesmith Aimee Mann.\n\nRipped with Handbrake.\n\nLength: 1 Hour 56 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:9eec74e6cb41b04b7428b6ef7ed78db1446a5869","amp;dn":"Enough%282002%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eec74e6cb41b04b7428b6ef7ed78db1446a5869","infoHashBuffer":{"type":"Buffer","data":[158,236,116,230,203,65,176,75,116,40,182,239,126,215,141,177,68,106,88,105]},"announce":[],"urlList":[]}}