{"title":"Coast to Coast AM - 2011.02.07 - Egypt Uprising &amp; Mythology","uid":6180059,"size":55105274,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9ef9e0939bbe8e7163fac8b677c673b060476681&amp;dn=Coast+to+Coast+AM+-+2011.02.07+-+Egypt+Uprising+%26+Mythology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pegasus77","files":5,"time":1297919464,"description":"Egypt Uprising &amp; Mythology\n \nDate: \t02-07-11\nHost: \tGeorge Noory\nGuests: William Henry, Michael Shedlock\n\nInvestigative mythologist William Henry was leading a tour in Egypt when the revolution suddenly began. He recapped what he saw in Egypt, and how he escaped the chaos, violence, and military lock down, as well as his study of ancient Egypt's iconography and wisdom traditions. His tour, begun on January 19th included 24 people, and was going fine. After two days in Giza exploring the pyramids, they traveled south for a cruise on the Nile. When they flew from Cairo to Aswan to begin their cruise, they encountered a British man in the security line, who cryptically said &quot;wait till you see what happens in Egypt next week,&quot; which in retrospect made Henry wonder if the Egyptian uprising had been carefully planned rather than spontaneous.\n\nWhen they returned to Cairo on January 28th, the demonstrations had been going on for several days, and a curfew was announced. There was gunfire outside their hotel room, and tanks rolling through the area, and they didn't know if they'd get out. Cobbling together various resources, the group journeyed to the Cairo airport passing checkpoints guarded by neighborhood gangs with makeshift weapons. At the airport, mayhem reigned, as 18,000 people were all trying to go through security at the same time, and no one could print out their boarding passes because the Internet had been shut down. Henry's group pulled together as a team, and eventually all successfully got out on various planes.\n\nHe noted that Zahi Hawass, who recently created new restrictions for touring the temples, is a Mubarak follower, and as a Cabinet member, is the #3 person in their administration, and could possibly rise to power there. Henry also talked about his visit to the temple of Hathor at Denderah, which on the ceiling features images of the gods sailing on their ships of eternity. This imagery matches the way modern science depicts a wormhole, he commented.\nUnemployment &amp; the Economy\n\nFirst hour guest, financial analyst Mish Shedlock talked about unemployment and the economy. It was recently announced that the unemployment rate was lowered from 9.4% to 9%, but he attributes this to people dropping out of looking for work entirely, rather than more jobs being created.\n\nNews segment guests: J.R. Berry, Glynis McCants\n\nWebsite(s):\nwilliamhenry.net\nglobaleconomicanalysis.blogspot\n\nVideo(s):\nSoul Rising\n\nBook(s):\n* Cloak of the Illuminati","torrent":{"xt":"urn:btih:9ef9e0939bbe8e7163fac8b677c673b060476681","amp;dn":"Coast+to+Coast+AM+-+2011.02.07+-+Egypt+Uprising+%26+Mythology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ef9e0939bbe8e7163fac8b677c673b060476681","infoHashBuffer":{"type":"Buffer","data":[158,249,224,147,155,190,142,113,99,250,200,182,119,198,115,176,96,71,102,129]},"announce":[],"urlList":[]}}