{"title":"The Idolmaker Dvdrip H264 Bookerdog.mp4","uid":4995337,"size":911234011,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9f31fb45118040c4bddc61094ccc87d3eb982c20&amp;dn=The+Idolmaker+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookerdog","files":-1,"time":1247249099,"description":"Category\tDramas, Musical, Character Study\nStarring\tRay Sharkey, Peter Gallagher, Tovah Feldshuh, Paul Land\nDirector\tTaylor Hackford\nEditor\tArthur Schmidt\nThis 119 minute feature film is a DVD starring Joe Pantoli ano, Olympia Dukakis and Peter Gallagher.\nA young songwriter from the Bronx who doesn't have the looks to be a teen star himself transforms others into rock legends. He's the Idolmaker. Based on the career of Bob Marcucci, who created teen idols Frankie Avalon and Fabian, the film stars Ray Sharkey in a tour-de-force performance in the title role, with strong supporting work from Tovah Feldshuh, Peter Gallagher, Olympia Dukakis, and Joe Pantoliano (best known as RISKY BUSINESS's Guido the Killer Pimp). THE BRADY BUNCH's Maureen McCormick also plays a small role.\n\nVincent Vaccardi (Ray Sharkey) has talent and drive, but in the singing world of 1959, he knows he has to have looks too. Determined to find success for his songs, he latches on to a local performer and shapes his image into Tommy Dee (Paul Land), who's suddenly an overnight sensation. As his own power and income increase, Vinnie doesn't realize he's lost his focus on the work and is becoming a feral, driven taskmaster. When Tommy starts to agitate for bigger things, Vinnie realizes he'd better have more than one trick up his sleeve. He finds another fresh face (an unbelievably young Peter Gallagher), whom he transforms from Guido the busboy into Caesare--a reclusive, mysterious singing sensation. Vinnie's formula is on the money, and Caesare is catapulted to fame as well, but Vinnie finally begins to see that he may have left something important behind, and that he's not the only one who might have to pay for it. Director Taylor Hackford's THE IDOLMAKER is a brutal exploration of the creation, manipulation, and destruction of teen idols and their audience in the late 1950s and early 1960s.","torrent":{"xt":"urn:btih:9f31fb45118040c4bddc61094ccc87d3eb982c20","amp;dn":"The+Idolmaker+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f31fb45118040c4bddc61094ccc87d3eb982c20","infoHashBuffer":{"type":"Buffer","data":[159,49,251,69,17,128,64,196,189,220,97,9,76,204,135,211,235,152,44,32]},"announce":[],"urlList":[]}}