{"title":"Michael Jackson - This Is It [New Nov].mpg","uid":5184012,"size":63553540,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a09062b7a64686a3d2eeb45d44c86a88c7e9eb7e&amp;dn=Michael+Jackson+-+This+Is+It+%5BNew+Nov%5D.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"claudeq","files":1,"time":1259383260,"description":"&quot;This Is It&quot; is a song from Michael Jackson's sixth posthumous compilation album, This Is It, which accompanies the Sony Pictures motion picture release Michael Jackson's This Is It, and according to Epic the song is &quot;available exclusively on the forthcoming album&quot;.\n\nSony misleadingly referred to the song as a &quot;new single&quot; during its promotion, but it later emerged that the song would only be released to radio, and not be available to buy or download as a single release.[3]\n\nPaul Anka, who co-wrote the song, stated that it was recorded in 1983 for a duet intended between him and Jackson on his album Walk a Fine Line under the original title of &quot;I Never Heard&quot;. The song was later included in Sa-Fire's album I Wasn't Born Yesterday. The demo of the song was recorded in Anka's studio in Carmel, CA and the tape was sent to a studio in Hollywood for finishing touches. However, Anka claims Jackson &quot;stole the tapes&quot; from the studio. Only Jackson is credited writing the song in the booklet of the This Is It album and theatrical film.\n\nJackson's copy of the original recording of &quot;This Is It&quot; was apparently found in a box of tapes with only Jackson's voice and a piano accompaniment. Strings were then added to the bare-bones recording, along with backing vocals from Jackson's brothers, including Alvin Chea of Take 6, and finger-click percussion.[5] The Extended Orchestra version in the album also has the orchestra playing in the beginning before the conductor taps his baton.\n\nThe song premiered worldwide on October 12, 2009, at midnight on MichaelJackson.com","torrent":{"xt":"urn:btih:a09062b7a64686a3d2eeb45d44c86a88c7e9eb7e","amp;dn":"Michael+Jackson+-+This+Is+It+%5BNew+Nov%5D.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a09062b7a64686a3d2eeb45d44c86a88c7e9eb7e","infoHashBuffer":{"type":"Buffer","data":[160,144,98,183,166,70,134,163,210,238,180,93,68,200,106,136,199,233,235,126]},"announce":[],"urlList":[]}}