{"title":"Spektrum der Wissenschaft 2011 03","uid":6206436,"size":12512022,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a099a4f066ca773f071ec2c523067233fcd2f346&amp;dn=Spektrum+der+Wissenschaft+2011+03&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"papiertiger","files":-1,"time":1298825343,"description":"Ausgabe 03/2011 der Zeitschrift &quot;Spektrum der Wissenschaft&quot;:\n\nMit dieser Ausgabe beginnt unsere Serie Die grÃƒÂ¶ÃƒÅ¸ten RÃƒÂ¤tsel der Philosophie, die wir mindestens bis August 2011 fortfÃƒÂ¼hren werden. Wer bin ich? fragt zu Beginn Albert Newen, und Michael Pauen will in Eine Frage der Selbstbestimmung wissen: Wie frei sind unsere Entscheidungen wirklich? FÃƒÂ¼r die kommenden Ausgaben haben wir schon weitere Autoren gefunden. Unter anderem fÃƒÂ¼hrt Michael Esfeld in die gegenwÃƒÂ¤rtige Philosophie der Physik ein, Julian Nida-RÃƒÂ¼melin widmet sich der Gerechtigkeit und Gottfried Vosgerau analysiert Sprache und Denken.\n\nDie meisten Mutationen im Erbgut verschiedener Menschengruppen entpuppen sich als ÃƒÂ¼berraschend alt. Neuere leicht erkennbare Spuren von Umweltanpassungen hingegen sind selten, wie der Humangenetiker Jonathan K. Pritchard von der University of Chicago berichtet - befindet sich die Evolution auf der Kriechspur?\n\nAuÃƒÅ¸erdem im Heft:\nRoboter als Naturforscher: Prototypen fÃƒÂ¼hren vor, wie Automaten wissenschaftlich arbeiten; Reise ins Innere des Neutrons: Forscher rÃƒÂ¼cken den Geheimnissen des Kernbausteins immer nÃƒÂ¤her; Giftgas mit Heilkraft: Schwefelwasserstoff kann tÃƒÂ¶dlich sein - oder bei Herzinfarkten helfen; und vieles mehr","torrent":{"xt":"urn:btih:a099a4f066ca773f071ec2c523067233fcd2f346","amp;dn":"Spektrum+der+Wissenschaft+2011+03","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a099a4f066ca773f071ec2c523067233fcd2f346","infoHashBuffer":{"type":"Buffer","data":[160,153,164,240,102,202,119,63,7,30,194,197,35,6,114,51,252,210,243,70]},"announce":[],"urlList":[]}}