{"title":"Cold Feet - Seizoen 5 (2 DVD's) Juultje TBS","uid":6136000,"size":9362474127,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a0a34b160ebc96bc7cd0e9f28fb2dfa609f35ef8&amp;dn=Cold+Feet+-+Seizoen+5+%282+DVD%5C%27s%29+Juultje+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"juutje","files":-1,"time":1296306176,"description":"\nCold Feet - Seizoen 5 (2 DVD's)\n\nDe complete 5de serie met de aller-allerlaatste aflevering. In deze laatste complete serie kunnen we ze nog ÃƒÂ©ÃƒÂ©n keer volgen: de 30-plussers uit Manchester. Met ups en downs gaan ze door hun huwelijk, seksleven en vriendenkring en laten ze ons wederom genieten van hilarische, maar ook dieptragische momenten.\nDeze nieuwe serie opent met de nasleep van serie vier die in AustraliÃƒÂ« eindigde als een smartlap: Rachel beviel van een zoon na een roerige periode voor haar en Adam. Pete en Jo trokken de huwelijksbanden aan nadat ze iedereen - inclusief elkaar - ervan overtuigd hadden dat ze voor elkaar gemaakt waren en\nDavid was helemaal de kluts kwijt nadat Karen haar buitenechtelijke relatie had moeten bekennen. Het is zes maanden na de terugkeer van Sydney. Adam en Rachel storten zich op het familieleven met hun zoontje Matt en het begint langzaam tot Adam door te dringen dat ze nu met zijn drieÃƒÂ«n zijn. Pete en Jo keren terug uit AustraliÃƒÂ« en ontdekken dat het leven met een schoonmoeder niet zo zonnig is als het land waar ze net vandaan komen. David en Karen ontdekken dat vriendschappelijk uit elkaar gaan niet zo gemakkelijk is als het lijkt\nen Ramona geniet van haar siÃƒÂ«sta's met een lokale badmeester.\n\n[IMG]http://i845.photobucket.com/albums/ab16/hortencia9/plaatjes%20film/marjan/films/coldfeetES1209_468x279.jpg[/IMG]\n\nEnglish\t\n\nThree months after the birth of their baby, Adam is given a redundancy notice at work. After he gets a new job he and Rachel are told they will be evicted from their house after their landlord died. As they search for a new place to live, Adam's estranged father, Bill (Ian McElhinney), arrives. Bill and Adam patch up their relationship and he offers Adam and Rachel the money to buy their own house. On the way to the auction, Rachel is killed in a car crash, leaving Adam devastated. Her ashes are scattered in the final episode. Karen and David are going through an amicable divorce but when she starts seeing Mark again and David starts seeing his new lawyer Robyn (Lucy Robinson), it escalates, as they begin using each others' adultery and her alcoholism as a basis for custody of the children. Karen stops seeing Mark and the divorce cools down. Both re-evaluate their lives after Rachel's death; David develops his relationship with Robyn and Karen plans a trip with Ramona. Pete and Jo's marriage deteriorates when she sleeps with a co-worker (Richard Armitage) on a work weekend away. Jenny returns from New York in Episode 4 and moves back in with Pete after he asks Jo for a divorce.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0168596/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0168596/&lt;/a&gt;\n\n\n\nVideo: DVD Rip Retail\nAudio: AC  3 . 2 English\nSubs: Dutch\nMenu: Yes\nID : 224 (0xE0)\nFormaat: MPEG Video\nFormaatversie: Version 2\nBitrate-modus : Variabel\nBreedte: 720 pixels\nHoogte: 576 pixels\nBeeldverhouding: 4:3\nFramerate: 25,000 fps\nStandaard: PAL\nCover+Label: Yes\n\n\n\nEnjoy The Serie\n","torrent":{"xt":"urn:btih:a0a34b160ebc96bc7cd0e9f28fb2dfa609f35ef8","amp;dn":"Cold+Feet+-+Seizoen+5+%282+DVD%5C%27s%29+Juultje+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0a34b160ebc96bc7cd0e9f28fb2dfa609f35ef8","infoHashBuffer":{"type":"Buffer","data":[160,163,75,22,14,188,150,188,124,208,233,242,143,178,223,166,9,243,94,248]},"announce":[],"urlList":[]}}