{"title":"The Back-up Plan English R5 LiNE XViD","uid":5516417,"size":1473119639,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a0dc31c2a32e6d13698ffdcb2ce9480f70127edc&amp;dn=The+Back-up+Plan+English+R5+LiNE+XViD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"panpa","files":3,"time":1272302202,"description":"Zoe (Jennifer Lopez) is well aware that her biological clock is ticking, but she just can't find the type of guy she'd want to settle down and start a family with. Eventually, she makes the decision to become a single mother. The very same day that Zoe follows through on her plan, however, she meets Stan (Alex O'Loughlin), a single charmer whom she thinks would make a great father. While at first Zoe struggles to hide her condition from Stan, before long there's no denying the truth and she decides to spill the beans. Much to her surprise, Stan responds enthusiastically, announcing that he's in it for the long haul. Over the course of the next nine months, Zoe and Stan enter into a whirlwind romance, begin drawing up wedding plans, and mapping out the rest of their lives together. But will their burgeoning relationship collapse under the stress of all this weight, or was it simply meant to be that Zoe and Stan would both find each other at such a crucial turning point in each other's lives?","torrent":{"xt":"urn:btih:a0dc31c2a32e6d13698ffdcb2ce9480f70127edc","amp;dn":"The+Back-up+Plan+English+R5+LiNE+XViD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0dc31c2a32e6d13698ffdcb2ce9480f70127edc","infoHashBuffer":{"type":"Buffer","data":[160,220,49,194,163,46,109,19,105,143,253,203,44,233,72,15,112,18,126,220]},"announce":[],"urlList":[]}}