{"title":"ANTONIO VIVALDI - ARSILDA REGINA DI PONTO[TNTVILLAGE]","uid":5115657,"size":760446796,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a0f72818d6ff0b88670cd0d0c0b945db419ae3e9&amp;dn=ANTONIO+VIVALDI+-+ARSILDA+REGINA+DI+PONTO%5BTNTVILLAGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":33,"time":1255047456,"description":"[b][color=blue]ANTONIO VIVALDI[/COLOR][color=red] \n\nARSILDA REGINA DI PONTO[/color][/b]\n\n\n[b][color=green]::-&gt;COVER&lt;-::[/b][/color]\n\n\n[IMG]http://img23.imageshack.us/img23/2245/arsilda.jpg[/IMG]\n\n\n[b][color=green]::-&gt;DATI ALBUM&lt;-::[/color][/b]\n[color=teal]\n \nElena Cecchi Fedi (Mirinda), Nicky Kennedy (Barzane), Alessandra Rossi (Nicandro) (soprano); \nSimonetta Cavalli (Arsilda), Lucia Sciannimanico (Lisea) (mezzo); Joseph Cornwell (Tamese) (tenor); Sergio Foresti (Cisardo) (bass)\nCoro da Camera Italiano; Modo Antiquo/ Federico Maria Sardelli\nrec. July 2001, Chiesa del Santissimo Crocifisso, Barga, Italy. DDD \n\n\n[b][color=green]::-&gt;NOTIZIE&lt;-::[/color][/b]\n\n Arsilda, regina di Ponto\n\nTitolo originale: \tArsilda, regina di Ponto\nLingua originale: \titaliano\nGenere: \tdramma per musica\nMusica: \tAntonio Vivaldi\nLibretto: \tDomenico Lalli\nFonti letterarie: \t\nAtti: \ttre\nEpoca di composizione: \t1715\nPrima rappresentazione: \t27 o 28 ottobre 1716\nTeatro: \tTeatro Sant'Angelo di Venezia\nPrima rappresentazione italiana: \t\nTeatro: \t\nVersioni successive:\nPersonaggi:\n\n    * Arsilda - (mezzosoprano)\n    * Lisea - (mezzosoprano)\n    * Mirinda - (soprano)\n    * Barzane - (soprano)\n    * Tamese - (tenore)\n    * Cisardo - (basso)\n    * Nicandro - (soprano)\n\n\n\n\nArsilda, regina di Ponto ÃƒÂ¨ un dramma per musica in tre atti del compositore Antonio Vivaldi su libretto di Domenico Lalli.\n\nTerza opera di Vivaldi, ebbe la sua prima messa in scena al Teatro Sant'Angelo di Venezia il 27 o il 28 ottobre del 1716. Come asserito dal Pallade Veneto, \n\nuna rivista veneziana dell'epoca, l'opera ebbe molto successo e fu portata in scena senza difficoltÃƒÂ , dopo essere stata vistata dal censore, l'inquisitore \n\ngenerale della Repubblica di Venezia Tommaso Maria Gennari. Dopo la rapresentazione veneziana, il lavoro fu ripreso e rappresentato alla corte di Kassel e \n\nprobabilmente anche a Dresda. Inoltre varie copie di parecchie arie del dramma sono state ritrovate, talvolta tradotte e/o riadattate, a Praga e a Cracovia. \n\nDedicatario dell'opera fu il Conte Giacomo Brivio di Brochles.\n\nQuesto lavoro si colloca nella prima fase dell'attivitÃƒÂ  operistica del Prete Rosso, in un momento nella storia dell'opera veneziana dove si stava concludendo \n\nun'epoca in cui compositori come Carlo Francesco Pollarolo, Antonio Lotti e Francesco Gasparini, che dominavano la vita musicale della cittÃƒÂ , rappresentavano \n\ni loro lavori riferendosi al vecchio modello del dramma del secolo precedente, che aveva fatto la fortuna di Venezia. Ma nel 1713 avvenne una svolta, \n\nGasparini tornÃƒÂ² a Roma, il tradizionale Teatro San Cassiano fu chiuso e Vivaldi era in procinto di debuttare nei teatri veneziani. Egli cercÃƒÂ² quindi tra il \n\n1714 e 1715 di stabilire la sua reputazione e la sua autoritÃƒÂ , sia di compositore che di impresario, nei teatri veneziani (soprattutto al Sant'Angelo), \n\nimpresa ardua in una cittÃƒÂ  aristocraticamente conservativa, dove i teatri erano sotto il controllo di patrizi. A prova di ciÃƒÂ² nell'autunno del 1715 fu \n\nstipulato un contratto tra i proprietari del Sant'Angelo e l'impresario Pietro Denzio: questo pose fine alla crescente influenza di Vivaldi su questo \n\npalcoscenico. Fu quindi relagato al piÃƒÂ¹ piccolo Teatro San MoisÃƒÂ©, ma tornÃƒÂ² al Sant'Angelo nell'autunno del 1716, dove fu data appunto Arsilda Regina di \n\nPonto. Nel frattempo l'ex cantante Pietro Ramponi succedette a Denzio nella carica d'impresario, perÃƒÂ² nonostante questo anche il Prete Rosso risulta apparire \n\ncome impreario ufficiale durante questa stagione allo stesso teatro.\n\nNonostante Arsilda, regina di Ponto sia stata messa in scena nell'ottobre del 1716, il dramma era giÃƒÂ  pronto un anno prima, ma fu soggetto a un lungo e \n\nlaborioso lavoro di tagli, revisioni e riadattamenti, sia nella musica che nel testo, al fine di evitare possibili censure.\n\n \n\n Trama\n\n \nAntefatto\n\nDopo la morte del marito, la vecchia Regina di Cilicia, Antipatra, regna assieme al cognato Cisardo fino a che i suoi due figli gemelli, Tamese e Lisea, non \n\nraggiungono la maggiore etÃƒÂ . Per sedare una rivolta Tamese si reca verso i confini del regno assieme a Barzane, il giovane Re di Lidia e fidanzato segreto di \n\nsua sorella. Vengono ospitati presso il Re di Ponto, dove s'innamorano entrambi di sua figlia Arsilda; questo causa la rottura della loro amicizia. Arsilda \n\nsceglie Tamese come promesso sposo e Barzane giura vendetta, perÃƒÂ² nel viaggio di ritorno verso casa Tamese naufraga. PoichÃƒÂ© al trono di Cilicia ÃƒÂ¨ possibile \n\nsolo la successione maschile, Antipatra, credondolo morto, costringe la figlia Lisea a fingere di essere suo fratello gemello. Quindi dopo la morte della \n\nmadre Lisea le succede al trono.\n\nAtto I\n\nSiamo nel palazzo reale di Ama, capitale di Cilicia, dove Lisea, mascherata da Tamase, annuncia alla folla festante il proprio fidanzamento con la \n\nprincipessa di Ponto Arsilda. Tuttavia lo zio Cisardo invita tutti nel portare attenzione, in quanto ÃƒÂ¨ giunta notizia che un nemico ÃƒÂ¨ entrato in cittÃƒÂ  al \n\nfine di rapire la promessa sposa.\nNel suo appartamento privato il &quot;finto Tamase&quot; rifiuta ad Arsilda per l'ennesima volta di redimere la promessa di matrimonio, la quale ne rimane \n\nprofondamente ferita. Entra poi Nicandro, il quale giura fedeltÃƒÂ  all'amico &quot;Tamese&quot; e promette di combattere contro il nemico infiltrato. Quando Lisea rimane \n\nfinalmente sola, puÃƒÂ² dunque confidare la sua disperazione all'amica Mirinda; ambedue si scambiano confidenze e riflessioni sull'amore. Nel frattempo l'ostile \n\nintruso, che in realtÃƒÂ  non ÃƒÂ¨ altro che Barzane, venuto a conoscenza del ritorno di &quot;Tamese&quot; decide di portare a compimento il suo passato giuramento di \n\nvendetta, ossia di uccidere l'ex amico. Ma il vero Tamase non ÃƒÂ¨ morto nel naufragio, bensÃƒÂ¬ si ÃƒÂ¨ salvato e ora ÃƒÂ¨ nei parchi nella reggia mascherato da \n\ngiardiniere: egli ÃƒÂ¨ profondamente amareggiato in quanto crede che la sorella gli abbia volutamente usurpato il trono. Appena Barzane scova Arsilda, le tende \n\nun'ÃƒÂ¬mboscata, ma ella viene prontalmente salvata da Tamese, il quale perÃƒÂ² non le rivela la sua vera identitÃƒÂ . Arsilda si sente subito attratta dall'ignoto \n\nsalvatore, mentre Barzane viene catturato. Poco dopo Lisea, che era occupata in una cerimonia di beatificazione in un tempio, viene informata dell'arresto \n\ndalla zio.\n\nAtto II\n\nSempre mascherata da Tamese, Lisea si reca da Barzane che ora si trova in prigione e lo rimprovera con veemenza di aver tradito la sua amante segreta (ossia \n\nlei stessa); Questa accusa confonde alquanto Barzane.\nArsilda presenta a Lisea il suo soccoritore, il quale non intende rivelare il suo nome la sua provenienza; le risposte evasive di Tamese fanno insospettire \n\nla sorella, la quale crede che egli sia proprio il fratello creduto morto; invece Arsilda, che si sente attratta sentimentalmente da lui, pensa che il &quot;finto \n\ngiardiniere&quot; sia un suo ammiratore giunto da Ponto. Lisea, intuendo questa &quot;attrazione&quot;, riesce a differire la celebrazione del matrimonio.\nIn onore della dea Diana viene tenuta una caccia. Lisea, che s'inganna sempre piÃƒÂ¹ dinanzi gli occhi di Arsilda, decide di tornare da Barzane al quale rivela \n\nche la sua amante segreta ÃƒÂ¨ ancora viva e che sta nascosta nel palazzo. Inoltre gli riferisce che sta soffrendo moltissimo e consegna a lui una chiave con la \n\nquale potrÃƒÂ  raggiungerla. Barzane chiede dunque al &quot;finto Tamase&quot; di perdonarlo per aver tradito la sorella. Nel frattempo il vero Tamese sta consolando \n\nArsilda, la quale ÃƒÂ¨ un po' confusa. Cisardo che ha avuto modo di origliare la conversazione, ÃƒÂ¨ inferocito per l'inganno della nipote.\n\nAtto III\n\nLisea (non piÃƒÂ¹ mascherata da Tamese) attende nelle catacombe del palazzo l'arrivo di Barzane.\nAppena giunto, Barzane le chiede perdono e le promette di chiedere al &quot;fratello&quot; di sposarla. Lisea, a causa della sua gioia, non riesce a trovare uno sbocco \n\na questa complessa situazione.\nMirinda confessa a Tamese la propria casta attrazione verso di lui e subito dopo Cisardo, capito chi ÃƒÂ¨ il vero Tamase, tenta di dissuadere il &quot;finto \n\ngiardiniere&quot; di usurpare al trono. Di nascosto Lisea confessa allo zio Cisardo di esser stata costretta ad effettuare lo scambio di ruoli per ragioni di \n\nstato e di aver scoperto successivamete che il fratello era ancora vivo.\nPoco dopo Barzane chiede al Lisea (nuovamente travestita da Tamese) la mano della sorella. Cisardo spiega al popolo la confusa situazione e Lisea cede al \n\nfratello il trono. L'opera si conclude con il duplice matrimonio Tamese-Arsilda e Barzane-Lisea.\n\n\n\n\n[b][color=green]::-&gt;DATI TECNICI E NOTE&lt;-::[/color][/b]\n[color=red]\n[b]3 CD formato APE + CUE\nCover e Booklet allegati\n[/b]\n[/color]\n[color=RED][B]\n\nTNTVILLAGE.SCAMBIOETICO.ORG[/b][/color]","torrent":{"xt":"urn:btih:a0f72818d6ff0b88670cd0d0c0b945db419ae3e9","amp;dn":"ANTONIO+VIVALDI+-+ARSILDA+REGINA+DI+PONTO%5BTNTVILLAGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0f72818d6ff0b88670cd0d0c0b945db419ae3e9","infoHashBuffer":{"type":"Buffer","data":[160,247,40,24,214,255,11,136,103,12,208,208,192,185,69,219,65,154,227,233]},"announce":[],"urlList":[]}}