{"title":"Coast to Coast AM - 2011.02.25 - Middle East Upheaval, Oil And T","uid":6204991,"size":55204782,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a1720ed7ff9ca8b228170e0a02bb9756f913121d&amp;dn=Coast+to+Coast+AM+-+2011.02.25+-+Middle+East+Upheaval%2C+Oil+And+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pegasus77","files":5,"time":1298758974,"description":"Mid East Upheaval, Oil, &amp; the Elite\n \nDate: 02-25-11\nHost: John B. Wells\nGuests: Lindsey Williams\n\nFilling in for George Noory, guest host John B. Wells (email) welcomed minister Lindsey Williams for a discussion on the tumultuous events in the Middle East, how rising oil prices are going to affect the US economy, and who may be behind it all. According to Williams, the world is ruled by an elite group of people, some of whom he got to know during his 3-year tenure as a chaplain for oil companies operating in Alaska. &quot;Nothing ever happens in politics, or in Washington, or in monetary affairs, that [was not] planned first by the elite of the world,&quot; he said.\n\nTo illustrate his point, Williams revealed he had been told there would be a crisis in the Middle East several months before the unrest erupted in Egypt. The turmoil in that region has been planned and will spread throughout the Middle East, he explained, noting that within 12 months the price of oil will approach $200 a barrel. &quot;Watch the price of crude oil and you will know the progression of the elite's program,&quot; Williams added. The cost of gas will skyrocket as US currency is further devalued, he said, warning that by the end of 2012 the dollar will be dead. Making the dollar worthless has always been part of the elite's plan, he added.\n\nAs evidence, he pointed to a deal former Secretary of State Henry Kissinger made with various oil-producing countries (excluding Iraq and Iran). In return for America's promise to buy oil from them, these nations pledged to purchase treasury bills to prop up the US economy. As stability in the Mid East decreases, along with the value of their US-backed securities, \n\nAmerica will begin producing oil from its own fields, he explained. The elite's long-range plan is to bring the country back to new heights under the control of their new world order, he said. To protect oneself from the coming days, Williams suggested purchasing gold and silver, and storing six months worth of food and water.\n\nThe final hour of the program was devoted to Open Lines.\n\nWebsite(s):\nprophecyclub.com\n\nBook(s):\nThe Energy Non-Crisis","torrent":{"xt":"urn:btih:a1720ed7ff9ca8b228170e0a02bb9756f913121d","amp;dn":"Coast+to+Coast+AM+-+2011.02.25+-+Middle+East+Upheaval%2C+Oil+And+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1720ed7ff9ca8b228170e0a02bb9756f913121d","infoHashBuffer":{"type":"Buffer","data":[161,114,14,215,255,156,168,178,40,23,14,10,2,187,151,86,249,19,18,29]},"announce":[],"urlList":[]}}