{"title":"Creedence Clearwater Revival - Forever (1995) WMA320","uid":6166477,"size":279557241,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a20af31392cf24db16f241f33ce7ffc5944467bd&amp;dn=Creedence+Clearwater+Revival+-+Forever+%281995%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1297406506,"description":"At a time when rock was evolving further and further away from the forces that had made the music possible in the first place, Creedence Clearwater Revival brought things back to their roots with their concise synthesis of rockabilly, swamp pop, R&amp;B, and country. Though CCR was very much a group in their tight, punchy arrangements, their vision was very much singer, songwriter, guitarist, and leader John Fogerty's. Fogerty's classic compositions for Creedence both evoked enduring images of Americana and reflected burning social issues of the day. The band's genius was their ability to accomplish this with the economic, primal power of a classic rockabilly ensemble. \n\nThe key elements of Creedence had been woodshedding in bar bands for about a decade before their breakthrough to national success in the late '60s. John's older brother Tom formed the Blue Velvets in the late '50s in El Cerrito, CA, a tiny suburb across the bay from San Francisco. By the mid-'60s, with a few hopelessly obscure recordings under their belt, they'd signed to Fantasy, releasing several singles as the Golliwogs that went nowhere. In fact, there's little promise to be found on those early efforts, primarily because Tom, not John, was doing most of the singing. The group only found themselves when John took firm reigns over the band's direction, singing and writing virtually all of their material. \n\nOn their first album as Creedence Clearwater Revival in 1968, the group played it both ways, offering extended, quasi-psychedelic workouts of the '50s classics &quot;I Put a Spell on You&quot; and &quot;Suzie Q.&quot; The latter song became their first big hit, but the band didn\\'t really bloom until &quot;Proud Mary&quot;, a number-two single in early 1969 that demonstrated John's talent at tapping into Southern roots music and imagery with a natural ease. It was the start of a torrent of classic hits from the gritty, Little Richard-inspired singer over the next two years, including &quot;Bad Moon Rising&quot;, &quot;Green River&quot;, &quot;Down on the Corner&quot;, &quot;Travelin' Band&quot;, &quot;Who'll Stop the Rain&quot;, &quot;Up Around the Bend&quot; and &quot;Lookin' Out My Back Door&quot;. \n\nCreedence also made good albums, but their true forte was as a singles band -- their LPs contained some filler, both in the forms of average original material and straightforward covers of rock &amp; roll chestnuts. When the Beatles broke up in early 1970, CCR was the only other act that provided any competition in the fine art of crafting bold, super-catchy artistic statements that soared to the upper reaches of the charts every three or four months. Although they hailed from the San Francisco area, they rarely succumbed to the psychedelic indulgences of the era. John Fogerty also proved adept at voicing the concerns of the working class in songs like &quot;Fortunate Son&quot;, as well as partying with as much funk as any white rock band would muster on &quot;Travelin' Band&quot; and &quot;Down on the Corner&quot;. \n\nWith John Fogerty holding such a strong upper hand, Creedence couldn't be said to have been a democratic unit, and Fogerty's dominance was to sow the seeds of the group's quick dissolution. Tom Fogerty left in 1971 (recording a few unremarkable solo albums of his own), reducing the band to a trio. John allowed drummer Doug Clifford and bassist Stu Cook equal shares of songwriting and vocal time on the group's final album, Mardi Gras (1972), which proved conclusively that Fogerty's songs and singing were necessary to raise CCR above journeyman status. \n\nIt was John Fogerty, of course, who produced the only notable work after the quartet broke up. Even his solo outings, though, were erratic and, for nearly ten years, nonexistent as he became embroiled in a web of business disputes with Fantasy Records. His 1984 album Centerfield proved he could still rock in the vintage Creedence mode when the spirit moved him, but Tom Fogerty's death in 1990 ended any hopes of a CCR reunion with the original members intact.\n\nby Richie Unterberger\n\nTRACKLIST:\nDisc 1:\n01 - Bad Moon Rising.wma                                         \n02 - Proud Mary.wma                                              \n03 - Up Around The Bend.wma                                      \n04 - Have You Ever Seen The Rain.wma                             \n05 - Hey Tonight.wma                                             \n06 - I Heard It Trough The Grapewine.wma                         \n07 - My Baby Left Me.wma                                         \n08 - Wrote A Song For Everyone.wma                               \n09 - Lodi.wma                                                    \n10 - The Midnight Special.wma                                    \n11 - Run Through The Jungle.wma                                  \n12 - It's Just A Thought.wma                                     \n13 - Walk On The Water.wma                                       \n14 - Night Time Is The Right Time.wma                            \n15 - (Wish I Could) Hideaway.wma                                 \n16 - Cotton Fields.wma                                           \n17 - Someday Never Comes.wma                                     \n18 - Suzie Q.wma             \n\nDisc 2:\n01 - Lookin' Out My Back Door.wma                                \n02 - Travelin' Band.wma                                          \n03 - Down On The Corner.wma                                      \n04 - Who'll Stop The Rain.wma                                    \n05 - Fortunate Son.wma                                           \n06 - Good Golly Miss Molly.wma                                   \n07 - Long As I Can See The Light.wma                             \n08 - Sweet Hitch-Hiker.wma                                       \n09 - Born On The Bayou.wma                                       \n10 - Molina.wma                                                  \n11 - Hello Mary Lou.wma                                          \n12 - Green River.wma                                             \n13 - It Came Out Of The Sky.wma                                  \n14 - Don't Look Now.wma                                          \n15 - Commotion.wma                                               \n16 - Before You Accuse Me.wma                                    \n17 - Ooby Dooby.wma                                              \n18 - I Put A Spell On You.wma \n\nWMA 320Kbps 44100Hz STEREO\n\nMARCELODRGZ\t\t","torrent":{"xt":"urn:btih:a20af31392cf24db16f241f33ce7ffc5944467bd","amp;dn":"Creedence+Clearwater+Revival+-+Forever+%281995%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a20af31392cf24db16f241f33ce7ffc5944467bd","infoHashBuffer":{"type":"Buffer","data":[162,10,243,19,146,207,36,219,22,242,65,243,60,231,255,197,148,68,103,189]},"announce":[],"urlList":[]}}