{"title":"How To Talk With The Dead by Alan Valiant","uid":6265628,"size":395387,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a20f0956d814ed1ad70b20d07501705ab65dc7c1&amp;dn=How+To+Talk+With+The+Dead+by+Alan+Valiant&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"northernsoul1988","files":-1,"time":1300896320,"description":"The author is an independent psychic investigator who, with his late wife, Amanda,\nspent twelve years researching communication with those in the spiritual world. This\nbook reveals the results of their work and contains explicit instructions on how to\nconverse with relatives or friends who have passed on.\nNever before, have the principles of such communication been known but now the\nauthor has revealed the secrets of easily learned methods so that serious seekers of the\nknowledge of their continued existence after death may find the proof that they need.\nWorking independently of any organisation, the author has made an important\nbreakthrough in the technology of communication with the so-called dead and has\nreceived astounding information from the Spiritual Hierarchy which they have asked\nhim to pass on to others wishing to learn the facts about their own existence.\nThe methods described may be used by you, alone and at any time. There is no need\nfor seances, darkened rooms, mediums, trances or special apparatus. All you need to\nstart with are pencil and paper.\nAfter applying the principles in this book, you may end speculation about survival\nafter death because you will know. Your psychic awareness, once awakened, is\nlimitless and it could lead you, as it has done for the author, to unbelievable peace of\nmind and happiness as a result of great enlightenment.\nThe fifty-six principles were given to me by by the late Professor Carl Jung, a High\nSpiritual Being once a very famous man on earth, now enjoying the fruits of his\nlabours on a high plane in the spiritual world where he works with the Hierarchy.\nYour psychic channels are opened wider and wider as you progress with your\npractices and studies.These Principles constitute the most revealing definition of the mind ever disclosed to mankind.","torrent":{"xt":"urn:btih:a20f0956d814ed1ad70b20d07501705ab65dc7c1","amp;dn":"How+To+Talk+With+The+Dead+by+Alan+Valiant","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a20f0956d814ed1ad70b20d07501705ab65dc7c1","infoHashBuffer":{"type":"Buffer","data":[162,15,9,86,216,20,237,26,215,11,32,208,117,1,112,90,182,93,199,193]},"announce":[],"urlList":[]}}