{"title":"Friends of Dean Martinez-Random Harvest(flac)","uid":5186388,"size":224069031,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a26a7d93bdf47697d4d1035b92828cbcfb60a7ed&amp;dn=Friends+of+Dean+Martinez-Random+Harvest%28flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"themadoldman","files":-1,"time":1259491207,"description":"Friends of Dean Martinez: Brad Fordham, Billy Pitman, Bill Elm, Dave Lachance, Mike Semple, Andrew Gerfers.  Personnel: Bill Elm (guitar, strings, organ, glockenspiel, shaker); Erik Wofford, Mike Semple (guitar); Bill Pitman (nylon-string guitar); Dave Lachance, Andrew Gerfers (drums).\nFriends Of Dean Martinez Random Harvest.\nFriends Of Dean Martinez Random Harvest Album Track Listing                    1.\tSo Well Remembered\t\n2.\tRipcord\t\n3.\tThe Winter Palace\t\n4.\tRandom Harvest\t\n5.\tDusk\t\n6.\tWhy Does My Heart Go on Beating\t\n7.\tLost Horizon\t\n8.\tNowhere to Go                                                           Just a year after they issued On the Shore, Friends of Dean Martinez returned with Random Harvest, an album that finds them at their most powerful since A Place in the Sun. However, Random Harvest is darker and more rock-oriented than that album and, indeed, than any of their previous work. The heavy guitars and winding keyboards that run through the album nod to classic rock like Led Zeppelin and the Doors while still staying within the confines of the band's widescreen Southwestern sound. What's more, the album is also Friends of Dean Martinez's most thematically cohesive work; instead of being just filmic, Random Harvest could actually work as a soundtrack, ideally to a smart, stylish horror movie like 28 Days Later. An eerie tension seeps into all of the album, beginning with the taut, jazzy &quot;So Well Remembered&quot; and ending with &quot;Nowhere to Go,&quot; which begins as a bittersweet ballad and, without warning, turns into a rock monster with guitar tones that would make many a metal band jealous. But even within this louder sound, Friends of Dean Martinez are masters of restraint; &quot;Ripcord&quot;'s intense guitars stop short of wanky indulgence, and the very spooky &quot;Winter Palace&quot; does a lot with minimal percussion, organ, and a delicately plucked acoustic guitar. As consistent as the whole album is, Random Harvest's middle stretch is truly outstanding. The title track's icy strings and buzzing bass and guitars combine into something both gorgeous and menacing, like a cross between stoner rock and the atmospherics for which Friends of Dean Martinez are better known. The 11-minute &quot;Dusk&quot; is no less impressive, an appropriately dark and rolling epic with vaguely Middle Eastern guitars that reference Led Zep and the Deftones' prettier moments as well as their own work. &quot;Lost Horizon&quot; reintroduces the Southwestern theme into this more amped-up sound and draws the album near its end with a sweeping, shimmering majesty. Random Harvest is a fascinating, beautiful album that proves that Friends of Dean Martinez just keep getting better as they go along. ~ Heather Phares.                                               FLAC.Level of compression 5(default)Easy CD-DA Extractor.  ","torrent":{"xt":"urn:btih:a26a7d93bdf47697d4d1035b92828cbcfb60a7ed","amp;dn":"Friends+of+Dean+Martinez-Random+Harvest%28flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a26a7d93bdf47697d4d1035b92828cbcfb60a7ed","infoHashBuffer":{"type":"Buffer","data":[162,106,125,147,189,244,118,151,212,209,3,91,146,130,140,188,251,96,167,237]},"announce":[],"urlList":[]}}