{"title":"Reba McEntire and Brooks &amp; Dunn-If You See Him/If You See Her","uid":5193488,"size":160292868,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a297af4665704259ef5d1e524f032a096a84c2ec&amp;dn=Reba+McEntire+and+Brooks+%26+Dunn-If+You+See+Him%2FIf+You+See+Her&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1259812607,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;If You See Him/If You See Her&quot; is the title of a song released in 1998 by American country music artist Reba McEntire, along with the duo Brooks &amp; Dunn. It served as the title track to each artist's respective 1998 albums (If You See Him for Reba, and If You See Her for Brooks &amp; Dunn), both released on June 2 of that year.[1] The song was concurrently promoted and distributed by both artists' labels: MCA Nashville and Arista Nashville, then the respective labels for McEntire and Brooks &amp; Dunn.\n\nIt is a ballad, alternating McEntire's vocals with those of Ronnie Dunn (one half of the duo), while Kix Brooks (the other half) provides harmony vocals on the verses sung by Dunn. McEntire and Brooks &amp; Dunn debuted the song at the Academy of Country Music awards in 1998.\n\nThe song reached Number One on the Billboard Hot Country Singles &amp; Tracks (now Hot Country Songs) charts for the week of June 27, 1998, and held that position for two weeks, giving McEntire her twenty-ninth Number One single, and Brooks &amp; Dunn their twelfth.\n\nIf You See Him is an album released in 1998 by American country music artist Reba McEntire. The lead single was &quot;If You See Him/If You See Her&quot;, a duet with Brooks &amp; Dunn, which was concurrently released on Brooks &amp; Dunn's corresponding album If You See Her; the song reached Number One on the Hot Country Songs charts in 1998. &quot;Forever Love&quot;, &quot;Wrong Night&quot; and &quot;One Honest Heart&quot; were all released from this album as well, all of which reached Top 10 as well, with &quot;Forever Love&quot; reaching number one..\n\nThe album was released as an enhanced CD, featuring a multimedia presenatation that included behind-the-scenes videos and pictures.\n\nIf You See Her is the fifth studio album by country music duo Brooks &amp; Dunn, released in 1998 on Arista Nashville. The album featured five chart singles: &quot;If You See Him/If You See Her&quot; (#1), &quot;How Long Gone&quot; (#1), &quot;Husbands and Wives&quot; (a cover of a Roger Miller song) (#1), &quot;I Can't Get Over You&quot; (#5), and &quot;South of Santa Fe&quot; (#41). South of Santa Fe's music video was popular as the single itself. This last song was the first single of Brooks &amp; Dunn's career to miss Top 40 entirely, and was the last single to feature Kix Brooks on lead vocals. The album is a counterpart to Reba McEntire's album If You See Him (also released in 1998), which shared the track &quot;If You See Him/If You See Her&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a297af4665704259ef5d1e524f032a096a84c2ec","amp;dn":"Reba+McEntire+and+Brooks+%26+Dunn-If+You+See+Him%2FIf+You+See+Her","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a297af4665704259ef5d1e524f032a096a84c2ec","infoHashBuffer":{"type":"Buffer","data":[162,151,175,70,101,112,66,89,239,93,30,82,79,3,42,9,106,132,194,236]},"announce":[],"urlList":[]}}