{"title":"Heinz - The Complete Heinz 2CD (1963-1966)","uid":5615441,"size":252142128,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a29e891b4f5793f37b484cf83082ef25bd654096&amp;dn=Heinz+-+The+Complete+Heinz+2CD+%281963-1966%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":48,"time":1276042748,"description":"Heinz - The Complete Heinz 2CD (1963-1966)\nCD (2002) To Mp3 320 Kbit/s\nIncluded: CD Front cover &amp; Tis Info.\n\nBiography\tby Bruce Eder &amp; Richie Unterberger\nA British teen idol whose fame overlapped with the early days of Beatlemania, Heinz (full name Heinz Burt) first achieved success as the bassist for the Tornados, the instrumental group best remembered for topping the charts on both sides of the Atlantic with &quot;Telstar&quot;, before emerging as a recording artist in his own right. The Tornados' music, like the thrust of Heinz's subsequent solo career, was the brainchild of legendary producer Joe Meek -- he became Meek's most visible and well known protege, before their professional relationship degenerated into hostility and, ultimately, personal tragedy and destruction for one of them.\n\nHe was born Heinz G. Burt in Detmold, Germany in 1942, and came to England at age seven, when his family resettled in Eastleigh, Hampshire, between Southampton and Winchester. By the second half of the 1950's, when he wasn't working as a butcher's assistant at a grocery store, he had joined the ranks of England's teenaged rock 'n' roll fans. He was also serious enough in his interest in music to take up the bass, of all instruments. In 1961, he was playing with a local band called the Falcons, who were good enough to get an audition with producer Joe Meek, who didn't think much of the band but was attracted personally to the bassist's blonde Teutonic good looks -- so involved was he in Heinz Burt's physical appeal, that he eventually persuaded the musician to dye his hair bleach-blonde, to make him stand out even more in any band he worked with. According to David Wells in his notes for the Heinz compilation Just Like Eddie, Meek tried to push Heinz into the bassist's spot in his resident house band the Outlaws, but resistance from that group's leader, Chas Hodges, killed that idea. Instead, Meek assembled a whole new group called the Tornados, which included Alan Caddy (guitar), Clem Cattini (drums, and Roger LaVern (organ, plus Heinz on bass. They initially played as a backing band to Billy Fury whilst Meek tried to work out an adequate recording debut for the group. The Tornados scored a huge international hit on record their second time out with &quot;Telstar&quot;. And it was soon after their second hit, &quot;Globetrotter&quot;, in 1963, that Meek began recording Heinz for releases of his own, billed simply as &quot;Heinz.&quot;\n\nReview\tby Bruce Eder\nThis double-CD set, with 44 songs recorded by the early- to mid- '60s British pop/rock star Heinz, may seem like overkill, but as it turns out, it's not. Heinz, or Heinz Burt as he was known in the Tornados, was not only a prodigious talent, but a highly consistent recording artist. From the first two tracks here, dating from 1962, to the last one -- a live recording of &quot;I Got a Woman&quot; done in 1965 from the Cavern Club -- the recordings are exciting and interesting, and memorable. Heinz' producer on these sides was the legendary Joe Meek, and his signature attributes -- flashy keyboards and guitar, all very compressed -- can be found on much of it, but unlike a lot of other extended bodies of Meek's recordings, this body of music is highly listenable, track after track. Heinz was a better singer than he usually got credit for being, and he cut superb versions of &quot;Summertime Blues&quot; and &quot;Twenty Flight Rock,&quot; and was just as good doing songs that came out of Meek's stable of composers, including Geoff Goddard's &quot;Hush-a-Bye,&quot; and his singing makes even lackluster songs such as &quot;(Sorry) I Ran All the Way Home&quot; more interesting than they should be. The annotation is also extremely thorough, not just concerning the songs but also Heinz's career, which was, sadly, cut short by illness in the 1990s. \n\nMay to December 1964 Heinz &amp; the Wild Boys. People involved:- Burr Bailey [Dave Adams] (kbr); Ritchie Blackmore (gtr); Heinz Burt (vcl); Ian Broad (drm); John Davies (bss); Brian Woods (bss). \n\nDisc: 1 \n01. Dreams Do Come True \n02. Been Invited To A Party \n03. Just Like Eddie \n04. Don't You Knock At My Door \n05. Country Boy \n06. Long Tall Jack \n07. You Were There \n08. No Matter What They Say \n09. Please Little Girl \n10. For Loving Me This Way \n11. Questions I Can't Answer - Heinz &amp; The Wild Boys \n12. Beating Of My Heart - Heinz &amp; The Wild Boys \n13. Diggin' My Potatoes - Heinz &amp; The Wild Boys \n14. She Ain't Coming Back - Heinz &amp; The Wild Boys \n15. Don't Think Twice It's Alright - Heinz &amp; The Wild Boys \n16. Big Fat Spider - Heinz &amp; The Wild Boys \n17. End Of The World \n18. You Make Me Feel So Good \n19. Heart Full Of Sorrow \n20. Don't Worry Baby \n21. Movin' In \n22. I'm Not A Bad Guy \n\nDisc: 2 \n01. I Get Up In The Morning \n02. Talkin' Like A Man \n03. That Lucky Old Sun \n04. Lonely River \n05. Live It Up \n06. Don't You Understand \n07. When Your Loving Goes Wrong \n08. Tribute To Eddie \n09. Hush-A-Bye \n10. (Sorry) I Ran All The Way Home \n11. Summertime Blues \n12. Don't Keep Pickin' At Me \n13. Cut Across Shorty \n14. Three Steps To Heaven \n15. Come On And Dance \n16. Twenty Flight Rock \n17. Look For A Star \n18. My Dreams \n19. I Remember \n20. Rumble In The Night \n21. Somebody To Love [Live] \n22. I Got A Woman [Live]\n\nSee my other Torrents: &lt;a href=&quot; http://thepiratebay.se/user/Iron_Horse/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/Iron_Horse/&lt;/a&gt;","torrent":{"xt":"urn:btih:a29e891b4f5793f37b484cf83082ef25bd654096","amp;dn":"Heinz+-+The+Complete+Heinz+2CD+%281963-1966%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a29e891b4f5793f37b484cf83082ef25bd654096","infoHashBuffer":{"type":"Buffer","data":[162,158,137,27,79,87,147,243,123,72,76,248,48,130,239,37,189,101,64,150]},"announce":[],"urlList":[]}}