{"title":"Pet Shop Boys - Did You See Me Coming","uid":5118006,"size":136966148,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a38a2b31dfee527a7e615223323c1030b26d14ed&amp;dn=Pet+Shop+Boys+-+Did+You+See+Me+Coming&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1255172908,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Did you see me coming?&quot; is a song written and recorded by Pet Shop Boys, released on June 1, 2009, as the second single from their tenth studio album Yes. It peaked at #21 on the UK singles chart.\n\nYes is the tenth studio album by British electronic dance music band Pet Shop Boys.\n\nThe album was recorded throughout 2008 and is produced by Brian Higgins and his production team Xenomania. Xenomania also co-wrote three of the tracks. Guitarist Johnny Marr (The Smiths, Modest Mouse, Electronic, The Cribs) and string arranger Owen Pallett (Arcade Fire, The Last Shadow Puppets, Final Fantasy) also appear.\n\nYes was released in the UK on 23 March 2009. The lead single, &quot;Love etc.&quot;, was released a week earlier, on 16 March 2009. The USA release date was 21 April 2009.\n\nYes reached #4 in the UK album charts on March 29, 2009 (2009-03-29), Pet Shop Boys' highest placing since their 1996 album Bilingual. Early sales figures predicted that the album would enter at #1, but a series of blunders by record label Parlophone rendered a number of sales ineligible for the chart. These included allowing 2,500 copies of the album to be bought digitally online three days before release date, as well as stock level problems with a number of suppliers, which affected sales and chart placement. Some booklets that shipped with the Yes etc. double CD set had pages in the wrong order. EMI have set up a website for people affected by this to claim a new booklet.\n\nThe album was released in multiple formats, including an MP3 download version that included a 48-minute commentary track on the entire album, and a limited-edition (300 copies) vinyl version featuring 11 x 12&quot; singles with exclusive instrumental versions of each track on the B-sides. The double CD edition of the album incorporated a bonus disc entitled Etc., which featured mostly instrumental dub mixes of six album tracks, plus a new song called &quot;This used to be the future&quot;, to which Phillip Oakey of The Human League contributed some vocals.\n\nThe second single to be taken from Yes was &quot;Did You See Me Coming?&quot;, which was released on 1 June 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a38a2b31dfee527a7e615223323c1030b26d14ed","amp;dn":"Pet+Shop+Boys+-+Did+You+See+Me+Coming","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a38a2b31dfee527a7e615223323c1030b26d14ed","infoHashBuffer":{"type":"Buffer","data":[163,138,43,49,223,238,82,122,126,97,82,35,50,60,16,48,178,109,20,237]},"announce":[],"urlList":[]}}