{"title":"Albert Collins - Iceman  [1991]  [Robbie60] [FLAC] [EAC]","uid":6167576,"size":285395168,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a425e292c61a8264243d69962b74f46883e89d8f&amp;dn=Albert+Collins+-+Iceman++%5B1991%5D++%5BRobbie60%5D+%5BFLAC%5D+%5BEAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robbie6ty","files":13,"time":1297441154,"description":"Albert Colins\nIceman\n\n\n\n\nLabel: Pointblank/Virgin Records\nReleased: 1991\nSource: Original CD \nSize Torrent: 272 MB\nFormat: FLAC\n\n\n\n\nThere has never been and may never be again a bluesman quite like Albert Collins. &quot;The Master Of The Telecaster&quot; was born on October 1, 1932, in Leona, Texas. A cousin of the legendary Lightnin' Hopkins, Collins emerged with a blues sound and style all his own, featuring a combination of icy echo, shattering, ringing, sustained high notes, an ultra-percussive right-hand attack, and an unheard-of minor key guitar tuning (taught to him by his cousin Willow Young). Deeply influenced by T-Bone Walker, John Lee Hooker and Gatemouth Brown, Collins absorbed the sounds of Mississippi, Chicago, and especially Texas. He formed his own band in 1952, packing clubs around Houston. In the early 1960s, Collins' &quot;cool sound&quot; instrumentals like the million-seller Frosty (recorded with a young Johnny Winter and Janis Joplin in attendance at the studio) and follow-ups Sno Cone and Thaw Out were all over R&amp;B radio. Soon he was sharing stages with his idols Gatemouth Brown and T-Bone Walker.\n\nThen, in the mid-'60s (following a move from Texas to Kansas City to California), Collins broke into the rock 'n' roll world, releasing three albums produced by members of Canned Heat, and began playing the San Francisco psychedelic circuit. But Albert's greatest success came after he signed with Alligator in 1978 and cut ICE PICKIN''. It won the Best Blues Album of the Year Award from the Montreux Jazz Festival, and was nominated for a Grammy. His following Alligator albums helped earn Collins every award the blues world had to offer. And, along with Johnny Copeland and Robert Cray (who decided on a career as a bluesman after seeing Collins play his high school prom) Collins cut the Grammy-winning SHOWDOWN!.\n\nEven after he was firmly established as a major modern bluesman, Collins never got too big for his fans and friends, and never took things easy. And he never relinquished the wheel of his battered tour bus that he loved to drive so much. Along with his band, The Icebreakers, Collins' live shows -- driven by his kinetic stage presence -- were legendary testaments to the power of the blues. With his untimely death in 1993, Albert Collins left behind a blues legacy that continues to amaze and delight blues fans all over the world.\n\n\n\n\n\n\n\nPersonnel\n\nGuitar, Vocals - Albert Collins \nBacking Vocals - Debbie Jamison , Vicki Loveland \nBass - Johnny B. Gayden\nDrums, Percussion - Soko Richardson \nGuitar - Debbie Davis , Jack Holder , Mabon &quot;Teenie&quot; Hodges \nKeyboards - Eddie Harsch \nOrgan - Charles Hodges \nSaxophone [Alto, Baritone] - Crispin Cioe \nSaxophone [Tenor] - Arno Hecht \nTrombone - Bob Funk \nTrumpet - Hollywood Paul Litteral\n\nBrass/Horn Players collectively credited/known as The Uptown Horns.\n\n\n\n\nTrack Listing\n\n01 - Mr. Collins, Mr. Collins (5:12) \n02 - Iceman (5:04) \n03 - Don't Mistake Kindness For Weakness (6:12) \n04 - Travellin' South (3:07) \n05 - Put The Shoe On The Other Foot (5:34) \n06 - I'm Beginning To Wonder (4:12) \n07 - Head Rag (3:55) \n08 - The Hawk (2:39) \n09 - Blues For Gabe (3:43) \n10 - Mr. Collins, Mr. Collins (Faded Version) (3:56) \n","torrent":{"xt":"urn:btih:a425e292c61a8264243d69962b74f46883e89d8f","amp;dn":"Albert+Collins+-+Iceman++%5B1991%5D++%5BRobbie60%5D+%5BFLAC%5D+%5BEAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a425e292c61a8264243d69962b74f46883e89d8f","infoHashBuffer":{"type":"Buffer","data":[164,37,226,146,198,26,130,100,36,61,105,150,43,116,244,104,131,232,157,143]},"announce":[],"urlList":[]}}