{"title":"Charles Williams - A Touch of Death (pdf)","uid":5177988,"size":713377,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4bbeec6f1214df878d65f5c0b087418f3871ddd&amp;dn=Charles+Williams+-+A+Touch+of+Death+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pigeye","files":1,"time":1259081621,"description":"A Touch of Death by Charles Williams -- pdf\n \n  Charles Williams was an American writer of hardboiled crime fiction. He is regarded by critics as one of the finest suspense novelists of the 1950s and 1960s. His 1951 debut, the pulp paperback novel Hill Girl, sold over a million copies. A dozen of his books have been adapted for the screen, most popularly Dead Calm.\n--Wikipedia\n\n  A Touch of Death is another good one (but then there's no such thing as a bad Charles Williams novel). Lee Scarborough is a former college football player, a one-time star who's now struggling just to get by. He meets a woman who says her name is Diana James, and she has a plan to get her hands on a lot of money if she can find the right helper. Lee's her pigeon, and before long he's met another woman, Madelon Butler, who's about the toughest babe you'll find in fiction. And she's smart, too, a lot smarter than Lee, who, as things move along always believes he's always one step ahead of her, only to discover, far too late, that he never even got out of the starting blocks. Great stuff, and the last few lines, like the ones in River Girl, are devastating.\n--Bill Crider","torrent":{"xt":"urn:btih:a4bbeec6f1214df878d65f5c0b087418f3871ddd","amp;dn":"Charles+Williams+-+A+Touch+of+Death+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4bbeec6f1214df878d65f5c0b087418f3871ddd","infoHashBuffer":{"type":"Buffer","data":[164,187,238,198,241,33,77,248,120,214,95,92,11,8,116,24,243,135,29,221]},"announce":[],"urlList":[]}}