{"title":"Sara Storer - Beautiful Circle [2002]","uid":6308137,"size":71766197,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a583c8c3ffac49388725c64d465196bbb13e8617&amp;dn=Sara+Storer+-+Beautiful+Circle+%5B2002%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":18,"time":1302431773,"description":"\nSara Storer - Beautiful Circle 2002 ( kbps 192 )\n\nLabel: ABC Country\nYear: 2002\nbitrate : 192 kbps\nsize : 68,4 MB\ngenre : country from Australia\n\nTrack Title\t\n1.\tTell These Hands\t \n2.\tBack Out Back\t \n3.\tDrover's Call\t \n4.\tBeautiful Circle\t \n5.\tNight After Night\t \n6.\tOld Piece Of Tin\t \n7.\tRaining On The Plains\t \n8.\tBack On The Grader\t \n9.\tSweet Dreams\t \n10.\tKiss A Cowboy\t \n11.\tKurrajong Tree\t \n12.\tBetter Next Year\t \n13.\tBoss Drovers Pride\t \n14.\tTell These Hands (Reprise)\t \n15.\tI'll Be Home Soon\n\n\nBeautiful Circle is an Ode to the Hardworking Farmer, and an Album that Nobody Should Pass Over. Every song is a small story about country life in outback Australia. The catchy tunes and true Aussie twang make this a must for all true blue Australian Country Music Fans.\nThis is an amazing album, half concept and half fun, from a women who shows herself worthy of headlining Farm Aid. More than anything else this is an album about a way and a place of life that mainstream country seems determined to ignore by and large, a place that used to be called the heartland.\nGolden Guitar winner Sara Storer delivers the highly anticipated follow up to her stunning debut Chasing Buffalo, Beautiful Circle. The first single, Tell These Hands has been an instant hit at radio in Australia. It tells the story of the impact of too much rain on a battling farmer and his family, it's also about the many other elements which are totally out of a farmer's hands, but which have the power to make or break their livelihood. Beautiful Circle marks a major step forward for Sara. Not only is her trademark vocal lilt to the fore but also so is her refreshing and unique conversational style of story telling.\nThe album opens with the heartfelt and heart breaking &quot;Tell These Hands&quot; where the daughter of a flooded out farmer observes &quot;Never seen my daddy cry/didn't think that he was able,&quot; before going on to proclaim &quot;Tell the rain to stop falling/Tell the banks to stop calling/Tell the politicians where they can put their plans/Tell the day to hold out longer/tell our sons we can't be bothered/then tell these hands to give up on the land.&quot; Next she picks up some fun with &quot;Back Out Back&quot; the story about a small town girl and her encounter with a city boy &quot;What the---you're going to yoga with the girls from where you work back/Sorry, I been thinking this over, I gotta get back out back.&quot; &quot;Drover's Call&quot; is a pretty song, in the vein of and old Rex Allen Junior song, about an old drover on his death bed. &quot;Beautiful Circle&quot; is about the work and plans of plowing a field. &quot;Night After Night&quot; is a bouncy two-stepper about getting over a broken heart. &quot;Old Piece of Tin&quot; is very pretty song about a piece of tin used to patch together the wall of a rundown shack. In balance to the opening song of flooding comes &quot;Raining on the Plains Again&quot; the duet with Aussie Country superstar John Williamson celebrating the return of rain after a long drought. &quot;Back on the Grader&quot; is a song about a retired cattle driver missing his work, much like &quot;Nobody Home on the Range Anymore.&quot; Next is the pretty love song &quot;Sweet Dreams,&quot; which is followed by the up tempo frolic of &quot;Kiss A Cowboy.&quot; She pays tribute to her grandmother, a storyteller, by setting one of her stories to music, the pretty memory &quot;Kurrajong Tree.&quot; &quot;Better Next Year&quot; is her remedy for curing a broken heart. Then comes &quot;Boss Drover's Pride,&quot; a stunning ballad about a daughter in a little flower sack dress her mum made for her. There is a brief re-prise of &quot;Tell These Hands&quot; before she launches into the bonus track, a wonderful duet with Travis Sinclair, &quot;I'll Be Home Soon.&quot;\nThis is the perfect album for you if you have been hankering for a slice of life on the farm, and one that refutes the contemporary assumption that people working the land is a outdated notion. This is also a very interesting album because it sounds far more Australian than many albums from that country. Storer's accent is quite pronounced and there are beautiful touches of dijeradoo (Sp?) and Australians percussion. ","torrent":{"xt":"urn:btih:a583c8c3ffac49388725c64d465196bbb13e8617","amp;dn":"Sara+Storer+-+Beautiful+Circle+%5B2002%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a583c8c3ffac49388725c64d465196bbb13e8617","infoHashBuffer":{"type":"Buffer","data":[165,131,200,195,255,172,73,56,135,37,198,77,70,81,150,187,177,62,134,23]},"announce":[],"urlList":[]}}