{"title":"Ron Carter - Patrao (1981) [FLAC]{OJC 778}","uid":6222781,"size":226454239,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a5e9a9a493589b2d5f512377fe71c34e257e26d3&amp;dn=Ron+Carter+-+Patrao+%281981%29+%5BFLAC%5D%7BOJC+778%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":null,"files":24,"time":1299402673,"description":"Ron Carter - Patrao (1981) [FLAC] {OJC 778}\nUPC Code: 025218677820\n\nAudio Samples: http://www.amazon.com/Patrao-Ron-Carter/dp/B000000YZ7\n\nOfficial Web Site: http://www.roncarter.net/officialSite.html\n\nBiography\nBorn: May 4, 1937\nRon Carter is among the most original, prolific, and influential bassists in jazz. With more than 2,000 albums to his credit, he has recorded with many of music's greats: Tommy Flanagan, Gil Evans, Lena Horne, Bill Evans, B.B. King, the Kronos Quartet, Dexter Gordon, Wes Montgomery, and Bobby Timmons. In the early 1960s he performed throughout the United States in concert halls and nightclubs with Jaki Byard and Eric Dolphy. He later toured Europe with Cannonball Adderley. From 1963 to 1968, he was a member of the classic and acclaimed Miles Davis Quintet. He was named Outstanding Bassist of the Decade by the Detroit News, Jazz Bassist of the Year by Downbeat magazine, and Most Valuable Player by the National Academy of Recording Arts and Sciences.\nIn 1993 Ron Carter earned a Grammy award for Best Jazz Instrumental Group, the Miles Davis Tribute Band and another Grammy in 1998 for Call 'Sheet Blues', an instrumental composition from the film 'Round Midnight. In addition to scoring and arranging music for many films, including some projects for Public Broadcasting System, Carter has composed music for A Gathering of Old Men, starring Lou Gosset Jr., The Passion of Beatrice directed by Bertrand Tavernier, and Blind Faith starring Courtney B. Vance. Carter shares his expertise in the series of books he authored, among which are Building Jazz Bass Lines and The Music of Ron Carter; the latter contains 130 of his published and recorded compositions.\nCarter earned a bachelor of music degree from the Eastman School in Rochester and a master's degree in double bass from the Manhattan School of Music in New York City. He has also received two honorary doctorates, from the New England Conservatory of Music and the Manhattan School of Music, and was the 2002 recipient of the prestigious Hutchinson Award from the Eastman School at the University of Rochester. Carter has lectured, conducted, and performed at clinics and master classes, instructing jazz ensembles and teaching the business of music at numerous universities. He was Artistic Director of the Thelonious Monk Institute of Jazz Studies while it was located in Boston and, after 18 years on the faculty of the Music Department of The City College of New York, he is now Distinguished Professor Emeritus although, as a performer, he remains as active as ever.\n\nTracks\n01 - Ah, Rio\n02 - Nearly\n03 - Tail Feathers\n04 - Yours Truly\n05 - Third Plane\n","torrent":{"xt":"urn:btih:a5e9a9a493589b2d5f512377fe71c34e257e26d3","amp;dn":"Ron+Carter+-+Patrao+%281981%29+%5BFLAC%5D%7BOJC+778%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5e9a9a493589b2d5f512377fe71c34e257e26d3","infoHashBuffer":{"type":"Buffer","data":[165,233,169,164,147,88,155,45,95,81,35,119,254,113,195,78,37,126,38,211]},"announce":[],"urlList":[]}}