{"title":"Jefferson Airplane - Journey (The Best Of) [EAC-FLAC] [RePoPo]","uid":5027477,"size":435682700,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a69f1ea6c6fd9c743c2d62b025ff7cf51cbf8a6f&amp;dn=Jefferson+Airplane+-+Journey+%28The+Best+Of%29+%5BEAC-FLAC%5D+%5BRePoPo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"repopo","files":-1,"time":1248772202,"description":"*******************************************************************************\n                  Jefferson Airplane - Journey (The Best Of) \n*******************************************************************************\n\nCD: Jefferson Airplane - The best of Jefferson Airplane  [1967-1974]\n      track 21 name altered to be correct YEAR: 1996\n\n01. Embryonic Journey  [1967]    [0:01:56.63]\n02. High Flyin' Bird  [1974]    [0:02:35.10]\n03. It's No Secret  [1966]    [0:02:40.45]\n04. Come Up The Years  [1966]    [0:02:33.12]\n05. Somebody To Love  [1967]    [0:03:00.35]\n06. Blues From An Airplane  [1966]    [0:02:12.13]\n07. White Rabbit  [1967]    [0:02:34.20]\n08. Plastic Fantastic Lover  [1967]    [0:02:39.57]\n09. Aerie (Gang Of Eagles)  [1972]    [0:03:51.73]\n10. The Ballad Of You And Me And Pooneil  [1967]    [0:04:38.00]\n11. Crown Of Creation  [1968]    [0:02:56.40]\n12. Lather  [1968]    [0:02:58.35]\n13. The Last Wall Of The Castle  [1967]    [0:02:42.32]\n14. Greasy Heart  [1968]    [0:03:24.53]\n15. Volunteers  [1969]    [0:02:10.30]\n16. When The Earth Moves Again  [1973]    [0:03:56.10]\n17. Triad  [1969]    [0:04:58.20]\n18. We Can Be Together  [1969]    [0:05:51.00]\n19. Wooden Ships  [1969]    [0:06:25.42]\n20. Milk Train  (Live)  [1973]    [0:03:31.58]\n21. Have You Seen The Saucers  (Live)  [1974]    [0:04:11.50]\n\n\n-------------------------------------------------------------------------------\n                            THE ALLMUSIC BIOGRAPHY\n-------------------------------------------------------------------------------\n\nby William Ruhlmann\n\nJefferson Airplane was the first of the San Francisco psychedelic rock groups of \nthe 1960s to achieve national recognition. Although the Grateful Dead ultimately \nproved more long-lived and popular, Jefferson Airplane defined the San Francisco \nsound in the 1960s, with the acid rock guitar playing of Jorma Kaukonen and the \nsoaring twin vocals of Grace Slick and Marty Balin, scoring hit singles and \nlooking out from the covers of national magazines. They epitomized the drug-\ntaking hippie ethos as well as the left-wing, antiwar political movement of \ntheir time, and their history was one of controversy along with hit records. \nTheir personal interactions mirrored those times; the group was a collective \nwith shifting alliances, in which leaders emerged and retreated. But for all the \nturmoil, Jefferson Airplane was remarkably productive between 1965 and 1972. \nThey toured regularly, being the only band to play at all the major '60s rock \nfestivals -- Monterey, Woodstock, even Altamont -- and they released seven \nstudio albums, five of which went gold, plus two live LPs and a million-selling \nhits collection that chronicled their eight chart singles. Rather than formally \nbreaking up, they mutated into other configurations, Hot Tuna and Jefferson \nStarship, and went on to further success in the 1970s and '80s, before reuniting \nfor an album and tour in 1989.\n\n\n\nThe initial idea for the group that became Jefferson Airplane came from 23-year\n-old Marty Balin (born Martyn Jerel Buchwald in Cincinnati, OH, January 30, \n1942), a San Francisco-raised singer who had recorded unsuccessfully for \nChallenge Records in 1962 and been a member of a folk group called the Town \nCriers in 1963-1964. With the Beatles-led British Invasion of 1964, Balin saw \nthe merging of folk with rock in early 1965 and decided to form a group to play \nthe hybrid style as well as open a club for the group to play in. He interested \nthree investors in converting a pizza restaurant on Fillmore Street into a 100-\nseat venue called the Matrix, and he began picking potential bandmembers from \namong the musicians at a folk club called the Drinking Gourd. His first recruit \nwas rhythm guitarist/singer Paul Kantner (born Paul Lorin Kantner in San \nFrancisco, CA, March 17, 1941), who in turn recommended lead guitarist/singer \nJorma Kaukonen (born Jorma Ludwik Kaukonen in Washington, D.C., December 23, \n1940). Balin, who possessed a keening tenor, wanted a complementary powerful \nfemale voice for the group and found it in Signe Toly (born Signe Ann Toly in \nSeattle, WA, September 15, 1941). The six-piece band was completed by bass \nplayer Bob Harvey and drummer Jerry Peloquin. The group's unusual name was \nsuggested by Kaukonen, who had once jokingly been dubbed &quot;Blind Thomas Jefferson \nAirplane&quot; by a friend in reference to the blues singer Blind Lemon Jefferson.\n\n\n\nJefferson Airplane made their debut at the Matrix on August 13, 1965, and began \nperforming at the club regularly. They attracted favorable press attention, \nwhich -- at a time when folk-rock performers like Sonny &amp; Cher, We Five, Bob \nDylan, the Byrds, the Beau Brummels, and the Turtles were all over the charts -- \nled to record company interest. By September, Jefferson Airplane was being wooed \nby several labels. At the same time, the band was already undergoing changes. \nPeloquin was fired and replaced by Skip Spence (born Alexander Lee Spence, Jr. \nin Windsor, Ontario, Canada, on April 18, 1946; died in Santa Cruz, CA, April \n16, 1999). Spence considered himself a guitarist, not a drummer, but he had some \ndrumming experience. Also in September, Signe Toly married Jerry Anderson, who \nhandled lights at the Matrix, becoming known as Signe Anderson. In October, \nHarvey was fired and replaced by Jack Casady (born John William Casady in \nWashington, D.C., April 13, 1944), a friend of Kaukonen's. On November 15, 1965, \nthis lineup -- Balin, Kantner, Anderson, Kaukonen, Spence, and Casady -- signed \nto RCA Victor Records. They had their first recording session in Los Angeles on \nDecember 16, and RCA released their debut single, Balin's composition &quot;It's No \nSecret,&quot; in February 1966; it did not chart. Meanwhile, Jefferson Airplane began \nto appear at more prestigious venues in San Francisco and even to tour outside \nthe Bay Area. In May 1966, Anderson gave birth to a daughter, and caring for the \nchild while performing with the band became a challenge. Meanwhile, Spence \nbecame increasingly unreliable as his appetite for drugs increased, and he was \nreplaced in June by session drummer Spencer Dryden (born Spencer Dryden Wheeler \nin New York, April 7, 1938; died in Petaluma, CA, January 11, 2005). Spence went \non to form the band Moby Grape.\n\n\n\nFollowing a second non-charting single, Balin and Kantner's &quot;Come Up the Years,&quot; \nin July, Jefferson Airplane released their debut LP, Jefferson Airplane Takes \nOff, on August 15, 1966, just over a year after the band's debut. The album had \nmodest sales, peaking at only number 128 during 11 weeks on the Billboard chart. \n(A third single, Balin and Kantner's &quot;Bringing Me Down,&quot; was released from the \nalbum, but did not chart.) At this point, Anderson's commitment to her family \ncaused her departure from the group. Jefferson Airplane was able to find a \nstrong replacement for her in Grace Slick (born Grace Barnett Wing in or near \nChicago, IL, October 30, 1939), the lead singer for the San Francisco rock band \nthe Great Society, which happened to be in the process of breaking up at the \nsame time. Slick joined Jefferson Airplane in mid-October 1966, and by the end \nof the month was with them in the recording studio. She brought with her two \nsongs from the Great Society repertoire: the rock tune &quot;Somebody to Love,&quot; \nwritten by her brother-in-law Darby Slick, the Great Society's guitarist, and \nher own composition, the ballad &quot;White Rabbit,&quot; set to a bolero tempo, which \nused imagery from Alice in Wonderland to discuss the impact of psychedelic \ndrugs. Both songs were recorded for Jefferson Airplane's second album, \nSurrealistic Pillow.\n\n\n\nRCA did not release either of them as the advance single from the album, opting \ninstead for the departed Spence's &quot;My Best Friend&quot; in January 1967; it became \nthe group's fourth single to miss the charts. Surrealistic Pillow followed in \nFebruary. It debuted in the charts the last week of March, and its progress was \nspeeded by the release of &quot;Somebody to Love,&quot; the first Jefferson Airplane \nsingle to feature Grace Slick as lead vocalist. By early May, both the album and \nsingle were in the Top 40 of their respective charts; a month later, both were \nin the Top Ten. With that, RCA released &quot;White Rabbit&quot; as a single, and it too \nreached the Top Ten. Surrealistic Pillow became Jefferson Airplane's first gold \nalbum in July.\n\n\n\nMeanwhile, the band, which, naturally, had attracted national media attention \n(much of it focusing on Slick's photogenic looks), began recording a new album \nand continued to tour. On June 17, 1967, they performed at the Monterey \nInternational Pop Festival, which was celebrated for introducing many of the new \nSan Francisco rock bands (as well as the Jimi Hendrix Experience) and launching \nthe &quot;Summer of Love&quot; that the season was touted to be in 1967. Jefferson \nAirplane's performance was filmed and recorded. Two songs from their show, &quot;High \nFlying Bird&quot; and &quot;Today,&quot; were featured in the documentary film Monterey Pop, \nreleased in 1968. The concert recording was heavily bootlegged and over the \nyears has turned up on numerous gray-market releases as well.\n\n\n\nThe nature of Jefferson Airplane's commercial breakthrough, and the nature of \nthe band itself, restricted their commercial appeal thereafter. AM Top 40 radio, \nin particular, became wary of a group that had scored a hit with a song widely \nderided for its drug references, and Jefferson Airplane never again enjoyed the \nkind of widespread radio support they would have needed to score more Top Ten \nhits. At the same time, the group did not think of itself as a hitmaking \nmachine, and its recordings were becoming more adventurous. Kantner's &quot;The \nBallad of You and Me and Pooneil,&quot; the band's new single released in August, \nfeatured him as lead singer with Slick and Balin harmonizing. It reached number \n42 on the strength of the band's prominence, but they never again crossed the \nhalfway mark in the Hot 100. At the same time, the rise of FM radio, attracted \nto longer cuts and the kind of experimental work the group was starting to do, \ngave them a new way of exposing their music. Nevertheless, their third album, \nAfter Bathing at Baxter's, its songs arranged into lengthy suites, was not as \nsuccessful as Surrealistic Pillow when it appeared on November 27, 1967, \nreaching the Top 20 but failing to go gold. Also notable was the diminished \nparticipation of Marty Balin, who co-wrote only one song, and now was being \nmarginalized in the group he had founded.\n\n\n\nAfter Kantner's &quot;Watch Her Ride,&quot; released as a single from After Bathing at \nBaxter's, stalled at number 61, RCA released a new Jefferson Airplane single \nwritten and sung by Slick in the spring of 1968. But radio was even more \nresistant, and &quot;Greasy Heart&quot; stopped at number 98. It was included in the \nband's fourth album, Crown of Creation, released in August. The title track got \nto number 64 as a single, and the LP, which featured more concise, less \nexperimental tracks than After Bathing at Baxter's, marked a resurgence in the \ngroup's commercial success, reaching the Top Ten and eventually going gold. \nJefferson Airplane's live appeal was chronicled on the concert album Bless Its \nPointed Little Head, released in February 1969. In August, the group appeared at \nthe Woodstock festival, and it was featured on the million-selling triple-LP \nsoundtrack album to the resulting film in 1970, though it did not appear \nonscreen in the version initially released. The band's fifth studio album, \nVolunteers, appeared in October 1969 as its title song became a minor singles \nchart entry. Volunteers stopped short of the Top Ten, but it went gold in three \nmonths. On December 6, 1969, the band played at the Rolling Stones' disastrous \nAltamont free concert in California, its performance (complete with Balin's \nbeating at the hands of Hell's Angels) captured in the 1970 documentary film \nGimme Shelter.\n\n\n\nJefferson Airplane released one more single, the non-charting marijuana anthem \n&quot;Mexico,&quot; in 1970 in its familiar configuration, but the turn of the 1970s \nbrought great changes in the group. Already, Kaukonen and Casady, with assorted \nsidemen, had begun to play separately as Hot Tuna while maintaining their \nmembership in Jefferson Airplane; they had recorded shows the previous September \nfor a self-titled debut album issued in May 1970. Spencer Dryden was fired early \nin the year and replaced by drummer Joey Covington (born Joseph Michno in \nJohnston, PA, in 1945). At shows performed in October 1970, violinist Papa John \nCreach, who had been performing with Hot Tuna, first played with Jefferson \nAirplane. Creach (born John Henry Creach in Beaver Falls, PA, May 18, 1917; died \nFebruary 22, 1994) was a journeyman musician decades older than any of the other \nmembers of Jefferson Airplane, and his recruitment was evidence of the ways in \nwhich the band's approach was changing. An even more radical change was the \ndeparture of Marty Balin, who left the band at the end of the fall tour in \nNovember. (His resignation was formally announced in April 1971.)\n\n\n\nJefferson Airplane did not have a new album ready for release in 1970, and RCA \nfilled the gap with a compilation, sarcastically dubbed The Worst of Jefferson \nAirplane and released in November. The album went gold quickly and was later \ncertified platinum. Issued on its heels was Paul Kantner's debut solo album, \nBlows Against the Empire, featuring most of the members of Jefferson Airplane as \nwell as various other musical friends. Due to that long list of sidemen and the \nalbum's science fiction theme about a group of hippies hijacking a spaceship, \nKantner co-billed the disc to &quot;Jefferson Starship.&quot; As yet, there was no such \nentity, but Kantner would use the name for a real band later.\n\n\n\nHaving completed their recording commitment to RCA, Jefferson Airplane shopped \nfor a new label, but was wooed back when RCA offered them their own imprint, \nGrunt Records. Grunt bowed with the release of the sixth Jefferson Airplane \nstudio album, Bark, in August 1971. The album stopped just short of the Top Ten \nand quickly went gold. Covington, Casady, and Kaukonen's &quot;Pretty as You Feel,&quot; \nlater issued as a single, gave the band its final placing in the Hot 100 at \nnumber 60 early in 1972. Grunt issued albums by bandmembers including Creach and \nHot Tuna, as well as discs by friends, but Jefferson Airplane remained its most \nsuccessful act.\n\n\n\nIn the early '70s, the members of Jefferson Airplane became increasingly \npreoccupied by their side projects. Hot Tuna, having issued a second live album, \nFirst Pull Up, Then Pull Down, in the spring of 1971, put out their first studio \neffort, Burgers, in February 1972. Kantner and Slick, who had become a couple \nand had a child, China Kantner (who went on to be an MTV VJ in her teens), \nissued a duo album, Sunfighter, in December 1971. In April 1972, Covington left \nthe band and was replaced by veteran drummer John Barbata (born in Passaic, NJ, \nApril 1, 1945), formerly a member of the Turtles and a backup musician for \nCrosby, Stills, Nash &amp; Young. The group then recorded its seventh studio album, \nLong John Silver, which was issued in the summer of 1972. It reached the Top 20 \nand went gold within six months. For the accompanying tour, they added \nsinger/multi-instrumentalist David Freiberg (born in Boston, MA, August 24, \n1938), formerly a member of the San Francisco rock band Quicksilver Messenger \nService, to provide the male lead vocals formerly sung by Balin. The tour \nconcluded at the Winterland ballroom in San Francisco on September 22, 1972, in \neffect marking the end of Jefferson Airplane, although no formal announcement \nwas ever made. Kaukonen and Casady went back to performing as Hot Tuna. Kantner, \nSlick, and Freiberg recorded a trio album, Baron von Tollbooth &amp; the Chrome Nun, \nissued in the spring of 1973 and featuring the rest of Jefferson Airplane as \nside musicians. Slick's debut solo album, Manhole, issued in early 1974, also \nfeatured many of the same performers. Kantner and Slick then organized a new \nband along the same lines as Jefferson Airplane, but without Kaukonen and \nCasady, and called it Jefferson Starship. Meanwhile, a second Jefferson Airplane \nlive album drawn from the 1972 tour, Thirty Seconds Over Winterland, was issued \nin the spring of 1973. Early Flight, a collection of stray tracks, appeared in \nthe spring of 1974. Grunt issued the compilation Flight Log (1966-1976) at the \nstart of 1977, filling the two LPs with tracks by Jefferson Airplane, Jefferson \nStarship, and various other spinoff acts. 2400 Fulton Street: An Anthology, \nnamed after the address of a house owned by the band in the 1960s, was a two-\ndisc set released in 1987. All of these albums sold well enough to reach the \ncharts.\n\n\n\nThe various members of Jefferson Airplane went through various solo efforts and \ngroup affiliations in the 1970s and '80s, plus considerable litigation with an \nold manager and each other. This was all cleared up by the late '80s, however, \nand in 1989 Kantner, Slick, Kaukonen, and Casady (who, with manager Bill \nThompson, still owned the rights to use the name Jefferson Airplane) brought in \nBalin (who had sold out his share in the group in 1971) and reunited as \nJefferson Airplane for a tour and album. The tour, which ran from August 18 to \nOctober 7, was well received; the album, Jefferson Airplane, released by Epic \nRecords, was only a modest success. After that, the band again became inactive. \nSlick retired. Kaukonen and Casady resumed performing as Hot Tuna. Kantner \neventually resurrected the Jefferson Starship name, sometimes including Balin \nand even occasionally Slick, and playing Jefferson Airplane songs. RCA continued \nto release archival recordings, its most interesting issues being the 1992 box \nset Jefferson Airplane Loves You and the 1998 concert recording Live at the \nFillmore East. \n\n-------------------------------------------------------------------------------\n                       SOME TRACKS REVIEWED AT ALLMUSIC\n-------------------------------------------------------------------------------\n\n\nEmbryonic Journey     by Matthew Greenwald\n\nJorma Kaukonen's first solo original contribution to Jefferson Airplane's \nsongbook, &quot;Embryonic Journey&quot; is an acoustic guitar instrumental that truly \ndefies classification. An amalgamation of ideas, it starts off as a simple, \nwarm, descending folk melody. However, Kaukonen changes gears (while still \nkeeping the subtle feeling of the melody) dramatically with some classical \novertones that bring the song to an elegant close. Kaukonen's gorgeous \nmodulation at the end of the song shows true compositional genius at work. \nOverall, it added a feeling and a mood to the second side of the Airplane's \nSurrealistic Pillow album, and it's irreplaceable. \n\n-------------------------------------------------------------------------------\n\nHigh Flyin' Bird     by Matthew Greenwald\n\nOne of the songs that graced the Jefferson Airplane's repertoire, &quot;High Flyin' \nBird&quot; had been a folk-rock coffeehouse staple since the early '60s. A minor-key \nfolk ballad with strong blues roots, &quot;High Flyin' Bird&quot; is a downcast song about \nbeing tied down, by human consciousness in general. Pretty heavy for the early \n'60s, when it was written by folk journeyman Billy Wheeler. The song has been \nrecorded by numerous artists, namely the Au Go-Go Singers (featuring a very \nyoung Stephen Stills). But the Airplane's version, where Marty Balin, Grace \nSlick, and Paul Kantner each take a verse, is probably the most definitive. \n\n-------------------------------------------------------------------------------\n\nIt's No Secret     by Matthew Greenwald\n\nThe pilot single from Jefferson Airplane's debut album, &quot;It's No Secret&quot; is a \nvery strong slice of mid-'60s pop/rock. Originally intended for Otis Redding to \nrecord, this soul-inflected ballad is built on some classic pop chord changes. \nHowever, Balin's love of soul music comes through loud and clear during the \nbridge, with its syncopated melody that recalls &quot;Respect.&quot; Although originally \nrecorded on the Airplane's debut album in 1966 with excellent results, the band \ncontinued to keep it in their live sets through the years, and one of the best \nversions is included on their fine 1968 live album, Bless Its Pointed Little \nHead. \n\n-------------------------------------------------------------------------------\n\nCome Up the Years\n     by Matthew Greenwald\n\nAfter the Airplane material became so abstract and political in the latter \nyears, listening again to this ode to a young man's dilemma becomes an eye-\nopening experience. It stands as testimony to what their early craft was all \nabout. &quot;Come Up the Years,&quot; from their first album, Takes Off, has all the \nnecessary ingredients to remind the listener what a great band the Airplane was \nfrom its beginning. Its precision lyrics and a pleasant light folk-rock melody \nhelp to bring to life this sad story of a young man that has fallen in love with \na much younger, &quot;shouldn't touch,&quot; girl -- not unlike the Spoonful's &quot;Younger \nGirl,&quot; which very well may have inspired this composition. The story is told by \nthe emotion-fueled vocals of Marty Balin, with the formidable Signe Anderson at \nhis side to add the harmony and vocal punch this song needs. \n\n-------------------------------------------------------------------------------\n\nSomebody to Love    \tby Joe Viglione\n\nOriginally titled &quot;Someone To Love&quot; when the former Grace Wing's brother-in-law \nand bandmate, Darby Slick of The Great Society, penned it for that band, it \nbecame the break-through hit for the Jefferson Airplane when re-titled &quot;Somebody \nTo Love&quot; going Top 5 in May of 1967. The opening with Grace Slick's voice \nbooming an acappella &quot;When the truth is found&quot; is such a great top of the hour \nlead-off call to arms that classic rock and oldies radio do just that with it \ndecades after its initial sojurn at the upper reaches of the charts. Followed in \nless than two months by &quot;White Rabbit&quot; the members wouldn't have Top 40 success \nagain until 8 years later when revitalized as Jefferson Starship Marty Balin's \n&quot;Miracles&quot; went Top 3 in September of 1975. &quot;Somebody To Love&quot; with its jangly \nguitars and cool San Franciscan sound moves with a pop intensity and urgent \nlyric so essential to the vibe of the time. Todd Rundgren wanted to find himself \nand Leroy a girlfriend in &quot;We Gotta Get You A Woman&quot; in 1971 and John Cougar \nneeded &quot;a lover that don't drive&quot; him crazy in 1979, but the purest sentiment \nregarding finding a significant other was in this track, a direct admonition: \n&quot;You'd better find somebody to love.&quot; The Lady Mondegreen or mis heard lyric \nhere is a major one. In the second verse. The lyric sheet reads &quot;When the garden \nflowers ...are dead&quot;, but it sounds like sly Grace might be slipping in &quot;When \nGod and his laws, are dead...&quot;. How counterculture. The song\n\nis an essential element of The Jefferson Starship's repertoire, the band \nmutating it into a sludgy &quot;Jumpin' Jack Flash&quot; riff closer in the new millenium. \nBoth latter-day group vocalists Darby Gould and Diana Mangano understand the \nmajesty and sing the words Grace Slick is known for with reverence. Check out \nthe 1990's version live from the House Of Blues with a rare guest appearance by \nGrace which shows up on the Deep Space/Virgin Sky CD. The hard rock is a far cry \nfrom the manic almost garage band original ...and Slick says &quot;garden flowers&quot; \nvery clearly in the live rendition. \n\n-------------------------------------------------------------------------------\n\nBlues from an Airplane     by Matthew Greenwald\n\nA slightly dark and brooding song, &quot;Blues From an Airplane&quot; was the opening song \non Jefferson Airplane's 1966 debut album, Jefferson Airplane Takes Off. It's a \nclassy way to introduce the band to the public. Built around a murky, minor-key \nmelody, the sound of the group is that of a darker version of the Lovin' \nSpoonful. Lyrically, it's a real young man's blues: &quot;Don't know what to do/and I \ndon't have you by my side.&quot; The sense of modern craft in the group is already \napparent on this song. \n\n-------------------------------------------------------------------------------\n\nWhite Rabbit     by Joe Viglione\n\nFrom the Surrealistic Pillow album comes this song which, like the word \nsurrealistic indicates, has &quot;an oddly dreamlike or unreal quality&quot;. Few \npsychedelic moments can match Grace Slick's trance-like monotone perhaps \ninspired by having just read - Lewis Carroll: The Complete Illustrated Works: \nAlice's Adventures in Wonderland, Through the Looking-Glass and What Alice Found \nhere. With hypnotic guitar work in the slow-march intro sounding like it was \ninduced by F.A. Mesmer himself, it's all the more ominous in the harder rocking \nversion released decades later on the Deep Space/Virgin Sky live reunion CD. \nOriginally performed with The Great Society, this composition by Grace came \nright on the heels of &quot;Somebody To Love&quot; and instantly insured Ms. Slick \nsuperstardom with more Top 40 airplay in 1967 than her famous colleague Janis \nJoplin. With well over a hundred cover versions by such diverse acts as punk/new \nwavers The Damned, the hard rock Lizzie Borden (no relation to the new wave girl \ngroup produced by Genya Ravan) and, believe it or not, jazz maestro George \nBenson, it is Grace and her pharmaceutical prescription advice which is the \ndefinitive rendition and inspired the Keanu Reeves film The Matrix as much as \nJames Cameron's The Terminator did. When in the movie Morpheus offers Neo the \nlittle red pill or the little blue pill, it is pure Grace Slick opening the door \nto wonderland with narcotics. Years later it is amazing the censors didn't put a \nstop to it, Janis Ian's &quot;Society's Child&quot; finding more problems with an \ninterracial love affair than The Jefferson Airplane's window to another world. \nIt's a classic in the truest sense of the word and always a pause for fun when \nit comes on the radio. \n\n-------------------------------------------------------------------------------\n\nPlastic Fantastic Lover     by Matthew Greenwald\n\nA song about television? Leave it to Jefferson Airplane to do it. The closing \nsong on their landmark Surrealistic Pillow album, &quot;Plastic Fantastic Lover&quot; has \nits origins in an L.A. hotel room (probably the Tropicana, where the band was \nstaying at the time). Marty Balin was watching television and thinking about how \nso many people were a bit too entranced with the medium. Like a lot of Airplane \nsongs, it's loaded with a strong sense of low-key sarcasm. Musically, it's a \nfine blues-rocker, with a very strong James Brown/ funk influence. \n\n-------------------------------------------------------------------------------\n\nAerie (Gang of Eagles)     by Matthew Greenwald\n\nA somewhat unusual blues-based song from the Grace Slick songbook, &quot;Aerie (Gang \nof Eagles)&quot; has a sad, downcast quality to the lyrics, almost like a requiem for \nsomeone. The melody is meandering and tends to have trouble staying in focus. \nThe slightly depressing and tired quality of the song and arrangement mirrors \nthe end of the 1960s, and the Airplane's fate as well. \n\n-------------------------------------------------------------------------------\n\nThe Ballad of You and Me and Pooneil     by Matthew Greenwald\n\nOne of Jefferson Airplane's most powerful rockers, &quot;Ballad of You and Me and \nPooneil&quot; (a sly reference to Fred Neil, one of Paul Kantner's biggest \ninfluences) is almost a mini-suite. The first section is a strong 1-4-5 chord \nprogression backed by a 4/4 rhythm. The song abruptly shifts into a psychedelic \nfolk-rock riff that slides into an instrumental section before returning to the \nmain 4/4 verses. Lyrically, it's a very loose love song in keeping with the \ngeneral atmosphere of the time. It's very visual, and the feeling of color and \nvision (or, more accurately, LSD) is paramount. It was released as a single \n(just missing the Top 40) in late 1967, and it was the lead track on the \nAirplane's After Bathing at Baxter's album. A stunning 11-minute alternate \nversion can be found on the group's Jefferson Airplane Loves You box set. \n\n-------------------------------------------------------------------------------\n\nCrown of Creation     by Matthew Greenwald\n\nLike &quot;She Has Funny Cars,&quot; the title song from Jefferson Airplane's excellent \n1968 LP Crown of Creation is a snide and direct put-down of traditional American \nvalues as well as the hypocrisy. A powerful folk-inspired melody with some \nstrident chord changes, the song also has a slight funk flavor, due to Jack \nCasady's great bass playing. The song slows to a crawl at the end, with some \nexcellent lyrics about the power of change. Inspired by science fiction \n(especially Theodore Sturgeon's writings), the song fused Kantner's sci-fi and \nrevolutionary thoughts perfectly. \n\n-------------------------------------------------------------------------------\n\nLather     by Matthew Greenwald\n\nSeveral of the songs on Jefferson Airplane's 1968 album Crown of Creation are \nabout change, and &quot;Lather,&quot; the first song on this album, sets the tone. \nInspired by Airplane drummer (and Slick's current lover) Spencer Dryden's \nimpending 30th birthday, Grace Slick's lyric speaks about the loss of innocence \nand the confusion and reflection that goes with it. Musically, it's a bit of a \ndeparture for Slick, being a folk-inspired melody, with some excellent classical \nfeeling as well. \n\n-------------------------------------------------------------------------------\n\nThe Last Wall of the Castle     by Matthew Greenwald\n\nSounding not unlike a James Brown song on steroids, &quot;The Last Wall of the \nCastle&quot; is one of the Airplane's hardest-rocking songs. The words are sung in an \nalmost too-fast-to-decipher flow, but the overt illustration of a generation \nchanging at an alarming rate is apparent. Musically, it's a minor psychedelic \nmasterpiece, and the incredibly fast tempo drives the melody over the goal line. \n\n-------------------------------------------------------------------------------\n\nGreasy Heart     by Matthew Greenwald\n\nWhen Grace Slick writes a song, it is a very personal experience. So personal \nthat the material is usually suited for only her voice. &quot;Greasy Heart&quot; is a good \nexample. Written during the After Bathing at Baxter's period, and perhaps better \nsuited to that album than Crown Of Creation, it is a perfect period piece that \nstill comes alive today. The lyrics are a jumble of intelligent-sounding random \nthoughts and put-downs to a lover -- something that Slick was an expert at. It \nalso makes social comments on everything from commercialism to drugs and sex. \nThe music is classic Airplane, loud, fast, in and out, and all over the musical \nmap. \n\n-------------------------------------------------------------------------------\n\nVolunteers     by Matthew Greenwald\n\nAlthough on the surface this song is one of the most revolutionary and \nreactionary Jefferson Airplane songs, &quot;Volunteers&quot; has some relatively innocent \norigins. Apparently, Marty Balin was awoke one morning by a loud garbage truck \nthat was making its rounds outside the Airplane's communal house, bearing the \ntitle &quot;Volunteers for America,&quot; and, thus, the title and hook were born. \nMusically, it is very similar to the lead track from the album of the same name, \nwhich was based on a bluegrass riff that was suggested to Paul Kantner by David \nCrosby. It's a heavy rocker, and one of the Airplane's finest -- and easily most \nunderrated -- singles. The studio version (with Nicky Hopkins on piano) is \ndefinitive, but there is also an excellent live version on the Woodstock \nsoundtrack. \n\n-------------------------------------------------------------------------------\n\nWhen the Earth Moves Again     by Matthew Greenwald\n\nAn apocalyptic song that draws on history and politics, &quot;When the Earth Moves \nAgain&quot; is one of Paul Kantner's finest efforts from the Airplane's Bark album. \nWith a strident, three-chord melody that recalls &quot;We Can Be Together&quot; and other \nKantner works, there is an earnest quality that permeates the music and lyrics. \nThe only sad fact is that the Airplane's recording of this fine song is quite \nmuddy and tends to not only bury the melody, but the message as well. \n\n-------------------------------------------------------------------------------\n\nWe Can Be Together     by Matthew Greenwald\n\nThe political climate of America in the late '60s was great fodder for a lot of \nmusicians, but few groups handled it better than Jefferson Airplane. This song, \nthe opener for the group's Volunteers album, was a virtual &quot;state of the union&quot; \naddress for the counterculture of the late '60s. Graphically putting forth all \nof the impassioned positive thrust as well as the paranoia of the time, &quot;We Can \nBe Together&quot; defined the later Airplane state of mind. Musically, it's a basic, \nthree-chord folk-rock anthem; but the bluegrass-inflected melody -- suggested by \nKantner's friend, David Crosby -- places it in a different, and unusual, \n\n-------------------------------------------------------------------------------\n\nWooden Ships     by Joe Viglione\n\nReleased by Jefferson Airplane on the Volunteers lp after Crosby, Stills &amp; Nash \nput it on their self-titled 1969 debut, the collaboration between Stephen \nStills, David Crosby and Paul Kantner got much attention through Crosby, Stills, \nNash &amp; Young's rendition as the first track on side three of the Woodstock \n&quot;music from the original soundtrack and more&quot; set, with no co-writing credit for \nPaul Kantner on original copies of the disc or album jacket! The six minute and \ntwenty-three second version on the 2400 Fulton Street double CD has the twenty \nseconds or so of waves against the boat sounds while the alternate mix from the \n&quot;Quad&quot; Volunteers album appears on the Jefferson Airplane Loves You box. The \nalternate mix is much cleaner, going right into the folk guitars, the original \nAl Schmitt production mixed to stereo by Paul Williams and Pat Martin. At 5:52 \nit is 31 seconds shorter than the original, recorded April 14-22, 1969 at Wally \nHeider's, San Francisco. There are sixteen musicians on this epic version \nincluding pianist Nicky Hopkins, Jerry Garcia on pedal steel guitar, David \nCrosby on &quot;music&quot; and &quot;sailboat&quot;, Stephen Stills on hammond organ, and lots of \nvocals making for an eerie and totally cosmic trip into the future.\n\nGrace Slick's presence is key, and as latter day Jefferson Starship combinations \nbring the epic back to life it becomes clear that Jefferson Airplane/ Jefferson \nStarship could very well have followed The Grateful Dead into that jam band \nphenomenon which Phish picked up on so efficiently. &quot;Wooden Ships&quot; and songs \nlike it were the ticket, and had the band stayed on this course rather than \ngoing into that arena rock 1980's sound with Mickey Thomas, they very well could \nbe playing to tens of thousands every night. The studio rendition of this \ncomposition is amazing and as much fun as it is a good study in psychedelic \nfolk-rock. The line &quot;Go ride the music&quot; which repeats at the end of &quot;Wooden \nShips&quot; became the title of a television special.\n\n-------------------------------------------------------------------------------\n\nHave You Seen The Saucer     by Matthew Greenwald\n\nThe final recording featuring the &quot;classic&quot; Jefferson Airplane lineup, &quot;Have You \nSeen the Saucers?&quot; was a great parting shot at the forces of conformity and the \nneed for the hippie counterculture to escape. In this regard, it is a \ncontinuation of &quot;Wooden Ships,&quot; a Crosby, Stills &amp; Nash song that Paul Kantner \ncontributed to, and the theme of space travel, ecology, and the '60s hippie \ndream are all included in the lyrics. Brilliantly performed and sung, the entire \nband shines, especially the harmonies of Slick, Kantner, and Balin, and the \nfunky bridge that finds bassist Jack Cassidy and guitarist Jorma Kaukonen laying \ndown some of the funkiest grooves that the band ever achieved. Aside from its \nsingle release, it was also included on the Early Flight rarities collection of \n1971. \n\n-------------------------------------------------------------------------------\n                               EAC LOG EXTRACT\n-------------------------------------------------------------------------------\n\nExact Audio Copy V0.99 prebeta 4 from 23. January 2008\n\nEAC extraction logfile from 27. July 2009, 15:04\n\nJefferson Airplane / The best of Jefferson Airplane  [1967-1974]\n\nUsed drive  : HL-DT-STDVD-RAM GSA-H55N   Adapter: 0  ID: 0\n\nRead mode               : Secure\nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\nRead offset correction                      : 102\nOverread into Lead-In and Lead-Out          : No\nFill up missing offset samples with silence : Yes\nDelete leading and trailing silent blocks   : No\nNull samples used in CRC calculations       : Yes\nUsed interface                              : Installed external ASPI interface\nGap handling                                : Appended to previous track\n\nUsed output format              : User Defined Encoder\nSelected bitrate                : 1024 kBit/s\nQuality                         : High\nAdd ID3 tag                     : No\nCommand line compressor         : F:Archivos de programaExact Audio \nCopyFLACFLAC.EXE\nAdditional command line options : -8 -V -T &quot;ARTIST=%a&quot; -T &quot;TITLE=%t&quot; -T \n&quot;ALBUM=%g&quot; -T &quot;DATE=%y&quot; -T &quot;TRACKNUMBER=%n&quot; -T &quot;GENRE=%m&quot; -T &quot;COMMENT=%e&quot; %s -o \n%d\n\n-------------------------------------------------------------------------------\n                                ACCURIP REPORT\n-------------------------------------------------------------------------------\n\n[Verification date: 27/07/2009 16:05:05]\n[Disc ID: 002f4fdd-02ed71c1-1a10d515]\nPregap length 00:00:32.\nTrack\t[ CRC    ] Status\n 01\t[45781b18] (08/44) Accurately ripped as in pressing(s) #3\n 02\t[a9dbc7ee] (08/42) Accurately ripped as in pressing(s) #3\n 03\t[5f465732] (09/43) Accurately ripped as in pressing(s) #3\n 04\t[7fff295c] (08/42) Accurately ripped as in pressing(s) #3\n 05\t[fa59497a] (09/45) Accurately ripped as in pressing(s) #3\n 06\t[095b9321] (09/43) Accurately ripped as in pressing(s) #3\n 07\t[6bc03fef] (10/46) Accurately ripped as in pressing(s) #3\n 08\t[ff29c698] (09/43) Accurately ripped as in pressing(s) #3\n 09\t[eacefb3f] (09/43) Accurately ripped as in pressing(s) #3\n 10\t[7f69b7e9] (09/43) Accurately ripped as in pressing(s) #3\n 11\t[3fce1e1f] (09/42) Accurately ripped as in pressing(s) #3\n 12\t[5df37e6e] (09/42) Accurately ripped as in pressing(s) #3\n 13\t[ce7118a9] (08/41) Accurately ripped as in pressing(s) #3\n 14\t[5ad7e523] (08/41) Accurately ripped as in pressing(s) #3\n 15\t[8a67742d] (10/43) Accurately ripped as in pressing(s) #3\n 16\t[59c42673] (09/42) Accurately ripped as in pressing(s) #3\n 17\t[82c0375e] (08/42) Accurately ripped as in pressing(s) #3\n 18\t[9854987a] (09/42) Accurately ripped as in pressing(s) #3\n 19\t[72c06378] (08/40) Accurately ripped as in pressing(s) #3\n 20\t[67ed3df2] (09/43) Accurately ripped as in pressing(s) #3\n 21\t[4c1923c2] (09/43) Accurately ripped as in pressing(s) #3\nOffsetted by -676:\n 01\t[02906f20] (14/44) Accurately ripped as in pressing(s) #2\n 02\t[9a54e53e] (14/42) Accurately ripped as in pressing(s) #2\n 03\t[025ad286] (14/43) Accurately ripped as in pressing(s) #2\n 04\t[a3957670] (14/42) Accurately ripped as in pressing(s) #2\n 05\t[80a9ea6a] (14/45) Accurately ripped as in pressing(s) #2\n 06\t[7f83b735] (14/43) Accurately ripped as in pressing(s) #2\n 07\t[c5ebd05f] (14/46) Accurately ripped as in pressing(s) #2\n 08\t[d239b828] (14/43) Accurately ripped as in pressing(s) #2\n 09\t[ef42d993] (14/43) Accurately ripped as in pressing(s) #2\n 10\t[a5266a19] (14/43) Accurately ripped as in pressing(s) #2\n 11\t[d4ac54e7] (14/42) Accurately ripped as in pressing(s) #2\n 12\t[67238d4e] (14/42) Accurately ripped as in pressing(s) #1\n 13\t[d1e0d39d] (14/41) Accurately ripped as in pressing(s) #1\n 14\t[ad1d4747] (14/41) Accurately ripped as in pressing(s) #1\n 15\t[72966ef5] (14/43) Accurately ripped as in pressing(s) #2\n 16\t[cd881af7] (14/42) Accurately ripped as in pressing(s) #2\n 17\t[5da3e692] (14/42) Accurately ripped as in pressing(s) #2\n 18\t[51911f62] (14/42) Accurately ripped as in pressing(s) #2\n 19\t[af3769b8] (14/40) Accurately ripped as in pressing(s) #1\n 20\t[a2c7378a] (14/43) Accurately ripped as in pressing(s) #2\n 21\t[e1c72e82] (14/43) Accurately ripped as in pressing(s) #2\n\n-------------------------------------------------------------------------------\n                      IMPORTANT: PLEASE READ (A REQUEST)\n-------------------------------------------------------------------------------\n\nIt's usual to post comments only to complain about a torrent which doesn't work \nin your configuration.  It's normal, after a few hours/days downloading and \nexpecting a release, to feel deceived if it doesn't work properly, and \nexpressing this is legitimate.\n\nI've often found one comment (negative) on a movie/CD downloaded by 2000+ \npeople, and since that single negative feedback, people simply stop downloading \nand therefore, sharing.  But a few times it was due not to the torrent itself, \nbut to some issues on the downloader side (not updated codecs, misused \ntools...), and that's unfair for the person who took the time to share it for\nfree.\n\nIF YOU FIND THIS RELEASE DESERVES TO BE RECOMMENDED TO OTHERS, HELP BY DROPPING \nA LINE AFTER YOU'VE CHECKED IT.  This way, You'll help in keeping the torrent \nalive, almost as much as keeping it in your HDD until a 1:1 ratio is\nreached.\n\nThanks\n\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:a69f1ea6c6fd9c743c2d62b025ff7cf51cbf8a6f","amp;dn":"Jefferson+Airplane+-+Journey+%28The+Best+Of%29+%5BEAC-FLAC%5D+%5BRePoPo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a69f1ea6c6fd9c743c2d62b025ff7cf51cbf8a6f","infoHashBuffer":{"type":"Buffer","data":[166,159,30,166,198,253,156,116,60,45,98,176,37,255,124,245,28,191,138,111]},"announce":[],"urlList":[]}}