{"title":"Ancient Chinese Warfare -epub","uid":6276234,"size":1173045,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a72dc3fd8fa84586cd501d6a3d268add42bc79dc&amp;dn=Ancient+Chinese+Warfare+-epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1301265617,"description":"Sawyer, a leading scholar of Chinese warfare and fellow at the Centre for Military and Strategic Studies, is best known for his comprehensively edited translations of classical military writings. His latest analytical work is no less significant. It begins in the prehistoric period and continues through the fifth century B.C.E., an era traditionally described as one of stability, almost idyllic compared to the two-century warring states period that followed. Sawyer instead demonstrates through archeological evidence, traditional accounts, and convincing interpretations of inscriptions that conflict in China became increasingly complex, lethal, and decisive during the Hsia and Shang dynasties. Armies became structured forces with bureaucratized logistics. Warrior values were integrated into mainstream cultures. Sawyer's analysis ranges from the evolution of fortification, through the metallurgical innovations behind improved weapons, to the technologies and animal husbandry that enabled the chariots that became ancient China's signature. Warfare, says Sawyer, stimulated innovation, social change, and material progress. It also destroyed the peace and security of communities, then peoples, absorbed into ever-larger political systems sustained by force. Ancient China, shaped by its wars, was firmly set on &quot;a trajectory of state building and aggressive activity.&quot; \n\n576 pages \nPublisher: Basic Books (March 1, 2011) \nLanguage: English \n","torrent":{"xt":"urn:btih:a72dc3fd8fa84586cd501d6a3d268add42bc79dc","amp;dn":"Ancient+Chinese+Warfare+-epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a72dc3fd8fa84586cd501d6a3d268add42bc79dc","infoHashBuffer":{"type":"Buffer","data":[167,45,195,253,143,168,69,134,205,80,29,106,61,38,138,221,66,188,121,220]},"announce":[],"urlList":[]}}