{"title":"Chick Corea - My Spanish Heart (1976) [Jazz][flac][schon55]","uid":6200505,"size":323758865,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a759547405ed5fe3d222db690d1eb6e42e571fe7&amp;dn=Chick+Corea+-+My+Spanish+Heart+%281976%29+%5BJazz%5D%5Bflac%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":27,"time":1298599581,"description":"Chick Corea - My Spanish Heart \nOriginal Released (vinyl): 1976\nAudio CD: March 7, 2000 \nFormat: Original recording remastered \nLabel: Polygram Records\nQuality: flac + cue\n\nReleased at the height of Return To Forever's popularity, My Spanish Heart is usually regarded as one of Chick Corea's best albums. While this reviewer is not sufficiently versed in Corea's catalogue to make such a comprehensive judgement, the album is clearly a work of substance, and a fair representation of what the 1970s jazz-fusion scene could produce in its better moments.\n\nMy Spanish Heart is entirely instrumental (using the voice as an instrument, note), and is generally devoid of the more Spinal Tappian ideas which Corea has sometimes been accused of profering (ie. there are no leprechauns to be found here). While some neophytes may be unnerved by Corea's matador poses on the front and back covers, said images are thankfully not harbingers of musical absurdity. Instead, the listener will discover good composing, good playing and (not least important) good arranging. Those interested in Corea's output but wary of his &quot;big ideas&quot; could do worse than begin with this work.\n\nThe album begins with &quot;Love Castle&quot;, a tasty bit of 1970s jazz, with elements of both fusion and funk in the mix. Corea himself is in top form here, incorporating a fair number of synthesized timbres into the piece; the vocal harmonies fit perfectly, and the danceable section don't come off as silly or contrived. Credit should also be given to Steve Gadd, whose drumming is extremely good throughout the track.\n\n&quot;The Gardens&quot; incorporates a bit more musical tension, with Clarke &amp; Corea trading lines over a background of stability (provided by cellist David Speltz, if I'm not mistaken). This piece really comes alive as a jazz piano trio in the middle. Then, after a bit of denouement, it segues into &quot;Day Danse&quot;, featuring handclapping and violin in a stronger role. Some might argue that the piano solo in this track meanders a bit, but its sharing of lead roles with the violin provides an impressive whole.\n\n&quot;My Spanish Heart&quot; is a brief solo piano work, written in the Romantic style and featuring traditionally Spanish effects. While a good number, this isn't an album highlight. It is followed by &quot;Night Streets&quot;, a fiesta number featuring horns and Airto-esque percussion; Corea provides multilayered playing with a use of the pitch-wheel which should appeal to most Patrick Moraz fans. The segue section is a bit darker (and somewhat &quot;rockier&quot;) than the rest of the track (it's better the second time than the first). Steve Gadd once again provides an extremely talented drum line.\n\nThings return to a more rural setting again for the next three tracks. &quot;The Hilltop&quot; is a more sparse number, featuring bass and percussion (and what appears to be a guitar line, despite the fact that no guitarist is credited on the album) creating an atmospheric effect fitting to an image of vast, arid plains. Corea and Clarke eventually unfold a fairly complex duet in this track, marred only by a fairly meandering bass solo near the end. The better parts of this track are among the album's highlights.\n\nThis is followed by &quot;The Sky&quot;, a track which might remind modern ambient enthusiasts of nothing so much as Roger Eno on 45 RPM (apologies to the Trouser Press Guide). This piano solo has some nice tone colouring, and gains in melodic qualities by the end.\n\n&quot;Wind Danse&quot; features a bit more of a dance influence (perhaps not surprisingly), with the fusion elements more strongly in the foreground. Harmonic vocals are once again incorporated into this track; Corea incorporates quite a few interesting sounds; Gadd contributes well. I imagine that the Bruford band was probably inspired by this track, to some degree.\n\n&quot;Armando's Rhumba&quot; is an active number featuring Corea and Ponty in the starring positions. The lead &quot;hook&quot; of this track, although a good piece of music in its own right, hides the fact that more music &quot;happens&quot; on this track than may be evident on a first listen. Clarke and Corea both take solos toward the end, though this is clearly intended as a spotlight for Ponty. The end result is quite impressive.\n\nAt this stage, Corea allows his larger instrumental projects to take the foreground. The &quot;El Bozo&quot; suite begins with a brief prelude, a modern jazz piano solo that should impress those of progressive tastes. This is followed by a three-part adventure in synthesizer programming. There are some who claim that Miles Davis may have been inspired by The Nice in his decision to embrace fusion; if so, &quot;Part I&quot; returns the favour somewhat, intermingling harsh chords (and sounds) with a more pleasant lead motif. &quot;Part II&quot; is a bit more of a light-hearted number, showcasing experimental keyboard technology in all of its 1970s glory. &quot;El Bozo&quot; doesn't really come of age, however, until &quot;Part III&quot;, a more serious composition within the 1970s jazz-fusion variety (with all of the good and a little bit of the bad which this entails). This final section is not a novelty piece, and stands out as the most substantial aspect of the larger composition.\n\nThe &quot;Spanish Fantasy&quot; suite is, in general, a more serious/involved composition. &quot;Part I&quot; begins with active performances, combining late Romantic and jazz stylings in a fairly impressive way. The trumpet and drums are shortly added (in a fairly odd manner), soon superseded by a string quartet appearance. Corea and Clarke, moreover, join in for a duet at the end. This is a fairly diverse arrangement, of course, but Corea nevertheless manages to pull it off. &quot;Part II&quot; is more of a standard prog-fusion extravaganza, lacking the timbric diversity of the previous section (though still quite good by its own standards). Gadd shines once again, and Corea is consistently good (though the synth bass could arguably have been curtailed). &quot;Part III&quot; returns to Romantic-jazz piano in a fairly &quot;busy&quot; manner, though some may wonder if Corea's lead melody is a bit too safe for the occasion. Finally, &quot;Part IV&quot; culminates the album with a return to the street fiesta setting, with active drumming and a fair degree of piano/synth variety from Corea (even a Polymoog solo makes an appearance). The bridge section is understated fusion at its best, and the bass synth makes a bit more sense here. The string quartet and trumpets return at the end to bring the arrangement of the track to its fruition.\n\nMy Spanish Heart is a highly creative album, and one which those progressive fans interested in seeking out fusion works may find some interest in (the next step after Miles, perhaps?). Recommended. ~ The Christopher Currie\n\nPersonnel:\n\nChick Corea: acoustic piano, mini-moog, Moog 15, Arp Odessy, Yamaha Organ,Polymoog, Fender Piano, handclapping,    footstomping, male choir\nDon Alias: percussion\nStuart Blumberg: trumpet\nStanley Clarke: acoustic bass on &quot;The Gardens&quot;, &quot;Armando's Rhumba&quot;, &quot;TheHilltop&quot; and &quot;Spanish Fantasy, Part I&quot;\nSteve Gadd: drums\nConnie Kupka: second violin\nRon Mass: trombone\nGayle Moran: vocals, vocal choir\nCarol Mukogawa: viola\nJean Luc Ponty: violin on &quot;Armando's Rhumba&quot;\nJose Rosenburg: trumpet\nBarry Socher: first violin\nDavid Speltz: cello\nJohn Thomas: lead trumpet\nMichael Narada Walden: handclapping on &quot;Armando's Rhumba&quot;\n\nChick Corea - My Spanish Heart Tracks:\n01  Love Castle 4:45    \n02  The Gardens 3:12    \n03  Day Danse 4:27    \n04  My Spanish Heart 1:38    \n05  Night Streets 6:08    \n06  The Hilltop 6:16    \n07  The Sky 4:57    \n08  Wind Danse 5:00    \n09  Armando's Rhumba 5:19    \n10  Prelude To El Bozo 1:34    \n11  El Bozo, Part I 2:52    \n12  El Bozo, Part II 2:03    \n13  El Bozo, Part III 5:03    \n14  Spanish Fantasy, Part I 6:06    \n15  Spanish Fantasy, Part II 5:14    \n16  Spanish Fantasy, Part III 3:06    \n17  Spanish Fantasy, Part IV 5:16    \n18  The Clouds 4:33 ","torrent":{"xt":"urn:btih:a759547405ed5fe3d222db690d1eb6e42e571fe7","amp;dn":"Chick+Corea+-+My+Spanish+Heart+%281976%29+%5BJazz%5D%5Bflac%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a759547405ed5fe3d222db690d1eb6e42e571fe7","infoHashBuffer":{"type":"Buffer","data":[167,89,84,116,5,237,95,227,210,34,219,105,13,30,182,228,46,87,31,231]},"announce":[],"urlList":[]}}