{"title":"K'naan feat. will.i.am &amp; David Guetta-Wavin' Flag (2nafish","uid":5595877,"size":124411908,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a7807de24cdd60d93fd5889a30c4f184f97e7f81&amp;dn=K%5C%27naan+feat.+will.i.am+%26+David+Guetta-Wavin%5C%27+Flag+%282nafish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1275037265,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Wavin' Flag&quot; is a song by K'naan from his album Troubadour, reaching #2 on the Canadian Hot 100. A remake by a supergroup of Canadian artists, credited as Young Artists for Haiti, became a charity single, with this new version going straight to #1 on the Canadian charts. A version of the song featuring will.i.am  and David Guetta is targeted for international release. The song also appears on the soundtrack for the video game NBA 2K10.\n\nThe song was chosen as Coca-Cola's promotional anthem for the 2010 FIFA World Cup, to be held in South Africa. The English version was released as &quot;Wavin' Flag (The Celebration Mix)&quot; by K'naan and many other bilingual and country-specific versions have been released. &quot;The Celebration Mix&quot; version of the song topped the singles charts in Germany, Swiss Music Charts and Austria.\n\nAn international remix of Wavin' Flag features French music producer David Guetta and American rapper producer and Black Eyed Peas frontman will.i.am and was made for an international release outside of Canada. A big part of the will.i.am solo parts were newly written for the international version, and even for the K'naan part, some of the lyrics were amended.\n\nThe version featuring will.i.am and David Guetta was released as the single b-side to the Wavin' Flag (Celebration Mix) single release in Europe. \n\nA separate music video was made for this version, with the artists performing in front of a large black flag. However some scenes were used from the Canadian original music video and from K'naan's &quot;Wavin' Flag Celebration Mix&quot; music video.\n\nTroubadour is the second studio album by Somali-Canadian hip hop artist K'naan, released February 24, 2009. The album features performances by Kirk Hammett, Chubb Rock, Chali 2na, Mos Def, Damian Marley, and Adam Levine. Production was completed by Track and Field, a team composed of R&amp;B artists Gerald Eaton and Brian West.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a7807de24cdd60d93fd5889a30c4f184f97e7f81","amp;dn":"K%5C%27naan+feat.+will.i.am+%26+David+Guetta-Wavin%5C%27+Flag+%282nafish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7807de24cdd60d93fd5889a30c4f184f97e7f81","infoHashBuffer":{"type":"Buffer","data":[167,128,125,226,76,221,96,217,63,213,136,154,48,196,241,132,249,126,127,129]},"announce":[],"urlList":[]}}