{"title":"MEF - Consuming Kids The Commercialisation Of Childhood","uid":5054869,"size":709945703,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a7aba38dc724b57244bb34119edb0030e9639f0b&amp;dn=MEF+-+Consuming+Kids+The+Commercialisation+Of+Childhood&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1250359144,"description":"With virtually no government oversight or public outcry, the multi-billion dollar youth marketing industry in America has been able to use the latest advances in psychology, anthropology and neuroscience to transform American children into one of the most powerful and profitable consumer demographics in the world.\n\n\nAmerican kids now influence an estimated $700 billion in annual spending, targeted virtually from birth with sophisticated commercial appeals designed to sell everything from Hollywood merchandise and junk foods to iPods, mobile phones, and the family car. The result is that childhood itself has been commercialised. Consuming Kids traces the evolution and impact of this disturbing and unprecedented phenomenon, exposing the youth marketing industry's controversial tactics, and exploring the effect of hyper-consumerism on the actual lived experience of children. Dr. Susan Linn, the Director of the Campaign for a Commercial-Free Childhood, explains: &quot;This generation of children is marketed to as never before. Kids are being marketed to through brand licensing, through product placement, marketing in schools, through stealth marketing, through viral marketing. There's DVDs, there's video games, there's the internet, there are iPods, there are cell phones. There are so many more ways of reaching children so that there is a brand in front of a child's face every moment of every day.&quot;\n\n\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\n\nMAY BE SLOW BUT SURE! PLEASE ASSIST IN BANDWIDTH!","torrent":{"xt":"urn:btih:a7aba38dc724b57244bb34119edb0030e9639f0b","amp;dn":"MEF+-+Consuming+Kids+The+Commercialisation+Of+Childhood","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7aba38dc724b57244bb34119edb0030e9639f0b","infoHashBuffer":{"type":"Buffer","data":[167,171,163,141,199,36,181,114,68,187,52,17,158,219,0,48,233,99,159,11]},"announce":[],"urlList":[]}}