{"title":"Eric Clapton - Unplugged (1992) WMA320","uid":6160985,"size":152987510,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a80482723320d65c437442fb679c7a4f72b6e716&amp;dn=Eric+Clapton+-+Unplugged+%281992%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1297211679,"description":"The debate whether, when learning to play the guitar, you should begin with an acoustic or an electric instrument, is probably as old as the history of the electric guitar itself; regardless which event you associate most strongly with its invention, and which of the enterprising souls who began experimenting with the amplification of the six-string sound way back in the 1930s you most credit therewith. Many find the sound of an electric guitar more impressive than that of an acoustic; and I'll freely admit that few pieces of music make my inner membranes resonate as instinctively as those featuring a really well-played e-guitar solo. Purists, however, argue passionately in favor of the acoustic guitar, and maintain that you're simply not going to learn to play &quot;cleanly&quot; if you don't start out that way. And there is definitely something to be said for that, because it is much easier to conceal a sloppily-played chord behind an electric guitar's amplified volume or a clever-sounding solo (or behind both) than in the unadulterated sound of an acoustic guitar. The discussion about the early 1990s' trend towards &quot;unplugged&quot; recordings centers around similar arguments. Some pieces of music are of course simply not meant to ever be played on an acoustic guitar. Others, however, live from their amplified soundeffects more than from their intrinsic musical values, and they simply fizzle when reduced to their core and performed acoustically. \n\nAnd then there is that rare category of pieces which sound equally fantastic both ways, and that rare category of players who manage to dazzle you regardless what type of instrument they're playing. Eric Clapton is such a musician, and some of the songs on the playlist of his &quot;Unplugged&quot; album are such pieces of music. Most notable among those, of course, is &quot;Layla,&quot; Clapton's intensely personal dedication to one-time wife Patty Boyd; written in 1970 and at a time when he saw no chance of ever winning her for himself. From the memorable opening riff of the song's original recording to its guitar solos, screaming with despair, it is extremely hard to imagine how this song could ever work in an acoustic version. Yet on a whim and at the last minute, Clapton decided to include it in the &quot;Unplugged&quot; playlist. And transposed by a full octave, reduced to a languid and almost upbeat, somewhat jazzy blues rhythm, it works out wonderfully; and Layla/Patty finds herself miraculously transformed from an object of desire to one of reflection instead. In fact, that track alone, which won the 1992 Grammy as Best Rock Song, turned out to be responsible for a good share of the enormous popularity of this album which (together with 1989's &quot;Journeyman&quot;) reestablished Clapton as an artist to reckon with, after his career had threatened to slump over the course of much of the previous decade. And similarly responsible for the success of &quot;Unplugged&quot; was the inclusion of another and more recent piece performed from the bottom of Clapton's soul, the triple Grammy winning &quot;Tears in Heaven;&quot; dedicated to his son Conor who had tragically died after falling from the open window of a 53rd floor apartment in New York City the preceding year. (The studio version of the song is contained on the soundtrack of the movie &quot;Rush,&quot; likewise released in 1992.) \n\nBut &quot;Unplugged&quot; is to large extents a classic blues album, from the twelve-bar rhythm of Bo Diddley's &quot;Before You Accuse Me&quot; (featuring only Eric Clapton himself and one of the most modest and supremely talented living guitarists, Clapton's trusted friend and touring partner Andy Fairweather Low) to Jimmy Cox's &quot;Nobody Knows You When You're Down and Out&quot; (the second cut besides &quot;Layla&quot; from the famous album recorded under the name Derek and the Dominos), Delta Blues king Robert Johnson's &quot;Walkin' Blues&quot; and &quot;Malted Milk,&quot; Jesse Fuller's upbeat &quot;San Francisco Bay Blues,&quot; and the traditionals &quot;Alberta&quot; and &quot;Rollin' and Tumblin'&quot; (the latter, here attributed to the great Chess blues man M[cKinley] Morganfield a/k/a Muddy Waters, who made it famous). Three more of Eric Clapton's own compositions stand out among the songs which round up the album's playlist: the introductory lighthearted &quot;Signe,&quot; which reflects his love of Brazilian music, the melancholic &quot;Lonely Stranger&quot; and finally &quot;Old Love,&quot; a cut from 1989's &quot;Journeyman.&quot; \n\nFew white artists understand as well as Eric Clapton that the blues thrives, first and foremost, on a live atmosphere - preferably in a smaller setting like the one used for this recording, which allows for plenty of spontaneous interaction between stage and audience. And few artists are as unafraid of the gaffes that are almost invariably associated with a live appearance, even in the case of Clapton and his outstanding backup band; and manage, time and again, to turn them into a light moment. The garbled beginning of &quot;Alberta&quot; is an excellent example here; you can almost hear Clapton grinning when he says &quot;Hang on, hang on, hang on&quot; and simply starts over. Similarly, &quot;Layla&quot; is merely introduced with the words &quot;See if you can spot this one&quot; - and instantly greeted with the enthusiastic cheers of an audience which doesn't even need to hear the famous five notes of the song's introductory riff to recognize it. \n\nAsked whether he, too, would ever consider an &quot;unplugged&quot; appearance, e-guitar legend Jeff Beck, who with Eric Clapton and Led Zeppelin's Jimmy Page forms the trinity of &quot;guitar gods&quot; that emerged from Great Britain's famous Yardbirds, reportedly once responded that he couldn't imagine such a thing because it would make him feel &quot;naked.&quot; And listening to Eric Clapton's &quot;Unplugged&quot; album, you can't shake the impression that Beck does have a point. These are pure, naked blues songs, supremely performed - and a pure joy to listen to. \n\nby Themis-Athena\n\nTRACKLIST:\n\n01 - Signe.wma                                                 \n02 - Before You Accuse Me.wma                                  \n03 - Hey Hey.wma                                               \n04 - Tears In Heaven.wma                                       \n05 - Lonely Stranger.wma                                       \n06 - Nobody Knows You When You're Down &amp; Out.wma               \n07 - Layla.wma                                                 \n08 - Running On Faith.wma                                      \n09 - Walkin' Blues.wma                                         \n10 - Alberta.wma                                               \n11 - San Francisco Bay Blues.wma                               \n12 - Malted Milk.wma                                           \n13 - Old Love.wma                                              \n14 - Rollin' &amp; Tumblin'.wma    \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:a80482723320d65c437442fb679c7a4f72b6e716","amp;dn":"Eric+Clapton+-+Unplugged+%281992%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a80482723320d65c437442fb679c7a4f72b6e716","infoHashBuffer":{"type":"Buffer","data":[168,4,130,114,51,32,214,92,67,116,66,251,103,156,122,79,114,182,231,22]},"announce":[],"urlList":[]}}