{"title":"Ry Cooder - Chicken Skin Music  [1976]  [Robbie60] [FLAC]","uid":6220675,"size":235143879,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a81562fbf84f637bfccf9ee65c09d1c0a612c286&amp;dn=Ry+Cooder+-+Chicken+Skin+Music++%5B1976%5D++%5BRobbie60%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robbie6ty","files":-1,"time":1299316721,"description":"Ry Cooder\nChicken Skin Music\n\nLabel: Reprise\nReleased: 1976\nSource: Original CD \nSize Torrent: 224 MB\nFormat: FLAC\n\n\n\n\n\n\nI recorded &quot;Yellow Roses&quot; and &quot;Chloe&quot; in Hawaii with Gabby Pahinui and Atta Isaacs, two of Hawaii's greatest traditional musicians. Gabby has been playing and singing Hawaiian music for forty years, and he is a national treasure to the Hawaiian people. Atta and Gabby are old friends and partners, and together they play some of the best guitar music I've ever heard. Atta is a traditional slack-key guitarist, but plays with a strong jazz feeling that blends perfectly with Gabby's Western Swing steel. This is the classic Hawaiian sound of the 1940's and 50's.\n&quot;Always Lift Him Up&quot; is an old song by the West Virginia fiddler and songwriter Blind Alfred Reed. I did this tune in slack-key style, and the instrumental section is an old Hawaiian gospel song, &quot;Kanaka Wai Wai&quot;, that I learned from Gabby and Atta. Many traditional Hawaiian melodies have a gospel quality that puts me in the same frame of mind as Alfred Reed's lyrics - sort of solemn but optimistic. Bobby King, Terry Evans and Herman Johnson, an ordained minister, really carry that feeling.\n&quot;Stand By Me&quot; has always sounded gospel to me. We sang it modified quartet style with Flaco Jimenez leading the band in a Norteno arrangement. Flaco plays diatonic button accordion, the favorite lead instrument in Norteno, or &quot;Tex-Mex&quot; music, and he is a favourite with the people of South Texas. I started playing with Flaco a couple of years ago in San Antonio, and I thought it would be a good idea to blend the rich and expressive Norteno sound with other material. We recorded &quot;He'll Have To Go&quot; in Bolero rhythm, featuring the accordion and alto sax duet sound that originated in Monterrey, Mexico, in the early 50's. I got the idea to record &quot;Good Night Irene&quot; from watching Flaco and his band play boleros, polkas, and waltzes at all-night dances. Leadbelly started out as a dance musician and all his songs have a strong beat.\nI learned a little accordion from Flaco, who is a master, enough to try Louisiana French accordion on another Leadbelly song, &quot;The Bourgeois Blues&quot;. The bajo-sexto I got in San Antonio also fits this piece well - it is a great rhythm instrument.\n&quot;I Got Mine&quot; is actually an old pop song from the minstrel and medicine show tradition. I learned this version from Pink Anderson, who followed tent shows in his early years. The idea of &quot;Smack Dab In The Middle&quot; came partly from listening to the Golden Gate Quartet and the Pilgrim Travellers. These innovative gospel groups featured complex harmonies and hair's breadth syncopated arrangements. With me on this tune are Jimmy Adams and Cliff Givens, who both have careers reaching back into the heyday of this style.\nOne of the things I love most about making records is getting together with Jim Keltner, Milt Holland, Chris Ethridge, and George Bohanon. &quot;I Got Mine&quot;, &quot;Smack Dab In The Middle&quot; and &quot;Always Lift Him Up&quot; show the years of work and friendship. For me, this album reaches a level of real understanding and mutuality in music.\n\n-Ry Cooder\n\n\n\n\nDipping deeply into a richly mixed musical bag, Ry Cooder, on his 1976 release Chicken Skin Music, joins forces with legendary Hawaiian slack key guitarist Gabby Pahinui and Tex-Mex accordian master Flaco Jimenez on selections that range from Ledbetter/Lomax perennials &quot;Goodnight Irene&quot; and &quot;The Bourgeois Blues&quot;, to Ben E. King's &quot;Stand By Me&quot; and a stunning rendition of the traditional &quot;I Got Mine&quot;.\nRy Cooder's mastery of string instruments began at age three, when he first began playing guitar. Active on the Southern California folk and blues circuit in the early '60s, Cooder apprenticed with, among others, Jackie DeShannon, Taj Mahal, Gordon Lightfoot, Little Feat and Captain Beefheart. A superb session musician, Cooder played on the sountracks to Candy and Performance and is heard extensively on the Rolling Stones' landmark Let It Bleed.\nThe singer, songwriter and multi-instrumentalist recorded his eponymously-titled debut album in 1970. Featuring lunging, syncopated rhythms, masterful mandolin and slide guitar work, and an eclectic tune stack, Ry Cooder earned immediate critical and popular acclaim. On subsequent albums, Cooder mined a motherlode of indigenous American music, from the Dust Bowl laments of Into The Purple Valley (1972), to the Depression-era blues of Boomer's Story (1972), to a full spectrum of folk, pop and R&amp;B treasures on Paradise And Lunch (1974). Cooder continued his wide-ranging musical explorations on Chicken Skin Music. Arranged and produced by the artist, Chicken Skin Music taps the spicy accordian playing of Flaco Jimenez (on such cuts as &quot;He'll Have To Go&quot; and &quot;Smack Dab In The Middle&quot;), while on the medley &quot;Always Lift Him Up/Kanaka Wai Wai&quot; and &quot;Chloe&quot;, Cooder trades licks with slack key master Pahinui, a major influence on the artist's own distinctive style.\n\n\n\n\nPersonnel\n\nRy Cooder : Bajo Sexto, Mandola, Bottleneck Guitar, French Accordion, Electric Guitar, Slack-key Guitar, Tiple, Hawaiian Guitar\n\nMilt Holland : Percussion, Drums\n\nGeorge Bohanon : Horn Arrangement, Baritone Horn\n\nJim Keltner : Drums\n\nChris Ethridge : Bass\n\nFred Jackson, JR. : Tenor Sax\n\nBenny Powell : Trombone\n\nOscar Brashear : Cornet\n\nRed Callender : Upright Bass\n\nFlaco Jimenez : Accordion\n\nPat Rizzo : Alto Sax\n\nRuss Titelman : Bajo Sexto\n\nGabby Pahinui : Steel Guitar\n\nAtta Isaacs : Slack-key Guitar, Accoustic Guitar\n\nIsaac Garcia : Drums\n\nHugo Gonzales : Bajo Sexto\n\nHenry 'Red' Ojeda : Bass\n\nFrank Villarreal : Alto Sax\n\n\nVocals : Ry Cooder, Bobby King, Terry Evans, Herman Johnson, James Adams, Cliff Givens, Gabby Pahinui\n\n\n\n\n\nTrack Listing\n\n\nThe Bourgeois Blues\n\nI Got Mine\n\nAlways Lift Him Up/Kanaka Wai Wai\n\nHe'll Have To Go\n\nSmack Dab In The Middle\n\nStand By Me\n\nYellow Roses\n\nChloe\n\nGoodnight Irene\n","torrent":{"xt":"urn:btih:a81562fbf84f637bfccf9ee65c09d1c0a612c286","amp;dn":"Ry+Cooder+-+Chicken+Skin+Music++%5B1976%5D++%5BRobbie60%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a81562fbf84f637bfccf9ee65c09d1c0a612c286","infoHashBuffer":{"type":"Buffer","data":[168,21,98,251,248,79,99,123,252,207,158,230,92,9,209,192,166,18,194,134]},"announce":[],"urlList":[]}}