{"title":"Phil Mulloy - Extreme Animation [DVD9 ENG] cartoon [TNTVillage]","uid":6139524,"size":8424110080,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a8d6e04fbb484ad411a5f4832788f6a1299dd600&amp;dn=Phil+Mulloy+-+Extreme+Animation+%5BDVD9+ENG%5D+cartoon+%5BTNTVillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dedalo33","files":-1,"time":1296443539,"description":"Phil Mulloy\nExtreme Animation\n\n\n\n&quot;If Disney is animation's heart, then British animator Phil Mulloy is its bowels.&quot;\n(Chris Robinson - Ottawa International Animation Festival)\n\n&quot;Phil Mulloy is the most entertaining... not to mention the most viscerally enjoyable animator since, oh, Tex Avery... okay?&quot;\n(Richard Meltzer)\n\n\n\n~-~ PRESENTAZIONE ~-~\n\nMulloy ha lavorato al cinema live-action come sceneggiatore e regista sino alla fine degli anni '80 quando, reinventandosi disegnatore e animatore, si ÃƒÂ¨ dedicato al cartoon tradizionale. Il suo lavoro ÃƒÂ¨ spesso cinico e grottesco, caratterizzato dalla scioccante abilitÃƒÂ  nel mettere a nudo le debolezze del comportamento sociale sottomesso alla repressione e ai dogmi, al controllo e al consumismo.\nLa natura umana ed i valori contemporanei vengono passati alla lente indagatrice di questo autore britannico, ed il rischio per lo spettatore ÃƒÂ¨ quello di restare sbruciacchiato dall'umorismo nero che pervade le sequenze; sbruciacchiati sotto la lente come le formiche e difatti lo stile di Mulloy ÃƒÂ¨ crudo e minimalista, con personaggi scheletrici, puntuti ed unici elementi di contrasto con uno sfondo quasi sempre bianco. L'estetica di Mulloy ÃƒÂ¨ &quot;[...] consapevolmente ad una distanza di milioni d'anni luce dai buoni sentimenti e dalla nitidezza dei disegni animati convenzionali&quot; (Animation Now! - Taschen).\n\nTra i suoi lavori ricordiamo quello che l'ha portato sotto i riflettori, Cowboys, che analizza la cultura occidentale moderna maschilista e violenta, basata sulla conquista/oppressione del prossimo; la scala sociale del selvaggio Far West viene trasposta cosÃƒÂ¬ nel quadro produttivo/televisivo dell'era post-industriale, in cui non si ha piÃƒÂ¹ neanche una vera percezione di chi sia il carnefice ne' di quale sia il suo obiettivo. La pluripremiata serie televisiva di cortometraggi in 35mm The Ten Commandments riprende i precetti della tradizione ebraica e cristiana, e li reinterpreta per farne una visione del mondo e della vita; ma il dio che ha scritto i comandamenti di questi corti ÃƒÂ¨ concepito ad immagine e somiglianza del piÃƒÂ¹ vile degli uomini...\n\nIn effetti Mulloy riesce spesso nei suoi lavori ad unire religione, sesso e sopraffazione in un dissacrante capovolgimento delle strutture narrative, permeate da una satira cosÃƒÂ¬ invadente da indurre lo spettatore (leggasi: partecipante) a sobbalzare nel vedere queste sagome nere danzare sullo schermo (leggasi: specchio).\nDegno di nota ÃƒÂ¨ il pianeta Zog, ricorrente nei racconti dell'autore, che ÃƒÂ¨ un autentico parco giochi della metafora; gli zog, abitanti di tale pianeta, hanno infatti un pene o una vagina al posto della testa la quale si trova invece dove dovrebbero essere i genitali: ÃƒÂ¨ chiaro come queste &quot;teste di cazzo&quot; offrano un parallelismo un tantino scomodo con certi abitanti della Terra...\n\nI corti di Phil Mulloy contengono sesso, violenza, blasfemie... se non vi piace mettere in discussione la vostra condizione umana, statene alla larga. Se invece avete la curiositÃƒÂ  di sondare i fetidi meandri della societÃƒÂ  moderna (intendo gli ultimi 5000 anni almeno), questo DVD fa per voi; perÃƒÂ² mettete a letto i pargoli, prima winky.gif\nSe dovessi scegliere un aggettivo: &quot;oltraggioso&quot;.\n\n\nPremi e riconoscimenti:\n\n    * Kino Award - Melbourne 1991\n    * McLaren Award - 1993\n    * Critics Award - Zagreb 1993 1998\n    * Design Award - Mediawave 1993\n    * Special Award - Hiroshima 1996\n    * Special Award - Stuttgart 1996\n    * Life Achievement - Grenada 1996\n    * Jury Prize - Annecy 2000\n    * Best Animation - Mediawave 2000\n    * Best Short - Imago 2000\n    * Grand Prix - Tampere 2001\n    * Jury Prize - Castelli Animati Roma 2001\n    * City of Espinho Award - 2001\n\nLinki interessanti:\n\n    * sito personale: philmulloy.com\n    * voce su IMDB: nm0612465\n    * voce su Wikipedia: Phil_Mulloy\n\n\n\n~-~ DVD CONTENT ~-~\n\nThe films of a multi-award-winning animator Phil Mulloy are the antidote to all that is kitsch and sentimental in animation. Witty and acerbic fables, drawn in brush and ink, comment in human nature and contemporary values. Definitely not for the squeamish or prudish, these films contain sex, violence, and scenes calculated to outrage horses!\n\nThis definitive compilation contains 24 films, including the six films in the Cowboys series, all of the Ten Commandments, the outrageous The sound of Music, and the unmissable The Sexlife of a Chair.\n\nPublished by: BFI - the British Film Institute\nRelease date: 28/07/2009\nRun time: 153'\nDVD region: 1\nFormat: NTSC\nAspect ratio: 1.33:1\nColor: black&amp;white, color\nSuitable only for persons of 18 years old and over\n\nContent listing:\n\nCowboys (1991)\nSlim Pickin's - 3 mins\n&quot;That's Nothin'&quot; - 3 mins\nMurder! - 3 mins\nThe Conformist - 3 mins\nHigh Noon - 3 mins\nOutrage! - 3 mins\n\nThe History of the World (1994)\nThe Invention of Writing - 3 mins\nThe Discovery of Language - 3 mins\n\nThe Ten Commandments (1994 - 1996)\nNumber 1 Thou Shalt Not Adore False Gods - 5 mins\nNumber 2 Thou Shalt Not Commit Blasphemy - 5 mins\nNumber 3 Remember to Keep Holy the Sabbath Day - 7 mins\nNumber 4 Honour thy Father and thy Mother - 5 mins\nNumber 5 Thou Shalt Not Kill - 3 mins\nNumber 6 Thou Shalt Not Commit Adultery - 5 mins\nNumber 7 Thou Shalt Not Steal - 4 mins\nNumber 8 Thou Shalt Not Bear False Witness - 5 mins\nNumber 9 Thou Shalt Not Covet thy Neighbouts Goods - 5 mins\nNumber 10 Thou Shalt Not Covet thy Neighbours Wife - 9 mins\n\nIntolerance (2000 - 2001)\nIntolerance - 11 mins\nIntolerance II: The Invasion - 15 mins\n\nMore Films (1992 - 1998)\nThe Wind of Changes - 15 mins\nThe Chain - 12 mins\nThe Sexlife of a Chair - 7 mins\nThe Sound of Music - 11 mins\n\n\nThe films are grouped into sub-menus as listed above. Click on the group title to access each set of films. The films can then be played singly by highlighting the individual title or, by clicking &quot;Play All&quot;, the films in the group will run successively.\n\n\n~-~ TRAILERS AND COVER ~-~\n\nYou can also check these YouTube videos to get an idea about this stuff:\n\nThe DVD cover is available in printing resolution here: http://dproduzioni.com/extern/mulloy/cover_hires.jpg\n\n\n\nIF YOU LIKE IT, SEED THIS TORRENT AS LONG AS YOU CAN, PLEASE","torrent":{"xt":"urn:btih:a8d6e04fbb484ad411a5f4832788f6a1299dd600","amp;dn":"Phil+Mulloy+-+Extreme+Animation+%5BDVD9+ENG%5D+cartoon+%5BTNTVillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8d6e04fbb484ad411a5f4832788f6a1299dd600","infoHashBuffer":{"type":"Buffer","data":[168,214,224,79,187,72,74,212,17,165,244,131,39,136,246,161,41,157,214,0]},"announce":[],"urlList":[]}}