{"title":"Comedy - Patton Oswalt - Werewolves and Lollipops (2007 AVI)","uid":5171387,"size":367203905,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a8f6dc2e9d673fa76b8c77923e649e8f4ff44a47&amp;dn=Comedy+-+Patton+Oswalt+-+Werewolves+and+Lollipops+%282007+AVI%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1258708071,"description":"Patton Oswalt - Werewolves and Lollipops (2007 AVI format) \n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 782kbps \nDuration.............: 53:47.532\nResolution...........: 544*448 \nFramerate............: 23.976 \n\nAudio Data: \n\nAudio Codec..........: 0x0055 MPEG-1 Layer 3 \nAudio Bitrate........: 115 kbps VBR \nAudio Channels.......: 2 \n\nFile Data: \n\nFilename.............: Patton Oswalt - Werewolves and Lollipops (2007 AVI format).avi \nFilesize.............: 367,134,720 \n\nNO SUBTITLES\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1084002/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1084002/&lt;/a&gt;\n\nReview\tby David Jeffries\n\nTurn on any deep cable channel that runs three-year-old movies -- or old Kings of Queens episodes or Comedy Central Celebrity Roasts -- and you'll run into the leading doughboy of cynicism, Patton Oswalt. The numerous guest spots and character actor parts the man lands are all delivered with the utmost care, but to really appreciate Patton you have to experience his standup. Werewolves and Lollipops is a masterful, and most importantly, hilarious example of how this jaw-droppingly talented comedian can craft a set that doesn't underestimate its audience. With so much venom to spit -- and with all of George Carlin's &quot;Seven Dirty Words&quot; working overtime -- there's no point easing into the opening fast-food diatribe &quot;America Has Spoken.&quot; Oswalt doesn't bother with the usual, &quot;how's everybody doin' tonight?&quot; time waster. Instead, the routine mercilessly skewers a shameless fast-food industry where every fatty thing on the menu is offered in single mash, or as Oswalt puts it, &quot;a failure pile in a sadness bowl.&quot; \n\nThat the esoteric This Mortal Coil and their It'll End in Tears album gets mentioned among all this fried guilt is amazing and a nod to the in-the-know cult audience that has championed the comedian. Still, there's an approachable, self-deprecating side to his act that proudly declares &quot;I'm a nerd&quot; (&quot;At Midnight I Will Kill George Lucas with a Shovel&quot;) and while the Bush-bashing (&quot;Alternate Earth&quot;), small-town bashing (&quot;Sterling, Virginia&quot;), and religious bashing (&quot;I Tell a Story About Birth Control and Deal with a Retarded Heckler&quot;) has &quot;elitist&quot; written all over it, it tastes like sweet manna from heaven after the five-year reign of the Blue Collar Comedy crowd. There's no reason to make excuses when Oswalt is able to stream through this seemingly impossible jumble of topics effortlessly or instantly lay to waste the heckler that dares interrupt his flow. After so much &quot;stupid is as stupid does&quot; has flooded the standup market, it's good to feel uncompromisingly smart for a change, and even better when the material is honed to perfection. [Werewolves and Lollipops was also released with an excellent bonus DVD featuring most of the same material on the CD but from a show two months earlier. Being able to witness the act developing and reaching full potential is an extra that fans will find fascinating.] \n &lt;a href=&quot;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:knfyxzy5ld6e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:knfyxzy5ld6e&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a8f6dc2e9d673fa76b8c77923e649e8f4ff44a47","amp;dn":"Comedy+-+Patton+Oswalt+-+Werewolves+and+Lollipops+%282007+AVI%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8f6dc2e9d673fa76b8c77923e649e8f4ff44a47","infoHashBuffer":{"type":"Buffer","data":[168,246,220,46,157,103,63,167,107,140,119,146,62,100,158,143,79,244,74,71]},"announce":[],"urlList":[]}}