{"title":"Not Just a Game: Power, Politics, and American Sports","uid":6176607,"size":405885593,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a928cad902c1075e90cea8aa92406f2a43922211&amp;dn=Not+Just+a+Game%3A+Power%2C+Politics%2C+and+American+Sports&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"c4ll7","files":1,"time":1297791041,"description":"We've been told again and again that sports and politics don't mix, that games are just games and athletes should just &quot;shut up and play.&quot; But according to Nation magazine sports editor Dave Zirin, this notion is just flat-out wrong. In Not Just a Game, the powerful new documentary based on his bestselling book The People's History of Sports in the United States, Zirin argues that far from providing merely escapist entertainment, American sports have long been at the center of some of the major political debates and struggles of our time. In a fascinating tour of the good, the bad, and the ugly of American sports culture, Zirin first traces how American sports have glamorized militarism and racism then excavates a largely forgotten history of rebel athletes who stood up to power and fought for social justice beyond the field of play. The result is as deeply moving as it is exhilarating: nothing less than an alternative history of political struggle in the United States as seen through the games its people have played.","torrent":{"xt":"urn:btih:a928cad902c1075e90cea8aa92406f2a43922211","amp;dn":"Not+Just+a+Game%3A+Power%2C+Politics%2C+and+American+Sports","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a928cad902c1075e90cea8aa92406f2a43922211","infoHashBuffer":{"type":"Buffer","data":[169,40,202,217,2,193,7,94,144,206,168,170,146,64,111,42,67,146,34,17]},"announce":[],"urlList":[]}}