{"title":"[DC] Cosmic Smash [NTSC-J] [SB] [CDI]","uid":5104954,"size":64620937,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:a990f7bc47aa6134bd9de07adcecdabe26324980&amp;dn=%5BDC%5D+Cosmic+Smash+%5BNTSC-J%5D+%5BSB%5D+%5BCDI%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1254298049,"description":"Cosmic Smash for the Sega Dreamcast                               Rel. 09/13/2001\n\n\nFormat:\t       CD-R NTSC-J\nLang.:\t       English\nDiscs:          1\nImage:          CDI\nGener.:         Sports\nSelfboot:       Yes\nOrigin:         Japan-Import DC Game\nRequirements:   Dreamcast Console, or DC Emulator.\n\n\nCompressed with WinRar, Game was tested and works. \nTry 7Zip its free google it, if you don't have WinRar.\n\nYes the size is so small but so is the game nothing to worry about.\n\n\nRelease Notes: Cosmic Smash is a japan game but the great thing about it is its in\n               English. It is selfboot on a standard CD-R. Read below for info on\n               type of media you should use &amp; how you should burn. All's thats\n               needed is a Cd-r and a dreamcast console or you can try a DC \n               emulator. Game was tested on a regular dc console (made in 1999) \n               and ran fine.\n             \n     \nImportant: Some later versions of Sega dreamcast consoles supposedly won't allow\n           utopia or copies of games, not sure if this is true but to be on the \n           safe side try to use a console manufactured before october 2000. You\n           can find the manfacture date on the bottom of the console the sticker \n           is in fine print just look for it. Of course the only way to know is to\n           just try it on your dreamcast.\n\n\n\nGame Description:\n\nCosmic Smash for Dreamcast is a port of the Sega Rosso arcade game. It is a futuristic sports game, a mix of squash and Breakout.\n\nThe player controls a semi-transparent human male in third-person view. The goal is to clear each level from a set of different blocks at the far end of the room within a given time limit. Additional time is given at the start of the next level depending on how well the player did. To clear the room, the player has to hit a ball with a racket at the correct angle. The ball bounces back from the blocks and walls. The blocks have different properties, for example, some have to be hit multiple times before they disappear, while others move around thus making them harder to hit.\n\nBesides the regular shot, the player can also perform a trick shot, which in combination with other moves gives extra points when successfully executed. At the end of each level, a map with branching paths is displayed, enabling the player to take different routes towards the end of the game.\n\n\nGame Pics included.\n\n\nBurn with Alcohol 120% or Discjuggler (Both included in download).\n\nIn Options enable overburn disc in Alcohol or DiscJuggler. (Do for all DC games)\n\nSet Write Method To Raw/Dao and burn at 4x Speed for Alcohol 120%.\n\n\nIf you wanna burn using DiscJuggler Set Burn settings to Raw Write Mode 2 2352 \nCD-DA or Mode 1 2048 Raw Write and burn at 4x Speed.\n\n\nUse Verbatim or Tayio Yuden CD-R Media for best quality, or if other media isn't working.\n\n(No CD-RW will not work only CD-R's).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:a990f7bc47aa6134bd9de07adcecdabe26324980","amp;dn":"%5BDC%5D+Cosmic+Smash+%5BNTSC-J%5D+%5BSB%5D+%5BCDI%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a990f7bc47aa6134bd9de07adcecdabe26324980","infoHashBuffer":{"type":"Buffer","data":[169,144,247,188,71,170,97,52,189,157,224,122,220,236,218,190,38,50,73,128]},"announce":[],"urlList":[]}}