{"title":"Little Steven - Freedom No Compromise  [1987]  [Robbie60] [FLAC]","uid":6176917,"size":301320719,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a9cdf4136ff09b32587445d8e0642c52e4645892&amp;dn=Little+Steven+-+Freedom+No+Compromise++%5B1987%5D++%5BRobbie60%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robbie6ty","files":-1,"time":1297801983,"description":"Little Steven\nFreedom No Compromise\n\n\n\nLabel: Manhattan Records\nReleased: 1987\nSource: Original CD \nSize Torrent: 286 MB\nFormat: FLAC\n\n\n\n\n\nSurrounding himself with a sensational cast of studio pros including drummer Steve Jordan, bass players TM Stevens/Doug Wimbish (who would later join the ranks of Living Colour), and keyboard guru Bernie Worrell, in 1987, Little Steven would release Freedom No Compromise, the E-Street-er's third solo record to date. \n\nWhen the album first came out the US press were savage in their condemnation of the man and his songs. Well, they do take a huge swipe at the immorality of modern capitalism and its politics, so no easy listening &quot;America is always right&quot;- songs .Where Mr Springsteen concentrates on the human politics of the ordinary American, Little Steven takes a more global approach. Maybe there is some crudity in the result but at least the attempt is being made. A very noble effort and such a radical difference to &quot;Men without women&quot;.\n\nAlthough, certainly not as accomplished as Steven's sensational debut &quot;Men Without Women&quot;, the album features some very good material. With a heavy political agenda in toe, &quot;Freedom&quot; opens the record. &quot;Freedom&quot; is quickly followed by the riveting &quot;Trail of Broken Tears&quot;. Little Steven's weathered voice is in full on Bob Dylan-meets-Keith Richards mode as he pronounces that &quot;there ain't no love here, love's been sacrificed, promises buried beneath, the trail of broken tears.&quot; The Latin-flavored &quot;Pretoria&quot; runs side by side with the album's best track, &quot;Bitter Fruit&quot; (a duet with Ruben Blades. And although the track sounds like one big party, upon closer inspection, it's clear that the song is a solemn condemnation on the state of intrusive U.S. anti-communism Reaganomics in Latin America. Surprisingly, in Europe, the track proved to be a massive hit for Little Steven. Coupled with the success of another one of Freedom No Compromise's tracks, &quot;No More Partys,&quot; the E-Street sideman would return to the old continent as an arena sensation in his own right. Another track worth noting is &quot;Native American,&quot; a collaboration with Bruce Springsteen. Freedom No Compromise comes to an end with &quot;Sanctuary&quot; (a not so distant cousin of &quot;Bitter Fruit&quot;). Overall, a good effort, sometimes a great one. For another taste of the artist, spend some quality time with the album &quot;Men Without Women&quot;. \n\n\n\n\nPersonnel\n\nSteve Van Zandt - Guitar, dulcimer\nSteve Jordan, David Beal, Keith LeBlanc - drums\nRomeo Williams, Doug Wimbish, T.M. Stevens - bass\nBernie Worrell, Paul Shaffer, Greg Phillinganes, Tommy Mandel, Richard Scher - keyboards.\nRubÃƒÂ©n Blades, David Beal, Monti Louis Ellison - percussion\nHilario Soto - Toyo\nZoe Yanakis - Bass Flute\nKenny Moore, Cobra Jones, Will Downing, Craig Derry, Wendell Morrison, Floyd Westerman, Tina B., Audrey Wheeler, Brenda White-King, Steve Jordan, Oren Waters, Julia Waters, Luther Waters, Maxine Waters, Debra Byrd, Elicia Wright, Benjamin Newberry, Sechaba Cultural Singers, Zola Dube, Tshepo Tsotetsi, Moeketsi Bodibe, Tnemba Ntinga, Mweli Mzizi, South African Students Committee of UCLA, Abner Mariri, Mendiswa Mzamne, Ronald Kunene, Kindiza Ngubeni, Nonhlanhla Simelane, Motlole Moseki - background vocals\n\n\n\nTrack Listing\n\n1.Freedom\n2.Trail Of Broken Treaties\n3.Pretoria\n4.Bitter Fruit\n5.No More Party's\n6.Can't You Feel The Fire\n7.Native American\n8.Sanctuary\n","torrent":{"xt":"urn:btih:a9cdf4136ff09b32587445d8e0642c52e4645892","amp;dn":"Little+Steven+-+Freedom+No+Compromise++%5B1987%5D++%5BRobbie60%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9cdf4136ff09b32587445d8e0642c52e4645892","infoHashBuffer":{"type":"Buffer","data":[169,205,244,19,111,240,155,50,88,116,69,216,224,100,44,82,228,100,88,146]},"announce":[],"urlList":[]}}