{"title":"Knockout Kings 2001 [CD-R] [NTSC], PS2","uid":5038980,"size":604466095,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:aaa8dea2029dc3e63258f6162191e5069ee09451&amp;dn=Knockout+Kings+2001+%5BCD-R%5D+%5BNTSC%5D%2C+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1249276996,"description":"Knockout Kings 2001 for PS2                                     Rel. 2/13/2001\n\n\nFormat:\t       CD-R NTSC-USA\nLang.:\t       English\nDiscs:         1\nImage:         MDS/MDF \nRequirements:  Modded/Chipped Ps2, or Swap Magic Disc Method.\n\nCompressed with WinRar, Game was tested and works (tested on a chipped ps2).\n\nIf you don't have winrar you can use 7-zip to extract rar formats, \n7-zip is free google it.           \n\n\n\nNote: This is a CD-R or Compact Disc Type PS2 game, so you'll have to use cd-r  \n      media only to burn with. (Verbatim recommended).\n\n \n\n\nGame Description:\n\nEA SPORTS puts you up against the greats of boxing and doesn't pull any punches. Take on legendary boxers or spar against the stars of today. Whether you're fighting your way up the rankings for a title bout, building the ultimate boxer with Create-A-Boxer, or duking as or against an all-time legend in Fantasy Fights Mode, Knockout Kings 2001 puts you in the game.\n\nWith awesome Playstation 2 console graphics and gameplay, a killer new soundtrack, the top female boxers, and much more, Knockout Kings 2001 goes the distance.\n\nFeatures:\n\nUltra-Realistic Boxers - Mo-capped moves and amazing graphics put you in the ring\n                         like never before.\n\nFemale Boxers - The top female boxers, including Mia St. John, Lucia Rijker, and \n                Christie Martin, battle to prove who is the best.\n\nDeeper Interactive Training - Work with your trainer to hone your skills.\n\nMore Fighting Styles - In addition to improved Boxer and Slugger styles. EA SPORTS\n                       has motion-captured Ali's unique &quot;Freestyle&quot; fighting\n                       method. Each style has its own puches, movement, defense,\n                       and combinations. Find the style that suits you.\n\nEnhanced Gameplay - Pick your shots with &quot;haymaker&quot; punches and go for the \n                    knockout.\n\nAdded Boxing Realism - Exciting commentary and analysis from boxing experts Max  \n                       Kellerman, Al Bernstein, and Teddy Atlas. Referees Mills\n                       Lane and Richard Steele call the big fights, and Jimmy\n                       Lennon, Jr. is the ring announcer.\n\n\n\n\nGame Pics included.\n\n\nBurn with Alcohol 120%, (Included in download).  \n\nSet datatype to Playstation 2 and Burn at 8x speed.\n\nUse Verbatim Or use Tayio Yuden CD Media for best quality.\n\nUsing any other media might not work at all.\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:aaa8dea2029dc3e63258f6162191e5069ee09451","amp;dn":"Knockout+Kings+2001+%5BCD-R%5D+%5BNTSC%5D%2C+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaa8dea2029dc3e63258f6162191e5069ee09451","infoHashBuffer":{"type":"Buffer","data":[170,168,222,162,2,157,195,230,50,88,246,22,33,145,229,6,158,224,148,81]},"announce":[],"urlList":[]}}