{"title":"Stieber-Chancellor's Spy(Bismarck's Secret Service Chief M","uid":5019477,"size":938298,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab1503bd665fa77ba1d6ea7f0b0c6ba5c06de3fb&amp;dn=Stieber-Chancellor%5C%27s+Spy%28Bismarck%5C%27s+Secret+Service+Chief+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1248385078,"description":"This is Wilhelm Stieber's mindblowing book The Chancellor's Spy - The Revelations of the Chief of Bismarck's Secret Service (1980) which is the memoirs of Wilhelm Stieber, former chief of the 19th century Berlin Police and later a trusted member of Count von Bismarck's inner circle. Stieber was born as the son of a Lutheran minister in the German Kingdom of Saxony. He defied his parents in order to persue a career in the legal profession. However, he was sidetracked and became a police officer instead. In his role first as an inspector and later as the Chief of the Berlin Police, Stieber takes us deep into the sordid underbelly of 19th century Berlin, a world were respectable aristocrats indulged in the darkest depths of depravity, and where crimes that embarrassed the King of Prussia or his family were to be covered up, not prosecuted. There is also a tale of how he bluffed his way into the London household of Karl Marx and stole the membership lists of the World Communist League. The book really gets interesting when Stieber enters into the inner circle of Prussian Chancellor Count Otto von Bismarck, a man whom would have made Henry Kissinger look like an amateur. It is all in here: peacetime espionage, slush funds, bribes to foreign heads of state, and dirty tricks campaigns that make the Cold War pale by comparison. According to Stieber, he was still receiving reports from his spies in the French Army while the battle of Sedan raged around him. The Chancellor's Spy is the autobiographical memoir of the man who can rightfully be considered the founding father of all modern espionage, secret service, and intelligence agencies. The tactics and principles he established, indeed invented, still form the basic operating procedure of everything from Scotland Yard and the FBI through and including the CIA and the KGB. This book is a rarity: as thrilling as the best spy novels and at the same time an historical source of true significance. As the man who organized and controlled Bismarck's intelligence network, Stieber paints a fascinating picture of a tumultuous epoch. 215 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:ab1503bd665fa77ba1d6ea7f0b0c6ba5c06de3fb","amp;dn":"Stieber-Chancellor%5C%27s+Spy%28Bismarck%5C%27s+Secret+Service+Chief+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab1503bd665fa77ba1d6ea7f0b0c6ba5c06de3fb","infoHashBuffer":{"type":"Buffer","data":[171,21,3,189,102,95,167,123,161,214,234,127,11,12,107,165,192,109,227,251]},"announce":[],"urlList":[]}}