{"title":"Harmon-Masonic Lodge-Study Outline(systematic expose of masonry)","uid":5094763,"size":1115357,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab714189ecef0c00771bc946fbb607dcd96fd7b1&amp;dn=Harmon-Masonic+Lodge-Study+Outline%28systematic+expose+of+masonry%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1253459815,"description":"This is Steve Harmon's amazing booklet The Masonic Lodge - A Study Outline (1991) which systematically exposes freemasonry as an organized religion and shows in plain sight that Christianity and the Masonic lodge are not compatible with each other. The claim of the Mason to the outside world is that Masonry and Christianity are totally compatible and yet they are not. Masonry claims that they are not a religion, but a fraternity to make better men in a better world yet they are involved in major wars and catastrophes. This study is to determine if the Masonic Lodge and Christianity are indeed compatible, and if Masonry is a religion. The Mason is instructed to study the order or he will hinder the order. The ignorant Freemason is a drone and an encumbrance in the Order. He who does not study the nature, the design, the history, and character of the Institution, but from the hour of his initiation neither gives nor received any ideas that could not be shared by a profane, is of no more advantage to Masonry than Masonry is to him. The true Mason seeks Light that darkness may be dispelled, and knowledge that ignorance may be removed. The ignorant aspirant, no matter how loudly he may have asked for Light, is still a blind groper in the dark. The author uses only authoritative Masonic publications to show how the system of degrees leaves the majority of brothers in complete darkness on what the lodge is all about. 40 pages, some pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:ab714189ecef0c00771bc946fbb607dcd96fd7b1","amp;dn":"Harmon-Masonic+Lodge-Study+Outline%28systematic+expose+of+masonry%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab714189ecef0c00771bc946fbb607dcd96fd7b1","infoHashBuffer":{"type":"Buffer","data":[171,113,65,137,236,239,12,0,119,27,201,70,251,182,7,220,217,111,215,177]},"announce":[],"urlList":[]}}