{"title":"Parliament - The Clones Of Dr. Funkenstein .flac files","uid":6311140,"size":252045725,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:abee315a48da58c44372d950de834302ed998b8c&amp;dn=Parliament+-+The+Clones+Of+Dr.+Funkenstein+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ulikes","files":14,"time":1302539861,"description":"After MOTHERSHIP CONNECTION, these guys couldn't be stopped. The Outer space theme really struck a chord with the public, and they tried to duplicate that success here with CLONES OF DR. FUNKENSTEIN. It is a creative concept, having Dr. Funkenstein be the mentor of Starchild and producing a bunch of clones to spread the funk, but this album lacks in some areas. This really was George's attempt to be more commercial, and it is not bad at all. But the reason why this lp is not as well known as MOTHERSHIP or FUNKENTELECHY is because it wasn't as original on the musical end. MOTHERSHIP invented the P. Funk concept, and FUNKENTELECHY showcased the bass synth and straight musical nastiness. CLONES wasn't a trailblazer, but it is still killer funk. The Prelude sets the stage for the album and &quot;Gamin on Ya&quot; gives the Horny Horns a full work-out. &quot;Dr. Funkenstein&quot; is good, but is a prime example of the commercial factor. &quot;Children of Productions&quot; is a great track with a nice horn section along with a pounding bassline, probably by Bootsy. &quot;Gettin to Know You&quot; is the gem of this lp. This is my favorite song off the album with Garry Shider's vocals going along nicely with another great horn riff and bass. &quot;Do That Stuff&quot; is a good song, with the most commercial appeal of the whole album. It has the same rythm as Funkadelic's &quot;You Can't Miss What You Don't Measure&quot; off of the album COSMIC SLOP. &quot;Everything is on the One&quot; is a nice track, but is probably the weakest on the whole album. &quot;Ive Been Watchin You...&quot; has some great vocals by Glen Goins, who would tragically pass away about a year after this album was released. He is one of the best singers I have ever heard and should be better known, just like the rest of the P. Funk staff should be. The final track, &quot;Funkin for Fun&quot; is exactly that. It is real funk that is fun and is similar to some of Parliament's earlier jams. Glen once again comes through with a great vocal performance. (These last two songs would be not nearly as good if it weren't for Glen) This album is, overall, good, but it suffers from the fact that it is basically a sequel to MOTHERSHIP. The album name was actually supposed to be MOTHERSHIP II until George decided that it would be better to be a little more creative. \n\nTrack list:\n1. Prelude\t1:40\n2. Gamin' On Ya\t3:01\n3. Dr. Funkenstein\t5:46\n4. Children Of Productions\t3:57\n5. Getten' To Know You\t5:18\n6. Do That Stuff\t4:48\n7. Everything Is On The One\t3:47\n8. I've Been Watching You (Move Your Sexy Body)\t6:00\n9. Funkin' For Fun\n\nEnjoy and please seed!!!!","torrent":{"xt":"urn:btih:abee315a48da58c44372d950de834302ed998b8c","amp;dn":"Parliament+-+The+Clones+Of+Dr.+Funkenstein+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abee315a48da58c44372d950de834302ed998b8c","infoHashBuffer":{"type":"Buffer","data":[171,238,49,90,72,218,88,196,67,114,217,80,222,131,67,2,237,153,139,140]},"announce":[],"urlList":[]}}