{"title":"Bible Stories for Children #2 - MP3 version","uid":6137513,"size":756830251,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ac33b1b2cd2fcea2f4208b31b4bd4537ada57b1b&amp;dn=Bible+Stories+for+Children+%232+-+MP3+version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ruthchiun","files":25,"time":1296364347,"description":"Bible Stories (Dramatized) for children.  To purchase the tapes or CDs, please visit the following website: &lt;a href=&quot; http://yourstoryhour.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://yourstoryhour.org/&lt;/a&gt;\n\nThis is the MP3 format.\n\nThis is the second in the series which contain the following stories:\n\n\nB13-1 Dangers in the Desert.  Israelites face dangers and challenges in the wilderness.\nB13-2 The Ten Commandments.  God gives the Isralites the 10 Commandments and Moses goes up Mount Sinai.\nB14-1 Miriam the Great.  Moses\\'s sister, Miriam, becomes jealous.\nB14-2 The Man of Patience.  Moses not allowed to go into the promised land.\nB15-1 The Unfaithful Prophet (Part 1).  Balaam employeed to curse Israel.\nB15-2 The Unfaithful Prophet (Part 2).  Baalam\\'s plans to curse Israel are defeated.\nB16-1 The Thief Who Defeated an Army.  Joshua and the Israelites defeat Jericho, but the next battle is lost because Achan took items from Jericho, against God\\'s command.\nB16-2 The Longest Day in History.  The day the sun stood still.\nB17-1 Conquering Canaan.  Joshua\\'s leadership in establishing Israel. \nB17-2 Mighty Gideon.  Gideon defeats the Midianites.\nB18-1 The Champion of Champions.  The life of Samson.\nB18-2 The Story of Ruth.  The story of the faithful daughter-in-law, Ruth.\nB19-1 The Wayward Sons.  Eli\\'s wicked sons.\nB19-2 The Youngest Priest.  Samuel\\'s ministry as a child.\nB20-1 The Two Battles of Aphek.  The ark of the conveant is captured.\nB20-2 The Tall, Strong, Handsome, Young Man.  Saul is chosen to be the first king of Israel.\nB21-1 King Saul Saves a City.  Saul battles the Ammonites.\nB21-2 The Crown Prince on a Secret Mission.  Prince Jonathan and his armor bearer attack the Philistines.  Saul disobeys God\\'s commands and Samuel tells him his kingdom will taken away and given to a neighbor.  God sends Samuel to annoint David.\nB22-1 The Boy and the Giant.  The story of David and Goliath.\nB22-2 The Deadly Plot.  Saul begins to plot David\\'s death.  David and Jonathan become friends.\nB23-1 The Sword of Goliath.  David asks Ahimelech for Goliath\\'s sword.\nB23-2 David Escapes.  David escapes for his life from Saul.\nB24-1 King Saul and a Cave.  David spares Saul\\'s life when he has a chance to kill him.\nB24-2 A Wicked Rich Man.  The story of Abigail, David and Nabal.\n","torrent":{"xt":"urn:btih:ac33b1b2cd2fcea2f4208b31b4bd4537ada57b1b","amp;dn":"Bible+Stories+for+Children+%232+-+MP3+version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac33b1b2cd2fcea2f4208b31b4bd4537ada57b1b","infoHashBuffer":{"type":"Buffer","data":[172,51,177,178,205,47,206,162,244,32,139,49,180,189,69,55,173,165,123,27]},"announce":[],"urlList":[]}}