{"title":"Lazaro Valdes - De tal palo... tal Valdes [FLAC] TQMP","uid":6238555,"size":316680014,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ac6281d0417bd7417313cff47b13dbfb30291d71&amp;dn=Lazaro+Valdes+-+De+tal+palo...+tal+Valdes+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pastafari","files":-1,"time":1299965655,"description":"Lazaro Valdes - De tal palo... tal Valdes\n2004\n\nCuban Music Series. Jazz fusion.\n\nBrought to you by TQMP\nThe Quality Music Project\n\nLeader and pianist Lazaro Valdes Moises Rodriguez was born on February 6, 1965. He comes from a family of musicians, such as his father Lazaro Valdes, director of Son Jazz, nephew of Oscar Valdes (*), director of the modern jazz group Diakara, grandson of Oscar Valdes, an also famous Cuban percussionist, and nephew of Vicentico Valdes, a prominent Cuban soloist. He began his professional career at 16 and proceeded to tour extensively with Pachito Alonso as a keyboardist and percussionist. With this group he visited Chile, Venezuela, Italy, Spain, Switzerland and France.In February 1995 he decided to establish Bamboleo, with the aim of entering into various genres such as salsa, folkloric afro-cuban music, Latin jazz, boleros and ballads. That same year the group receives the nomination for 'Revelation Orchestra' in the annual program 'My Salsa' as well as great acceptance in the island's top music clubs and festivals. Bamboleo, which is the group that brought together all of Lazarito's musical wants and ideas, quickly rose in popularity both nationally and internationally, highlighted by their extensive touring schedule in the U.S.A., Japan, China, Panama, and throughout Europe. Their third record, &quot;Ya no hace falta&quot; has become one of the most popular Cuban music albums of the all time.\n-- timba.com\n\n(*) Much better known as lead singer and founder of Irakere.\n\n* * * * * * * * * * * * * * * * * * *\n\nEditor's Pick:\nExplosive powerhose and highly percussive Latin jazz led by young vituoso pianist Lazaro Valdes of the Cuban Valdes dynasty. This one, Latin jazz fans, is a monster roller coaster that should not be missed. On &quot;Carcases a Bobby,&quot; one of the best tracks, bassist Osmany Diaz Gil and drummer Rodney Barreto have redefined their instruments.\nHighly recommended. (BP 09/09/03)\n\nWhat a cool record. Valdes, the pianist, leader and arranger for Bamboleo, has put out a Cuban fusion record, overlaid with smooth jazz that has moments of raw power. It's as if Valdes decided he liked the early electric music of Miles Davis and decided to order it a bit, and make it Cuban. And when he solos, he mashes the harmony, getting into bitter chromaticism, and the rhythms start flying, and what was smooth jazz all of a sudden gets serious. It's intense, and sometimes maudlin, but at it's best it's new (some tracks have two bassists), and you can't help wondering what Valdes would record if he had a decent career and didn't have to try and make money. This isn't for purists looking for an old Cuba; it's modern, influenced by the good and bad of American music. But the level of the musicianship is shocking (the musicians include Bamboleo's fantastic bassist and percussionist), and Valdes, who comes from a family of musicians that includes Alfredito, Marcelino and Vicentico, can be proud of what he's done.\nHighly recommended. (Peter Watrous, 2003-09-23)\n-- descarga.com\n\n* * * * * * * * * * * * * * * * * * *\n\nPersonnel --\nLazaro Valdes, piano &amp; keyboards\nOsmany Diaz Gil, bass\nRafael Paseiro, bass\nRodney Barreto, drums\nDuniesky Barreto, congas\nRay Olivera, trumpet\nMairel Rojas, trumpet\nCarlos Valdes, tenor sax\nAbel Fernandez Arana, alto sax\n\n* * * * * * * * * * * * * * * * * * *\n\nThe album title &quot;De tal palo... tal Valdes&quot; is a reference to the Cuban saying &quot;De tal palo, tal astilla&quot;, literally &quot;like stick, like splinter&quot;, meaning &quot;like father, like son&quot;, since Valdes comes from a family of musicians.\n\n* * * * * * * * * * * * * * * * * * *\n\nTrack List\n01- Cumbanchero\n02- De paso por Berlin\n03- Carcases a Bobby\n04- Balada para Yanet\n05- De mi campo a tu country (Zapateo por derecho)\n06- Piano para papa\n07- Aluya\n08- Mambo influenciado\n09- De tal palo ... tal  Valdes\n\nArtwork, EAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafariCubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:ac6281d0417bd7417313cff47b13dbfb30291d71","amp;dn":"Lazaro+Valdes+-+De+tal+palo...+tal+Valdes+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac6281d0417bd7417313cff47b13dbfb30291d71","infoHashBuffer":{"type":"Buffer","data":[172,98,129,208,65,123,215,65,115,19,207,244,123,19,219,251,48,41,29,113]},"announce":[],"urlList":[]}}