{"title":"Leverage.S03.Full.3pp0.NL","uid":6145751,"size":5391387907,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ac727bca46c2f02951fb6a2fa67702e53fba0d02&amp;dn=Leverage.S03.Full.3pp0.NL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Eppo","files":19,"time":1296667501,"description":"Leverage Season 3 full with hardburned dutch subs.\n\nSeason 3, Episode 1: The Jailhouse Job\nAs the team works to free Nate from jail, he must take on a corrupt warden and free an innocent man.\n\t\nSeason 3, Episode 2: The Reunion Job\nTo uncover a password, the team infiltrates the high school reunion of an amoral software magnate who's the IT department for the Axis of Evil.\n\t\nSeason 3, Episode 3: The Inside Job\nWhen Parker is trapped in an unknown location while working a theft for her mentor, the LEVERAGE team must race the clock to find her and free her.\n\t\nSeason 3, Episode 4: The Scheherazade Job\nTo rob an African kleptocrat's Boston vault, the LEVERAGE team has to time their heist to a symphony concert nearby, where amateur violinist Hardison must play a solo for a sell-out crowd.\n\t\nSeason 3, Episode 5: The Double Blind Job\nNate and the team runs a con against a corrupt CEO of a pharmaceuticals company who is marketing a product which could kill thousands.\n\t\nSeason 3, Episode 6: The Studio Job\nWhen Eliot poses as a country music singer to help run a con against a corrupt recording studio executive, things get complicated when he becomes a bona fide star.\n\t\nSeason 3, Episode 7: The Gone Fishin' Job\nThe team takes on a debt collector scamming innocent taxpayers, not knowing he is backed by a private militia.\n\t\nSeason 3, Episode 8: The Boost Job\nNate and the team infiltrate a crew of top-flight car thieves to bring down a greedy car dealer.\n\t\nSeason 3, Episode 9: The Three-Card Monte Job\nAn old enemy complicates matters for Nate and his crew as they try to help several small-time business people who were conned into committing crimes.\n\t\nSeason 3, Episode 10: The Underground Job\nNate and the team investigate a fatal explosion in a coal mine and uncover far more than the negligent practices they suspected.\n\t\nSeason 3, Episode 11: The Rashomon Job\nEach member of the team recalls the story of an artifact all of them tried to steal on the same night five years ago.\n\t\nSeason 3, Episode 12: The King George Job\nPieces of Sophie's past complicate a job in London where the team tries to expose an unscrupulous antiques trafficker who is using children as slave labor.\n\t\nSeason 3, Episode 13: The Morning After Job\nA con against a dirty financier could be the key to the team finding Damien Moreau.\n\t\nSeason 3, Episode 14: The Ho Ho Ho Job\nThe team runs into trouble while recovering Christmas gifts for a charity when an old enemy returns.\n\t\nSeason 3, Episode 15: The Big Bang Job\nThe team infiltrates a Department of Defense research lab in order to stop Damien Moreau, the villain they have been working to catch all season, from murdering a brilliant engineer and auctioning her work off to international terrorists.\n\t\nSeason 3, Episode 16: The San Lorenzo Job\nThe team follows Moreau to San Lorenzo only to find that Moreau is the chief advisor to the current President. In order to take Moreau down, the team must first take over the country.\n\nTorrent by 3pp0 | subs by Oxygen from www.bierdopje.com thx :)","torrent":{"xt":"urn:btih:ac727bca46c2f02951fb6a2fa67702e53fba0d02","amp;dn":"Leverage.S03.Full.3pp0.NL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac727bca46c2f02951fb6a2fa67702e53fba0d02","infoHashBuffer":{"type":"Buffer","data":[172,114,123,202,70,194,240,41,81,251,106,47,166,119,2,229,63,186,13,2]},"announce":[],"urlList":[]}}