{"title":"Frederick Forsyth - The Day of the Jackal  (Unabridged)","uid":5048622,"size":471295139,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:acd2a4ba3bbed2a08313ffc386cd3ef120f1564b&amp;dn=Frederick+Forsyth+-+The+Day+of+the+Jackal++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sheila6","files":2,"time":1249772511,"description":"Audio Books : Adventure : AAC : English\n\n\nFile Type: M4B with 96KBPS.\n\n\n\nBrief information about the master-piece:\n\nThe Day of the Jackal (1971) is a thriller novel by English writer Frederick Forsyth, about a professional assassin who is contracted by the OAS French terrorist group of the early 1960s, to kill Charles de Gaulle, the President of France.\n\nThe Day of the Jackal is a novel of the spy fiction genre, praised for its convincing portrayal of France in 1963, and its carefully thought-out plot. It received admiring reviews and praise when first published in 1971, and it received a 1972 Best Novel Edgar Award from the Mystery Writers of America. It also is notable for remarkably effective suspense, considering that the Jackal's target, president Charles de Gaulle, is a real historical figure who was not assassinated, and for its realism, exploring in detail aspects of intelligence, covert operations, and firearms.\n\nWhile the OAS did exist as described in the novel, and the film opens with a remarkably accurate re-enactment of the Jean-Marie Bastien-Thiry-led attempt on President De Gaulle's life, the remaining plot is fiction.\n\nThe story follows the efforts of an efficient, relentless assassin (hired by an exiled OAS high command) as he prepares to assassinate De Gaulle, and the efforts of an equally professional, but hard-pressed French detective assigned to identify and stop him, along with elements of intrigue and bureaucratic maneuvering at the highest levels of the French government.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:acd2a4ba3bbed2a08313ffc386cd3ef120f1564b","amp;dn":"Frederick+Forsyth+-+The+Day+of+the+Jackal++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acd2a4ba3bbed2a08313ffc386cd3ef120f1564b","infoHashBuffer":{"type":"Buffer","data":[172,210,164,186,59,190,210,160,131,19,255,195,134,205,62,241,32,241,86,75]},"announce":[],"urlList":[]}}