{"title":"The Dingoes - The Dingoes (1974)","uid":6193035,"size":77134527,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ad09da828b91b375665d19c96becf8a1c27c02c0&amp;dn=The+Dingoes+-+The+Dingoes+%281974%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"piratetorrent1989","files":10,"time":1298360604,"description":"The Dingoes are an Australian country rock band initially active from 1973 to 1979, formed in Melbourne they relocated to the United States from 1976. Most stable line-up was John Bois on bass guitar, John Lee on drums, Broderick Smith on vocals and harmonica, Chris Stockley on guitar and Kerryn Tolhurst on guitar. Mal Logan on keyboards joined after Stockley was hospitalised when shot in the stomach by Melbourne drug-dealer, Dennis Allen, who was attempting to gate crash a party. The Dingoes debut single, &quot;Way Out West&quot;, was released in November 1973, which peaked in the top 40 of the Australian Kent Music Report singles chart. Subsequent singles were &quot;Boy on the Run&quot;, &quot;Smooth Sailing&quot; and &quot;Into the Night&quot;, which did not reach the top 50. They had three top 40 albums, The Dingoes in 1974, Fives Times the Sun in 1977 and Orphans of the Storm in 1979.\n\nOn 27 August 2009, The Dingoes were inducted into the Australian Recording Industry Association (ARIA) Hall of Fame alongside Kev Carmody, Little Pattie, Mental As Anything and John Paul Young. The Dingoes reformed in late 2009 and released a new album, Tracks in 2010 which was followed by a tour of Australia.","torrent":{"xt":"urn:btih:ad09da828b91b375665d19c96becf8a1c27c02c0","amp;dn":"The+Dingoes+-+The+Dingoes+%281974%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad09da828b91b375665d19c96becf8a1c27c02c0","infoHashBuffer":{"type":"Buffer","data":[173,9,218,130,139,145,179,117,102,93,25,201,107,236,248,161,194,124,2,192]},"announce":[],"urlList":[]}}