{"title":"WinUtilities 9.0 Full version(trees)","uid":5103482,"size":10661657,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ad358187eb91e6d6d14268d748e31fa233cbfd1f&amp;dn=WinUtilities+9.0+Full+version%28trees%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ProDvDRipper","files":2,"time":1254177687,"description":"WinUtilities is a system tweaking suite that includes more than 20 tools to improve and tweak your PC's performance. It offers an attractive and easy to use interface that organizes all tasks into categories and provides graphical statistics whenever possible.The tools include Junk File Cleaner, Registry Cleaner, Memory Optimizer, System Information, Registry Backup, File Encryption, Safe Uninstaller, Duplicate File Finder, File Shredder and much more. WinUtilities also includes an Internet Tracks Eraser with Cookie Manager and Secure Deletion. Overall, a great bundle that offers a wide range of system tools with extra benefits which are not easy to find.\n\nFeatures:\n* Recovering deleted files on FAT and NTFS partitions\n* Disk Cleanup of unneeded and junk files that slow the performance of your PC\n* Scan Windows Registry for the presence of napravilnyh or outdated\n* List management program in the Windows autorun\n* The destruction of all traces of your activity on your computer\n* Cutting files of any type into several small parts and their connection to a single file\n* Complete destruction of confidential files permanently\n* Protect any executable EXE file password\n* Optimization of computer memory\n* Find and remove duplicate files to increase free space\n* Find and delete incorrect shortcuts\n* Ability to test PC performance and management running processes\n* Office installed programs on your computer and remove them safely\n* Displays detailed information about hardware and software\n* Backup and restore registry\n* Built-in scheduler to exit, transfer in sleep / standby mode or shutdown your PC at a specified time\n* Easy access to the standard built-in Windows utilities from one window\n* Organization and management settings in Windows\n* Scheduling Tasks purification system at a given time\n\nWindows Vista, Windows Me, Windows XP 64-bit, Windows Vista 32-bit, Windows Server 2008 x64, Windows 7, Windows 2000, Windows XP, Windows 98, Windows XP 32-bit, Windows 2003 32-bit, Windows 2003, Windows Server 2008, Windows Server 2008 x86, Windows 7 32-bit, Windows 7 64-bit, Windows NT, Windows 2003 64-bit\nClick on image for full size view.\n\n\n\nUnpack with any archiver\nInstall setup.exe\nRun the application\nUse one of serials provided\n","torrent":{"xt":"urn:btih:ad358187eb91e6d6d14268d748e31fa233cbfd1f","amp;dn":"WinUtilities+9.0+Full+version%28trees%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad358187eb91e6d6d14268d748e31fa233cbfd1f","infoHashBuffer":{"type":"Buffer","data":[173,53,129,135,235,145,230,214,209,66,104,215,72,227,31,162,51,203,253,31]},"announce":[],"urlList":[]}}