{"title":"Preface to Hegel's Phenomenology of Spirit (audio)","uid":5101712,"size":165220685,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ad9228a4c0b1793a4a13cbfc55a40a4db9ac8254&amp;dn=Preface+to+Hegel%5C%27s+Phenomenology+of+Spirit+%28audio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"HenKaiPan","files":19,"time":1254041076,"description":"Reading of the Preface to Hegel's Phenomenology of Spirit.\n\nA better version will be upped soon with better file names etc. Stay tuned!\n\nReader's notes to Hegel's Preface to the Phenomenology of Spirit (Y. Yovel trans.)\n\nHope you enjoy this reading of an extremely challenging and rewarding text by one of the most important Wester philosophers.\nSome notes and resources for studying the Preface:\n\n- I have used Miller's paragraph numbers, which are also used on the Marxists.org version. These make it easy to cite and compate the text between its many translations.\n\n- I have also used the headings Hegel wrote (after writing the text) for the Preface. They were found in Walter Kaufman's otherwise slightly questionable translation of the Preface published as Hegel: Texts and Commentary by Anchor Books. While his translation is problematic, his biographical notes are useful if you are interested in the historical conditions that surrounded the composition of the text. \n\nHegel Glossary: http://www.class.uidaho.edu/mickelsen/texts/Hegel%20Glossary.htm\n\nBallie trans of Preface: http://www.marxists.org/reference/archive/hegel/works/ph/phprefac.htm\n\nMiller trans of Preface: below this message.\n\nGerman Original (Hoffmeister):\n\n\n- When the word 'Concept' is used, this designates Hegel's word 'Begriff', translated as 'notion' by Miller and Ballie sometimes. In the Preface Hegel labels everything he criticizes as 'conceptless'. A sufficient preliminary understanding of this word is to think of it as meaning: the true conception of  the object (corresponding to reality) grasped both as a conceptual scheme, and as emcompassing myrad empirical determinations. For example, conceptual thinking about bodily health might include both some awareness of the history and selection of that concept, and also the particular observable facts which are being 'covered' or referred to by that concept. The concept 'is the organic union of the universal truth and the individual facts.' (J. Royce, from the glossary)\n\n- In this translation Hegel's word 'Geist' is generally translated as 'Spirit', although sometimes as 'mind'. Etymologically, Geist is closer to our English 'ghost' than to our words which relate to thinking. The French consistently translate it as 'Esprit', which has a good combination of the ideas of intangibility, movement (like the English 'gust'), and collectivity that is lost in the English mind and ghost, each of which have the implicaiton of being an individual object, rather than a wholistic composite as in Esprit and Geist. \n\n- The word 'shape' is used somewhat oddly in the Preface. The German word is 'gestalt' as in gestalt psychology, for example. A sufficient defiiton from an online dicitonary: 'a configuration or pattern of elements so unified as a whole that its properties cannot be derived from a simple summation of its parts.' So when Hegel speaks of one or another shape, he means an entity in which many parts are organized into a functional whole or organic totality, such as an animal, or a state of consciousness.\n\n- The matter itself/die Sache selbst. This phrase is used many times in the Preface, and is usually translated as 'the matter iself' or 'the thing at hand' among other things. \n","torrent":{"xt":"urn:btih:ad9228a4c0b1793a4a13cbfc55a40a4db9ac8254","amp;dn":"Preface+to+Hegel%5C%27s+Phenomenology+of+Spirit+%28audio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad9228a4c0b1793a4a13cbfc55a40a4db9ac8254","infoHashBuffer":{"type":"Buffer","data":[173,146,40,164,192,177,121,58,74,19,203,252,85,164,10,77,185,172,130,84]},"announce":[],"urlList":[]}}