{"title":"Animated Screensaver Maker 2.4.3 [Portable] ","uid":6155404,"size":24938477,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:adaec9fa99c9e3c76bcca68a4bafc4149ca15288&amp;dn=Animated+Screensaver+Maker+2.4.3+%5BPortable%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chusca","files":4,"time":1297018411,"description":"Animated Screensaver Maker es una aplicaciÃƒÂ³n que permite la creaciÃƒÂ³n de protectores de pantallas animados. Puedes utilizar los modelos ofrecidos por el programa o tus propias fotografÃƒÂ­as para dejar tu computadora mÃƒÂ¡s moderna\ny divertida incluso en los periodos en que no se este usando. Si no pierdes ni una oportunidad de personalizar tu mÃƒÂ¡quina, este programa es un aliado poderoso para hacer la apariencia de tu Escritorio ÃƒÂºnica. Comienza a reunir tus imagenes\ny preparate para pasar horas manipulando los protectores de pantalla. En la mayoria de los programas que poseen la misma funciÃƒÂ³n del Animated Screensaver Maker la cantidad de recursos grÃƒÂ¡ficos es bastante limitada. Sin embargo, en este editor de protectores de pantalla la variedad de efectos de transiciÃƒÂ³n impresiona.Son mÃƒÂ¡s de 20 estilos de flores, rayos, tempestades de nieve, burbujas, lluvias torrenciales, viento y mucho mas! Animated Screensaver Maker pone a disposiciÃƒÂ³n cuatro escenarios animados como base para las creaciones. Uno de ellos coloca los personajes de la pelicula Matrix en la pantalla de la computadora. \nCon tu ayuda, los hÃƒÂ©roes del mundo virtual se van a incendiar, tambien quedaran sumergidos o se volveran codigos de programaciÃƒÂ³n en caida libre. Libera tu creatividad y explota la apariencia de Escritorio.\n-Idioma: InglÃƒÂ©s\n\n","torrent":{"xt":"urn:btih:adaec9fa99c9e3c76bcca68a4bafc4149ca15288","amp;dn":"Animated+Screensaver+Maker+2.4.3+%5BPortable%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adaec9fa99c9e3c76bcca68a4bafc4149ca15288","infoHashBuffer":{"type":"Buffer","data":[173,174,201,250,153,201,227,199,107,204,166,138,75,175,196,20,156,161,82,136]},"announce":[],"urlList":[]}}