{"title":"Zot!","uid":5080802,"size":281137939,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ae48e294abb3a80ad87c520b07758deea4ed18a8&amp;dn=Zot%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1252273693,"description":"Zot! is a comic book created by Scott McCloud (Understanding Comics: The Invisible Art) in 1984 and published by Eclipse Comics until 1990 as a lighthearted alternative to the darker and more violent comics that predominated the industry during that period.  McCloud credited Astro Boy creator Osamu Tezuka as a major influence on the book, making it one of the first manga-inspired American comic books.  The series is particularly notable for its imagery which is reminiscent of the Golden Age of Science Fiction, its energetic visual design and its meta-fictional underpinning.\n\nZachary T. Paleozogt, popularly known as Zot, is a blond haired, blue eyed teenage hero from an alternate Earth who flies via rocket boots and fights villains with a ten-shooter laser gun and boundless optimism.  He lives in &quot;the far-flung future of 1965,&quot; a utopian Earth of world peace, robot butlers, and flying cars. Jenny Weaver lives in an imperfect world of disappointment and broken promises - the Earth we live in. Stepping across the portals to each other's worlds, Zot and Jenny's lives will never be the same again.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:ae48e294abb3a80ad87c520b07758deea4ed18a8","amp;dn":"Zot%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae48e294abb3a80ad87c520b07758deea4ed18a8","infoHashBuffer":{"type":"Buffer","data":[174,72,226,148,171,179,168,10,216,124,82,11,7,117,141,238,164,237,24,168]},"announce":[],"urlList":[]}}