{"title":"Megan Abbott - Queenpin","uid":5176365,"size":1051407,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aee0d6ec5a76ac1a6ccf7528405d2893cc884297&amp;dn=Megan+Abbott+-+Queenpin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pigeye","files":1,"time":1258998302,"description":"Working from her story in the anthology Damn Near Dead (2006), noir's reigning crown princess delivers a royally entertaining rumination on toxic female friendships set in the harsh neon underbelly of early-1960s Las Vegas. The tale of an avaricious assistant to a Virginia Hill-style Mob courier unfolds so cinematically it's difficult not to picture it onscreen--perhaps pitched as The Grifters meets Casino, with Sharon Stone and Scarlett Johansson under the leering direction of Quentin Tarantino. &quot;Gloria's girl,&quot; they call her when she's corralling payoffs from casino managers, fixing odds at the track, and doling out pad money to the cops. But she's out for a glorious score, and the taste of a gem heist she sets up only makes her ravenous for more. It's too bad that head for nasty business is paired with a body built for even nastier sin--and a heart foolish enough to go out to Vic Riordan, a self-destructive gambler nearing his final spin of the wheel. It'd be nice to get a better glimpse of her motivations, but this is a sleek, slick, seductive treat. \n--Frank Sennett","torrent":{"xt":"urn:btih:aee0d6ec5a76ac1a6ccf7528405d2893cc884297","amp;dn":"Megan+Abbott+-+Queenpin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aee0d6ec5a76ac1a6ccf7528405d2893cc884297","infoHashBuffer":{"type":"Buffer","data":[174,224,214,236,90,118,172,26,108,207,117,40,64,93,40,147,204,136,66,151]},"announce":[],"urlList":[]}}