{"title":"Scooby Doo Meets Batman","uid":6236552,"size":1029662836,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:af0abd7747e0c61fdfb178edf362f79c39872985&amp;dn=Scooby+Doo+Meets+Batman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jmanwf","files":-1,"time":1299893544,"description":"Format: Pal\n\nThe Caped Crusader Caper:\nIn this episode Scooby Doo meets Batman and Robin. While camping, Scooby and Shaggy are selected by the group to gather more wood for the fire. While out looking for wood, Scooby mistakenly tried to gather the horns of a stag. Frighten by noises they hear, they hide, only to see the Joker, the Penguin and Professor Flakey walking by. They try to run away and are captured by the Batplane's bat cage. When Batman and Robin land, they tell Scooby that Professor Flakey disappeared that morning from his home and they were searching for him. Their radar had detected movement in the forest, so Batman and Robin had dropped their bat cage in an attempt to capture the Penguin and Joker but instead they captured Scooby and Shaggy. The dastardly criminals have a scheme to steal Professor Flakey's untested new invention, the &quot;flying suit.&quot; The Scooby, Mystery, Inc. group is solicited to help look for the Professor and they are to signal Batman and Robin if they find anything. The Penguin's and the Joker's scheme is finally foiled by Scooby, his friends (Scooby, Mystery, Inc.) and the dynamic duo. Scooby also gets to take an unplanned test flight in the &quot;flying suit.\n\n\n\nThe Dynamic Scooby Doo Affair: \n\nWhen the gang witness a plane landing in a field and a truck making a delivery to an old house, they find an old woman living inside, having received a punching clown. But when it's broken apart, they find it filled with counterfeit money. The gang is soon joined by Batman and Robin, the Dynamic Duo, who've tracked the plane in pursuit of the counterfeiters in the form of the Joker and the Penguin. The chase leads to an amusement park, but learn they're not the only ones involved as the gang need to return to the old house and find the counterfeiters' ringleader.\nWrite a Recap Ã‚Â»","torrent":{"xt":"urn:btih:af0abd7747e0c61fdfb178edf362f79c39872985","amp;dn":"Scooby+Doo+Meets+Batman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af0abd7747e0c61fdfb178edf362f79c39872985","infoHashBuffer":{"type":"Buffer","data":[175,10,189,119,71,224,198,31,223,177,120,237,243,98,247,156,57,135,41,133]},"announce":[],"urlList":[]}}