{"title":"Sommerbauer-Into the Barrel Without Bottom(Soviet European Union","uid":4994960,"size":4262871,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af8c9d8fc6549731ae04ae4d01f5a97924de32f5&amp;dn=Sommerbauer-Into+the+Barrel+Without+Bottom%28Soviet+European+Union&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"red_gonzo","files":1,"time":1247234306,"description":"For english-only speaking:\nThis book is in german language. English title would be: Going into the barrel without bottom - Is Austria marching into the collective slavery too? - Backgrounds of EU (1994). Prof. Adolf Sommerbauer reveals the story behind the founding of European Union as an end result of many decades of work of various secret societies. What do socialism and communism really want and how is today's money made and put into circulation? Is it true that the EU is simply the continuaton of Soviet socialist republics? The author tries to sort out the confusion that is constantly produced in the media and schools. The story applies generally to EU and only touches the Austrian situation in a few places. 65 pages, many pictures.\n\nFur Deutschsprachige:\nDieses BÃƒÂ¼chlein leuchtet die HintergrÃƒÂ¼nde der EU aus. Es zeigt, worum es den verborgenen Drahtziehern der EU in der Vergangenheit ging und nach wie vor geht. Was verbirgt sich hinter den Worten &quot;Sozialismus&quot; und &quot;Kommunismus&quot; wirklich? Enger, als die meisten BÃƒÂ¼rger ahnen, ist Baron Rothschild in diskreter Weise mit diesen Begriffen und dem &quot;GeldschÃƒÂ¶pfungsrecht der Zentralbanken&quot; verbunden. Hat Dr. Steinhauser recht, wenn er die EuropÃƒÂ¤ische Union mit der Union der Sozialistischen Sowjet-Republiken vergleicht? Nur wenige BÃƒÂ¼rger kennen sich in diesen Bereichen wirklich aus. Der Autor will helfen, diese fatale BildungslÃƒÂ¼cke zu schlieÃƒÅ¸en. Das BÃƒÂ¼chlein bezieht sich nur an einzelnen Stellen auf ÃƒÂ¶sterreichische VerhÃƒÂ¤ltnisse. Es ist fÃƒÂ¼r BÃƒÂ¼rger aller Staaten gleichermaÃƒÅ¸en lesenswert. Zahlreiche Illustrationen lockern die Darstellung auf. 65 Seiten, viele Abbildunden.\n","torrent":{"xt":"urn:btih:af8c9d8fc6549731ae04ae4d01f5a97924de32f5","amp;dn":"Sommerbauer-Into+the+Barrel+Without+Bottom%28Soviet+European+Union","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af8c9d8fc6549731ae04ae4d01f5a97924de32f5","infoHashBuffer":{"type":"Buffer","data":[175,140,157,143,198,84,151,49,174,4,174,77,1,245,169,121,36,222,50,245]},"announce":[],"urlList":[]}}