{"title":"Phil Collins - No Jacket Required + 12''ers [1985, 320 kbps]","uid":5053090,"size":273135043,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:afd570de5c88bf63548e22ca49358fde68c028cf&amp;dn=Phil+Collins+-+No+Jacket+Required+%2B+12%5C%27%5C%27ers+%5B1985%2C+320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"musicalibera","files":39,"time":1250266979,"description":"PHIL COLLINS - No Jacket Required (1985) / 12&quot;ers (1988)\n\nCodec: mp3.\nDescription: MPEG-1 Audio Layer 3.\nBit rate: 320 kbps.\nSample rate: 44100 Hz joint stereo.\nTags: ID3V1 &amp; ID3V2.\nSource format: CD (trks 1-12, 19 &amp; 20 ADD, trks 13-18 AAD)\nNumber of tracks 20.\n\nAllmusic review:\n\n&quot;The winner of the 1985 Grammy for Pop Album of the Year, No Jacket Required found Phil Collins fully embracing horn-driven pop music, drum machines, and sentimental ballads over his previous darker and more dramatic solo material. The record established him as a major commercial force, and as one of the most recognizable voices of the 1980s. Although the major hits here, &quot;Sussudio,&quot; &quot;One More Night,&quot; &quot;Who Said I Would,&quot; and &quot;Don't Lose My Number&quot; quickly came to sound dated, the album contains several standout tracks. &quot;Long Long Way to Go,&quot; which features a cameo by Sting, is one of Collins' most effective ballads, while the pulsating &quot;Take Me Home&quot; utilizes the drama of &quot;In the Air Tonight&quot; on a more wistful track. &quot;Only You Know and I Know&quot; and &quot;Inside Out,&quot; meanwhile, show an effective aggressive side to the singer. It's not a completely satisfying recording, but it is the best example of one of the most dominating and influential styles of the 1980s.&quot;\n\nRolling Stone review:\n\n&quot;Phil Collins' sudden transformation from the balding bantam drummer for a prosperous British art-rock group into a mainstream pop heartthrob might seem one of the Eighties' most improbable success stories. But judging from the sly craft and warm, low-key humor of his solo records and his successful productions for Philip Bailey and Frida (Anni-Frid Lyngstad of ABBA), Collins' newfound fame was inevitable. His effortless graft of bright white-R&amp;B bounce to quirky, unexpected melodies is instinctively commercial but never feels overly contrived. His sound mix, which basically consists of brash horns and hard, clipped rhythms, also gives Collins' records a confident edge. Like his '81 and '82 outings, Face Value and Hello ... I Must Be Going!, No Jacket Required is not an album that waits to be liked.\nAbout the worst thing you can say about this record is that at times Collins' charms seem a little overfamiliar. The soft-core romance of the hit ballad &quot;One More Night&quot; occasionally echoes last year's &quot;Against All Odds (Take a Look at Me Now).&quot; His continued reliance on staccato horn fills (&quot;Sussudio,&quot; &quot;Only You Know and I Know&quot;) is also beginning to wear thin. But &quot;Who Said I Would&quot; is a refreshing blast of breathless Prince-style funk set at full throttle by guest keyboardist-bassist David Frank of the System. &quot;I Don't Wanna Know&quot; has a swift rock kick, and &quot;Take Me Home&quot; adds all-star vocal backup (Sting, Peter Gabriel, Helen Terry of Culture Club) to its engaging, circular rhythm and languid melodic texture.\nAfter years on the art-rock fringe, Collins has established himself firmly in the middle of the road. Perhaps he should consider testing himself and his new fans' expectations next time around.&quot;\n\nWikipedia bio:\n\n&quot;No Jacket Required is the third album by English singer-songwriter Phil Collins, released on 25 January 1985. The album was named after an incident at The Pump Room in Chicago, where Collins was denied admittance to the establishment because of his attire. No Jacket Required features guest vocalists, including Helen Terry, Peter Gabriel and Sting. Some of the songs, like &quot;Don't Lose My Number&quot; and &quot;Sussudio&quot;, were based on improvisation. Other songs, like &quot;Long Long Way to Go&quot;, had a political message. &quot;One More Night&quot;, &quot;Sussudio&quot;, &quot;Don't Lose My Number&quot;, and &quot;Take Me Home&quot; were released as singles, with corresponding music videos.\nThe album was positively received and won the Grammy Award for Album of the Year in 1985. Stephen Holden of The New York Times said that Collins was &quot;quietly revolutionizing and expanding the role of the drums in pop record making&quot;. Rolling Stone reviewer David Fricke said that the album, &quot;Like his '81 and '82 outings, Face Value and Hello ... I Must Be Going!, No Jacket Required is not an album that waits to be liked&quot;. Collins' most commercially successful album, No Jacket Required went to number one in several countries, including the United States, where it was at the top of the charts for seven weeks, United Kingdom and Canada. The record has been certified diamond in the US by the Recording Industry Association of America, and has sold over two million copies in the UK, being certified for 6x platinum.\nMany of the songs, including &quot;Take Me Home&quot;, and &quot;Long Long Way To Go,&quot; have been used in episodes of Miami Vice and &quot;We Said Hello Goodbye&quot; was featured in movie Playing for Keeps. All four singles were top-ten hits in the Billboard Hot 100, with &quot;Sussudio&quot; and &quot;One More Night&quot; reaching number one. The three singles that were released in the UK all reached the top 20 on the UK charts.\nCollins embarked on The No Jacket Required World Tour concert in 1985, which was a success. During the tour, Collins received critical acclaim for appearing at the Philadelphia and Wembley Stadium Live Aid events on the same day. Remixes of six songs from the album were later included on the 12&quot;ers compilation. In 1985 Collins also recorded a song with Marilyn Martin for the movie White Nights, called &quot;Separate Lives&quot;, which was a number one hit in the US, and a top ten hit in the UK.&quot;\n \nTRACK LIST\n\nNo Jacket Required (1985)\n=========================\n01. Sussudio\n02. Only You Know And I Know\n03. Long Long Way To Go\n04. I Don't Wanna Know\n05. One More Night\n06. Don't Lose My Number\n07. Who Said I Would\n08. Doesn't Anybody Stay Together Anymore?\n09. Inside Out\n10. Take Me Home\n+\n11. We Said Hello Goodbye (Don't Look Back)\n12. Separate Lives (Duet with Marilyn Martin)\n13. Sussudio (Extended Remix)\n14. Who Said I Would (Extended Remix)\n15. Only You Know And I Know (Extended Remix)\n16. Don't Lose My Number (Extended Remix)\n17. One More Night (Extended Remix)\n18. Take Me Home (Extended Remix)\n19. Doesn't Anybody Stay Together Anymore? (Live)\n20. Separate Lives (Live)\n\nEnjoy and share with you fellow man.\n","torrent":{"xt":"urn:btih:afd570de5c88bf63548e22ca49358fde68c028cf","amp;dn":"Phil+Collins+-+No+Jacket+Required+%2B+12%5C%27%5C%27ers+%5B1985%2C+320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afd570de5c88bf63548e22ca49358fde68c028cf","infoHashBuffer":{"type":"Buffer","data":[175,213,112,222,92,136,191,99,84,142,34,202,73,53,143,222,104,192,40,207]},"announce":[],"urlList":[]}}