{"title":"Moneda.(ebook).","uid":6190756,"size":7975264,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0106e0cda909e2bc12d7f97b25cbfa537328f0c&amp;dn=Moneda.%28ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1298276452,"description":"La ciudad de Londres es el nueva e imponente protagonista de este incomparable fresco sobre el origen histÃƒÂ³rico de nuestro tiempo, con el enfrentamiento entre la nueva ciencia moderna de la Royal Society y la vieja alquimia, no siempre tan alejadas como parecerÃƒÂ­a a primera vista. La confusiÃƒÂ³n inevitablemente asociada al nacimiento del mundo y la mentalidad modernos es en realidad el eje central de una vasta peripecia humana, social e Intelectual que configura el tercer y ÃƒÂºltimo volumen de esta magna obra que es el Ciclo Barroco. Un libro de inmensa ambiciÃƒÂ³n, erudiciÃƒÂ³n y alcance.\n\nSir Isaac Newton usa su poder como director de la Casa de la Moneda de Inglaterra para buscar el mÃƒÂ­tico Ã‚Â«Oro de SalomÃƒÂ³nÃ‚Â» del que supone que contiene el Mercurio FilosÃƒÂ³fico que ha de ser imprescindible en sus estudios alquÃƒÂ­micos. Eso le enfrenta irremediablemente a Jack Shaftoe el llamado Rey de los Vagabundos, conocido ahora como Jack el AcuÃƒÂ±ador. Mientras, Daniel Waterhouse, puritano y filÃƒÂ³sofo natural, fundador del Instituto de las Artes TecnolÃƒÂ³gicas de la BahÃƒÂ­a de Massachusetts (el precedente del actual M.I.T.), es llamado de nuevo a Europa para mediar en la disputa intelectual que enfrenta a Newton y a Leibniz para dilucidar cuÃƒÂ¡l de los dos ha inventado primero el cÃƒÂ¡lculo infinitesimal. En Massachusetts, Waterhouse habÃƒÂ­a empezado a construir el Molino LÃƒÂ³gico de Leibniz, el precedente de los modernos ordenadores y, llegado ahora a Inglaterra, recibe de Leibniz un encargo del zar Pedro I el Grande: colaborar en el desarrollo de la ciencia con un envÃƒÂ­o de material cientÃƒÂ­fico para Rusia.\n\n\n\nPolÃƒÂ­tica e intrigas, ciencia y alquimia amores y odios, el amplio fresco de la vida se da cita en el Ciclo Barroco de manera inÃƒÂ©dita hasta hoy. Otro verdadero tour de force.","torrent":{"xt":"urn:btih:b0106e0cda909e2bc12d7f97b25cbfa537328f0c","amp;dn":"Moneda.%28ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0106e0cda909e2bc12d7f97b25cbfa537328f0c","infoHashBuffer":{"type":"Buffer","data":[176,16,110,12,218,144,158,43,193,45,127,151,178,92,191,165,55,50,143,12]},"announce":[],"urlList":[]}}