{"title":"Dumb and Dumber(1994)DVDRip.AC3(ENG)-DROCK","uid":6250641,"size":731922050,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b04adf0b8ef86d02a390a33512e32fcfa349613d&amp;dn=Dumb+and+Dumber%281994%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1300396781,"description":"Jim Carrey and Jeff Daniels play the title roles (though viewers may find themselves debating which is which) in this genially low-brow comedy. Lloyd Christmas (Jim Carrey) and Harry Dunne (Jeff Daniels) are two intellectually-challenged best friends who share an apartment so messy that gangsters aren't sure how to trash the place; the guys also have a certain problem (not difficult to understand) holding on to jobs. Lloyd is working as a limo driver in Rhode Island when he picks up a beautiful and wealthy woman named Mary Swanson (Lauren Holly) who is being taken to the airport. Lloyd immediately falls head over heels in love with Mary, and when she leaves a briefcase at the airport, he's determined to return it in hopes of impressing her. Lloyd isn't able to get aboard Mary's flight (though not for lack of trying). Harry has a van decorated to look like a dog (to promote his failing dog-grooming business), and the pair hop in the Poochmobile to find Mary in Aspen. What Lloyd and Harry don't know is that the briefcase is full of money, which Mary deliberately left at the airport as a ransom payment to save the life of her kidnapped husband. Incidentally, Lloyd's chipped front tooth happens to be real; while Jim Carrey had the injured tooth capped many years ago, he thought a broken smile would suit Lloyd's character and had the cap removed for the duration of filming. \n\nRipped with Handbrake.\n\nLength: 1 Hour 46 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:b04adf0b8ef86d02a390a33512e32fcfa349613d","amp;dn":"Dumb+and+Dumber%281994%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b04adf0b8ef86d02a390a33512e32fcfa349613d","infoHashBuffer":{"type":"Buffer","data":[176,74,223,11,142,248,109,2,163,144,163,53,18,227,47,207,163,73,97,61]},"announce":[],"urlList":[]}}