{"title":"Stellastarr - Civilized [2009] (VBR-0) [Dodecahedron]","uid":5077063,"size":84064648,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b0a6bab94e03f1fbdb37f8d44aca318f6af23681&amp;dn=Stellastarr+-+Civilized+%5B2009%5D+%28VBR-0%29+%5BDodecahedron%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dodecahedron9","files":-1,"time":1251941983,"description":"Stellastar* - Civilized [2009] (VBR-0) [Dodecahedron]\n\n\nStellastarr (styled as stellastarr*) is an American indie rock band based in New York City. It is composed of Shawn Christensen (vocals, rhythm guitar), Amanda Tannen (bass, vocals), Arthur Kremer (drums, percussion, keyboards), and Michael Jurin (lead guitar, vocals).\n\nThe band formed in March 2000 from the ashes of a previous musical effort formed while studying art and design at the Pratt Institute in Brooklyn. A few years later, after a chance meeting with Michael, who had recently relocated to Brooklyn and had left his former band Charlotte's Funeral behind in his hometown of Philadelphia, the former classmates reunited, this time with Shawn on vocals.\n\nStellastarr played their first gig at Luna Lounge, formerly on the Lower East Side of Manhattan in July 2000, and released a limited series of independent/homemade EP CDs shortly thereafter. They have toured with (among others) Jane's Addiction, The Raveonettes, Placebo, supported by The Killers, and Editors. Stellastarr have played live in the United States, the United Kingdom, Canada, Mexico, Japan, and Europe.\n\nThey recently released their third album, Civilized, and are currently on tour. The songs &quot;Warchild,&quot; &quot;People,&quot; &quot;Numbers,&quot; and &quot;Graffiti Eyes&quot; have been previewed on their Myspace page and all four tracks are on the album, which contains ten tracks.\n\nVocalist Shawn Christensen had stated that the third album will be &quot;faster, less mid-tempo. More energy, more rock, slightly more aggressive.&quot; He also went on to state that he'd been battling with throat issues which necessitated a change in his singing style. &quot;I had to alter the intonation of my voice. I will be singing in a higher register for the most part, where I would normally go to a lower one.\n\nSource: http://en.wikipedia.org/wiki/Stellastar\n\n\n--\n\nArtist: stellastar*\nCountry: USA (New York)\nAlbum: Civilized.\nGenre: Indie Rock\n\nTrack listing:\n\n01. Robot\n02. Freak out\n03. Tokyo sky\n04. Numbers\n05. Graffiti eyes\n06. Prom Zombie\n07. Warchild\n08. People\n09. Move on\n10. Sonja cries\n\n\n\n--\nBrought to you by Dodecahedron. Enjoy and seed! :)","torrent":{"xt":"urn:btih:b0a6bab94e03f1fbdb37f8d44aca318f6af23681","amp;dn":"Stellastarr+-+Civilized+%5B2009%5D+%28VBR-0%29+%5BDodecahedron%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0a6bab94e03f1fbdb37f8d44aca318f6af23681","infoHashBuffer":{"type":"Buffer","data":[176,166,186,185,78,3,241,251,219,55,248,212,74,202,49,143,106,242,54,129]},"announce":[],"urlList":[]}}