{"title":"Guns N' Roses - Yesterdays  (2nafish)","uid":5620755,"size":117858308,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b10c8c0513b302c42e9fa5e35ab42b434bba756a&amp;dn=Guns+N%5C%27+Roses+-+Yesterdays++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":1,"time":1276263231,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Yesterdays&quot; is a single and third track on the Guns N' Roses album Use Your Illusion II. It was written by Axl Rose, West Arkeen, Del James and Billy McCloud. This song is featured in the 2004 compilation Greatest Hits. The song peaked at #72 on the Billboard Hot 100.\n\nUse Your Illusion II is the fourth studio album by Hard Rock band Guns N' Roses. It was one of two albums released in conjunction with the Use Your Illusion Tour, and as a result the two albums are sometimes seen together as a double album. Bolstered by the lead single &quot;You Could Be Mine&quot;, Use Your Illusion II was the slightly more popular of the two albums, selling 770,000 copies in its first week and debuting at #1 on the U.S. charts, ahead of Use Your Illusion I's first week sales of 685,000. Use Your Illusion II is Guns N' Roses best selling album in the U.S., having sold 5,587,000 units as of March 2010 according the Nielsen SoundScan. Both albums have been certified 7x Platinum by the RIAA. It was also #1 on the UK Albums Chart for a single week.\n\nGuns N' Roses (sometimes abbreviated as GN'R or GNR) is an American hard rock band. The band formed in Hollywood, Los Angeles, California in 1985. Led by frontman and co-founder Axl Rose (born William Bruce Rose, Jr.), the band has released six studio albums, three EPs, and one live album while going through numerous line-up changes and controversies since its formation.\n\nThe band has sold more than 100 million albums worldwide, including over 46 million in the United States. The band's 1987 major label debut album, Appetite for Destruction, has sold in excess of 38 million copies worldwide and reached No. 1 on the United States Billboard 200. In addition, the album charted three Top 10 hits on the Billboard Hot 100, including &quot;Sweet Child o' Mine&quot; which reached No. 1. The 1991 albums Use Your Illusion I and Use Your Illusion II debuted on the two highest spots on the Billboard 200 and have sold a combined 14 million copies in the United States alone and 35 million worldwide. After over a decade of work, the band released their follow-up album, Chinese Democracy. A Greatest Hits album was released in 2004.\n\nThe current lineup comprises lead vocalist Axl Rose, lead guitarists Ron &quot;Bumblefoot&quot; Thal and DJ Ashba, rhythm guitarist Richard Fortus, bassist Tommy Stinson, keyboardists Dizzy Reed and Chris Pitman and drummer Frank Ferrer.\n\nGuns N' Roses' mid-to-late 1980s and early 1990s years have been described by individuals in the music industry as the period in which &quot;they brought forth a hedonistic rebelliousness and revived the punk attitude-driven hard rock scene, reminiscent of the early Rolling Stones.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:b10c8c0513b302c42e9fa5e35ab42b434bba756a","amp;dn":"Guns+N%5C%27+Roses+-+Yesterdays++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b10c8c0513b302c42e9fa5e35ab42b434bba756a","infoHashBuffer":{"type":"Buffer","data":[177,12,140,5,19,179,2,196,46,159,165,227,90,180,43,67,75,186,117,106]},"announce":[],"urlList":[]}}