{"title":"Public Enemy - Greatest Misses .flac files","uid":6296587,"size":460896352,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b12ca6ffb691e7e93dd74415970af524b63548e8&amp;dn=Public+Enemy+-+Greatest+Misses+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ulikes","files":22,"time":1302017030,"description":"&quot;Greatest Misses&quot; is the first `anti-concept LP' from Public Enemy. Originally released in August of 1992, it hit stores just following the Los Angeles riots of that year as well as being in the midst of the U.S. Presidential campaign that year as well. Perhaps for the first time, the group reaches outside its traditional Bomb Squad production team for remixing select album cuts and singles from previous albums. Those remixes comprise the second half of this release, the first half containing all-new recordings.\n1. &quot;Tie Goes to the Runner&quot; - Some wah-wah guitar samples anchor the rhythm track, where Chuck goes off on recent events: &quot;Not surprised at all about the riot zone... This was predicted not self-inflicted By the rap outta the 'hood..&quot;\n2. &quot;Hit Da Road Jack&quot; - The group gives a middle finger to racists but also lament the apathy for some in the black community &quot;When I come they all run and hide and they quit, and yell loud, here comes Chuck with that black...&quot;\n3. &quot;Gett Off My Back&quot; - Flavor Flav's solo opus (previously heard on the Mo' Money soundtrack) finds the rapper warning people about substance abuse, (&quot;monkey, get off my back!&quot;), with a nice Parliament-inspired hook.\n4. &quot;Gotta do What I Gotta Do&quot; - Congas percolate on this track where Chuck explains his role as an activist and agitator- &quot;They come &amp; try to get some\nThey had the nerve to call the president/ An' I wasn't hesitant, To scream I was a resident&quot;\n5. &quot;Air Hoodlum&quot; - Rhyming over a deceptively smooth jazz-based rhythm track, Chuck tells the sobering tale of a basketball prodigy whose dreams go terribly wrong. &quot;The fall began When Mickey Mack fell; Hell ripped his knee, Drafted last by personnel.&quot;\n6. &quot;Hazy Shade of Criminal&quot; - For the first single on the album, Chuck re-interprets the title of an old Simon &amp; Garfunkel tune to indict the imbalances on how the American justice system deals with minorities- includes a timely swipe at grisly serial killer &quot;Jeffrey Dahmer, enters the room without cuffs, how the hell do we get stuffed in the back of a cell on an isle...&quot;\n7. &quot;Megablast&quot; - Horns blast away on this remix of a Bum Rush the Show album cut, Chuck and Flav trade verses about the ills of dope addiction: &quot;An antique fork, how long would it last.. we'll see in 12 minutes when he wants that blast..&quot;\n8. &quot;Louder Than a Bomb&quot; - Run DMC's Jam Master Jay helms a relentless heavy-bass uptempo remix of this Nation of Millions album cut, and the second single from Misses.\n9. &quot;You're Gonna Get Yours&quot; - A scratch-heavy tweaking of Public Enemy's first single from their first LP.\n10. &quot;How to Kill a Radio Consultant&quot; - New York pioneer DJ Chuck Chillout remixes this Apocalypse 91 album cut, with a special message for anti-hip-hop radio programmers.\n11. &quot;Who Stole the Soul?&quot; - Ice Cube producer Sir Jinx gives PE a left-coast flair for this Black Planet album cut remix, including a hilarious audio clip of Eddie Murphy.\n12. &quot;Party for Your Right to Fight&quot; - Live bass &amp; guitar make for an engaging re-interpretation of the Nation of Millions album cut.\n13. &quot;Shut Em Down&quot; - a live performance on UK television of the Pete Rock-produced remix. \n\nEnjoy and please seed.","torrent":{"xt":"urn:btih:b12ca6ffb691e7e93dd74415970af524b63548e8","amp;dn":"Public+Enemy+-+Greatest+Misses+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b12ca6ffb691e7e93dd74415970af524b63548e8","infoHashBuffer":{"type":"Buffer","data":[177,44,166,255,182,145,231,233,61,215,68,21,151,10,245,36,182,53,72,232]},"announce":[],"urlList":[]}}