{"title":"Kenny Chesney (Duet with George Strait) - Shiftwork","uid":5010754,"size":180824068,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b12f4bf397224b3ecd69ec2ea57c7b4cae257933&amp;dn=Kenny+Chesney+%28Duet+with+George+Strait%29+-+Shiftwork&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1247982333,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Shiftwork&quot; is a single by country music artists Kenny Chesney and George Strait. It is the third single from Kenny Chesney's 2007 album Just Who I Am: Poets &amp; Pirates.\n\nInitially, &quot;Shiftwork&quot; charted as an album cut, receiving unsolicited airplay which brought the song up to #42 on the country music charts prior to its release. Before the song was officially released, it was credited to both Chesney and Strait. Once it was officially made a single, however, Strait's name was removed from the song, due to contractual agreements between his label (MCA Nashville) and Chesney's Label (BNA Records). Starting with the Billboard chart dated for February 9, 2008, the song was once again billed as &quot;Kenny Chesney duet with George Strait&quot;.\n\nThe song is a moderate up-tempo, backed by percussion (mainly steel drums), in which the central characters (Chesney and Strait) express their frustration with constantly working shifts at a convenience store (&quot;workin' seven to three / Three to eleven / Eleven to seven&quot;). Both characters point out that their job is &quot;a bunch of shiftwork&quot;. In the second verse, Chesney tells of taking a trip to the beach to &quot;party from seven to three / Three to eleven / Eleven to seven.&quot;\n\nJust Who I Am: Poets &amp; Pirates is the twelfth studio album by country music artist Kenny Chesney. It was released in the United States on September 11, 2007. The CD was leaked on the Internet on September 5, 2007, almost a week before its release.\n\nThe album debuted at #3 on the Billboard 200 chart. In its first week, the album had the best weekly sales of any country album since the Dixie Chicks' Taking the Long Way in May 2006 and the album has sold 1.4 million copies in the U.S. up to August 2008.\n\nThe album's first two singles (&quot;Never Wanted Nothing More&quot; and &quot;Don't Blink&quot;) both reached the top of the Billboard Hot Country Songs charts in 2007. &quot;Shiftwork&quot;, which was a duet with George Strait was the album's third single, peaking at #2. &quot;Better as a Memory&quot;, the fourth and final single, also reached Number One. Also included is &quot;Wild Ride&quot;, a Joe Walsh duet which was previously recorded by Dwight Yoakam on his 1992 album This Time.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:b12f4bf397224b3ecd69ec2ea57c7b4cae257933","amp;dn":"Kenny+Chesney+%28Duet+with+George+Strait%29+-+Shiftwork","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b12f4bf397224b3ecd69ec2ea57c7b4cae257933","infoHashBuffer":{"type":"Buffer","data":[177,47,75,243,151,34,75,62,205,105,236,46,165,124,123,76,174,37,121,51]},"announce":[],"urlList":[]}}