{"title":"Vince Guaraldi Trio - Jazz Impressions Of Black Orpheus (FLAC) [","uid":6210427,"size":225856135,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b130cf2777e1c5d18da2bc3ace796c4b20bce4a1&amp;dn=Vince+Guaraldi+Trio+-+Jazz+Impressions+Of+Black+Orpheus+%28FLAC%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"tverlaine","files":18,"time":1298966405,"description":"eac secure cue log scans\n\nJazz Impressions Of Black Orpheus [DCC Gold GZS-1042]\nThis DCC Gold limited release been mastered by &quot;Audiogod&quot; Steve Hoffman.\nThe sound is an awesome improvement above all other releses.\n\n01. Samba De Orfeo\n02. Manha de Carnaval (Morning Of The Carnival)\n03. O Nosso Amor (Our Love)\n04. Generique - A Felicidade (The Happiness)\n05. Cast Your Fate To The Wind\n06. Moon River\n07. Alma-Ville\n08. Since I Fell For You\n\nIncl. complete HQ Scans, CUE + Log\n\nHere is Vince Guaraldi's breakthrough album -- musically, commercially, in every which way. After numerous records as a leader or sideman, for the first time a recognizable Guaraldi piano style emerges, with whimsical phrasing all his own, a madly swinging right hand and occasional boogie-influenced left hand, and a distinctive, throat-catching, melodic improvisational gift. The first half of the CD is taken up by cover versions of tunes from the Antonio Carlos Jobim/Luiz Bonfa score for the film Black Orpheus, recorded just as bossa nova was taking hold in America. These are genuinely jazz-oriented impressions in a mainstream boppish manner, with only a breath of samba from Monty Budwig (bass) and Colin Bailey (drums) in the opening minute of &quot;Samba de Orpheus&quot;; an edited version of this haunting song was issued as a 45 rpm single. But DJs soon began flipping the single over to play the B-side, a wistful, unforgettably catchy Guaraldi tune called &quot;Cast Your Fate to the Wind&quot; that opens the North American half of the album. The tune became a surprise hit; Fantasy redesigned the cover to call attention to it, and Vince was on his way to fame as one of Latin and mainstream jazz's most irresistible composers. The whole album evokes the ambience of San Francisco's jazz life in the 1960s as few others do -- and such is this record's appeal that even non-jazz and non-Latin music people have been grooving to this music ever since it came out.\n\nEnjoy and keep seeding!","torrent":{"xt":"urn:btih:b130cf2777e1c5d18da2bc3ace796c4b20bce4a1","amp;dn":"Vince+Guaraldi+Trio+-+Jazz+Impressions+Of+Black+Orpheus+%28FLAC%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b130cf2777e1c5d18da2bc3ace796c4b20bce4a1","infoHashBuffer":{"type":"Buffer","data":[177,48,207,39,119,225,197,209,141,162,188,58,206,121,108,75,32,188,228,161]},"announce":[],"urlList":[]}}