{"title":"tÃƒÂ© Discography","uid":5088267,"size":259231253,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b24440fb65cff4f55957a4ec9232f35bda3197ef&amp;dn=t%C3%83%C2%A9+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ilovecomputerporn","files":37,"time":1252898406,"description":"Thought i might share this amazing band, comment and seed :).\n\nTrack List\n\nte' - 2005 - Naraba Imi Kara Kaihou Sareta Hibiki Wa Oto No\n\n1 It must be called &quot;Intelligence&quot; if people stop when they realize they are not able to become what they are wishing to be.\n2 A Thought Would Never Let People &quot;Watch&quot; What They Choose. Instead, It Let Them See What They Hope to See.\n3 Anxiety Is Not About The Issue. It Is Actually About People's &quot;Mind&quot; Related to the Issue That They Are Afraid Of.\n4 Avarice Would Speak With Every Word, It &quot;Acts&quot; Every Part And It Even Pretends to Be Not Avaricious.\n5 A Real &quot;Imitation&quot; Is the Imitation That Let People See Ridiculousness of Boring Original One.\n6 It Is Supposed to Be &quot;Ordinary&quot; That Imagination Moves Much Faster And More Freely Than Bright Light in the Darkness.\n7 &quot;Existence&quot; of Eloquence Is Only in a Look Of People's Face That Remain Silence, And It Even Beats Any Kind Of Words.\n8 Anger Kills All the Idiots, And Envy Would Torture Foolish People And All the &quot;Instants&quot; Being Involved.\n9 We Promise With a View to Hope, But the Reason to &quot;Accomplish&quot; What We Promised Would Be Fear.\n10 A Reality That People Are Living in This World Is a Lot &quot;More&quot; Complicated Than Fantasy-Land That They Imagine.\n\nte' - 2007 - Te Sore Wa Narihibiku Sekai Kara Genjitsuteki Na\n\n1 Even mightiest soul and mightiest power,it is same as nothing if there is no intellect\n2 If there is no word which tells sound, beautiful melody does not keep in mind\n3 Also love and faith keep up with a daily small deed\n4 Those who do not need tomorrow most see tomorrow most pleasantly\n5 Daredevil is child of ignorance &amp; mean and it is inferior to other qualification\n6 Those who play using word are not in the talent, it is only there's memory\n7 Moderation and justice are the nominal which only a superior can use freely\n8 When one's mental lost right goal that shown wrong direction to the frustrations\n9 You can not call anyone happy, if you do not had been any trouble\n10 Human have ability of destroy oneself by logical mind\n\nte' - 2008 - Mashite Kokoro To Gokan Ga Icchi Surunara Subete Saijou No Ongaku Ni Henzuru\n\n01. Ningen wa jiyuu na Mono toshite Umare, Itaru Tokoro de &quot;Kusari&quot; ni Tsunagarete Yuku\n02. Tani Yoseru Shinrai no Daibubun wa, Onore no Uchi ni Daku Jishin kara &quot;u&quot;mareru\n03. Yume towa Genjitsu to iu Heibon na Mono ni Tsukeru Utsukushisa ni Nita &quot;uso&quot; no Zokushou\n04. Itsumo Kouten Suru Mirai o Nozomi, Shikashi Jisetsu no Henka wa &quot;Oso&quot;reteiru\n05. Yowai to iu Mono wa Aware na Koto da, Aete Okonau ni Shiro &quot;shino&quot; buni Shiro\n06. Gugan no Shi ni Kenetsu Sareru Koto wa, Mottomo Tadashii &quot;kachi&quot; no Kettei de Aru\n07. Shi wa Tada, Yameru Tamashii no Shoyuusha to Kodokusha tono Sabishii &quot;nagusa&quot;me de Aru\n08. Hito wa Tanin no Fukou niwa Juubun Taerareru dake no Tsuyosa o &quot;mo&quot;tteiru\n09. Kotowari wa Kouhei na Handan o Nozomi, Ikari wa handan ga Kouhei ni Mieru Koto o &quot;nozo&quot;mu\n10. Imi no Aru Meguriai o Motomezu, Deai ni &quot;imi&quot; o Mitsuketeiku\n11. Uta o Utatte Nemurasete Yaritai. Dareka no Soba ni Suwari &quot;uta&quot; tte Itai\n12. &quot;Wu Lun Zuo Shen Dou Hao&quot; Yong Qing Sheng Xi Yu Shuo Chu Ming Wei &quot;Jiyuu&quot; to iu &quot;kyouhaku&quot;\n\nLOVE THE SONG NAMES DONT CHA?","torrent":{"xt":"urn:btih:b24440fb65cff4f55957a4ec9232f35bda3197ef","amp;dn":"t%C3%83%C2%A9+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b24440fb65cff4f55957a4ec9232f35bda3197ef","infoHashBuffer":{"type":"Buffer","data":[178,68,64,251,101,207,244,245,89,87,164,236,146,50,243,91,218,49,151,239]},"announce":[],"urlList":[]}}