{"title":"Avataars - Covenant of The Shield","uid":5072080,"size":37302239,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b2dd21b994396aeac8491c5c0230e07485dab99d&amp;dn=Avataars+-+Covenant+of+The+Shield&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1251491663,"description":"Avataars: Covenant of the Shield is a three-issue comic book mini-series, published by Marvel Comics in 2000. The series is written by Len Kaminski and pencilled by Oscar Jimenez and Javier Saltares.\n\nSet in a sword and sorcery version of the Marvel Universe Earth, it features alternate versions of Marvel characters such as Spider-Man, Captain America, Doctor Doom and the X-Men.\n\nAvataars: Covenant of the Shield was initially intended as a twelve-issue project featuring the established Marvel characters in a fantasy setting, but the story that was originally planned was never published. Marvel was in financial trouble at the time, and a twelve-issue series was not considered viable, so the creative team instead produced a three-issue prologue to the main saga, an unsuccessful attempt to generate sufficient interest in a longer story.\n\nThe series begins with the formation of the planet Eurth by the Shaper of Worlds under the supervision of the Living Tribunal, Eternity and Infinity. Their purpose is to create a planet that is an alternate version of Earth in order to further understand the heroes that inhabit that world.\nThe overall plot involves the kidnapping of the son of Captain Avalon (Captain America) by forces employed by the Dreadlord (Baron Zemo).  Various heroes become involved in the rescue efforts, most of these being members of the Champions of the Realm (the Avengers).\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:b2dd21b994396aeac8491c5c0230e07485dab99d","amp;dn":"Avataars+-+Covenant+of+The+Shield","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2dd21b994396aeac8491c5c0230e07485dab99d","infoHashBuffer":{"type":"Buffer","data":[178,221,33,185,148,57,106,234,200,73,28,92,2,48,224,116,133,218,185,157]},"announce":[],"urlList":[]}}