{"title":"Michael Jackson - Remember The Time (Long Version)","uid":5008584,"size":318992388,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b3c45c82391940444e1a47a25d206f6a5f2b8e28&amp;dn=Michael+Jackson+-+Remember+The+Time+%28Long+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1247869419,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Remember the Time&quot; is a popular recording by American rock, pop and R&amp;B singer Michael Jackson in March of 1992. Released as the second single off Jackson's hit 1991 album, Dangerous, the song was a successful attempt by Jackson to create a New jack swing-flavored R&amp;B jam with the accompanient of co-producer Teddy Riley. The song hit #3 on the Billboard Hot 100 singles chart and #1 on Billboard's R&amp;B Singles chart. In 1993 Jackson gave a memorable performance of the song at the Soul Train Awards in a chair. This was because he had severely twisted his ankle as he was going into a spin during dance rehearsals the day before. Remember The Time received the Soul Train Award for Best Male R&amp;B Single.\n\nThe song was originally set to be a part of the Dangerous World Tour and was rehearsed before the tour began but was taken out. Many rumors state that it might have been taken out for time purposes due to the already large song list for the tour.\n\nAs with some of his past songs, the music video for &quot;Remember the Time&quot; (directed by John Singleton) was an elaborate production and became one of his longest videos at over 9 minutes. Set in ancient Egypt, it featured groundbreaking visual effects and appearances by Eddie Murphy, Iman, Magic Johnson, and Tom &quot;Tiny&quot; Lister, Jr. along with a distinct physically complicated dance routine that became the centre piece of many other videos from the Dangerous album and is one of only a few videos where he is seen embraced in a kiss.\n\nDangerous is the eighth album by Michael Jackson, released on November 26, 1991. It became his second to debut at #1 on the Billboard 200 album chart, where it spent the next four consecutive weeks. In the space of 17 years, media sources state the record has sold as much as 30 million copies worldwide, with 7 million certified shipments in the United States alone, making it a faster selling album than his previous record Bad. The album won one Grammy for Best Engineered Album - Non Classical won by Bruce Swedien &amp; Teddy Riley and is the most successful New Jack Swing album of all time.. Dangerous was the first album ever to spawn eight consecutive UK Top 20 hits. &quot;Dangerous&quot; was Michael Jackson's second best-selling album (first was Thriller).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:b3c45c82391940444e1a47a25d206f6a5f2b8e28","amp;dn":"Michael+Jackson+-+Remember+The+Time+%28Long+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3c45c82391940444e1a47a25d206f6a5f2b8e28","infoHashBuffer":{"type":"Buffer","data":[179,196,92,130,57,25,64,68,78,26,71,162,93,32,111,106,95,43,142,40]},"announce":[],"urlList":[]}}