{"title":"Fist [Myofist] - Thunder In Rock [Fleet Street] (1981)","uid":5184051,"size":84295942,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b3c9f73ffeaa72d22854b658cce080b6baa2e4ca&amp;dn=Fist+%5BMyofist%5D+-+Thunder+In+Rock+%5BFleet+Street%5D+%281981%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"duchessnukem","files":12,"time":1259385948,"description":"Double Or Nothing\nThunder In Rock\nLeather and Lace\nOn The Radio\nIt's Late\nBetter Way To Go\nEvil Cold\nFleet Street\nOpen The Gates\n\nMy rip from vinyl @ 320\nEnjoy!\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nfrom canadianbands.com:\n\nFormed in 1977 by Ottawa-born Ron Chenier, the singer/guitarist recruited his younger brother John on drums, Ed Eagan on keyboards and Jeff Nystrom on bass and began honing their chops doing small clubs in and around the Toronto area. The band quickly graduated to the 'B circuit', touring the eastern-Canadian/US areas for the next year and a half.\n\nThe group took their heavy approach to music into the studios and cut the independantly released ROUND ONE in the spring of '79. Raucous and raunchy, the band's sound was dominated by raw guitars with little studio-tampering. Produced by the Cheniers' brother Normand and done on the proverbial shoestring budget, the record failed to to gain the attention of radio execs. Held together by a tight drums/bass marriage, Eagan's keyboards rounded out what had become known live as one of Canada's most promising talents just the same. But with only a total of seven tracks, nothing from ROUND ONE was short enough to even be considered suitable for radio-play. Still, numbers like the lead-off &quot;Too Late&quot;, The erie &quot;Madness&quot; and &quot;Who Did You Love&quot; showed the band's penchant for writing hard-driving, simple yet complex songs. Still, the album went unnoticed by the critics.\n\nFist returned to the road and toured practically every corner of the eastern half of the continent for the next year. The band was signed to a deal with A &amp; M in the summer of 1980 and quickly returned to the studios. They emerged from Toronto's Amber Studios that fall and released HOT SPIKES. The band hired George Semkiw to produce the album, and a refined, yet still heavy sound that grabbed you by the balls was the result. The only difference between HOT SPIKES and its predecessor was the new album caressed them gently as well. Backed by songs like the anthemic cover of David Bowie's &quot;Rock n Roll Suicide&quot; and lead-off track &quot;Money&quot;, a song about the hussle and bussle of society's drive for materialism, HOT SPIKES showed a maturity, harnessed by Semkiw's experience working with such acts as Streetheart, Queen City Kids, Rough Trade and Harlequin. Other noteable cuts included &quot;Lord I Miss You&quot; and &quot;Teenage Love Affair&quot;. Chenier &amp; Nystrom's shared vocal duties gave the sound some dimension, and was a critical fave. Semkiw's work was recognized with two Juno nominations that year for production work.\n\nThe tours continued, with FIST seeing practically every province and state over the next year. However personnel problems caused the departure of Eagan shortly after tour's end, while the younger Chenier called it quits to pursue other interests. The band regrouped, and with new keyboardist Ivan Tessier and drummer Bob Patterson, released FLEET STREET in '81. The band's problems with A&amp;M began here, when the album was released as THUNDER IN ROCK in the US and in the UK, with a different cover. And because there was already a new band from rural England making waves named Fist, Chenier and company were re-named Myofist. All this would cause no end of confusion in later years, and endless red tape when it came to re-releases.\n\nRecorded in Toronto's Master's Workshop with a new studio team consisting of Steve Vaughn and Paul Massey the group hit paydirt with not one ... but two FM staples that summer. &quot;Double Or Nothing&quot; again showcased Chenier's talent for writing slick, driving guitar riffs, while &quot;Thunder In Rock&quot; was easily the year's best tune on the 'waves. With the clever addition of a sax solo, &quot;Thunder&quot; is probably most synonymous with Fist's music, if any song is at all. However, other killer cuts included &quot;It's Late,&quot; &quot;Open The Gates&quot;, the title track (complete with Sherlock Holmes excerpt) and &quot;Evil Cold&quot;. Backed by the album's success, the group took the show on the road again for the better part of the next two years, backing up Rush, Triumph, Girlschool, Toronto, Harlequin, Kim Mitchell, The Police and Heart. The very first 'Monsters of Rock' tour also featured Fist with Motorhead, Molly Hatchet and Krokus.\n\nFeaturing newcomer Dave MacDonald on vocals and guitars/keyboards, IN THE RED hit the shelves in February of '83. Produced by world renowned studio-guru Nick Blagona (Deep Purple, Rush) The single, &quot;If I'm Not Loved&quot;, along with the roaring lead-off &quot;When I'm Bad I'm Better,&quot; &quot;It Ain't Good&quot; and &quot;Street Fighting Heroes&quot; all pushed the band on another series of major tours with Molly Hatchet again and ZZ Top. But unhappy with the label's 'big wigs', Fist left A&amp;M the next year.","torrent":{"xt":"urn:btih:b3c9f73ffeaa72d22854b658cce080b6baa2e4ca","amp;dn":"Fist+%5BMyofist%5D+-+Thunder+In+Rock+%5BFleet+Street%5D+%281981%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3c9f73ffeaa72d22854b658cce080b6baa2e4ca","infoHashBuffer":{"type":"Buffer","data":[179,201,247,63,254,170,114,210,40,84,182,88,204,224,128,182,186,162,228,202]},"announce":[],"urlList":[]}}