{"title":"Project 2612 Soundtrack Archive [03/20/2011]","uid":6269334,"size":571737138,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b43ca52195b71cddba0c82327b5e73d29979dd52&amp;dn=Project+2612+Soundtrack+Archive+%5B03%2F20%2F2011%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Monkeymook","files":12331,"time":1301018187,"description":"This is the complete archive of VGMs, as of 03/20/2011 of the VGM soundtrack collection, hosted over at Project 2612.\n\nNot much to say.\n\nEach game soundtrack has its own folder, properly named, an IMAGE.PNG file of the title screen of each game inside, an .m3u file for each soundtrack, and a .txt file inside each folder that has been created by each ripper of each game detailing the soundtrack information.\n\nThere's still much to be done, and anyone who has experience with the VGM hacking tools Regen, Gens Tracer, or HazeMD, then please don't hesitate to lend a hand over at Pj2612 to rip some more soundtracks. We're still finding unused songs and sound bits through sound tests and hacking the ROMs' data, and the more help, the better.\n\nThe list of soundtracks that still need to be ripped can be found here (The list may be a bit outdated): http://project2612.org/phpbb3/viewtopic.php?f=2&amp;t=502\n\n\n\n\n\n\nWARNING: These files are NOT in mp3, m4a, FLAC, or ogg. If you want them in that format, you will need to get an encoder plugin, and put it in a suitable media player, such as xmPlay or Winamp, and convert the files.\n\nDepending on how many requests I get, I may make an entire torrent of these files in .mp3 format, and upload it as well.\n\n\n\nTo play and use these files, download either xmPlay or Winamp, and the in_vgm plugin, found here:\n\nEnjoy this torrent, and leave a comment if you like it or have any questions.","torrent":{"xt":"urn:btih:b43ca52195b71cddba0c82327b5e73d29979dd52","amp;dn":"Project+2612+Soundtrack+Archive+%5B03%2F20%2F2011%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b43ca52195b71cddba0c82327b5e73d29979dd52","infoHashBuffer":{"type":"Buffer","data":[180,60,165,33,149,183,28,221,186,12,130,50,123,94,115,210,153,121,221,82]},"announce":[],"urlList":[]}}