{"title":"The Fourth Protocol (1987) incl.opt.NLsubs","uid":5123385,"size":916854860,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b5c543e0d7eb26958508a94f1bc04438a65e465a&amp;dn=The+Fourth+Protocol+%281987%29+incl.opt.NLsubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnodde","files":-1,"time":1255473703,"description":"...........................The Fourth Protocol (1987)...........................\n\nIMDB: http://www.imdb.com/title/tt0093044/\n\nPlot:\nKGB agent, Major Valeri Petrofsky has been reassigned at the request of the KGB\nChairman for a secret mission, wherein he is sent to England to establish a\nresidence near an American Military base and receive various items for couriers\nfrom the USSR. John Preston is the top British spy catcher, currently he is at\nodds with his superior cause, he doesn't lick his boots. After a recent\noperation caused his superior some embarrassment, he is reassigned to the menial\ntask of overseeing airports and ports. One day one the couriers Petrofsky was\nexpecting had an encounter with customs which left him dead. Preston then went\nthrough his things and found that he was carrying a thing that is part of an\natomic bomb. Preston then suspects that someone is bringing in parts for an\natomic bomb, and after being shut down by his superior, he is given a reprieve\nby a higher official, and begins trying to find this person. And back in the\nUSSR, Petrofsky's boss is so disgruntled that Petrofsky has been taken from him\nthat he calls his old friend, the Vice-Chairman of the KGB to find out what's\ngoing on, cause he believed that the Chairman couldn't be able to do any of\nthese things without his friend's input. But his friend is just as incredulous\nas he is. So he tries to find out what the Chairman is up to.\n\nDuration: 01:54:12.07, bitrate: 1070 kb/s\nVideo: XviD, 25bps \nAudio: mp3, 48000 Hz, stereo, 112 kb/s\n\n.....!!!!!.....DON'T HIT AND RUN: KEEP SEEDING AFTER DOWNLOADING.....!!!!!.....\n","torrent":{"xt":"urn:btih:b5c543e0d7eb26958508a94f1bc04438a65e465a","amp;dn":"The+Fourth+Protocol+%281987%29+incl.opt.NLsubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5c543e0d7eb26958508a94f1bc04438a65e465a","infoHashBuffer":{"type":"Buffer","data":[181,197,67,224,215,235,38,149,133,8,169,79,27,192,68,56,166,94,70,90]},"announce":[],"urlList":[]}}