{"title":"Adam Faith - A's B's &amp; Ep's CD  to MP3 192 Kbit","uid":6234797,"size":79366586,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b5fe52adfd196860e0d3896fce10396730fc4bd7&amp;dn=Adam+Faith+-+A%5C%27s+B%5C%27s+%26+Ep%5C%27s+CD++to+MP3+192+Kbit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Iron_Horse","files":29,"time":1299826736,"description":"Adam Faith - A's B's &amp; Ep's\nCD (Emi 2003) To MP3 192 Kbit/s.\nIncluded CD Front Cover &amp; This Info.\n &lt;a href=&quot;\nhttp://www.adamfaith.org.uk/discog.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.adamfaith.org.uk/discog.php&lt;/a&gt;\n\n\nReview  by John Bush  Allmusic.com\nAn alternate look at the early career of Adam Faith, A's B's &amp; EP's presents most of the best singles of his career, along with a dozen tracks of period material that obviously doesn't rate as highly -- but does deserve a listen for listeners fascinated by completely of-their-time pop castoffs. EMI compiled many more A-sides than anything else, slotting nearly every one of his early hits -- &quot;What Do You Want?,&quot; &quot;Poor Me,&quot; &quot;Someone Else's Baby&quot; -- and used only a few B-sides or tracks from the flip side of his EPs. Faith's material from this time was spotty at best; even &quot;Someone Else's Baby,&quot; one of the biggest-performing singles of his career, featured several unfortunate vocal mannerisms that sound faintly embarrassing and a bit quaint by the dawning of the digital era.\n\n\nBiography  by Bruce Eder  Allmusic.com\nThe late '50s in England saw a legion of young teen idols, groomed for music stardom by managers eager to see their clients land a chart hit or two on their way to careers as all-around entertainers, or even television or movie actors. A few of them, like Cliff Richard and Billy Fury, were genuinely exciting rock &amp; rollers when they started out, although most were just playing at rock &amp; roll, and lacked the talent to make much lasting impact in any area of entertainment.\n\nAdam Faith was one of the better ones, a late-'50s/early-'60s singing star who went on to a respectable acting career in television, movies, and theater. Born Terence Nelhams in Acton, West London, he made his first appearances in public at the legendary 21's Coffee Bar in London's Soho. He came to the attention of producer Jack Goode, which, in turn, introduced Faith to bandleader John Barry (the music director of Goode's music showcase series Oh Boy! and the music director of the Drumbeat series), which resulted in the invitation to audition for a role in Drumbeat. Faith first emerged on the music scene on the Top Rank and HMV labels, but he saw little chart success until Drumbeat came along in 1959.\n\nFaith became an immediate star, with his matinee-idol looks and charismatic screen presence. He was signed to EMI's Parlophone label soon after he began work on Drumbeat. In November of 1959, he cut the single &quot;What Do You Want,&quot; which soared to number one on the British charts in the course of a 19-week run. With a pleasing, upbeat arrangement built around pizzicato strings and a sort of peppy variation of Elvis' scowling, mumbling demeanor, Faith's career at this point was closer to teen pop than rock &amp; roll, although his stuff is eminently listenable. His next single, &quot;Poor Me,&quot; was a better song and also reached number one, while his third, &quot;Somebody Else's Baby,&quot; got to number two. Although hardly cutting-edge rock &amp; roll (and one has to ignore singles like &quot;When Johnny Comes Marching Home&quot;), it was all pleasant, rather reminiscent of Buddy Holly songs like &quot;True Love Ways.&quot; The best of his singles was the John Barry co-authored &quot;Made You,&quot; which owes a bit to songs like &quot;Nervous Breakdown&quot; -- it also showed what Faith could do with a real, straight-ahead rock &amp; roll number.\n\nHe placed six songs in the Top Ten during 1960, and three more in 1961. His string of major hits was pretty much exhausted by the summer of 1962, just before the Beatles and the other Liverpool bands came along and changed the entire musical landscape, but he made one more run into the Top Ten in late 1963 with &quot;The First Time.&quot; Listening to this stuff, it's easy to understand why acts like the Beatles, not to mention ballsier, older rock &amp; rollers from Liverpool like Tony Sheridan and the Big Three held performers like Adam Faith in such contempt -- he could be lethally &quot;cute&quot; on novelty songs like &quot;Lonely Pup (In a Christmas Shop),&quot; a number four single over Christmas of 1960, and had no compunction about it.\n\nDespite his shortcomings as a rock &amp; roller, Faith left the post-Beatles era with one major gift in the form of his superb backing band, the Roulettes -- featuring future Argent members Russ Ballard and Bob Henrit -- who recorded some of the best music of the early British Invasion era. Beginning in 1963, they had a separate recording and performing career as well, including a series of superb recordings for EMI (available on BGO Records). Their records with Faith were also exceptionally good, and were among the last of his major hits. In 1965, Faith released his last new album, the concert recording Faith Alive, featuring him and the Roulettes, a surprisingly exciting and unretouched account of their work on-stage together.\n\nFaith's handful of early film appearances generally enhanced his musical image, most notably Beat Girl (1961), a fairly gritty British delinquency drama. He turned increasingly to acting on the stage during this period, and by the '70s he'd moved on to a career in business, with a successful finance company and a directorship of the Savoy Hotel. He returned to repertory theater work in the '70s and created the title role of the series Budgie, which he later brought to the stage. Faith also resumed his film career, most notably with a major supporting role in the 1975 Michael Apted movie Stardust, starring David Essex, the Roger Daltrey-starring vehicle McVicar (1980), and the television version of Murder on the Orient Express (1985). He also went into music management during the '70s, and the most important of his clients was Leo Sayer. Adam Faith died of a heart attack at age 62 on March 8, 2003, the day after becoming ill following a stage performance of Love and Marriage at Stoke-on-Trent, North Staffordshire, England.\n\nTracklist:\n01. What Do You Want  (24 Oct 1959)\n02. Poor Me  (1960)\n03. Someone Else's Baby  (1960)\n04. When Johnny Comes Marching Home  (1960)\n05. Wonderful Time  (1960)\n06. Diamond Ring  (1960)\n07. Summertime  (1960)\n08. Greenfinger  (1960)\n09. How About That  (1961)\n10. Easy Going Me  (1961)\n11. Who Am I  (1961)\n12. Lonely Pup (In A Christmas Shop)  (1961)\n13. Time Has Come  (1961)\n14. Help Each Other Romance  (1961)\n15. As You Like It  (1962)\n16. Face To Face  (1962)\n17. Don't That Beat All  (1962)\n18. Mix Me A Person  (1962)\n19. First Time  (1963)\n20. So Long Baby  (1963)\n21. We Are In Love  (1963)\n22. Made For Me  (1963)\n23. Message To Martha (Kentucky Bluebird)  (1964)\n24. It Sounds Good To Me  (1964)\n","torrent":{"xt":"urn:btih:b5fe52adfd196860e0d3896fce10396730fc4bd7","amp;dn":"Adam+Faith+-+A%5C%27s+B%5C%27s+%26+Ep%5C%27s+CD++to+MP3+192+Kbit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5fe52adfd196860e0d3896fce10396730fc4bd7","infoHashBuffer":{"type":"Buffer","data":[181,254,82,173,253,25,104,96,224,211,137,111,206,16,57,103,48,252,75,215]},"announce":[],"urlList":[]}}