{"title":"Pirates Of The Caribbean Trilogy DVDR - DivXNL-Team","uid":5599379,"size":2311338783,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b639041a952c4da97ad583d3e4e81b6e77ffec79&amp;dn=Pirates+Of+The+Caribbean+Trilogy+DVDR+-+DivXNL-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Koedje","files":-1,"time":1275215931,"description":"Pirates Of The Caribbean - The Curse Of The Black Pearl:\n\nVerenigde Staten\nActie / Avontuur\n143 minuten\n\ngeregisseerd door Gore Verbinski\nmet Johnny Depp, Geoffrey Rush en Orlando Bloom\n\nJack Sparrow, de afgedankte kapitein van het beroemde spookschip The Black Pearl, wil zijn schip terug. De nieuwe kapitein, Barbossa, ontvoert Elizabeth Swann tijdens ÃƒÂ©ÃƒÂ©n van hun veroveringen, omdat Elizabeth de enige lijkt die er voor kan zorgen dat de vloek van Cortez, die op Barbossa en zijn crew rust, wordt opgeheven. De ware persoon die de vloek kan opheffen is echter Will Turner, die smoorverliefd is op Elizabeth. En dus schakelt Will, om Elizabeth te redden, de enige in die de thuishaven van The Black Pearl kent: Kapitein Jack Sparrow.\n\nMoviemeter: http://www.moviemeter.nl/film/7177\nIMDB: http://www.imdb.com/title/tt0325980/\n\n\n\nPirates Of The Caribbean - Dead's Mans Chest:\n\n\nVerenigde Staten\nAvontuur / Actie\n150 minuten\n\ngeregisseerd door Gore Verbinski\nmet Johnny Depp, Orlando Bloom en Keira Knightley\n\nDe bruiloft van Will Turner en Elizabeth Swann wordt afgelast als beiden gearresteerd worden voor het helpen ontsnappen van Jack Sparrow. Will krijgt de kans zichzelf en zijn verloofde te redden van de strop, door het kompas dat Jack bij zich heeft te overhandigen aan de nieuwe Heer van Port Royal. Jack is ondertussen doodsbang voor Davy Jones, bij wie hij een schuld heeft staan. Jack's ziel wordt opgeÃƒÂ«ist door Davy Jones, als Jack de sleutel van een dodemanskist met daarin het hart van Davy Jones niet weet te bemachtigen. Maar Jack is niet de enige die belang heeft bij het vinden van de kist...\n\nMoviemeter: http://www.moviemeter.nl/film/31795\nIMDB: http://www.imdb.com/title/tt0383574/\n\n\n\nPirates Of The Caribbean - At World's End:\n\n\nVerenigde Staten\nActie / Avontuur\n168 minuten\n\ngeregisseerd door Gore Verbinski\nmet Johnny Depp, Orlando Bloom en Keira Knightley\n\nIn deze donkere tijden waarin piraten harteloos worden vermoord en piratenschepen genadeloos worden vernietigd, besluiten Kapitein Barbossa, Will Turner, Elizabeth Swann en de crew van de Black Pearl om naar het einde van de wereld te reizen om Kapitein Jack Sparrow te zoeken. Om daar te komen moeten ze eerst langs piraat Kapitein Sao Feng in het gevaarlijke, maar exotische Singapore, om zijn schip en de belangrijke landkaart te bemachtigen, dat hen naar het einde van de wereld zal brengen. Als Jack gevonden wordt, lijkt zijn gevangenschap hem nog gekker gemaakt te hebben. Toch stemt hij in om te helpen en vaart met succes The Black Pearl uit het Land van de Doden. Maar eenmaal onderweg stapelt het verraad zich op en wordt het duidelijk dat Jack, Will, Elizabeth, Sao Feng en Barbossa allemaal hun eigen plannen hebben en dat niemand te vertrouwen is. Toch moet iedere partij kiezen en een definitieve alliantie vormen voor ÃƒÂ©ÃƒÂ©n laatste slag. Zou dit het einde betekenen van de vrijheid op de zeven zeeÃƒÂ«n voor de piraten?\n\nMoviemeter: http://www.moviemeter.nl/film/38169\nIMDB: http://www.imdb.com/title/tt0449088/","torrent":{"xt":"urn:btih:b639041a952c4da97ad583d3e4e81b6e77ffec79","amp;dn":"Pirates+Of+The+Caribbean+Trilogy+DVDR+-+DivXNL-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b639041a952c4da97ad583d3e4e81b6e77ffec79","infoHashBuffer":{"type":"Buffer","data":[182,57,4,26,149,44,77,169,122,213,131,211,228,232,27,110,119,255,236,121]},"announce":[],"urlList":[]}}