{"title":"Lord of the Rings rewritten from Mordors Perspective The Last Ri","uid":6180719,"size":980829,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b63d89cde255364cec956e29de5fcb1a5803feec&amp;dn=Lord+of+the+Rings+rewritten+from+Mordors+Perspective+The+Last+Ri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"toblakai","files":1,"time":1297901335,"description":"Lord of the Rings rewritten from Mordors Perspective\n\nThe Last Ring-bearer\nMore than 15 years ago Russian scientist Kirill Yeskov tried to settle certain geographical problems in Tolkien's fantasy world. One thing led to another, and he tackled a bigger project - what if we assumed that it's no less real than our world? His conclusion was that in such a case, the story of the Ring of Power is most likely a much-altered heroic retelling of a major war - but what was that war really about?\n\nThe result of this re-appraisal was the publication in 1999 of &quot;The Last Ring-bearer&quot; - a re-thinking of Tolkien's story in real-world terms. Dr. Yeskov, a professional paleontologist whose job is reconstructing long-extinct organisms and their way of life from fossil remnants, performs essentially the same feat in &quot;The Last Ring-bearer&quot;, reconstructing the real world of Tolkien's Arda from The Lord of the Rings - the heroic tales of the Free Men of the West written in that world. We have a pretty good idea how well heroic tales map to reality from our own world...\n\nI was impressed enough by this work to spend a few dozen lunch hours translating it to English. (Reportedly, some publishing houses have considered a commercial translation of this book, which had been published in several major European languages, but abandoned the idea out of fear of the Tolkien estate, which rigidly controls all derivative works, especially in English. This translation is non-commercial.) I have been fortunate to establish communication with the author and have the translation vetted (and much corrected) by him. I now offer this work for your perusal. At 139,000 words, this 1 Mb PDF is about 80% of the length of The Fellowship of the Ring. Suggestions for corrections will be appreciated. Please mention how you heard about this translation when commenting.\n\n(I have to disappoint the fans of Sauron: His Majesty Sauron the VIII rates only a few mentions in this work, having been nothing more than an enlightened king. Nor does the Ring of Power rate more than a passing mention.)\n\nI am now working on a second edition, with some corrections (very few, the author was thorough) and, hopefully, smoother prose.\n\nMore Information here:\n\n &lt;a href=&quot;\nhttp://www.salon.com/books/laura_miller/2011/02/15/last_ringbearer/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.salon.com/books/laura_miller/2011/02/15/last_ringbearer/index.html&lt;/a&gt; ","torrent":{"xt":"urn:btih:b63d89cde255364cec956e29de5fcb1a5803feec","amp;dn":"Lord+of+the+Rings+rewritten+from+Mordors+Perspective+The+Last+Ri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b63d89cde255364cec956e29de5fcb1a5803feec","infoHashBuffer":{"type":"Buffer","data":[182,61,137,205,226,85,54,76,236,149,110,41,222,95,203,26,88,3,254,236]},"announce":[],"urlList":[]}}