{"title":"Genesis - Three Sides Live resequenced and expanded ","uid":6235993,"size":1134336240,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b6c689732c652cd7d67033a95fd47a17fcf589ba&amp;dn=Genesis+-+Three+Sides+Live+resequenced+and+expanded+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"}{eywood","files":32,"time":1299874083,"description":"Created by Ratio: 0.46HeywoodPeace 16 hours ago\nMusic : Rock : Other quality\nThis is a new expanded version of the Three Sides Live album with altered sequencing and additional tracks. The recordings on this were done on the 1980 and 1981 tours for Duke and Abacab. The studio tracks that made up the fourth side of the vinyl version have been removed and placed with their respective albums. There are two songs not continguous with this era included on Three Sides Live: &quot;The Fountain Of Salmacis&quot; from 1978 and &quot;It/Watcher Of The Skies&quot; from 1976. I was going to cut these too, but &quot;Fountain...&quot; is flawlessly connected to &quot;One For The Vine&quot;, so I left them.\nI have used the Abacab tour setlist as the basis for the sequencing and attempted to keep the running order of songs from that tour in order as close as possible. Several songs played on that tour are not available so they have been replaced with songs from the &quot;Duke&quot; tour (in most cases). The additional songs on this not found on the original Three sides Live CD are from the Archive 2 box set (marked with an asterisk (*) and from the Perfect Three sides Live bootleg (marked with a plus (+). Recording dates are as follows:\n\n01 Behind The Lines (Nassau Coliseum, Long Island, NY 11/29/81)\n02 Duchess (Nassau Coliseum, Long Island, NY 11/29/81)\n03 The Lady Lies (Lyceum Theatre, London 5/6/80)*\n04 Keep It Dark (Nassau Coliseum, Long Island, NY 11/29/81)+\n05 Dodo/Lurker (Birmingham NEC, London 12/23/81)\n06 Abacab (Birmingham NEC, London 12/23/81)\n07 Follow You Follow Me (Lyceum Theatre, London 5/6/80)\n08 Me &amp; Sarah Jane (Birmingham NEC, London 12/23/81)\n09 Misunderstanding (Savoy Theater, NYC 11/28/81)\n10 No Reply At All (Nassau Coliseum, Long Island, NY 11/29/81)*\n11 Firth Of Fifth (Nassau Coliseum, Long Island, NY 11/29/81)+\n12 Ripples (Lyceum Theatre, London 5/6/80)*\n13 Man On The Corner (Nassau Coliseum, Long Island, NY 11/29/81)*\n14 One for The Vine (Theatre Royal, Drury Lane, London 5/5/80)\n15 The Fountain Of Salmacis (The Summit, Houston TX 10/22/78)\n16 Medley - In The Cage-The Cinema Show-Riding the Scree-The Cinema Show-The Colony of Slippermen (Birmingham NEC, London 12/23/81)\n17 Afterglow (Birmingham NEC, London 12/23/81)\n18 Duke's Travels/Duke's End (Lyceum Theatre, London 5/7/80)*\n19 Deep In The Motherlode (Theatre Royal, Drury Lane, London 5/5/80)*\n20 It/Watcher Of The Skies (Apollo Theatre, Glasgow, Scotland 7/8/76)\n21 Turn It On Again (Nassau Coliseum, Long Island, NY 11/29/81)\n22 Dance On A Volcano (Nassau Coliseum, Long Island, NY 11/29/81)+\n23 Drum Duet (Nassau Coliseum, Long Island, NY 11/29/81)+\n24 Los Endos (Nassau Coliseum, Long Island, NY 11/29/81)+\n\nNotes: The five songs from the Perfect Three Sides Live bootleg are originally sourced from mp3s taken from a vinyl source that I declicked. Some artifacts of the record still remain. I have been unable to locate a lossless source for this, hence the use of mp3s for the mastering. I want this to be perfectly clear that there are lossy sources mixed with lossless on this one. I have listed it under &quot;other quality&quot; for that reason.\nAlthough I was going to make this one continuous concert the version of &quot;Man On The Corner&quot; on Archive 2 fades out at the end. Fortunately this fade occurs about half-way through the set, so it worked out conveniently as if there was an intermission.\n\n--}{eywood 9-30-10\n","torrent":{"xt":"urn:btih:b6c689732c652cd7d67033a95fd47a17fcf589ba","amp;dn":"Genesis+-+Three+Sides+Live+resequenced+and+expanded+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6c689732c652cd7d67033a95fd47a17fcf589ba","infoHashBuffer":{"type":"Buffer","data":[182,198,137,115,44,101,44,215,214,112,51,169,95,212,122,23,252,245,137,186]},"announce":[],"urlList":[]}}