{"title":"Crack Analysis in Structural Concrete - Theory and Applications ","uid":5134904,"size":20435388,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b6e5badb29d5e61ac4cb828fa6a265440128b06e&amp;dn=Crack+Analysis+in+Structural+Concrete+-+Theory+and+Applications+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1256404115,"description":"ht tp://i37.tiny pic.com/14tvxgh.jpg\n\nCrack Analysis in Structural Concrete: Theory and Applications\nPublisher: Butterworth |Pages: 344 | 2009-07-09 | ISBN 0750684461 | PDF\n\nThis new book on the fracture mechanics of concrete focuses on the latest developments in computational theories, and how to apply those theories to solve real engineering problems. Zihai Shi uses his extensive research experience to present detailed examination of multiple-crack analysis and mixed-mode fracture.\n\nCompared with other mature engineering disciplines, fracture mechanics of concrete is still a developing field with extensive new research and development. In recent years many different models and applications have been proposed for crack analysis; the author assesses these in turn, identifying their limitations and offering a detailed treatment of those which have been proved to be robust by comprehensive use.\n\nAfter introducing stress singularity in numerical modeling and some basic modeling techniques, the Extended Fictitious Crack Model (EFCM) for multiple-crack analysis is explained with numerical application examples. This theoretical model is then applied to study two important issues in fracture mechanics - crack interaction and localization, and fracture modes and maximum loads. The EFCM is then reformulated to include the shear transfer mechanism on crack surfaces and the method is used to study experimental problems.\n","torrent":{"xt":"urn:btih:b6e5badb29d5e61ac4cb828fa6a265440128b06e","amp;dn":"Crack+Analysis+in+Structural+Concrete+-+Theory+and+Applications+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6e5badb29d5e61ac4cb828fa6a265440128b06e","infoHashBuffer":{"type":"Buffer","data":[182,229,186,219,41,213,230,26,196,203,130,143,166,162,101,68,1,40,176,110]},"announce":[],"urlList":[]}}