{"title":"Mario feat. Gucci Mane &amp; Sean Garrett - Break Up","uid":5081984,"size":161980420,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b90bbbb4d6488e8c222090cb6a86f23966386f92&amp;dn=Mario+feat.+Gucci+Mane+%26+Sean+Garrett+-+Break+Up&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1252396300,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Break Up&quot; is the first single from Mario's fourth studio album D.N.A., it features Gucci Mane and Sean Garrett. The lead single was produced by Bangladesh, written by Sean Garrett and Shondrae Crawford, mixed by Fabian. The single was first premiered on the radio station V-103 at March 30, 2009 with Greg Street.\n\nThe music video for &quot;Break Up&quot; was shot in in the second week of June, as Sean Garrett stated, most of the video was filmed in an new complex, which boasted top of the line architecture, was on the harbor, and had a view of the city of Baltimore with director Chris Robinson.The scenes that were shot on the bedroom was actually Mario's bedroom from his house and Mario stated he felt a little feeling of invasion of privacy because hes not used to being with a girl in bed while having cameras around. Audra, from new girl group RichGirl, is the girl who plays the role of Mario's girlfriend who wants to break up with him.In the video it is shown that they argue and he isn't a trustworthy boyfriend to her,as he is seen flirting with another girl in a club. Although he still trys to look for her remarking in the song that although he cheats he loves her. Brave (Christina Williams), from RichGirl, also makes a short appearance in which it shows her and Audra catching Mario in the act with another girl.On May, Mario stated that the video was coming soon. On July 2, Mario announced on his twitter that he would be on 106 &amp; Park to premiere the music video, although the video didn't premiered and is set to premier on the following week. On July 7, was announced on his website that the music video premiered on 9 of July exclusively on World Star Hip Hop. On the video, the explicit words from the verses by Gucci Mane are changed.In the song, &quot;B****&quot; is said before &quot;straight&quot;, in the first verse. In the second, and last verse, the infamous f-word is said after &quot;now&quot;, which is repeated twice.\n\nThe song quickly rose on BET 106 &amp; Park countdown show it debuted at number 10. Moving to number 7. On July 22 the video moved up to number 3 on the countdown. By the end of the week, the video went to number 1 on the countdown.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:b90bbbb4d6488e8c222090cb6a86f23966386f92","amp;dn":"Mario+feat.+Gucci+Mane+%26+Sean+Garrett+-+Break+Up","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b90bbbb4d6488e8c222090cb6a86f23966386f92","infoHashBuffer":{"type":"Buffer","data":[185,11,187,180,214,72,142,140,34,32,144,203,106,134,242,57,102,56,111,146]},"announce":[],"urlList":[]}}