{"title":"Flikken Seizoen 8 dvd 3 (Dutch) TBS","uid":6278489,"size":4519794557,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b9b0beb065f788b5b1e33d2854b671667040542c&amp;dn=Flikken+Seizoen+8+dvd+3+%28Dutch%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mad_Parrot","files":-1,"time":1301350304,"description":"\n\n\nFlikken Seizoen 8 dvd 3\n\n\n\nDe serie werd gecreÃƒÂ«erd door scenarioschrijver Pierre De Clercq en producent Erwin Provoost en was een coproductie van het productiehuis MMG en VRT en, seizoen 5 en 6, ook de Nederlandse TROS.\n\nDe serie Flikken heeft de Vlaamse stad Gent als achtergronddecor. Het lokale politieteam staat centraal in de serie en niet een of twee hoofdpersonages. De makers hadden bij aanvang van de serie zoveel vertrouwen in de serie, dat de opnames voor de tweede reeks in 1998 al begonnen waren, voordat de eerste aflevering uitgezonden was. \nIn de eerste reeks was er geen doorlopend verhaal tussen de verschillende afleveringen, dit volgde pas in de latere reeksen. Zo gingen de flikken, bijgestaan door de Nederlandse rechercheur Robert Nieuwman (Boudewijn de Groot), in 2004 op zoek naar de seriemoordenaar Luc Feiremans.\n\nIn april 2007 maakte de Vlaamse omroep VRT bekend dat het tiende seizoen van Flikken het laatste zou zijn. De financiÃƒÂ«n speelden hierbij een rol. De serie kostte veel geld, terwijl de VRT veel andere fictiereeksen op de rol had staan. \nHet slotseizoen, dat overigens maar tien afleveringen heeft in plaats van de gebruikelijke dertien, werd van 15 februari tot 19 april 2009 uitgezonden op ÃƒÂ©ÃƒÂ©n.[1]\n\nOm Flikken een waardige afsluiter te geven werd er op zaterdag 18 april 2009 in Gent een Flikkenparty georganiseerd. Op het einde van de dag kon in Kinepolis Gent de laatste Flikken-aflevering in avant-premiÃƒÂ¨re bekeken worden.\n\nSinds september 2007 zendt de TROS een Nederlandse versie van Flikken uit, Flikken Maastricht. Deze serie is qua cast kleinschaliger dan de originele serie.\n\n99 &quot;Verraad&quot; 24 maart 2007 8.08 \nJohn is druk bezig zijn stiefzoon terug te vinden. Bruno heeft de laatste dagen voor zijn verdwijning zijn naam veranderd van Soetaert naar Nauwelaerts. Er wordt ook een student David Caron opgepakt die verdere verduidelijking geschept in het onderzoek voor het team inruil voor anonimiteit.  \n\n100 &quot;100 kilo&quot; 31 maart 2007 8.09 \nMortelmans komt met een nog niet gepubliceerd artikel dat er corruptie binnen het team is. Hij verdenkt John van de corruptie. Mortelmans heeft zo zijn bronnen. Het team probeert deze te achterhalen. Het blijkt een bekende die uit is op wraak.  \n\n101 &quot;Geruchten&quot; 8 april 2007 8.10 \nHet team wordt van de zaak rond de Barracudabende en Immoportus gehaald omdat het boven hun pet groeit als lokale politie. Met lede ogen wordt toegekeken hoe de federale politie met hen dossier aan de haal gaat. John moet tijdelijk de leiding afstaan in verband met emotionele betrokkenheid omtrent de verdwijning van Bruno. Pasmans neemt zijn taken waar als ad interim en probeert opnieuw toch het initiatief in de Barracudazaak terug te trekken naar het lokale Gentse team.  \n\n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : ISO \nBron          : Retail\nMenu          : Ja\nExtra's       : Ja\nAudio         : Nederlands\nOndertitels   : Nederlands (instelbaar)\nCover &amp; label : Ja\nGenre         : Actie\n \n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Flikken_(televisieserie)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Flikken_(televisieserie)&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.een.be/programmas/flikken&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.een.be/programmas/flikken&lt;/a&gt;\n\n\n\nBrought to you by TinkerBell @ TBS","torrent":{"xt":"urn:btih:b9b0beb065f788b5b1e33d2854b671667040542c","amp;dn":"Flikken+Seizoen+8+dvd+3+%28Dutch%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9b0beb065f788b5b1e33d2854b671667040542c","infoHashBuffer":{"type":"Buffer","data":[185,176,190,176,101,247,136,181,177,227,61,40,84,182,113,102,112,64,84,44]},"announce":[],"urlList":[]}}