{"title":"Passmark WirelessMon Pro 3.1 build 1000+(serial) [Bit-Byte]","uid":5045533,"size":2514785,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b9e749c89134f64611c42d624c7673a37788e9fb&amp;dn=Passmark+WirelessMon+Pro+3.1+build+1000%2B%28serial%29+%5BBit-Byte%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ProDvDRipper","files":2,"time":1249607608,"description":"WirelessMon is a software tool that allows users to monitor the status of wireless WiFi adapter(s) and gather information about nearby wireless access points and hot spots in real time. WirelessMon can log the information it collects into a file, while also providing comprehensive graphing of signal level and real time IP and 802.11 WiFi statistics.\n\nAny wireless adapter complies with the NDIS_802.11 should be able to report information to WirelessMon. Note that only Windows XP, 2003 and Vista support this software. Windows 95, 98 and NT are not supported. Windows 2000 (Service pack 4 and above) may work but is not actively supported.\n\nAll the various IEEE 802.11 standards are supported, including 802.11a, 802.11b and 802.11g. 802.11N is supported to the extent provided by Windows XP and Vista, as the draft becomes a completed standard more 802.11N support should become available. Some features may not be supported by some wireless adapters, typically they will report only partial information in this case. It has been also been noted that several wireless adapter manufacturers are not providing device drivers that are fully Windows compliant.\n\nKey features for &quot;PassMark WirelessMon Pro 3.1&quot;\n* Verify 802.11 network configuration is correct.\n* Test WiFi hardware and device drivers are functioning correctly.\n* Check signal levels from your local WiFi network and nearby networks.\n* Help locate sources of interference to your network.\n* WirelessMon supports the MetaGeek Wi-Spy (2.4i, 2.4x and DBx) useful for finding interference from non 802.11A/B/G devices transmitting on the same frequencies\n* Scan for hot spots in your local area (wardriving)\n* Create signal strength maps of an area\n* GPS support for logging and mapping signal strength\n* Correctly locate your wireless antenna (especially important for directional antennas).\n* Verify the security settings for local access points.\n* Measure network speed &amp; throughput and view available data rates.\n* Help check Wifi network coverage and range\n\n\n\n\n\n*installation*\n1.Unpack with any archiver\n2.Install setup.exe\n3.copy and paste register wirelessmon\nin the installer folder run it register with\nserial from serial text done\n4.Enjoy!","torrent":{"xt":"urn:btih:b9e749c89134f64611c42d624c7673a37788e9fb","amp;dn":"Passmark+WirelessMon+Pro+3.1+build+1000%2B%28serial%29+%5BBit-Byte%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9e749c89134f64611c42d624c7673a37788e9fb","infoHashBuffer":{"type":"Buffer","data":[185,231,73,200,145,52,246,70,17,196,45,98,76,118,115,163,119,136,233,251]},"announce":[],"urlList":[]}}