{"title":"George y el Dragon[DVDRip][Spanish].avi","uid":6262827,"size":717107200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ba7a5d93d348c99309ad178043ec68582b257546&amp;dn=George+y+el+Dragon%5BDVDRip%5D%5BSpanish%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"erato99","files":1,"time":1300804481,"description":"Calidad del video: DVD RIP\nPeso: 684 mb\nIdioma del audio: EspaÃƒÂ±ol\n\nEn la Inglaterra del S.XII, el agraciado caballero andante George (James Purefoy) acaba de volver de Las Cruzadas para conseguir alcanzar por fin su sueÃƒÂ±o de una vida en paz, ocupÃƒÂ¡ndose de sus tierras. Sin embargo, para poder tomar posesiÃƒÂ³n definitiva de tales tierras de la mano del rey Edgaar (Simon Callow), deberÃƒÂ¡ ayudar a encontrar a la hija del rey, la princesa Luna (Piper Perabo), desaparecida misteriosamente. Para ello se une a Garth de Guerney (Patrick Swayze), el prometido de Luna, en una partida de bÃƒÂºsqueda, que inmediatamente se verÃƒÂ¡ envuelta en una refriega. Luna es hallada, no secuestrada, sino guardando el huevo de un dragÃƒÂ³n, y eso desata una batalla de voluntades entre Luna y George a propÃƒÂ³sito del destino del huevo. George quiere destruirlo; Luna, por el contrario, salvarlo. Mientras tanto, un grupo de mercenarios se une tras la pista del dichoso huevo. Garth estÃƒÂ¡ contrariado por la falta de entusiasmo de Luna por contraer matrimonio con ÃƒÂ©l, por lo que acaba raptÃƒÂ¡ndola como parte de un plan para hacerse con el trono de la naciÃƒÂ³n. George, Garth y los mercenarios se verÃƒÂ¡n finalmente librando una batalla final, a la que se unen los lugareÃƒÂ±os leales al rey. La batalla es interrumpida por la llegada de la madre del pequeÃƒÂ±o dragÃƒÂ³n, que llega tirando abajo las paredes del castillo. De las ruinas emergerÃƒÂ¡ George blandiendo una lanza ensangrentada, naciendo la leyenda de &quot;George, el matador de dragones&quot;.\n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:ba7a5d93d348c99309ad178043ec68582b257546","amp;dn":"George+y+el+Dragon%5BDVDRip%5D%5BSpanish%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba7a5d93d348c99309ad178043ec68582b257546","infoHashBuffer":{"type":"Buffer","data":[186,122,93,147,211,72,201,147,9,173,23,128,67,236,104,88,43,37,117,70]},"announce":[],"urlList":[]}}