{"title":"Dragonforce - Through The Fire and the Flames","uid":5003854,"size":174348292,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bab0db25b0152862fb33bae6f8eba8b4bdb8aa24&amp;dn=Dragonforce+-+Through+The+Fire+and+the+Flames&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1247641961,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Through the Fire and Flames&quot; is a song by English power metal band DragonForce. The song is acclaimed as the most successful song by the band. The song is a single as well as the opening track from DragonForce's third album, Inhuman Rampage, and features rapid twin guitar solos by Herman Li and Sam Totman.\n\nThe song peaked at #86 on the Billboard Hot 100 and #61 on the Canadian Hot 100. The song has appeared on two compilation albums. It is featured as an unlockable bonus song in the rhythm game Guitar Hero III: Legends of Rock, and is regarded as the most difficult song in the Guitar Hero series. It is in the the main setlist of Guitar Hero: Smash Hits. The song is also featured in Konami's band session arcade game, &quot;GuitarFreaks &amp; DrumMania V6&quot;. It is also one of the most popular songs used by Audiosurf players.\n\nThe track was used in the first music video by DragonForce. For the video, a shortened version of the song was used, lasting just over five minutes.\n\nDuring the guitar solos, the camera focuses on Herman Li and Sam Totman, with an inset shot of whoever is currently playing. During Herman Li's solos, Totman stands to Herman's left drinking. At the start of the solo, a Pac-Man sound is played by Herman, after which the whammy bar that was used to make this sound is thrown in the air.\n\nNear the end, five shots of each band member are shown, each one from a different angle. At the very end, the camera zooms away from the band, the same way it zooms into them at the beginning.\n\nThe music video circulated throughand various music video channels, including MTV2, and was shown on monitor screens during the band's performances at Ozzfest 2006.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:bab0db25b0152862fb33bae6f8eba8b4bdb8aa24","amp;dn":"Dragonforce+-+Through+The+Fire+and+the+Flames","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bab0db25b0152862fb33bae6f8eba8b4bdb8aa24","infoHashBuffer":{"type":"Buffer","data":[186,176,219,37,176,21,40,98,251,51,186,230,248,235,168,180,189,184,170,36]},"announce":[],"urlList":[]}}