{"title":"Daniel-Organized Christianity's Prostitution Cover-Up","uid":5010225,"size":433711,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bac4bc307c42d59cd3c86e86dd5d5a874aaf3e21&amp;dn=Daniel-Organized+Christianity%5C%27s+Prostitution+Cover-Up&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1247948057,"description":"This is John Daniel's revealing booklet Organized Christianity's Prostitution Cover-Up and the Da Vinci Code's False Messiah Connection which clearly shows how the early Christians were persecuted by the pagan Roman emperors until Emperor Constantine and Bishop Eusebius obviously &quot;cut a deal' in order to make &quot;Organized Christianity&quot; (i.e. Roman Catholicism) the State religion. The few true Christians who survived the various anti-Christian persecutions had gone &quot;underground&quot; or had fled to mountains and wilderness areas. This left a paganized &quot;Christian&quot; organization, now called Roman Catholicism, as a &quot;pretender&quot; claiming to be the one, true Church of Jesus Christ. And when the Roman Empire fell, the Roman Catholic Church moved into the power vacuum, and basically assumed all the titles and power of the Roman Emperor, the Pontifex Maximus! Also explains how this organized Church assumed the &quot;mantle&quot; of the Roman Pontifex Maximus when the Roman Empire fell, and began to persecute true Christians - wiping out hundreds and hundreds of thousands of them through the &quot;Holy Inquisition&quot;, crusades, and every genocide ever made against man; how this organized Church will soon reach the pinnacles or power she once held in Europe when her popes ruled over kings, and will once again launch yet another episode of murdering any and all who dare question her &quot;right&quot; to rule this planet! 20 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:bac4bc307c42d59cd3c86e86dd5d5a874aaf3e21","amp;dn":"Daniel-Organized+Christianity%5C%27s+Prostitution+Cover-Up","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bac4bc307c42d59cd3c86e86dd5d5a874aaf3e21","infoHashBuffer":{"type":"Buffer","data":[186,196,188,48,124,66,213,156,211,200,110,134,221,93,90,135,74,175,62,33]},"announce":[],"urlList":[]}}