{"title":"Aretha Franklin - Through The Storm [1989, 320 kbps]","uid":4999751,"size":93709604,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:badc96b26db28eac27766c4563c75879aa34b0f7&amp;dn=Aretha+Franklin+-+Through+The+Storm+%5B1989%2C+320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"musicalibera","files":16,"time":1247463353,"description":"ARETHA FRANKLIN - Through The Storm\n\nCodec: mp3.\nDescription: MPEG-1 Audio Layer 3.\nBit rate: 320 kbps.\nSample rate: 44100 Hz joint stereo.\nTags: ID3V1 &amp; ID3V2.\nSource format: CD.\nNumber of tracks 8.\n\nAllmusic.com review:\n&quot;Having scored in the recent past with producer Narada Michael Walden and some star duets, Franklin and Arista turned out another album with the same approach but less successful results. The title duet with Elton John went Top 20, but its followup, &quot;It Isn't, It Wasn't, It Ain't Never Gonna Be&quot; was an embarrassing failure for both Franklin and the previously pop-perfect Whitney Houston. The rest was even less distinguished, including a song with The Four Tops and Kenny G and a remake of the old hit &quot;Think.&quot; \n\nNow there's an unfair review if I ever saw one; in Europe &quot;Through The Storm&quot; still today counts as one of the biggest hits for both Aretha and Elton, and I personally think that the updated version of &quot;Think&quot; (produced by Arif &amp; Joe Mardin) rocks! OK, the duet with Whitney Houston may not have been the gargantuan commercial hit everybody expected it to be, correct - but judging by their giggles Aretha and Whitney themselves at least had a very good time in the studio recording the track! And ferchrissakes it's Ree! She - unlike most soul divas 20, 30 or 40 years her junior - can sing the telephone book and make it swing like there's no tomorrow! And music legends like Aretha, Whitney, Arif Mardin, James Brown AND The Four Tops, all on the very same album - how often does that happen? It will, for obvious reasons, never happen again..... So, sorry, but I beg to differ; an album not to be missed, especially if you enjoyed the first two with Narada Michael Walden (&quot;Who's Zoomin' Who?&quot; and &quot;Aretha (1986)&quot;). Go put your thinking cap back on Allmusic.\n\nTRACK LIST\n\nThrough The Storm\n=================\n01. Gimme Your Love  (Duet with James Brown)\n02. Mercy  \n03. He's The Boy \n04. It Isn't, It Wasn't, It Ain't Never Gonna Be  (Duet with Whitney Houston)\n05. Through The Storm  (Duet with Elton John)\n06. Think [1989] \n07. Come To Me \n08. If Ever A Love There Was  (Featuring The Four Tops &amp; Kenny G.)\n\nEnjoy - and thanks for seeding.","torrent":{"xt":"urn:btih:badc96b26db28eac27766c4563c75879aa34b0f7","amp;dn":"Aretha+Franklin+-+Through+The+Storm+%5B1989%2C+320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"badc96b26db28eac27766c4563c75879aa34b0f7","infoHashBuffer":{"type":"Buffer","data":[186,220,150,178,109,178,142,172,39,118,108,69,99,199,88,121,170,52,176,247]},"announce":[],"urlList":[]}}