{"title":"Metric - Gimme Sympathy","uid":4986806,"size":129538052,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bb28aa1052deb1f577107f9e81aa96fa3d6874f6&amp;dn=Metric+-+Gimme+Sympathy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1246762371,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Gimme Sympathy&quot; is the third single from Canadian rock group Metric's fourth studio album Fantasies. The song was released for radio airplay in March 2009.\n\nThe music video for Gimme Sympathy was filmed at The Sound Academy in Toronto, Ontario. It is a one-shot style video, very similar to Feist's music videos for The Reminder. It starts off with Haines getting ready for a concert backstage. The camera then follows her as she makes her way to the microphone. The three other band members are playing their instruments and as the video progresses, they all change outfits and instruments off screen and by the end they are all back to their starting positions. The video concludes ends with several children running into the room dressed as butterflies and pretending to float out of it again, and fades to white.\n\nThe song was written by Emily Haines and Jimmy Shaw and produced by John O'Mahony. It was one of the first songs written for Fantasies, and was written at Bear Creek Studios just outside of Seattle.\n\nThe band recorded the song as an acoustic version (during the filming of The Rawside Of...Metric), and gave it to fans who pre-ordered any of the packages of for the new album, along with Help I'm Alive and Jimmy Shaw's cover of Nobody Home by Pink Floyd.\n\nThe song's name is taken from two Rolling Stones songs: Gimme Shelter and Sympathy For The Devil. It also references the Stones and The Beatles in the chorus (&quot;Who would you rather be?/The Beatles or the Rolling Stones&quot;); Here Comes The Sun (a Beatles song) is also referenced.\n\nThe lyrical content of the song encourages taking chances in life and not worrying about the effects of our decisions (&quot;you're gonna make mistakes; you're young&quot;). The narrator reflects on her life, all the chances she took; and where her decisions have taken her now . She is aware of death, and though most of the time she does not acknowledge it, during hard times she wants to be reminded of something brighter (&quot;play me something like 'here comes the sun'&quot;).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:bb28aa1052deb1f577107f9e81aa96fa3d6874f6","amp;dn":"Metric+-+Gimme+Sympathy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb28aa1052deb1f577107f9e81aa96fa3d6874f6","infoHashBuffer":{"type":"Buffer","data":[187,40,170,16,82,222,177,245,119,16,127,158,129,170,150,250,61,104,116,246]},"announce":[],"urlList":[]}}