{"title":"The Skeleton Key (DVDR)(multi) 2Lions-Team","uid":5186389,"size":4511413273,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:bb69ed1309578c06b68832833934f05686c36da7&amp;dn=The+Skeleton+Key+%28DVDR%29%28multi%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"de_spijker","files":-1,"time":1259491234,"description":"The Skeleton Key       \n\n \n  Verenigde Staten\nDrama / Thriller\n104 minuten\n\ngeregisseerd door Iain Softley\nmet Kate Hudson, Gena Rowlands en Peter Sarsgaard\n\nVerpleegster Caroline (Kate Hudson) verzorgt een oude vrouw en haar zeer zieke man. Ze wonen in een oud herenhuis en ze houden er vreemde gewoonten op na. Wanneer Caroline een loper krijgt van de vrouw des huizes, komt ze er al snel achter dat 1 deur in het huis niet te openen is... Menue: Ja. Audio: Engels AC3 2CH. SUBS: NL instelbaar. Cover: Plaatje. NZB: wordt meegepost. Bestand: VTS. Er wordt 10% blocks par meegepost,dit is niet mijn rip,alle credits naar de originele poster.Veel plezier met deze. Grtz. Charlie.\n\nEnglish\n\nCaroline is a twenty-five-year-old hospice worker who cares for the ailing and the elderly, a job designed to atone for her own mistake for ignoring her dying father in the past, when she had been a rock 'n' roll manager. After her latest charge passes away, Caroline takes a job in Louisiana, caring for Ben, a stroke-victim who is bed-ridden and cannot speak. But Caroline becomes suspicious of the house, and Ben's cold wife, Violet only adds to the creepy atmosphere. After acquiring a skeleton key, Caroline makes her way into a secret room within the attic where she discovers hair, blood, bones, spells, and other instruments for practicing hoodoo. Violet says she has never been in the secret room, but that the items probably belonged to the original owners' two houseworkers, who practiced black magic and were lynched as a result. Noting that Ben had his stroke in the attic after entering the room, Caroline is determined to unlock the secrets of the house, and rescue Ben from the horrors that hold him captive within.\n\n\nCategorie : Beeld \nFormaat : DVD5 pal\nBron : Retail\nAudio : English, Hungarian 5.1\nOndertitels : English, Hungarian, Dutch, Danish, Finnish, Hebrew, Icelandic, Norwegian, Swedish,\nMenu : Yes\nExtra: Yes\n\n \nGenre : Drama\nThriller\n \nWeblink : http://www.moviemeter.nl/film/28431\nWeblink : http://www.imdb.com/title/tt0397101 \n\n \n\n","torrent":{"xt":"urn:btih:bb69ed1309578c06b68832833934f05686c36da7","amp;dn":"The+Skeleton+Key+%28DVDR%29%28multi%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb69ed1309578c06b68832833934f05686c36da7","infoHashBuffer":{"type":"Buffer","data":[187,105,237,19,9,87,140,6,182,136,50,131,57,52,240,86,134,195,109,167]},"announce":[],"urlList":[]}}