{"title":"New Police Story[DVDRip](spanish).","uid":5093601,"size":782815232,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bb892e8432f7e55a1a66ceb33d5dccda927bad42&amp;dn=New+Police+Story%5BDVDRip%5D%28spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"zurera","files":1,"time":1253360784,"description":"DirecciÃƒÂ³n: Benny Chan.\nPaÃƒÂ­s: China.\nAÃƒÂ±o: 2004.\nDuraciÃƒÂ³n: 123 min.\nGÃƒÂ©nero: AcciÃƒÂ³n, drama.\nInterpretaciÃƒÂ³n: Jackie Chan (Wing), Nicholas Tse (Fung), Charlie Yeung (Ho Yee), Charlene Choi (Sa Sa), Daniel Wu (Joe), Dave Wong (Sam), Andy On (Tin Tin), Terence Yin (Fire), Hayama Go (Max), Coco Chiang (Sue).\nGuiÃƒÂ³n: Alan Yuen.\nProducciÃƒÂ³n: Willie Chan, Solon So y Barbie Tung.\n\n\nWing (Jackie Chan) es un policÃƒÂ­a residente en el Departamento de policÃƒÂ­a de Hong Kong. Es el mejor de todos pues resuelve cada caso que cae en sus manos en un tiempo rÃƒÂ©cord. Fung (Nicholas Tse) es un rebelde sin descanso que se conoce al dedillo las calles de Hong Kong; ansÃƒÂ­a convertirse en un agente de policÃƒÂ­a. Pero el pasado criminal de su difunto padre hace que su ambiciÃƒÂ³n sea un sueÃƒÂ±o imposible. Sin embargo, el muchacho tiene finalmente su oportunidad de ejercer como de-tective cuando convence a Wing de que es efectivamente un agente de policÃƒÂ­a y forman equipo para localizar un grupo de adversarios verdaderamente peligroso: La Banda de los Cinco. Dirigidos por Joe (Daniel Wu), la banda la integran cinco jÃƒÂ³venes criminales con sangre frÃƒÂ­a. Joe (Daniel Wu), siendo hijo de un padre autoritario y agresivo, un veterano agente de la policÃƒÂ­a, obtiene casi un placer sÃƒÂ¡dico cada vez que hiere o asesina a los representantes de la ley en Hong Kong. Wing y su equipo no tardan en localizar la madriguera de los delincuentes y efectuar una incursiÃƒÂ³n. Sin embargo, caen en una trampa y mueren a balazos uno a uno. Tan sÃƒÂ³lo escapa ÃƒÂ©l. Como consecuencia de esta masacre, la vida de Wing se desmorona. Todos sus colegas han muerto. Aunque tÃƒÂ©cnicamente sigue en el cuerpo, se hunde en un abismo de alcoholismo y desesperaciÃƒÂ³n. Cierta noche, Fung encuentra a su ÃƒÂ­dolo ebrio echado en la calle inconsciente. Le saca del arroyo y se lo lleva a casa. Una vez rehecho del todo, Wing empieza a unir piezas e identifica a los cinco de la banda. Mientras tanto, Joe reÃƒÂºne a su equipo y trata de activar una estrategia definitiva. Sin embargo, ahora Wing estÃƒÂ¡ familiarizado con sus procedimientos, y emplea la informaciÃƒÂ³n que tanto ÃƒÂ©l como Fung han reunido para dar la vuelta a la situaciÃƒÂ³n.","torrent":{"xt":"urn:btih:bb892e8432f7e55a1a66ceb33d5dccda927bad42","amp;dn":"New+Police+Story%5BDVDRip%5D%28spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb892e8432f7e55a1a66ceb33d5dccda927bad42","infoHashBuffer":{"type":"Buffer","data":[187,137,46,132,50,247,229,90,26,102,206,179,61,93,204,218,146,123,173,66]},"announce":[],"urlList":[]}}