{"title":"El corazon del Soldado.(Docu.Spanish).WTorents.Com","uid":5516817,"size":566239232,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bbcfddd655ee1302d114b2951268adade38ba569&amp;dn=El+corazon+del+Soldado.%28Docu.Spanish%29.WTorents.Com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cholo24","files":1,"time":1272309068,"description":"El corazon del Soldado\n\nUna producciÃƒÂ³n norteamericana de 56 minutos de duraciÃƒÂ³n, dirigida por Raney Aronson y producida por WGBH que aborda la historia de un grupo de jÃƒÂ³venes estadounidenses que luchÃƒÂ³ en Iraq y ha sufrido desde entonces secuelas psicolÃƒÂ³gicas: depresiones, trastornos de personalidad, alcoholismo. Los soldados cuentan cÃƒÂ³mo les afectÃƒÂ³ la presiÃƒÂ³n a la que estuvieron sometidos durante el conflicto y cÃƒÂ³mo les ha cambiado la vida desde que regresaron a su paÃƒÂ­s. El PentÃƒÂ¡gono, segÃƒÂºn el documental, conoce los graves problemas que padecen los soldados que han estado en la guerra, pues tienen toda la informaciÃƒÂ³n, pero es difÃƒÂ­cil que salga a la luz pÃƒÂºblica. OcurriÃƒÂ³ en la guerra de Vietnam, en la guerra del Golfo, y en la de Iraq. Soldados histÃƒÂ©ricos por el miedo y el estrÃƒÂ©s matan por error a civiles, el trauma aparece mÃƒÂ¡s tarde. El documental plantea una serie de ejemplos como el de un militar con graduaciÃƒÂ³n que se negÃƒÂ³ a cumplir una orden. El EjÃƒÂ©rcito le acuso de dÃƒÂ©bil, traidor y cobarde. Algunos de los sÃƒÂ­ntomas como depresiÃƒÂ³n o alcoholismo pasan desapercibidos en un primer momento pero pueden desembocar en agresiones o suicidios como el caso del soldado Jelfs de 22 aÃƒÂ±os que acusÃƒÂ³ al EjÃƒÂ©rcito de obligarle a ejecutar a prisioneros iraquÃƒÂ­es. Familiares, amigos y compaÃƒÂ±eros de las vÃƒÂ­ctimas hablan de los cambios y trastornos que han sufrido en su personalidad muchos de los jÃƒÂ³venes. Algunos de ellos afirman abiertamente que la guerra les ha arruinado completamente la vida. No salen de su cuarto, tienen pesadillas a diario, pierden a sus amigos y parejas o se convierten en alcohÃƒÂ³licos. El testimonio mÃƒÂ¡s estremecedor es el de un soldado y sus familiares que terminÃƒÂ³ suicidÃƒÂ¡ndose.\n","torrent":{"xt":"urn:btih:bbcfddd655ee1302d114b2951268adade38ba569","amp;dn":"El+corazon+del+Soldado.%28Docu.Spanish%29.WTorents.Com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbcfddd655ee1302d114b2951268adade38ba569","infoHashBuffer":{"type":"Buffer","data":[187,207,221,214,85,238,19,2,209,20,178,149,18,104,173,173,227,139,165,105]},"announce":[],"urlList":[]}}