{"title":"Weezer-(If You're Wondering If I Want You To) I Want You To","uid":5190419,"size":126679044,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bbf16d0001bcf22b1f4374b44837023edf32e66a&amp;dn=Weezer-%28If+You%5C%27re+Wondering+If+I+Want+You+To%29+I+Want+You+To&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1259662013,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;(If You're Wondering If I Want You To) I Want You To&quot; is the first single to Weezer's seventh studio album Raditude. Initially scheduled to be released to American rock radio on August 25, 2009, the track leaked less than a week after the announcement, and the official release of the single to radio was moved up to August 18. The single debuted at number 21 on the Billboard Rock Songs Chart, and in the same position on the Alternative Songs chart. The music video features Odette Yustman. The song was first played live on August 23rd, 2009 in Toronto, Ontario at the Molson Amphitheatre.\n\nThe music video was released in October 23. Directed by Marc Webb, the music video revolves around the members of the band living a normal life until a beautiful lady played by Odette Yustman comes to the town. Her callousness and disregard leads to multiple band members being injured while trying to impress her, leaving only frontman Rivers Cuomo unhurt, though upon seeing his injured bandmates, Cuomo rejects the woman to their approval.\n\n&quot;Marc Webb has created a kind of '50s small town for us to live in,&quot; Cuomo told MTV, &quot;And basically it's just populated by the four members of Weezer. So we're just hanging out, driving around, filling up our trucks with gasoline. Basically being guys, and that's what Weezerville is like.&quot;\n\n&quot;The idea of the video is really simple: It's a town that's made up of clones of Weezer. There are multiple versions of Brian [Bell] and Patrick [Wilson] and Scott [Shriner] and Rivers, and they're just going about their business, until one day, this woman shows up,&quot; Webb continued. &quot;And after that, everything basically goes to hell.&quot;\n\nThe song has received positive reviews from Billboard Magazine and Allmusic.\n\nOn the week ending September 12, 2009, (If You're Wondering If I Want You To) I Want You To&quot; debuted on the Billboard Hot 100 at #82. It fell off the following week, but on the week ending November 21, 2009 (the same week that their album Raditude debuted at #7 on the Billboard 200), it re-entered at #81.\n\nRaditude is the seventh studio album by American alternative rock band Weezer. It was released on November 3, 2009, although its original release date was set for October 27, 2009. The title of the album was suggested to Weezer vocalist Rivers Cuomo by actor Rainn Wilson.\n\nThe album's first single, &quot;(If You're Wondering If I Want You To) I Want You To&quot;, was released in August 2009. The album debuted at number seven on the Billboard 200.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:bbf16d0001bcf22b1f4374b44837023edf32e66a","amp;dn":"Weezer-%28If+You%5C%27re+Wondering+If+I+Want+You+To%29+I+Want+You+To","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbf16d0001bcf22b1f4374b44837023edf32e66a","infoHashBuffer":{"type":"Buffer","data":[187,241,109,0,1,188,242,43,31,67,116,180,72,55,2,62,223,50,230,106]},"announce":[],"urlList":[]}}