{"title":"Indigo Renderer v2.6.1 ( x86  x64 )(Murlok)","uid":6273651,"size":54952324,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bc1652b17677854c32acaf28c6227989a8684136&amp;dn=Indigo+Renderer+v2.6.1+%28+x86++x64+%29%28Murlok%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Murlok","files":-1,"time":1301170220,"description":"Indigo is a photorealistic renderer which simulates the physics of light to achieve near-perfect image realism. Incorporating an advanced physical camera model, a super-realistic materials system and the ability to simulate extremely complex lighting situations through Metropolis Light Transport, Indigo Renderer is capable of producing the highest levels of realism demanded by architectural and product visualisation.\n\nNetwork rendering\nIndigo can easily use multiple computers to accelerate rendering, and if you need more rendering power than you have in house, we have partnered with Ranch Computing to provide renderfarm access to Indigo users.\n\nIndigo Materials\nEverything in an Indigo scene is coated with a material of some kind or another. We have made a real effort to make the material system easy to learn, but flexible enough to let you create ultra-realistic materials.\n\nMaterials in Indigo are physically based, so that light bounces around your scene in the same way that they do in the real world. Many other renderers make gross approximations of the way light acts, Indigo calculates it correctly.\n\nA candy material by tungee\nFor those of you looking for fine grained control over your materials, you can edit the albedo, specular, exponent, bump, displacement, sigma and emission components of each material, as well as blending multiple materials through texture maps. We even have a high performance shader language that can be used to generate textures for any of the material components.\n\nHigh performance\nAlthough unbiased is by far the most accurate and computationally intensive rendering technique available, Indigo makes it available to everyone in their daily work.\n\nIndigo has had over 5 years of development with a focus on building the fastest possible unbiased renderer. To this end we use SSE, multiple threads and highly optimized C++ code throughout our renderer. We also use widely respected acceleration techniques such as kd-trees, bounding volume hierarchies and metropolis-hasting sampling. Great commercial support\n\nFree for non-commercial users\nWe celebrate the artistic ability of hobbyist modelers and students by granting anyone using Indigo for non-commercial usage a free licence. Simple download Indigo and start using it instantly with all the great features we offer to our commercial users.\n\nThe only limitation placed on your work is a 0.7 Megapixel resolution limit and a non-obtrusive Indigo logo in the bottom right of your renders. See a sample render from the free version of Indigo to get an idea of what is possible.\nAvailable for Windows, Mac and Linux\n\nIndigo is built to fit in with your workflow, so we are available on all the platforms that you are, whether that is Windows, Mac or Linux.\nAnd for high-end users, a 64-bit performance build of Indigo is available for every platform that we support.\n\nPhysically based\nIndigo uses purely physically based parameters for the materials and light transport options.\n\nIndex of refraction demonstration by dakiru\n\nThis means that real life effects such as the bending of light when it enters a pool of water, the rays of light generated by a dusty room, or the rainbow emitted from a crystal prism - are all created accurately by Indigo. As an artist or designer, you just have to model correctly and specify the material you want - Indigo will do the rest. Getting great lighting with Indigo means thinking like a photographer, not a computer scientist.\n\nJust follow instructions!\n\n\nKey.gen &lt;a href=&quot;\nhttp://www.virustotal.com/file-scan/report.html?id=8408fe42982b0e6fb9d45ae4a4e2ee365673693b8f453095dee801d721973d8b-1300436001&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/file-scan/report.html?id=8408fe42982b0e6fb9d45ae4a4e2ee365673693b8f453095dee801d721973d8b-1300436001&lt;/a&gt;\n\n\nTested and working\n\nEnjoy","torrent":{"xt":"urn:btih:bc1652b17677854c32acaf28c6227989a8684136","amp;dn":"Indigo+Renderer+v2.6.1+%28+x86++x64+%29%28Murlok%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc1652b17677854c32acaf28c6227989a8684136","infoHashBuffer":{"type":"Buffer","data":[188,22,82,177,118,119,133,76,50,172,175,40,198,34,121,137,168,104,65,54]},"announce":[],"urlList":[]}}