{"title":"The White Stripes - Jolene (Live)","uid":5172637,"size":133283844,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bc1caaecd1deb767625133d6d575d6f5548d6860&amp;dn=The+White+Stripes+-+Jolene+%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1258776828,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Jolene&quot; is a song written and performed by Dolly Parton from her album Jolene (1974), produced by Bob Ferguson. It is ranked #217 on the Rolling Stone magazine's list of &quot;the 500 Greatest Songs of All Time&quot;.\n\n&quot;Jolene (Live Under Blackpool Lights)&quot; was released as a live single by American garage rock band The White Stripes. The single reached #16 in the UK singles chart in November 2004. The White Stripes previously released a studio version of &quot;Jolene,&quot; as the B-side to their 2000 single of &quot;Hello Operator&quot;, from the album De Stijl. In Australia, the song was ranked #10 on Triple J's Hottest 100 of 2004.\n\nThe White Stripes is an American rock duo, formed in 1997 in Detroit, Michigan. The group consists of songwriter Jack White (vocals, guitar and piano) and Meg White (drums and occasional vocals).\n\nAfter releasing several singles and three albums within the Detroit independent music underground, The White Stripes rose to prominence in 2002, as part of the garage rock revival scene. Their successful albums White Blood Cells and Elephant drew them attention from a large variety of media outlets in the United States and the United Kingdom.\n\nThe White Stripes use a low-fidelity, do-it-yourself approach to writing and recording. Their music features a melding of punk and blues influences and a raw simplicity of composition, arrangement, and performance. The duo is also noted for their fashion and design aesthetic which features a simple color scheme of red, white, and black.\n\nThe White Stripes' discography consists of six studio albums, two extended plays (EP), one concert film, 26 singles and fourteen music videos. The band has sold approximately 12 million albums worldwide, two million in the US alone, and their latest three albums have each won a Grammy Award for Best Alternative Music Album.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:bc1caaecd1deb767625133d6d575d6f5548d6860","amp;dn":"The+White+Stripes+-+Jolene+%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc1caaecd1deb767625133d6d575d6f5548d6860","infoHashBuffer":{"type":"Buffer","data":[188,28,170,236,209,222,183,103,98,81,51,214,213,117,214,245,84,141,104,96]},"announce":[],"urlList":[]}}