{"title":"20th Century Boys 2 The Last Hope DVDRip XviD LKRG[ExtraTorrent]","uid":5597850,"size":1815652588,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bc4aa86bcf2b4f58a20ba7ff5640fc7ecb11668f&amp;dn=20th+Century+Boys+2+The+Last+Hope+DVDRip+XviD+LKRG%5BExtraTorrent%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"raymondhome","files":-1,"time":1275111198,"description":"Love for All and Sharing is the first step to solving all the problems of humanity.\n\nWebsites I want to share.\n\n    &lt;a href=&quot;\nhttp://www.shareintl.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shareintl.org/&lt;/a&gt;\n\n    &lt;a href=&quot;\nhttp://www.lightmiddleway.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lightmiddleway.com&lt;/a&gt;\n\n\nThank you very much\n\nNo credit for me...credit to EVERYONE for sharing\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/raymondhome/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/raymondhome/&lt;/a&gt;\n\nPLOT\nIt is now 2015, and Friend rules a disturbing new world. Kenji has been missing since the Bloody New Year's Eve of 2000, and his niece Kanna, who has been looked after by Yukuji, is now in high school. Her history textbook contains a fabricated story about Kenji and his friends being the terrorists behind the horrific events of 2000. Kanna, knowing the truth, openly resents this, and as a result she is marked as a problem child by her teacher and sent to the Friend Land program because of her anti-Friend behavior. Friend Land is a facility where people with rebellious behavior are re-educated. As the program begins, Kanna and her classmate Kyoko Koizumi achieve high marks and are sent to the advanced program called the Bonus Stage, where they find themselves in a virtual reconstruction of 1971, when Kenji and his friends were kids. There, each of the girls learns crucial secrets about Friend. The surviving secret base members have been separated since Bloody New Year's Eve but each has spent the last 15 years in various activities opposing Friend and his regime. Otcho has been incarcerated in Umihotaru Prison. Yoshitune now leads an underground group against Friend. Maruo works for an important figure in the regime, waiting for the right time to act against Friend.\n\nAs Kenji's friends all try to find out the truth about Friend, they discover the shocking existence of The New Book of Prophecy, the sequel to The Book of Prophecy. The New Book describes an event: In 2015, at a church in Shinjuku, a savior will rise to uphold justice but will be assassinated. Who is the savior? Once again, Doomsday looms near... \n\nRun Time: 140 minutes\nLanguage: Japanese\nSubtitles: English Hard Coded\n\ncredit Infectious (JDPennington) BIG BIG BIG TIME &amp; to all the people who made it possible for us to share this...especially EVERYONE involve in the production of the movie...IF YOU LIKE IT...BUY IT :)\n\n*****help what we can with others in need...the world is ONE big family*****","torrent":{"xt":"urn:btih:bc4aa86bcf2b4f58a20ba7ff5640fc7ecb11668f","amp;dn":"20th+Century+Boys+2+The+Last+Hope+DVDRip+XviD+LKRG%5BExtraTorrent%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc4aa86bcf2b4f58a20ba7ff5640fc7ecb11668f","infoHashBuffer":{"type":"Buffer","data":[188,74,168,107,207,43,79,88,162,11,167,255,86,64,252,126,203,17,102,143]},"announce":[],"urlList":[]}}