{"title":"Jerry Harrison - The Red And The Black (1981)@flac","uid":6171088,"size":288223755,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bc56e3bbc7c7399d4c42afa454d63d4cd2aa7cd4&amp;dn=Jerry+Harrison+-+The+Red+And+The+Black+%281981%29%40flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alekow1","files":22,"time":1297582065,"description":"\nWhile the myth has been widely propagated that David Byrne was the sole creative presence of any consequence among his Talking Heads cohorts, The Red and the Black makes perhaps the strongest case against such a claim. \nJerry Harrison, no musical novice by any stretch (check out his work with the early Modern Lovers), proves his formidable talent as a multi-instrumentalist and songwriter for the first time in this close-up. There's little doubt that Harrison's debut is informed most directly by the last few Talking Heads albums, particularly the genre-defining Remain in Light.\nThe polyrhythmic exercises, spoken word interludes, and Enoesque knob twiddling are standard parts of Harrison's palette. He's also free to indulge in some impressive keyboard pyrotechnics, much of which hints at the arena funk of Stop Making Sense. Denser, more abrasive, and yet more musical than Remain in Light, The Red and the Black mines the same musical terrain, but it does so with more urgency and focus. \nWhile David Byrne sounded like a man suffocating under the weight of the modern world, Harrison takes a more sober, straightforward approach. He's able to discriminate the desirable parts from the undesirable, and to celebrate the whole. While Byrne's persona was strictly that of an observer, Harrison isn't afraid to get his hands dirty. His baritone warble may lose pitch or escape as a helpless bark on occasion, but there's warmth and humanity to his timbre, a yearning to connect rather than to distance. This is reflected most immediately in Harrison's no-nonsense pep talks that pop up in the middle of a few songs, just when the intensifying rhythms and synth lines become almost too cacophonous to bear. \n&quot;Have you ever been in a traffic jam?,&quot; he inquires in &quot;Slink.&quot; &quot;Have you ever needed a gram? I have, but I got over it.&quot; When Harrison shifts the focus from third person to second, the effect is jarring and surprisingly effective. On &quot;Magic Hymie&quot; he grows more impatient with us: &quot;There's a way out of that corner you painted yourself into...you gotta decide you wanna do it, and then you're just gonna do it.&quot; \nThroughout much of the album, Harrison continues to lay heavy condemnation upon modern attitudes of helplessness and irresponsibility. Modern, particularly urban, life has its pitfalls, he seems to say, but we're all equipped to deal with them if we accept some accountability. \nBesides the relentless attack of fired-up synthesizers and frenzied rhythms, Harrison incorporates a cast of soulful female background vocalists, many of whom would end up on the next Talking Heads record and following tour. Not surprisingly given Harrison's brainy and self-conscious approach, the singers add little soul, but serve rather as a Greek chorus, repeating Harrison's lyrical motifs and bringing substantial drama to his already tense and paranoid compositions. \nElsewhere, on &quot;Worlds in Collision,&quot; he throws in samples of barking hounds and Hitlerian rally cries to punctuate the monotone din of the rest of the song. \nThe Red and the Black more than holds its own against the rest of Talking Heads' oeuvre, and shows where the band could have gone, had they not opted for a more minimalistic approach later in their career. As a solo project, Harrison's debut is phenomenal. \nThe album's complex and funky musical style has aged impressively, as have Harrison's observations on the modern condition. (AMG)\n\n\n\n\n01 - Things Fall Apart\n02 - Slink\n03 - The New Adventure\n04 - Magic Hymie\n05 - Fast Karma / No Questions\n06 - Worlds In Collision\n07 - The Red Nights\n08 - No More Reruns\n09 - No Warning, No Alarm\n\n\n\n\nLabel: Sire\nReleased: 1981\nCatalogue: 7599-23631-2\n\nCompression Level: 5\nCovers Included (400dpi)\n\n\n\n\n\nEnjoy, Seed and Share","torrent":{"xt":"urn:btih:bc56e3bbc7c7399d4c42afa454d63d4cd2aa7cd4","amp;dn":"Jerry+Harrison+-+The+Red+And+The+Black+%281981%29%40flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc56e3bbc7c7399d4c42afa454d63d4cd2aa7cd4","infoHashBuffer":{"type":"Buffer","data":[188,86,227,187,199,199,57,157,76,66,175,164,84,214,61,76,210,170,124,212]},"announce":[],"urlList":[]}}