{"title":"House temporada 6 cap. del 9 al 16 by JKRILIN","uid":6285640,"size":3227700504,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bcd68ad575cccdf1b41b8c9a544888315957f127&amp;dn=House+temporada+6+cap.+del+9+al+16+by+JKRILIN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gaditano_cc","files":8,"time":1301603563,"description":"El Dr. Foreman se convierte en el reemplazo del Dr. House, volviÃƒÂ©ndolo completamente irracional el estar tratando de ser como House, cosa que hace que se termine su relaciÃƒÂ³n con Trece y sea despedida, marchÃƒÂ¡ndose ella a Bangkok. Taub abandona el equipo diciÃƒÂ©ndole a Foreman que la ÃƒÂºnica razÃƒÂ³n para estar en el equipo era trabajar para House. Lo que hace que se vuelva al equipo de Chase y Cameron.\n\nHouse comienza su tratamiento de desintoxicaciÃƒÂ³n en el Instituto Mental de Mayfield para desintoxicarse de la vicodina y con el fin de dejar de tener alucinaciones. Planea dejar el hospital, pero un mÃƒÂ©dico, el doctor Darryl Nolan, insiste en que finalice correctamente su tratamiento.[3] TambiÃƒÂ©n en su terapia de rehabilitaciÃƒÂ³n, tras probar con varios hobbies para distraer su atenciÃƒÂ³n del dolor de su pierna, descubre que su trabajo como mÃƒÂ©dico es lo ÃƒÂºnico que funciona, por lo cual vuelve tambiÃƒÂ©n pero esta vez como subordinado de Foreman.\n\nOtro de los giros de la historia es el caso de Dibala, un dictador que es conocido por varios crÃƒÂ­menes en contra de la humanidad, mientras es tratado, Chase y Cameron entran en un dilema de si salvarlo o no, mÃƒÂ¡s aÃƒÂºn por la interferencia de un ciudadano de esa patria el cual les describe lo horrible de sus crÃƒÂ­menes. Al final Chase cambia el resultado de sus exÃƒÂ¡menes para que lo traten por una enfermedad distinta, haciendo que el nuevo tratamiento lo mate. Pero Foreman lo descubre, tras una discusiÃƒÂ³n entre los dos, Foreman decide encubrirlo, pero debido a los nervios que presentan los dos, House tambiÃƒÂ©n descubre el cambio de resultados, pero tambiÃƒÂ©n los encubre. DespuÃƒÂ©s de eso las consecuencias de la decisiÃƒÂ³n de Chase se ven a travÃƒÂ©s de esta temporada.\n\nCon el tiempo Chase decide decirle la verdad a Cameron, ÃƒÂ©sta lo perdona pero Chase se pregunta por quÃƒÂ©. House recupera su licencia y vuelve a ser el superior de Foreman, y decide que su equipo debe estar formado por los dos anteriores (Foreman, Chase, Cameron, Taub y Trece), asÃƒÂ­ que en un caso, del cual sabe la respuesta, decide mandarle informaciÃƒÂ³n sobre ÃƒÂ©ste a Taub y Trece para despertar alguna clase de interÃƒÂ©s para que volvieran (lo cual logra, y juntos resuelven el caso), al mismo tiempo, siembra la duda en Chase sobre el perdÃƒÂ³n de Cameron, llevando a ÃƒÂ©ste a convertirse igual que House y no sentir culpa.\n\nCameron al ver esto, le dice a Chase que antes se habÃƒÂ­a enamorado de House pensando que lo podrÃƒÂ­a cambiar, y que despuÃƒÂ©s se interesÃƒÂ³ en ÃƒÂ©l porque se habÃƒÂ­a vuelto mÃƒÂ¡s humanitario, pero el hecho de no sentir culpa de haber matado a Dibala lo convertÃƒÂ­a en alguien como House, asÃƒÂ­ que decide separarse de ÃƒÂ©l y mudarse a otra ciudad. Aunque Chase sufre la pÃƒÂ©rdida, decide mostrarse fuerte ante sus compaÃƒÂ±eros de equipo, ahora formado por Foreman, Taub, Trece y ÃƒÂ©l, al mando de House.\n\nMientras a House las cosas se le empiezan a complicar, cuando cree que reconoce lo que siente por Cuddy, por lo cual empieza a idear formas de ganarse su corazÃƒÂ³n. Cuando ÃƒÂ©ste va a una conferencia de doctores con Cuddy y Wilson, ve una oportunidad perfecta para declararse, pero al llegar a su cuarto de hotel, ve a Lucas (el detective que le ayudÃƒÂ³ a vigilar a Wilson) con la hija de Cuddy (dÃƒÂ¡ndole a entender que Cuddy estÃƒÂ¡ con ÃƒÂ©l), lo cual le destroza el corazÃƒÂ³n, y como venganza decide comprar un apartamento con Wilson, el cual iba a comprar Cuddy para mudarse con su hija y Lucas, aunque no pierde su extraÃƒÂ±a amistad con este ÃƒÂºltimo.\n\nCuddy aparentemente ha dejado de sentir amor/atracciÃƒÂ³n por House, en varias ocasiones le dice que ahora estÃƒÂ¡ con Lucas y que quiere seguir con ÃƒÂ©l. Wilson le recrimina a House que a fin de cuentas, ÃƒÂ©l tuvo miles de oportunidades con Cuddy y las desperdiciÃƒÂ³ por su egoÃƒÂ­smo, que de alguna forma es culpable de que ahora Cuddy estÃƒÂ© con otra persona. House queda deshecho al darse cuenta de esto (en el episodio &quot;Ignorance is Bliss&quot; cuando se embriaga y aparece en el departamento de Lucas, le dice: &quot;Ella me diÃƒÂ³ 832 oportunidades y yo la desperdiciÃƒÂ©. Anota 832 es su nÃƒÂºmero lÃƒÂ­mite&quot;). Cuddy piensa irse a vivir con Lucas en un apartamento, pero Wilson compra el condominio que Cuddy iba a comprar. Lucas les hace algunas bromas a ambos para fastidiarlos, aunque ni a House o a Wilson les interesa vengarse de ÃƒÂ©l. House trata a toda costa de interesarle de nuevo a Cuddy, trata de ser amable consultando pacientes, incluso la invita a un paseo infantil para que lleve a su hija, pero Cuddy le insiste en que ya no estÃƒÂ¡ interesada en ÃƒÂ©l.\n\nMientras tanto, Wilson encuentra a su ex esposa Samantha. Casualmente ella acaba de divorciarse, y al igual que ÃƒÂ©l, sigue sin hijos. Ambos empiezan a tratarse nuevamente, hasta que empiezan una relaciÃƒÂ³n. House se molesta con Samantha, le recrimina porque en el primer divorcio ella dejÃƒÂ³ a Wilson y lo hizo sufrir. House incluso le pide a Cuddy que le ayude a separarlos, pero nadie le ayuda y provoca una pelea entre ellos haciendo cosas insignificantes que molestan a Wilson. House le dice a Samantha que en su primer divorcio (cuando House conociÃƒÂ³ a Wilson) ÃƒÂ©l estaba deshecho, sabe que James se preocupa mucho por las personas y que por eso habitualmente sale lastimado. Samantha le dice a House que esa es su decisiÃƒÂ³n y de Wilson, y ÃƒÂ©ste ÃƒÂºltimo le dice a House que piensa vivir con Samantha, y que preferirÃƒÂ­a que se mudara.\n\nHouse confiesa que no se siente mal porque Wilson le pidiÃƒÂ³ que se fuera, pero la realidad es que sÃƒÂ­. House ha empezado a sentirse muy solo, puesto que Cuddy ahora estÃƒÂ¡ con Lucas o su hija y Wilson estÃƒÂ¡ con Samantha, incluso Cameron se fue. House le dice a su terapeuta que tiene mucho tiempo en terapia pensando que podrÃƒÂ­a ser feliz, pero que jamÃƒÂ¡s lo logrÃƒÂ³ y que estÃƒÂ¡ cansado de eso, que ha tratado de hacer las cosas bien y todo le ha salido mal. Cuando regresÃƒÂ³ a su casa despuÃƒÂ©s de que Wilson le dijo que se fuera, se encontrÃƒÂ³ con Alvie, su amigo del manicomio, quien vendiÃƒÂ³ muchas de las cosas de House para comprar pintura y redecorar el departamento. Sin saber vendiÃƒÂ³ un libro que escribiÃƒÂ³ el Bisabuelo de Lisa Cuddy, aunque luego ambos lo recuperan. House busca a Cuddy para regalarle el libro, y ella le informa que Lucas le pidiÃƒÂ³ matrimonio. DespuÃƒÂ©s de eso, sucede un accidente en New Jersey, un derrumbe, en el cual el hospital Princenton-Plainsboro ayuda en el rescate, los mÃƒÂ©dicos del hospital, Cuddy, House, Foreman, Chase, Taub, ayudan en las labores de rescate, hasta que House encuentra bajo los escombros a una chica joven. Ella tiene una pierna bajo una viga irrompible, House insiste en que pueden recuperar su pierna y rescatarla, pero Cuddy le dice que no puede estar contradiciendo a todos sÃƒÂ³lo por estar molesto con ella por casarse, le dice que necesita progresar como lo hace ella y como lo hace Wilson. Mientras tanto, Trece deja una carta en donde le dice a House que necesita un tiempo libre, aunque no explica por quÃƒÂ©. House habla con la chica atrapada, diciÃƒÂ©ndole que la ÃƒÂºnica forma de sacarla con vida es amputando su pierna. Ella no estÃƒÂ¡ dispuesta, pero House le dice que ÃƒÂ©l ha tenido que vivir con una pierna inservible, que arriesgÃƒÂ³ su vida y que ahora sufre mucho con el dolor. La convence y House corta su pierna, cuando la llevan de camino al hospital la chica muere a causa de una embolia.\n\nForeman le dice que no fue su culpa, pero eso es lo que le molesta, hacer las cosas bien y que el resultado sea malo. Regresa a su departamento y busca frascos de Vicodin. Cuando estÃƒÂ¡ a punto de tomarlos, aparece Cuddy. Le cuenta que ha terminado con Lucas y que lo que dijo antes no era cierto. Cuddy por fin le dice que lo ama y el capÃƒÂ­tulo termina cuando ambos se besan\n","torrent":{"xt":"urn:btih:bcd68ad575cccdf1b41b8c9a544888315957f127","amp;dn":"House+temporada+6+cap.+del+9+al+16+by+JKRILIN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcd68ad575cccdf1b41b8c9a544888315957f127","infoHashBuffer":{"type":"Buffer","data":[188,214,138,213,117,204,205,241,180,27,140,154,84,72,136,49,89,87,241,39]},"announce":[],"urlList":[]}}