{"title":"NoMeansNo -[1986]- Sex mad - You kill me","uid":5024176,"size":486838804,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bd890befdece7bd467be47da4a4ba0240bb8c257&amp;dn=NoMeansNo+-%5B1986%5D-+Sex+mad+-+You+kill+me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kislithepothead","files":-1,"time":1248618490,"description":"Combining the two releases on one CD, Sex Mad/You Kill Me makes for an edgy, thrashing release that shows the Canadians fully in charge of a frenetic post-punk style seemingly left for dead by many in the late '80s. &quot;Sex Mad&quot; itself calls up memories of everything from the Gang of Four to MX-80 Sound to the Minutemen and back again, and with that as a worthy combination to draw on indeed, the trio goes all out and doesn't stop. It might be a stretch to say that Nomeansno are somehow Rush-influenced, but then again, considering that both sets of Canadians can readily demonstrate their way around sudden time changes (check the instrumental &quot;Obsessed&quot; or the six-minute character portrait &quot;Dead Bob&quot;), it might not be as crazy as all that! Other classic rock nods include a bit from &quot;Sunshine of Your Love&quot; at one point and a full cover of &quot;Manic Depression&quot; from the You Kill Me days (meanwhile, the chorus of &quot;Revenge&quot; is perfectly anthemic stadium rock, and works on that level without a problem). Slightly more straight-up punk efforts crop up -- &quot;Dad,&quot; one of the most powerful, sounds like what would happen if the scenario of Suicidal Tendencies' &quot;Institutionalized&quot; wasn't just about feeling petulant for lacking a Pepsi, to put it mildly. (Killer end touch -- the baldly delivered line &quot;I'm seriously considering leaving home.&quot;) The sometimes hoarse, higher-end singing sounds like what a less annoyed Henry Rollins would be been like in early Black Flag -- or at least, a Rollins one could talk to without immediately being beat on. Thus, a song like &quot;Self Pity,&quot; which manages the neat trick of addressing the titular topic without sounding like an example of same -- and by turning into a near-apocalyptic collage of power riff rage.\n- Ned Ragett, AllMusic\n\n","torrent":{"xt":"urn:btih:bd890befdece7bd467be47da4a4ba0240bb8c257","amp;dn":"NoMeansNo+-%5B1986%5D-+Sex+mad+-+You+kill+me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd890befdece7bd467be47da4a4ba0240bb8c257","infoHashBuffer":{"type":"Buffer","data":[189,137,11,239,222,206,123,212,103,190,71,218,74,75,160,36,11,184,194,87]},"announce":[],"urlList":[]}}