{"title":"Martin-Why They Wanted to Get Gordon Kahl(American tax protestor","uid":5046201,"size":316641,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bdb158ba8b3bc4b96cffdc718c1624f75b97fb32&amp;dn=Martin-Why+They+Wanted+to+Get+Gordon+Kahl%28American+tax+protestor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"red_gonzo","files":1,"time":1249604348,"description":"This is Len Martin's amazing booklet Why &quot;They&quot; Wanted to Get Gordon Kahl (1996) which recaps the fascinating life of tax-protestor Gordon Kahl and the reasons he choose not to pay taxes anymore. At about 5:45 February 13, 1983, U.S. Marshals and other law enforcement officers attempted to &quot;get&quot; Gordon Kahl at Medina, North Dakota. They failed. For nearly 16 weeks, an intense manhunt was carried on to &quot;get&quot; Gordon Kahl. It was reported that he was the &quot;most wanted man&quot; in America. Wanted by the U.S. Government for allegedly committing acts of murder - or was he being hunted for another reason? If everything that Kahl was saying was not true, then why would they go to such lengths to silence an old farmer unless what the man was saying was the truth, including learning about the govenor of North Dakota being involved in drug running. All the officers involved in the assassination attempt on him and his family were all Masons. It was the higher ups of the Masonic lodge that ordered the hit on him because he would not shut up about what he knew about the dark side of the Masons. The info that he learned about the Masons he got from Masons themselves that were wanting to get out because they found out that it was not the good guy organization that they thought it was. This book is a detailed account of a tape recorded conversation between Kahl and author that took place 2 months before that infamous shootout between Kahl and the Marshalls. It has been said that the shots at Medina were &quot;shots heard around the world&quot;. Who was Gordon Kahl and why was the government after him? That seems to be the question asked by those concerned citizens who are following the Medina / Gordon Kahl incident. If the powers that be go to these kinds of length to silence somebody, you can bet that the people they are going after are telling some truth that the powers that be would never want the commoners to ever know. 25 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:bdb158ba8b3bc4b96cffdc718c1624f75b97fb32","amp;dn":"Martin-Why+They+Wanted+to+Get+Gordon+Kahl%28American+tax+protestor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdb158ba8b3bc4b96cffdc718c1624f75b97fb32","infoHashBuffer":{"type":"Buffer","data":[189,177,88,186,139,59,196,185,108,255,220,113,140,22,36,247,91,151,251,50]},"announce":[],"urlList":[]}}