{"title":"Tiger Woods PGA Tour 2007","uid":6151462,"size":1881184038,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bdcbfd94db77aa6d3870fac5e1f970887c580b90&amp;dn=Tiger+Woods+PGA+Tour+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Psychodad149","files":3,"time":1296891102,"description":"EA Sports:\nTiger Woods PGA Tour 2007 takes golf gaming to new level of realism. Experience the next generation of technology as Tiger Woods comes to life -- you\\\\\\'ll see and feel each emotion in detail, as it\\\\\\'s displayed onscreen in the faces and movements of the golfers. Play under pressure just like pros, and go further in your game with the enhanced career mode. \n\nFeaturing 15 of the world\\\\\\'s top players, including Tiger Woods, John Daly, Vijay Singh, Ian Poulter, Michael Campbell, and Annika Sorenstam, the most decorated golfer on the LPGA Tour New Gameface tool with deeper modifications, more apparel, equipment licenses, and specialty items Challenge up to three players in five new game modes, or play in online tournaments complete with money lists, full stat tracking, league leaders, and more Work on your game or take on a friend in Match Play, Battle Golf, 21, OneBall, and more.\n==============\nThis is not my own torrent; it is from another site. I\\\\\\'m uploading it here because I had such a hard time finding it and downloading it. There are plenty of torrents out there for Tiger 2008, but I am absolutely convinced this is a better game. The gameplay is about the same, but I think the interface on 2008 is oversized, ugly, and clunky. The playing screen in 2007 is a lot less intrusive. C\\\\\\'mon, EA, a hexagon motif? Also, I\\\\\\'ve seen complaints about one issue that I was just starting to see, a real bad lag at the end of a hole, where the game just freezes for a while before moving on. 2008 is also a lot heavier on resources in general, I think. I know 2007 runs a lot smoother on my machine, and while it isn\\\\\\'t a gaming monster it is new and it isn\\\\\\'t a slouch.\n\nAnyway, I thought there might be some other folks out there who would be glad to get their hands on this, and hopefully you won\\\\\\'t be getting it from in single-digit download speeds the way I had to. Cheers...","torrent":{"xt":"urn:btih:bdcbfd94db77aa6d3870fac5e1f970887c580b90","amp;dn":"Tiger+Woods+PGA+Tour+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdcbfd94db77aa6d3870fac5e1f970887c580b90","infoHashBuffer":{"type":"Buffer","data":[189,203,253,148,219,119,170,109,56,112,250,197,225,249,112,136,124,88,11,144]},"announce":[],"urlList":[]}}