{"title":"Rooms:The Main Building [Multi5]","uid":5610407,"size":17035106,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:bde21f2917610e4b83f9bd2bb3ae0b3f990e4f70&amp;dn=Rooms%3AThe+Main+Building+%5BMulti5%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chusca","files":3,"time":1275836523,"description":"Los entusiastas de los puzzles del profesor Layton estÃƒÂ¡n de enhorabuena porque pueden seguir disfrutando de los juegos de puzzles con Rooms: The Main Building. Localizado en la misteriosa y oscura casa llamada MansiÃƒÂ³n Roms, el juego te sitÃƒÂºa en un mundo virtual compuesto de unos cien tortuosos puzles de piezas deslizantes. Tu personaje podrÃƒÂ¡ moverse de una pieza a otra, pero solo puedes mover la pieza en la que tu personaje esta situado. En este mundo paralelo, tendrÃƒÂ¡s que hacer uso de toda una serie de increÃƒÂ­bles objetos, algunos poco comunes, que van desde telÃƒÂ©fonos que tele-transportan a otra habitaciÃƒÂ³n, los explosivos que hacen volar las paredes y obstÃƒÂ¡culos similares. Pero, ten cuidado, algunas habitaciones estÃƒÂ¡n llenas de agua. AsÃƒÂ­ pues primero necesitarÃƒÂ¡s vaciarlas. \nOtras CaracterÃƒÂ­sticas: TendrÃƒÂ¡s que usar tu ingenio si quieres pasar cada nivel, y ser recompensado con las cuatro piezas de puzzle doradas necesarias para volver a casa. Los mÃƒÂ¡s perfeccionistas estarÃƒÂ¡n encantados de saber que les esperan algunos premios si consiguen ordenar de manera correcta las piezas que forman el fondo de cada habitaciÃƒÂ³n. Si necesitas ayuda, la obtendrÃƒÂ¡s de un personaje de lo mas extraÃƒÂ±o y fascinante, Mr Book. El te servirÃƒÂ¡ de guÃƒÂ­a y te mostrara como mover una habitaciÃƒÂ³n y como utilizas los objetos de la mejor manera para escapar de ese extraÃƒÂ±o mundo. Incluye espaÃƒÂ±ol.\n\n","torrent":{"xt":"urn:btih:bde21f2917610e4b83f9bd2bb3ae0b3f990e4f70","amp;dn":"Rooms%3AThe+Main+Building+%5BMulti5%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bde21f2917610e4b83f9bd2bb3ae0b3f990e4f70","infoHashBuffer":{"type":"Buffer","data":[189,226,31,41,23,97,14,75,131,249,189,43,179,174,11,63,153,14,79,112]},"announce":[],"urlList":[]}}