{"title":"London After Midnight (1927)","uid":5072579,"size":657836170,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bde270654e2a2a9095a7cb373e4ded7cfaaf88a4&amp;dn=London+After+Midnight+%281927%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Willams","files":27,"time":1251545674,"description":"London After Midnight (1927)\n\n\nLondon After Midnight (1927) is a silent mystery film with horror overtones. The film stars Lon Chaney, Marceline Day, Conrad Nagel, Henry B. Walthall, and Polly Moran and was directed by Tod Browning. It is also a lost film, quite possibly the most famous and eagerly-sought of all lost films. The last known copy was destroyed in a fire in an MGM film vault in 1965.\n\nThe setting of the film is (then contemporary) 1920s London.\n\nSir Roger Balfour is found shot to death in his home. Inspector Burke (Lon Chaney, Sr.) of Scotland Yard is called in to investigate. The suspects are Williams (the butler), Sir James Hamlin (Henry B. Walthall) and his nephew, Arthur Hibbs (Conrad Nagel). A suicide note is found and the case is supposedly closed.\n\nFive years later, the old residence of Balfour is taken up by a man in a beaver-skin hat, with large fangs and gruesome, sunken eyes. His assistant is a ghostly woman, with flowing robes and raven black hair. Could it be Balfour, returned from the dead?\n\nChaney's makeup for the film is noteworthy, for the sharpened teeth and the hypnotic eye effect he achieved with special wire fittings which he wore like monocles. Based on surviving accounts, he purposefully gave the &quot;vampire&quot; character an absurd quality, because it was the film's Scotland Yard detective character (also played by Chaney) in a disguise. Surviving stills show this was the only time Chaney used his famous makeup case as an on-screen prop.\n\nThe film grossed almost $500,000 at the box office, becoming the most successful collaborative film between Chaney and Browning. However, accounts by filmgoers and critics who saw the film before its destruction in 1965 (including film historian William K. Everson) suggest it was not one of Chaney and Browning's strongest films. Unfortunately, it is now lost: no copies of the film are known to exist, although there has been an attempt at a reconstruction utilizing the script and publicity shots. Browning later remade the film, with some changes to the plot, as Mark of the Vampire (Lionel Barrymore plays the police inspector and Bela Lugosi portrays the vampire).\n\nThe film was used as a part of the defense for a man accused of murdering a woman in Hyde Park, London in 1928. He claimed Chaney's performance drove him temporarily insane, but his plea was rejected and he was convicted of the crime.\n\nThe last known print of the film was stored by MGM in Vault #7. In 1965, an electrical fire broke out in the vault that destroyed countless films from the silent era, including this last known print.\n\nIn 2002, Turner Classic Movies commissioned famed restoration producer Rick Schmidlin (Greed, Touch of Evil) to produce a 45 min. reconstruction of the film, using still photographs. This was well received by horror fans and Schmidlin received the Rondo Award for his efforts.\n\nThe torrent contains some posters and stills of the film, and externals Spanish and French subtitles. \n\nIMDB: 7.1/10\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0018097/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0018097/&lt;/a&gt;\n\n\n*****************************FREAKYFLICKS*****************************\n\nFreakyFlicks is a free and open community dedicated to preserving and\nsharing cinematic art in the digital era. Our goal is to disseminate\nsuch works of art to the widest audience possible through the channels\nprovided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played\nan exceptional role in the history of cinema and its progression in\nbecoming a great art. Films that are usually described as classic,\ncult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them\nand participate in our community. All you need do is include this tag\nin your upload and join us at the forum to announce your release.\n       \n \n            &lt;a href=&quot; http://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com&lt;/a&gt;\t\n\t\n\n*****************************FREAKYFLICKS*****************************","torrent":{"xt":"urn:btih:bde270654e2a2a9095a7cb373e4ded7cfaaf88a4","amp;dn":"London+After+Midnight+%281927%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bde270654e2a2a9095a7cb373e4ded7cfaaf88a4","infoHashBuffer":{"type":"Buffer","data":[189,226,112,101,78,42,42,144,149,167,203,55,62,77,237,124,250,175,136,164]},"announce":[],"urlList":[]}}