{"title":"Learn to Speak Tibetan","uid":5038088,"size":770763390,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:be2d2ed3a7ccfc7f9010e74f285204b03c9557fe&amp;dn=Learn+to+Speak+Tibetan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"aneris6","files":38,"time":1249226216,"description":"The most systematic and extensive course system available in spoken Tibetan language, Fluent Tibetan was developed by a team of language experts working in conjunction with five indigenous Tibetan speakers, over a two-year period, under a grant from the International Research and studies Program of the Department of Education in Washington, DC.\nFluent Tibetan is based upon the courses developed by the U.S. State Department's Foreign Service Institute (FSI) specifically for diplomats needing to learn a language quickly. The FSI model used for this course is unsurpassed in its proven effectiveness. The method acquaints students with the sounds and patterns of Tibetan speech, through repetitive interactive drills, enabling them to learn increasingly complex structures quickly, and in this way promotes rapid progress in speaking Tibetan on your own.\nThe Fluent Tibetan package consists of a four-volume textbook and a set of tape recordings, arranged in fifteen units. The first three units are devoted to recognition and pronunciation of the Tibetan alphabet and its combinations in syllables and words. Beginning with unit four, vocabulary and grammatical patterns are introduced in the form of situational dialogues. Each dialogue is followed by extensive drills which repeat the vocabulary and grammatical patterns in different contexts. In this way the student learns not merely to mimic the phrases but to use the language creatively.\nAll the voices in the dialogues and drills are those of indigenous Tibetan speakers and the material is given by both male and female voices alternately. The Tibetan voices on the tape are exceptionally clear. The end-of-text glossary is both Tibetan-English and English-Tibetan.\nThe material covered in Fluent Tibetan roughly corresponds to what is covered in two semestres of college-level language study. Having completed this text, students should be capable of intermediate level speech as defined by the University of Virginia's Tibetan Oral Proficiency Guidelines formulated by William Magee.\n\nFluent Tibetan Series, William Magee and Elizabeth Napper, General EditorJeffrey Hopkins, 4 textbook volumes/18 tapes, $250.00 ","torrent":{"xt":"urn:btih:be2d2ed3a7ccfc7f9010e74f285204b03c9557fe","amp;dn":"Learn+to+Speak+Tibetan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be2d2ed3a7ccfc7f9010e74f285204b03c9557fe","infoHashBuffer":{"type":"Buffer","data":[190,45,46,211,167,204,252,127,144,16,231,79,40,82,4,176,60,149,87,254]},"announce":[],"urlList":[]}}