{"title":"Frank Zappa - Shut Up 'n Play Yer Guitar TQMP","uid":5136756,"size":761326691,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bfb75110102fef230685e133b104ef40967ad8de&amp;dn=Frank+Zappa+-+Shut+Up+%5C%27n+Play+Yer+Guitar+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":51,"time":1256552210,"description":"Personnel: Frank Zappa (guitar); Warren Cucurullo (guitar, electric sitar); Steve Vai, Denny Walley, Ike Willis, Ray White (guitar); Jean-Luc Ponty (baritone violin); Tommy Mars, Peter Wolf, Eddie Jobson, Bob Harris, Andre Lewis (keyboards); Arthur Barrow, Patrick O'Hearn, Roy Estrada (bass); Vinnie Coliauta, Terry Bozzio (drums); Ed Mann (percussion). Engineers include: Bob Stone, Mick Glossop, George Douglas.Recorded between February 17, 1979 and December 11, 1980. Originally released as a 3 LP set.SHUT UP 'N PLAY YER GUITAR puts the musical spotlight on Frank Zappa's solo guitar improvisations. Although many think of Frank Zappa first and foremost as a supreme composer and satirist, many seem to overlook the fact that he was one of the greatest rock guitarists that ever lived. After all, such latter-day guitar heroes as Joe Satriani and Steve Vai (the latter was a member of Zappa's backing band in the early '80s) revered him, often listing select Zappa albums as &quot;the best guitar albums of all time.&quot; But since he refused to play commercially acceptable music, many young guitarists are unaware of Zappa's guitar prowess. To correct this, Zappa issued the double-disc set SHUT UP N' PLAY YER GUITAR in 1986. Instead of just compiling already-released tracks that prominently featured his guitar chops, Zappa searched through tapes of concerts from his 1979 and 1980 tours, and edited together his very best solos. Although this may be a monotonous listen for a non-guitar player or a newcomer to Zappa's work, guitar enthusiasts and hardcore fans will consider it a godsend. It's hard to pick just a few highlights, since each disc is meant to be listened to in it's entirety, but you can't go wrong with &quot;Hog Heaven,&quot; &quot;Five-Five-Five,&quot; and &quot;The Deathless Horsie,&quot; to name b\n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:                  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)\n\t\t\t\t","torrent":{"xt":"urn:btih:bfb75110102fef230685e133b104ef40967ad8de","amp;dn":"Frank+Zappa+-+Shut+Up+%5C%27n+Play+Yer+Guitar+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfb75110102fef230685e133b104ef40967ad8de","infoHashBuffer":{"type":"Buffer","data":[191,183,81,16,16,47,239,35,6,133,225,51,177,4,239,64,150,122,216,222]},"announce":[],"urlList":[]}}