{"title":"Bainerman-Crimes of President(conspiracy&amp;cover-up in Bush/Reagan","uid":5111148,"size":1257778,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c00f8c104a69fe51f1cf1ae361c69f76f9070902&amp;dn=Bainerman-Crimes+of+President%28conspiracy%26cover-up+in+Bush%2FReagan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1254702247,"description":"This is Joel Bainerman's explosive book The Crimes of a President - New Revelations on the Conspiracy and Cover-Up in the Bush and Reagan Administration (1992) which exposes the crimes of the Reagan and Bush administrations and discusses Bush's orchestration of the Gulf War after planning to arm Saddam Hussein, his role in the Iran-Contra scandal and the bombing of Pan Am 103. Why has George Bush Sr. silenced the truth about: the little-known deaths of 248 US. soldiers - whose secret mission ended in flaming death when their plane mysteriously crashed in Canada; a CIA conspiracy to force a D.C.-based computer firm into bankruptcy - so the Agency could steal its unique software; plans to arm Saddam Hussein with nuclear and chemical weapons - to orchestrate the Gulf War and create Bush's &quot;New World Order&quot; (and his re-election); the role of the Bush administration in the bombing of Pan Am 103 and the tragic deaths over Lockerbee, Scotland; the whole truth about Oliver North - and why George Bush needed him as a willing scape-goat; a billion dollar secret deal with Saddam Hussein - resulting in the Justice Department's attempt to conceal the B.C.C.I scandal. These revelations are all published together here for the first time. They paint a disturbing portrait of the man who has discretely controlled the political and social destiny of America for more than a decade. Has he done it through hard ball politics and swift decisive action or - through CIA spy-tactics, terror and media control? The Crimes of a President is an important document of our times and necessary reading for all who want to know what really went on during the Bush-Reagan years. 330 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:c00f8c104a69fe51f1cf1ae361c69f76f9070902","amp;dn":"Bainerman-Crimes+of+President%28conspiracy%26cover-up+in+Bush%2FReagan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c00f8c104a69fe51f1cf1ae361c69f76f9070902","infoHashBuffer":{"type":"Buffer","data":[192,15,140,16,74,105,254,81,241,207,26,227,97,198,159,118,249,7,9,2]},"announce":[],"urlList":[]}}