{"title":"Build_a_lot_Collection.ShareReactor","uid":5055355,"size":298486072,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c0a18a809c6265088cb0d1350ac03d6a3845c8a0&amp;dn=Build_a_lot_Collection.ShareReactor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Groo_The_Wanderer","files":-1,"time":1250381066,"description":"Build-a-lot Collection:\n~~~~~~~~~~~~~~~\n\nBuild-a-lot\nBuild-a-lot 2 - Town of the Year\nBuild-a-lot 3 - Passport to Europe\nBuild-a-lot 4 - Power Source\n\nDeveloper: HipSoft\nPublisher: Reflexive Arcade Games\nGenre: Business Strategy\nRelease Date: 2007, 2008, 2009\n\nFile Details:\n\nRAR count: [20 x 15 MB]\n\nSystem Requirements:\n~~~~~~~~~~~~~~~~\n\nOS: Windows 98, Windows 2000, Windows XP, Windows Vista\nMemory: 256 MB\nCPU: P500\n\nSynopsis:\n~~~~~~~\n\nBuild-a-lot:\n~~~~~~~~\n\nSend the housing market through the roof as you build, buy, and sell houses in the new strategy game, Build-a-lot! You can flip houses for quick cash or sit back and watch the rental income pile up. Become a real estate mogul as you visit scenic towns, earn huge profits and perform special favors for the colorful local mayors. Can you build a new cinema for the local movie star? Install a bowling alley in the Mayor's Mansion? No problem! There's plenty to do and lots of fun ahead in Build-a-lot!\n\nBuild-a-lot 2: Town of the Year:\n~~~~~~~~~~~~~~~~~~~~~~\n\nIt's time to get busy again building, buying and selling houses in this exciting sequel! There are new towns to explore, new Mayors to meet and lots of money to be made! Use your keen eye to pick the right locations to build parks and shops. Pick your paint colors, upgrades and landscaping to create the ultimate curb appeal and earn outstanding profits. How about a latte from the new coffee shop? Some new flower boxes from the garden center? It's all waiting for you in Build-a-lot 2!\n\nBuild-a-lot 3: Passport to Europe:\n~~~~~~~~~~~~~~~~~~~~~~~\n\nBuild-a-lot 3 is your passport to fun! Travel all over Europe as you restore rundown houses, develop friendly services and beautify neighborhoods with picturesque landmarks. The changing needs of the neighborhood will definitely keep you busy--you may need to brave the rain and snow, deal with noisy neighbors, or even put out a small fire to get the job done on time! Pack your bags and let the fun take flight in the exciting sequel to Build-a-lot 1 &amp; 2!\n\nBuild-a-lot 4: Power Source:\n~~~~~~~~~~~~~~~~~~~\n\nThe power is in your hands! Help friendly towns to grow and glow by building neighborhoods and generating clean energy to make them run. Get your neighborhoods fit and fancy by building tennis courts, swimming pools, boutiques and more. With multiple campaigns to play and a variety of awards to earn, there is plenty to do and lots of fun waiting for you in this electrifying addition to the Build-a-lot series!\n\nINSTALLATION INSTRUCTIONS:\n~~~~~~~~~~~~~~~~~~~~~~\n\nDouble-Click [BuildalotSetup.exe].\n\nFollow the installation instructions.\n\nDo NOT launch the game yet !!!\n\nDouble-Click [All Reflexive Games Universal Crack v4.1 [FFF].exe] press &quot;Go !&quot; button and browse to the default installation directory C:Program FilesBuildalot, select [Buildalot.exe].\n\nPress &quot;Save&quot;, a [Buildalot.exe.bak] file will be created automatically.\n\nI chose the recommended default method 1 and it works just fine.\n\nNOTE:\n~~~~\n\nRepeat this procedure for each of the other games but keep in mind to choose the correct .exe file and of course the correct installation paths !!!\n\nBuild-a-lot 2 - Town of the Year: [Buildalot2.exe]\nBuild-a-lot 3 - Passport to Europe: [Buildalot3.exe]\nBuild-a-lot 4 - Power Source: [Buildalot4.exe]\n\nGame tested on Windows XP SP2, Intel Core 2 Duo E8500 processor with 4GB (2x2048MB), DDR2, PC2-8500, 1066 MHz, Platinum Series, Dual Channel RAM and a Gainward Radeon HD 4870 1GB GDDR5 Golden Sample Graphics Card.\n\nAnd finally enjoy it !!!\n\n:P\n\nNOTE: All files were scanned with KAV 7.0 and TrojanHunter.\n\n*** IMPORTANT NOTE ***\n\nFor those who have 'paranoid' virus scanners please read this:\n\n&quot;A WARNING TO PARANOID ANTIVIRUS USERS\n\nNO : exes files created with the Loader feature ARE NOT VIRUSES/TROJANS/WORMS/ADWARES..\nThey just depends on some tricks which are used also by most of malware nowadays. But it only manipulate files you choosed\n\nNO : files patched with Method 2 ARE NOT VIRUSES/TROJANS/WORMS/ADWARES..\nThey just depends on some tricks which are used also by most of malware nowadays. But it only manipulate the file you patch\n\nNO: THIS FILE IS NOT A VIRUS/TROJAN/WORM/ADWARE\nFFF releases are using some &quot;exes compressors&quot; in order to reduce file size &amp; prevent some kind of ripping.\nStupids antivirus software think FFF releases are viruses, because real viruses also use &quot;exe compressors&quot;.\nSome corporate antivir even detect all kind of cracks, to prevent illegal use of software.&quot;","torrent":{"xt":"urn:btih:c0a18a809c6265088cb0d1350ac03d6a3845c8a0","amp;dn":"Build_a_lot_Collection.ShareReactor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0a18a809c6265088cb0d1350ac03d6a3845c8a0","infoHashBuffer":{"type":"Buffer","data":[192,161,138,128,156,98,101,8,140,176,209,53,10,192,61,106,56,69,200,160]},"announce":[],"urlList":[]}}