{"title":"Eddy Grant - War Party [Bananas tv show 1984].VOB","uid":6264532,"size":141289472,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c0c9a74ec17d53e647763385cda9f00dbbf5a10b&amp;dn=Eddy+Grant+-+War+Party+%5BBananas+tv+show+1984%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1300864481,"description":"Eddy Grant - War Party [Bananas tv show 1984].VOB\n\n\nVery HQ Bananas tv show promo music video from an outstanding and very rare 1980's tv show from Germany, broadcasted from 1981 to 1984, this is practically unknown in America, but this show has very well known artists of the 1980's.\n\nThe rarity of this show is that, all the appearances of very well known guests are a whole new promo music video production that easly could be considered as never seen before videos or second versions of several classic 80's videos.\n\n&quot;War Party&quot; is a song from Killer on the Rampage, an album by Eddy Grant. It remains his most successful album, hitting the top 10 in the US and the UK. It features the hits &quot;Electric Avenue&quot; (which was a big hit in the US and UK at #2), &quot;I Don't Wanna Dance&quot; (a UK #1 hit) and &quot;War Party&quot;. It also features the title track which, curiously, was never released as a single.\n\nEddy Grant (born Edmond Montague Grant, 5 March 1948) is a musician, born in Plaisance, Guyana. When he was still a young boy, his parents emigrated to London, UK, where he settled. He lived in Kentish Town and went to school at the Acland Burghley Secondary Modern at Tufnell Park. He had his first number one hit in 1968, when he was the lead guitarist and main songwriter of the group The Equals, with his self-penned song &quot;Baby Come Back&quot;. The tune also later topped the UK Singles Chart again when covered by Pato Banton. Notably, he openly used his songwriting for political purposes, especially against the then-current apartheid regime of South Africa. The Clash recorded a version of &quot;Police On My Back&quot; for their Sandinista! set.\n\nGrant set up his own recording company, Ice Records and the Coach House studio, but more recently has returned to the West Indies from London, choosing Barbados as a more realistic venue for a recording company, rather than his country of origin. He has also produced for the likes of Sting, Mick Jagger and Elvis Costello.\n(video has a semi-transparent white &quot;festival&quot; logo at the top right)\n\n\n     &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Killer_on_the_Rampage&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Killer_on_the_Rampage&lt;/a&gt; \n       &lt;a href=&quot;\nhttp://bayimg.com/dAEHeAaDJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/dAEHeAaDJ&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25.00fps 9640kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:02:56\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated January 31, 2011\n\n*Media Player Classic Home Cinema*          &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t\n","torrent":{"xt":"urn:btih:c0c9a74ec17d53e647763385cda9f00dbbf5a10b","amp;dn":"Eddy+Grant+-+War+Party+%5BBananas+tv+show+1984%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0c9a74ec17d53e647763385cda9f00dbbf5a10b","infoHashBuffer":{"type":"Buffer","data":[192,201,167,78,193,125,83,230,71,118,51,133,205,169,240,13,187,245,161,11]},"announce":[],"urlList":[]}}