{"title":"Daunt and Dervish - series 1 (BBC)","uid":6235684,"size":209284302,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c107ac910a3b20fe719a4d1aefbfe3a7ed6591ba&amp;dn=Daunt+and+Dervish+-+series+1+%28BBC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fakeplastictrousers2","files":-1,"time":1299862763,"description":"Daunt and Dervish\n\nFrom BBC Radio 7. Written by Guy Meredith from an idea by Anna Massey and Imelda Staunton; Full cast dramatisations starring Anna Massey and Imelda Staunton; Directed by Cherry Cookson (ep1,3-5) and Janet Whitaker (ep2)\n\nEpisode 1 - After the Ball is Over\n\nTwo women who worked in their different ways in the Ministry of Defence during the Second World War, resolve their feelings of uselessness by setting up a detective agency.\n\nEpisode 2 - South of the Border\n\nDaunt and Dervish have established their detective agency and there is a steady flow of business. But their lives really become exciting when they rescue a woman from drowning, discover she is not at all what she seems, and find themselves involved in the more shady side of life at the race track.\n\nEpisode 3 - A Question of Class\n\nOur two female detectives return to their Covent Garden office early one morning to discover an Oxford undergraduate slumped on the doorstep wanting them to find the wallet he left in a Soho house of ill repute. Daunt's knowledge of his past makes her very suspicious of later accusations that he has beaten a woman up.\n\nEpisode 4 - Games of Chance\n\nDaunt and Dervish are called in on a sporting assignment when they are asked to do a 24 hour watch on a young East End boy who is about to fight for a place in the 1948 Olympic boxing team. The local Catholic priest has been taking a special interest in the boy's progress, but why?\n\nEpisode 5 - The Singer not the Song\n\nWhen a newspaper magnate is murdered, the obvious suspect is his much younger wife, but when the police discover that Daunt and Dervish were actually in the grounds of the house that evening, they are not only under suspicion but their licence is suspended. The only way to get it back will be for them to beat the police to the discovery of the real murderer.","torrent":{"xt":"urn:btih:c107ac910a3b20fe719a4d1aefbfe3a7ed6591ba","amp;dn":"Daunt+and+Dervish+-+series+1+%28BBC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c107ac910a3b20fe719a4d1aefbfe3a7ed6591ba","infoHashBuffer":{"type":"Buffer","data":[193,7,172,145,10,59,32,254,113,154,77,26,239,191,227,167,237,101,145,186]},"announce":[],"urlList":[]}}