{"title":"Two and a Half Men, TVSeries (divx), S04E13-16, NL Subs, DMT","uid":6139832,"size":1085939636,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c15a94978778720a841565256a9b7c20ad8cac51&amp;dn=Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S04E13-16%2C+NL+Subs%2C+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MeMar","files":-1,"time":1296460502,"description":"Two and a Half Men, TVSeries (divx), S04E13-16, NL Subs, DMT\n\n\n\nVerenigde Staten\nCategorie: Beeld\nFormaat: DivX\nOndertitels (ingebakken): Nederlands\nGenre: Sitcom\nBron: Retail\nDuur: ongeveer 20 minuten per aflevering\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0369179/episodes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0369179/episodes&lt;/a&gt; &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&lt;/a&gt;\n\nDe hoofdrollen worden vertolkt door Charlie Sheen, Jon Cryer en Angus T. Jones.\n\nHet begint met een man alleen (Alan gaat scheiden... alweer) en eindigt met een glimmende steen \n(de diamant die Evelyns nieuwe vriend aan de derde vinger van haar linkerhand wil schuiven). In de \ntussentijd is het hippe strandhuis van Charlie Harper in Malibu de perfecte plek voor grappen, mooie \nmeisjes, een eenoudergezin, beroemde buren, familie en nog meer grappen. Charlie (Charlie Sheen) \nkomt dicht in de buurt bij zijn al lang overleden vader. Alan (Jon Cryer) begint met online dating \nnadat hij zijn cv een beetje heeft opgeleukt. Jake (Angus T. Jones) vervangt zijn Harry Potter-posters \ndoor plaatjes van mooie meiden.\n\n\nAflevering 13: Don't Worry, Speed Racer\nJake vertelt Charlie en Alan dat hij zijn moeder en haar verloofde Herb 's nachts kan horen vrijen. Dit \nroept een verdrukte herinnering op bij Charlie, die op jeugdige leeftijd getuige was van een wilde \nstoeipartij van zijn moeder met haar toenmalige vriend. Hij schakelt Rose in om dit trauma te kunnen \nverwerken.\n\nAflevering 14: That's Summer Sausage, Not Salami\nCharlie denkt de perfecte vrouw voor Alan gevonden te hebben: hun nieuwe, bloedmooie buurvrouw \nDanielle. Ze heeft dezelfde interesses als zijn broer, ze is eveneens gescheiden, op zoek naar een \nserieuze relatie en rijk. Charlie besluit hen aan elkaar voor te stellen, maar na een tijdje ontdekt hij \nde ware aard van Danielle, waardoor hij een tikkeltje jaloers wordt op zijn broer.\n\nAflevering 15: My Damn Stalker\nRose brengt de Harpers op de hoogte van haar beslissing om naar Londen te verhuizen. Charlie \ngelooft haar eerst niet en trekt zich aanvankelijk ook weinig aan van haar nakend vertrek, maar \nlangzaam maar zeker beseft hij dat hij oprecht veel voor haar voelt. Ondertussen waagt Alan een \nnieuwe poging om de ware liefde te vinden. Zijn verbloemd profiel op een dating-website valt \nmeteen in de smaak bij de alleenstaande Beverly, maar ook zij nam een loopje met de waarheid\n\n\nAflevering 16: Young People Have Phlegm Too\nCharlie is verontwaardigd wanneer zijn nieuwe vriendin - een knappe 24-jarige actrice - hem als oud \nbeschouwt. Vastberaden om haar het tegendeel te bewijzen, gaat hij een avondje stappen met haar \nin de hipste discotheek uit de buurt. Maar wanneer hij na afloop met pijn in de borststreek moet \nworden opgenomen in het ziekenhuis, moet hij zijn jonge vriendin toch gelijk geven.\n\n\nDeze serie wordt u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:c15a94978778720a841565256a9b7c20ad8cac51","amp;dn":"Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S04E13-16%2C+NL+Subs%2C+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c15a94978778720a841565256a9b7c20ad8cac51","infoHashBuffer":{"type":"Buffer","data":[193,90,148,151,135,120,114,10,132,21,101,37,106,155,124,32,173,140,172,81]},"announce":[],"urlList":[]}}