{"title":"Xilisoft Video Converter Ultimate 6.5.2.0214 + Serial-[HB]","uid":6176576,"size":31059299,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c30954090f1ad434e9698c9e77d47ffba62cb3fb&amp;dn=Xilisoft+Video+Converter+Ultimate+6.5.2.0214+%2B+Serial-%5BHB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"[HB]","files":-1,"time":1297789791,"description":"+----------------------------------------------------------+\n|Xilisoft Video Converter Ultimate 6.5.2.0214 + Serial-[HB]|\n+----------------------------------------------------------+\n\nXilisoft Video Converter is powerful, versatile video conversion software which converts between all popular video formats such as convert AVI to MPEG, WMV to AVI, WMV to MPEG or H.264/AVC video, convert AVI files to iPod formats, etc. No other programs like Xilisoft Video Converter supports so comprehensive video formats including AVI, MPEG, WMV, DivX, MP4, H.264/MPEG-4 AVC, RM, MOV, XviD, 3GP, FLV, VOB (the video format used in DVD), DAT (the video format used in VCD, SVCD), etc. In addition, the video converter provides an easy way to convert video file to popular audio file, like MP2, MP3, WMA, WAV, RA, M4A, AAC, AC3, OGG, etc. The video converter also supports APE, CUE decoding and audio CD ripping.\n\n- Act as 3GP Video Converter, iPod Video Converter, PSP Video Converter, Zune Video Converter, AVI MPEG Converter, MP4 Video Converter, MOV Converter, MKV to MPEG converter, etc.;\n- Convert between all popular video formats including AVI, MPEG, WMV, DivX, MP4, H.264/MPEG-4 AVC, RM, MOV, XviD, 3GP, FLV, help you on how to convert AVI to MPEG, convert MKV to AVI, convert MKV to MPEG;\n- Convert videos to popular audio files, including MP2, MP3, WMA, WAV, RA, M4A, AAC, AC3, and OGG, and convert between these audio formats;\n- Extract pictures from video and output them as JPG, PNG, GIF, BMP, SWF;\n- Convert pictures to video formats like AVI, FLV, SWF, MOV, 3GP, WMV, etc.\n\n+------------+\n|Key Features|\n+------------+\n\n- Powerful video effect editing functions to customize your video: crop video size, edit video effects, and add video watermark; (Ultimate only)\n\n- Support the decoding and encoding of lossless audio; (Ultimate only)\n\n- Preview and compare the source video and fixed video; (Ultimate only)\n\n- Merge several video segments to one for conversion; (Ultimate and Platinum only)\n\n- Clip segments from video and audio, and output them respectively or merge them into one for output; (Ultimate and Platinum only)\n\n- Preview clipped video segment; (Ultimate and Platinum only)\n\n- More optimized and classified profiles are supported now, and any profile can be customized to create your own one with your favorite settings;\n\n- Customize the output file size and auto-calculate corresponding video bit rate;\n\n- Multiple output formats can be set for one original to facilitate your conversion;\n\n- Convert videos to compatible formats to work on PSP, PS3, iPod, iPhone, Apple TV, Zune, Archos, blackberry, iRiver PMP, Creative Zen, etc.;\n\n- It supports H.264/AVC video format, PSP H.264/MPEG-4 AVC encoding/decoding, PSP H.264/AVC Video (480x272) (*.mp4);\n\n- It provides batch conversion and multithreading, thus you can select multiple files at one time to have them convert one by one automatically;\n\n- You can convert any clip or segment of the video at will by setting the start point and duration, and split one source file to several by duration or file size;\n\n- video codec and audio codec can be modified: alternatively select video codec such as MPEG4, DVvideo, Mjpeg, etc. for AVI, H263, and MPEG4 for 3GP, as well as audio codec like PCM, MP2, MP3, MPEGAAC, AC3, etc.\n\n- When converting files, you can pause, stop and continue at any moment;\n\n- You can keep the default settings or set parameters of the video and audio by yourself to get particular effects for output file.\n\n\t\n","torrent":{"xt":"urn:btih:c30954090f1ad434e9698c9e77d47ffba62cb3fb","amp;dn":"Xilisoft+Video+Converter+Ultimate+6.5.2.0214+%2B+Serial-%5BHB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c30954090f1ad434e9698c9e77d47ffba62cb3fb","infoHashBuffer":{"type":"Buffer","data":[195,9,84,9,15,26,212,52,233,105,140,158,119,212,127,251,166,44,179,251]},"announce":[],"urlList":[]}}