{"title":"Warriors Legends of Troy [EUR][Multi5][Spanish][PS3][www.consola","uid":6248659,"size":14580964791,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:c39ae431324e20ee1bef26e0edd6de0af49587f8&amp;dn=Warriors+Legends+of+Troy+%5BEUR%5D%5BMulti5%5D%5BSpanish%5D%5BPS3%5D%5Bwww.consola&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"consolasatope","files":102,"time":1300321378,"description":"Los chicos de Koei, responsables de la saga Dynasty Warriors, pretenden prolongar el ÃƒÂ©xito de sus combates masivos y sus ÃƒÂ©picas luchas cuerpo a cuerpo contra cientos de unidades sacÃƒÂ¡ndolos del contexto histÃƒÂ³rico japonÃƒÂ©s para acercarlo a un nuevo perfil de pÃƒÂºblico: El occidental.\n\nÃ‚Â¿CÃƒÂ³mo hacerlo? Este estudio oriental ha pensado que la mejor fÃƒÂ³rmula es la de acercarse a textos clÃƒÂ¡sicos como La IlÃƒÂ­ada, por ejemplo, para trasladarlos a videojuego, y de ahÃƒÂ­ viene la coletilla del videojuego Leyendas de Troya -Legends of Troy-. HÃƒÂ©ctor batallarÃƒÂ¡ con los troyanos, Aquiles con los griegos, etcÃƒÂ©tera...\n\nÃ‚Â¡AtenciÃƒÂ³n amantes de la casquerÃƒÂ­a! Warriors Legends of Troy llega para convertir La IlÃƒÂ­ada en un sangriento festÃƒÂ­n de muerte y desmembraciones.\nÃ‚Â¡AtenciÃƒÂ³n amantes de la casquerÃƒÂ­a! Warriors Legends of Troy llega para convertir La IlÃƒÂ­ada en un sangriento festÃƒÂ­n de muerte y desmembraciones.\nFidelidad HistÃƒÂ³rica y MitologÃƒÂ­a\nWarriors se desarrolla en la fantasÃƒÂ­a mitolÃƒÂ³gica en la que Zeus reinaba sobre todos los dioses y los hombres, y que tenÃƒÂ­a al mundo sobrecogido por la batalla entre dos ciudades que acabÃƒÂ³ desembocando en la guerra entre troyanos y griegos. En el videojuego habrÃƒÂ¡ dos campaÃƒÂ±as individuales, una por cada bando, y en las dos sus responsables pretenden mezclar elementos histÃƒÂ³ricos con legendarios para conseguir un todo ÃƒÂºnico y genuino.\n\nY es que como decimos Koei pretende dar con un complicado equilibrio que le permita simultanear la fidelidad histÃƒÂ³rica a la ÃƒÂ©poca en cuanto a armas, entornos, armaduras y eventos histÃƒÂ³ricos, con la ilusiÃƒÂ³n de la mitologÃƒÂ­a griega y de relatos como La IlÃƒÂ­ada para construir un combate brillante y fantasioso.\n\nDe hecho hay muy poco de veracidad en un combate en el que deberemos plantar cara en solitario a cientos de enemigos con la ÃƒÂºnica ayuda de nuestras armas y en solitario, ejecutÃƒÂ¡ndolos con numerosos movimientos especiales y certeras cuchilladas. Hay que en insistir en el aspecto de &quot;en solitario&quot;, puesto que el videojuego no soportarÃƒÂ¡ cooperativo de ningÃƒÂºn tipo, asÃƒÂ­ que deberemos ser nosotros ÃƒÂºnicamente los que nos enfrentemos a las hordas de oponentes.\n\nMezclando mecÃƒÂ¡nicas clÃƒÂ¡sicas de Hack and Slash con violentas ejecuciones, Legends of Troy pretende llevar la fÃƒÂ³rmula Dynasty Warriors a la Grecia mitolÃƒÂ³gica.\nMezclando mecÃƒÂ¡nicas clÃƒÂ¡sicas de Hack and Slash con violentas ejecuciones, Legends of Troy pretende llevar la fÃƒÂ³rmula Dynasty Warriors a la Grecia mitolÃƒÂ³gica.\nEl juego mezcla el Hack and Slash clÃƒÂ¡sico con las mencionadas ejecuciones, y todo ello lo consigue con mucho ritmo y con el gancho que supone para el pÃƒÂºblico occidental el jugar con HÃƒÂ©ctor por el bando troyano y con Aquiles por el griego. Toda la acciÃƒÂ³n y los golpes de espada se mezcla con algÃƒÂºn ocasional QuickTime Event al mÃƒÂ¡s puro estilo God of War para acabar, por ejemplo, con las figuras mÃƒÂ¡s grandes en sangrientas y salvajes animaciones.\n\nDe momento es muy poco lo que se sabe de Warriors: Legends of Troy, puesto que en Koei estÃƒÂ¡n siendo muy secretistas en lo que se refiere a su desarrollo a pesar de que el tÃƒÂ­tulo se pondrÃƒÂ¡ a la venta en otoÃƒÂ±o de este mismo aÃƒÂ±o para PlayStation 3 y Xbox 360","torrent":{"xt":"urn:btih:c39ae431324e20ee1bef26e0edd6de0af49587f8","amp;dn":"Warriors+Legends+of+Troy+%5BEUR%5D%5BMulti5%5D%5BSpanish%5D%5BPS3%5D%5Bwww.consola","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c39ae431324e20ee1bef26e0edd6de0af49587f8","infoHashBuffer":{"type":"Buffer","data":[195,154,228,49,50,78,32,238,27,239,38,224,237,214,222,10,244,149,135,248]},"announce":[],"urlList":[]}}