{"title":"Alice in Chains - Black Gives Blue 2009 [FLAC] - Kitlope","uid":5109118,"size":404729700,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c41ff188651d7dff4f227ed81d0172df6d05079c&amp;dn=Alice+in+Chains+-+Black+Gives+Blue+2009+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kitlope","files":15,"time":1254619738,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: C41FF188651D7DFF4F227ED81D0172DF6D05079C\nFile Size: 385.98 Mb\nYear: September 25 2009\nLabel: Virgin / EMI\nCatalog #: 509999 67159 25\n\n\nPlease help seed these FLACs! \n\n\n\n\n\n*Strange, there's some sort of censor here at TPB and I cannot put in the proper title &quot;Black Gives Way To Blue&quot; as it automatically changes it to &quot;Black Gives Blue&quot;. Must be a pr0n thing...\n\n\n\n\n\n\nFrom Wiki:\n\n\nAlice in Chains is an American rock band formed in Seattle, Washington, in 1987 by guitarist Jerry Cantrell and vocalist Layne Staley. Although widely associated with grunge music, the band's sound incorporates heavy metal and acoustic elements. Since its formation, Alice in Chains has released four studio albums, three EPs, two live albums, four compilations, and two DVDs. The band is known for its distinct vocal style which often included the harmonized vocals of Staley and Cantrell.\n\nAlice in Chains rose to international fame as part of the grunge movement of the early 1990s, along with bands such as Nirvana, Pearl Jam, and Soundgarden. The band was one of the most successful music acts of the 1990s, selling over 17 million albums worldwide,[1] including 14 million in the United States alone.[2] The band achieved two number-one Billboard 200 albums (Jar of Flies and Alice in Chains), 12 top ten singles on the Mainstream Rock Tracks charts, and six Grammy Award nominations.\n\nAlthough never officially disbanding, Alice in Chains was plagued by extended inactivity due to Layne Staley's problems with substance abuse, culminating in his death in 2002. Alice in Chains reunited in 2005 with new lead vocalist William DuVall and released Black Gives Way to Blue, their first studio album in 14 years, on September 29, 2009.[1]\n\n\n\n\n\nBlack Gives Way To Blue 2009\n\n\n\nBlack Gives Way to Blue is the fourth studio album by the American rock band Alice in Chains, which was released in Australia on September 25, 2009 and in the United States four days later.[10] The first Alice in Chains album in nearly fourteen years, Black Gives Way to Blue is their first release with new vocalist William DuVall, who replaced the late Layne Staley. Black Gives Way to Blue marks the first Alice in Chains album released on Virgin Records, their first venture away from Columbia, who released all of their previous releases.\n\nThe span of nearly fourteen years between the self-titled album and Black Gives Way to Blue marks the longest gap between studio albums in Alice in Chains' career. The band had been working on new material since early 2006,[11] shortly before hiring DuVall as their new singer. By April 2007, Alice in Chains had been writing and demoing songs for the album,[12] but the band did not show further signs of progress until October 2008, when they announced that they had begun recording with producer Nick Raskulinecz (of Foo Fighters, Stone Sour and Rush fame) in the studio.[13] The writing and recording process was completed on March 18, 2009, guitarist Jerry Cantrell's 43rd birthday.\n\nIn 2005, guitarist Jerry Cantrell, bassist Mike Inez, and drummer Sean Kinney reunited to perform a benefit concert in Seattle for victims of the tsunami disaster that struck South Asia.[15] On March 6, 2006, the surviving members performed at VH1's Decades Rock Live concert, honoring fellow Seattle musicians Ann and Nancy Wilson of Heart. The band followed the concert with a short United States club tour, several festival dates in Europe, and a brief tour in Japan. Comes with the Fall vocalist William DuVall joined Alice in Chains as lead singer during the band's reunion concerts.\n\nKinney mentioned in a February 2006 interview that he would be interested in writing new material, but not as Alice in Chains. He explained, &quot;If we found some other dude, I'd love to move on, write some cool tunes and change the name and go on like that. I don't see continuing as Alice and replacing somebody. ... We're not trying to replace Layne. We want to play these songs one more time, and if it seems like the right thing to do, it'll happen. I don't know how long it will go or where it will take us. It's kind of a tribute to Layne and our fans, the people who love these songs. It's not some 'I'm broke and I need the money' situation. We love playing together.&quot;[11] However, AliceinChains.com reported that the band had begun writing new material, with DuVall on lead vocals.\n\nIn April 2007, frontman DuVall posted an update on progress towards the writing of the album, saying that Alice in Chains had been in Los Angeles, California for five days, &quot;sat through three rehearsals and one demo recording session, listened to several other demos&quot; and the new material was &quot;kicking his ass right out of his pants.&quot;[12] In September 2008, it was reported that Alice in Chains would enter the studio that October to begin recording a new album for a summer 2009 release.[16] Recording began on October 23, 2008 at the Foo Fighters' Studio 606 in Northridge, California with producer Nick Raskulinecz (Foo Fighters, Rush, Stone Sour, Trivium, Shadows Fall, Death Angel).[13] In mid-2009, Cantrell told Revolver Golden God Awards that Alice in Chains had finished recording the album on March 18 (his 43rd birthday) and were in the process of mixing it for a September 29 release.\n\nIn April 2009, a blog post from the band expressed the hope that &quot;these songs will strike a chord and make a similar impact on all of you out there that were moved by this band in the first place.&quot;[17] Kinney said that the music on the album doesn't deviate too far from the band's past music, adding, &quot;It's nice to sound like yourself...It's not really that hard, actually. I know people are blown away that we really sound like ourselves, and I understand the apprehension, but it's not really that big a stretch to sound the way that you sound.&quot;[18] There are hard rock as well as acoustic songs featured on the album.[18] In addition, it has been announced that Elton John appears on the album's title track.[19]\n\nKinney said that there are lyrics on the album that deal with original vocalist Layne Staley. He elaborated, &quot;There's not a day that goes by that I don't think of him. And there's a lot to address, with all of that stuff coming to the forefront. A lot has happened since 1995, a lot has happened in our lives and we've never talked about it or discussed it publicly. So some of that is what's addressed here. That's the way we operate, it's about what really happened in life. We're not really the fast cars and chicks songs. It's basically what's happened in life, but a lot has happened since the last record. And it's on this record.&quot;[18] The title track &quot;Black Gives Way to Blue&quot; was written as a tribute to Staley.[20] Regarding the lyrics to other specific songs, Cantrell said the first single from the album, &quot;A Looking in View&quot;, &quot;basically speaks to any number of things that keep you balled up inside.&quot;[21] The second single, &quot;Check My Brain&quot;, features lyrics dealing with Cantrell's move from Seattle to Los Angeles in 2003.[22] Another song on the album, &quot;Your Decision&quot;, contains lyrics about &quot;surviving pain and choosing to live.&quot;\n\nOn April 25, 2009, it was reported that the new Alice in Chains album would be released on their new label Virgin/EMI,[23] making it the band's first label change in their 20-plus year career. Alice in Chains revealed parts of their new album at a listening party on July 14, 2009 in Los Angeles. They played the entire album over the PA system and performed an acoustic set including versions of songs &quot;Your Decision&quot; and &quot;Black Gives Way to Blue&quot;. Another listening event took place on July 21, 2009 in New York.[20] The UK magazine Classic Rock awarded the album nine out of ten stars in its review section in September 2009.[24] Metal Hammer magazine awarded the album 10/10 in September.\n\nOn June 30, 2009, one of the album's songs, &quot;A Looking in View&quot;, was released as the first single from the album. It was made available for a limited time as a free download through the official Alice in Chains website in early July. The music video for &quot;A Looking in View&quot; debuted via Alice in Chains' official website on July 7, 2009. The second single &quot;Check My Brain&quot; was released to radio stations on August 14, 2009, and was made available for purchase on August 17, 2009.[25] The music video for &quot;Check My Brain&quot; premiered on September 14, 2009.[26] As of late-September &quot;A Looking in View&quot; has peaked at number 12 on the Billboard Hot Mainstream Rock Tracks chart and at number 27 on the Billboard Rock Songs chart and &quot;Check My Brain&quot; has peaked at number 94 on the Billboard Hot 100, at number 75 on the Hot 100 Airplay chart, at number one on the Billboard Hot Mainstream Rock Tracks and Billboard Rock Songs charts, and at number one on the Billboard Hot Alternative Rock Tracks chart.[27][28] Both singles are available for purchase through the iTunes music store and Amazon.com.\n\n\n\n\n\nTracks: \n\n\n1.\t&quot;All Secrets Known&quot;  \n2.\t&quot;Check My Brain&quot;  \n3.\t&quot;Last of My Kind&quot;  \n4.\t&quot;Your Decision&quot;  \n5.\t&quot;A Looking in View&quot;  \n6.\t&quot;When the Sun Rose Again&quot;  \n7.\t&quot;Acid Bubble&quot;  \n8.\t&quot;Lesson Learned&quot;  \n9.\t&quot;Take Her Out&quot;  \n10.\t&quot;Private Hell&quot;  \n11.\t&quot;Black Gives Way to Blue&quot;  \n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:c41ff188651d7dff4f227ed81d0172df6d05079c","amp;dn":"Alice+in+Chains+-+Black+Gives+Blue+2009+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c41ff188651d7dff4f227ed81d0172df6d05079c","infoHashBuffer":{"type":"Buffer","data":[196,31,241,136,101,29,125,255,79,34,126,216,29,1,114,223,109,5,7,156]},"announce":[],"urlList":[]}}