{"title":"Claw Boys Claw - Sugar  [1992] [Remaster 2008]  [Robbie60] [FLAC","uid":6170496,"size":385844752,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c43d2e10388cc9c957c29003b57bd8b2a9667554&amp;dn=Claw+Boys+Claw+-+Sugar++%5B1992%5D+%5BRemaster+2008%5D++%5BRobbie60%5D+%5BFLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robbie6ty","files":-1,"time":1297551150,"description":"Claw Boys Claw\nSugar\n\n\n\nLabel: EMI\nReleased: 1992\nRemastered: 2008\nSource: Original CD \nSize Torrent: 367 MB\nFormat: FLAC\n\n\n\n\n\nGod help the beast in Claw Boys Claw, for they are the expert representatives of a truly deranged performance mentality ever to dwell on the Dutch club circuit. On-stage, the band's main attraction is lead singer Peter Te Bos, quite possibly a species of the same breed as Jeffrey Lee Pierce, Nick Cave circa the Birthday Party, and Stooges-era Iggy Pop. Obviously inspired by these better-known U.S. colleagues, between 1983 and 1997 Claw Boys Claw succeeded in carving their own piece of garage rock and punk blues , introducing subtle doses of psychedelia and country on 1997's Will-o-the-Wisp. Although never officially disbanding, nothing was heard from them thereafter. From 1999 on, rumors circulated that they were working on new material.\n\nTogether with Fatal Flowers, Claw Boys Claw deserves to be credited as the most important group to evolve from the Dutch capital's early-'80s punk scene (aka &quot;Amsterdam School of Guitar&quot;). Formed in 1983 by l'Attentat's Allard Jolles, the band almost immediately gained attention from public and press. Their first lineup consisted of Bobbie Rossini on bass, guitarist John Cameron, and Jolles himself on drums. By coincidence (i.e. being spotted in a supermarket by future girlfriend Rossini), singer Peter Te Bos walked in on the band and completed the lineup. After winning a local band contest, the prize money was used to record a debut album. Shocking Shades of Claw Boys Claw received fair responses upon its 1984 release and Claw Boys Claw embarked on a series of national gigs. A far-out performance by singer Te Bos, as well as their memorable cover of Shocking Blue's &quot;Venus,&quot; don't fail to make a lasting impression. In 1986 they were signed by Polydor and played both the renowned Dutch Pink Pop Festival and Roskilde in Denmark. On a national scale Te Bos made a nice job of their reputation as well by kissing the Dutch State Secretary for Welfare, Public Health and Culture on the occasion of being honored with the BV Pop Award.\n\nAlthough their fourth album Crack My Nut got them as far as New York's New Music Seminar, media attention didn't translate into sales of any kind. After being dumped by Polydor, Claw Boys Claw struck back with Hitkillers. Consisting only of cover versions, it's remarkable for turning Dutch pop classics by the likes of Earth and Fire and Cuby &amp; the Blizzards inside out, in a way that surpasses the earlier &quot;Venus.&quot; The back cover shows a hilarious photo gallery with pictures of the band dressed up as their supposed heroes. Tour obligations with regard to Songs for Drella held none other than John Cale back from producing the next Claw Boys Claw record. Angelbite marked a shift towards a more bluesy and melodic sound. More effort was put into rhythmic structures, and Te Bos' singing is gradually improving. In the process, Rossini and Jolle's replacement Marius Schrader quit the band and were replaced with Arno Kooy and Marc Lamb.\n\nTurning to a more acoustic approach on-stage helped further to improve their sound. Eventually, this led to an artistic and financial highlight with 1992's Sugar, for which the band joined forces with producer Michel Schoots (aka Urban Dance Squad drummer Magic Stick) and yet another bass player (ex-Fatal Flowers Geert de Groot). A surprise entry in the Dutch charts for &quot;Rosie&quot; helped to sell 30.000 copies of the album. Sugar was followed by 1994's less successful Nipple, and after a three year gap, Claw Boys Claw released what turned out to be their last album for a long period: Will-o-the-Wisp. Psychedelic arrangements and a touch of country did not lead to an expected breakthrough. Individual bandmembers turned to their own musical courses, while Te Bos engages himself fully as a graphic designer. Among his better-known work are the Urban Dance Squad logo and the mascot of the Dutch Campingflight to the Lowlands festival. \n\n\n&quot;Sugar&quot; was released in 1992 and remastered in 2008.\n\n\n\n\n\nPersonnel\n\nPeter Te Bos: vocals \nJohn Cameron: guitar \nGeert De Groot: bass \nMarc Lamb: drums\nMagic Stick: percussion\n\n\n\n\nTrack Listing\n\nHail On \nRosie \nJackal Is Back \nSound Of The Psycho \nMonkeyride \nSpread That Jam \nEdit Away \nUse It \nHide \nSugarlite Blonde \nY.O.Y. \nTake Me For A Ride \nRosie (Lambless)\nSpread That Jam (Remix) (2008 Reissue Only) \nThe Keeper (2008 Reissue Only) \n","torrent":{"xt":"urn:btih:c43d2e10388cc9c957c29003b57bd8b2a9667554","amp;dn":"Claw+Boys+Claw+-+Sugar++%5B1992%5D+%5BRemaster+2008%5D++%5BRobbie60%5D+%5BFLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c43d2e10388cc9c957c29003b57bd8b2a9667554","infoHashBuffer":{"type":"Buffer","data":[196,61,46,16,56,140,201,201,87,194,144,3,181,123,216,178,169,102,117,84]},"announce":[],"urlList":[]}}