{"title":"Encyclopedia of Marine Mammals (2002)","uid":5506021,"size":76581559,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4a5e709987ebb14aec66fad42370daf4dc5366d&amp;dn=Encyclopedia+of+Marine+Mammals+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"artpepper","files":-1,"time":1271812828,"description":"Encyclopedia of Marine Mammals\n\nBernd Wursig, J.G.M. Thewissen\n\nAcademic Press 2002 | ISBN-10: 0125513402 | 1414 Pages | PDF | 67,8 MB\n\n\n\n\n\n\n\n\nReviews:\n\n&quot;This massive volume covers all aspects of marine mammals, with the topics alphabetically arranged for ease of use. The 283 articles contained here were expressly commissioned for this volume, and represent the most scientifically accurate and current science available on marine mammals. The encyclopedia is generously illustrated with photographs (including 16 pages of color plates), anatomical line drawings, charts, and figures. It is extensively referenced to the scientific literature, with approximately 3000 bibliography entries, and the appendix includes biographies of famous scientists and a definitive listing of all known marine mammals. This text is sure to be an invaluable reference on marine mammals for a large audience of researchers, students at all levels, and the general public.&quot;\n- SOUTHEASTERN NATURALIST\n\n\n&quot;This impressive reference would make an excellent addition to any library...&quot;-ENCYCLOPEDIA OF DINOSAURS AND VOLCANOES (February 2003)\n\n\n&quot;Very highly recommended for students, professionals, researchers and lay people with an interest in marine mammals.&quot;\n-WILDLIFE ACTIVIST (Fall 2002)\n\n\n&quot;...an excellent resource for beginning research. ...This encyclopedia is very highly recommended for all academic and larger public libraries.&quot;\n-Teresa Bowden, Villanova University Falvey\nMemorial Library for E-STREAMS (September 2002)\n\n\n&quot;...students beginning postgraduate study on marine mammals and researchers and academics working on marine mammals will find it indispensable.&quot;\n-Ivan Lawler, James Cook University of North Queensland for JOURNAL OF EXPERIMENTAL MARINE BIOLOGY AND ECOLOGY (September 2002)\n\n\n&quot;...this is a fascinating volume. If you are interested in marine mammals, you will buy this book. It is likely to become a standard reference book in many libraries.&quot;\n-Don E. Wilson, National Museum of Natural History, Smithsonian Institution, Washington D.C. for JOURNAL OF MAMMALOGY (2002)\n\n\n&quot;...provides a generally effective and efficient mode for transmitting information from the vast literature reviewed by the authors...establishes a solid and satisfying foundation for current study and future exploration.&quot;\n-SCIENCE (July 2002)\n\n","torrent":{"xt":"urn:btih:c4a5e709987ebb14aec66fad42370daf4dc5366d","amp;dn":"Encyclopedia+of+Marine+Mammals+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4a5e709987ebb14aec66fad42370daf4dc5366d","infoHashBuffer":{"type":"Buffer","data":[196,165,231,9,152,126,187,20,174,198,111,173,66,55,13,175,77,197,54,109]},"announce":[],"urlList":[]}}