{"title":"El.hombre.de.la.plata.(ebook).","uid":6163421,"size":4643364,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4c30cfac37377351d41492685bdcc11abfb6b8e&amp;dn=El.hombre.de.la.plata.%28ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1297297336,"description":"LeÃƒÂ³n Arsenal puso de manifiesto su talento para la creaciÃƒÂ³n de tramas de aventuras ya en la primera versiÃƒÂ³n de El hombre de la plata (2000), una obra situada en el siglo VI a. C. en el sur de la penÃƒÂ­nsula IbÃƒÂ©rica, donde florece la legendaria cultura de Tartessos. Con esta nueva versiÃƒÂ³n ampliada, como explica el autor en el prÃƒÂ³logo, cierra algunas brechas narrativas de la primera ediciÃƒÂ³n y pule ciertas cuestiones de estilo que contribuyen a hacer de esta novela una obra redonda.\n\n\n\nEl saqueo de la tumba de un noble, con el hallazgo de una enigmÃƒÂ¡tica pieza de plata, es el desencadenante de una trepidante aventura en que la acciÃƒÂ³n y la intriga se alternan a medida que se avanza en un espectacular recorrido por el MediterrÃƒÂ¡neo occidental. La perfecta recreaciÃƒÂ³n literaria de toda una cultura legendaria, la precisiÃƒÂ³n en el detalle histÃƒÂ³rico, la maestrÃƒÂ­a en la creaciÃƒÂ³n de personajes y la indiscutible pericia de LeÃƒÂ³n Arsenal para sumergir al lector en una vorÃƒÂ¡gine de tensiÃƒÂ³n narrativa, suspense y sorpresas hacen de esta nueva versiÃƒÂ³n de El hombre de la plata todo un hito de la novela histÃƒÂ³rica espaÃƒÂ±ola.","torrent":{"xt":"urn:btih:c4c30cfac37377351d41492685bdcc11abfb6b8e","amp;dn":"El.hombre.de.la.plata.%28ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4c30cfac37377351d41492685bdcc11abfb6b8e","infoHashBuffer":{"type":"Buffer","data":[196,195,12,250,195,115,119,53,29,65,73,38,133,189,204,17,171,251,107,142]},"announce":[],"urlList":[]}}