{"title":"Your Uninstaller! Pro 7.3.2010.33 Incl. crack &amp; key[ak] ","uid":6147341,"size":11101188,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c586ae84db33c0a0efe0c4465140381d812ecb9d&amp;dn=Your+Uninstaller%21+Pro+7.3.2010.33+Incl.+crack+%26+key%5Bak%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1296740002,"description":"Your Uninstaller! Pro 7.3.2010.33 Incl. crack &amp; key \nYour Uninstaller! 2010, the award winning uninstaller product on the market. Keeping all the features of previous features, Your Uninstaller! 2010 comes with more amazing features.\n\nHaving trouble uninstalling a program? Is your computer getting slower and slower? Get the best uninstaller software - Your Uninstaller! now to Make Your Computer Fast and Clean!\n\nYour Uninstaller! uninstaller software is the industry's leading uninstaller. It comes with SmartUninstall which helps you completely remove applications.\n\nWhat's New in Your Uninstaller! Pro v7.0:\n\n* This is a major upgrade from Your Uninstaller! 2008 with many improved and new features.\n* Greatly improves the scanning speed on searching over system files and registry.\n* Supports 64 bit platforms like Windows XP 64 and Windows 7 64.\n* Optimized match method to accurately locate unnecessary items.\n* Different scan level after uninstall for all users.\n* Newly added Uninstall Hunter makes uninstall even easier.\n* Fully Windows 7 support.\n* Groups all installed programs for clear view.\n* Mark programs as &quot;Never Uninstall&quot; to prevent uninstalling important programs accidently.\n* Monitors newly installed programs and reports as soon as possible.\n* Re-organize features to make them easier to find and use.\n* Backs up system state before uninstall so you can restore to an earlier state any time.\n* Core level optimization for uninstall performance.\n* New &quot;Quick Uninstall&quot; to uninstall some programs with only one click.\n* New &quot;Type and Go&quot; feature to uninstall programs by typing a few words.\n* Re-designed Startup Manager to work on both 64 bit and 32 bit platforms.\n* Re-designed Disk Cleaner for better performance and easier to use.\n* Improved Trace Eraser to wipe all surfing information with NON-RECOVERABLE removal.\n* Improved loading speed of Start Menu Cleaner.\n* New &quot;File Shredder&quot; to permanently destroy secure data.\n* New &quot;Windows Tools&quot; to discover more on Windows.\n* More advanced options for experts.\n\n* Compatible with: Win98/98SE/Me/2000/XP/Vista and Win7 (32/64-bit)\n* Languages: English, Spanish, Hungarian, German, Italian, French, Portuguese, Korean, etc\n","torrent":{"xt":"urn:btih:c586ae84db33c0a0efe0c4465140381d812ecb9d","amp;dn":"Your+Uninstaller%21+Pro+7.3.2010.33+Incl.+crack+%26+key%5Bak%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c586ae84db33c0a0efe0c4465140381d812ecb9d","infoHashBuffer":{"type":"Buffer","data":[197,134,174,132,219,51,192,160,239,224,196,70,81,64,56,29,129,46,203,157]},"announce":[],"urlList":[]}}