{"title":"Call of Cthulhu Dark Corners of the  Earth castellano","uid":6235752,"size":1227198743,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c595c62140864a2f56c86a1eb1f315744f352ea0&amp;dn=Call+of+Cthulhu+Dark+Corners+of+the++Earth+castellano&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alforo","files":2,"time":1299864788,"description":"Call of Cthulhu: Dark Corners of the Earth es un videojuego de acciÃƒÂ³n en primera persona basado en las novelas de H.P.Lovecraft. El juego fue realizado por Headfirst Productions y publicado por Bethesda Softworks en conjunto con 2K Games.\n\nEl juego se basa en parte en la novela &quot;La sombra sobre Innsmouth&quot;.\n[editar] Argumento\n\nEl personaje principal es el detective Jack Walters, quien despierta en la dÃƒÂ©cada de los aÃƒÂ±os 20 de un largo letargo en un manicomio despuÃƒÂ©s de tener un episodio horrible en Boston 6 aÃƒÂ±os atrÃƒÂ¡s, un incidente en una casa donde se recluÃƒÂ­a una secta adoradora de una extraÃƒÂ±a deidad. Tras despertar, y vuelto a la actividad como investigador privado, es enviado a investigar la desaparaciÃƒÂ³n de un joven en un pueblo costero miserable y olvidado de Dios: Innsmouth. Walters al llegar nota que los habitantes son hostiles y reacios a colaborar con su investigaciÃƒÂ³n, presentan un aspecto fisico extraÃƒÂ±o y tÃƒÂ©trico, y el pueblo refleja una apariencia similar a la de los habitantes. El trabajo de Walters es el de investigar la desapariciÃƒÂ³n del administrador de una tienda en Innsmouth, siendo que el administrador no es un natural de Innsmouth.\n\nA partir de la investigaciÃƒÂ³n es cuando se revela la verdadera naturaleza del pueblo de Innsmouth.\n[editar] Jugabilidad\n\nEl juego posee la particular caracterÃƒÂ­stica de que no utiliza reticula o medidor de salud y demÃƒÂ¡s, solo se puede apreciar las manos y el arma. La ÃƒÂºnica manera de saber si uno esta herido es por si hay una respiraciÃƒÂ³n frenÃƒÂ©tica.\n\nCurarse tambiÃƒÂ©n es particular en este juego, el proceso de curaciÃƒÂ³n se realiza mediante un proceso casi observado por el jugador como por ejemplo aplicarse una inyecciÃƒÂ³n o ponerse una banda alrededor de la herida.\n\nAquÃƒÂ­ se incentiva la exploraciÃƒÂ³n y tratar de evadir conflictos directos con los enemigos. De hecho, en la primera parte del juego el personaje de Walters no dispone de armas, y deberÃƒÂ¡ llevar adelante su misiÃƒÂ³n mediante la investigaciÃƒÂ³n, sacando informaciÃƒÂ³n de los personajes no jugadores que se encuentren en el pueblo, y espiando con sigilo a sus enemigos. El ambiente predominate es de la sensaciÃƒÂ³n permanente de suspenso y horror.\n\nLas armas son de la ÃƒÂ©poca tales como la Springfield 1903, subfusil Thompson, M1911, etc. incluye traduccion castellano .alforo -alfrg","torrent":{"xt":"urn:btih:c595c62140864a2f56c86a1eb1f315744f352ea0","amp;dn":"Call+of+Cthulhu+Dark+Corners+of+the++Earth+castellano","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c595c62140864a2f56c86a1eb1f315744f352ea0","infoHashBuffer":{"type":"Buffer","data":[197,149,198,33,64,134,74,47,86,200,106,30,177,243,21,116,79,53,46,160]},"announce":[],"urlList":[]}}