{"title":"Greg Bishop - Project Beta - UFO eBook","uid":6196273,"size":1227158,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c61ee03cf2b7fe1a514fd27b339f22d36d105273&amp;dn=Greg+Bishop+-+Project+Beta+-+UFO+eBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Eddiehjjjfcfjfc","files":-1,"time":1298419425,"description":"Unfortunately the pages are square.\n\n\nTHE HORRIFYING TRUE STORY OF A GOVERNMENT-AUTHORIZED CAMPAIGN OF DISINFORMATION THAT DEFINED AN ERA OF ALIEN PARANOIA AND DESTROYED ONE MAN'S LIFE.\n\nIn 1978, Paul Bennewitz, an electrical physicist living in Albuquerque, New Mexico, engaged in some aggressive radio monitoring of the nearby Sandia Labs, then managed by the Department of Defense. When he became convinced that the strange lights hovering over the labs and Kirtland Air Force Base signaled the vanguard of an extraterrestrial alien invasion, he began writing TV stations, newspapers, senators -- and even President Reagan -- to alert them.\n\nFor the most part Bennewitz received form-letter replies, but Air Force investigators paid him a visit, as did Bill Moore, author of the first book on the Roswell incident. Before long Moore -- then a new force in civilian UFO research -- was tapped by a group of intelligence agents and a deal was struck: Moore was to keep tabs on Bennewitz while the Air Force ran a psychological profile and disinformation campaign on the unsuspecting physicist. In return, Air Force Intelligence would let Moore in on classified UFO material.\n\nThis is Bennewitz's harrowing tale, told by fringe-culture historian Greg Bishop. It is the troubling account of the custom-made hall of smoke and mirrors that eventually drove Bennewitz to a mental institution, as well as the story of the explosive propagation of disinformation that began in 1979 and reverberates through the UFO community and pop culture to this day. ","torrent":{"xt":"urn:btih:c61ee03cf2b7fe1a514fd27b339f22d36d105273","amp;dn":"Greg+Bishop+-+Project+Beta+-+UFO+eBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c61ee03cf2b7fe1a514fd27b339f22d36d105273","infoHashBuffer":{"type":"Buffer","data":[198,30,224,60,242,183,254,26,81,79,210,123,51,159,34,211,109,16,82,115]},"announce":[],"urlList":[]}}