{"title":"Wil Wheaton - Just a Geek [Audiobook]","uid":5120126,"size":392187960,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c6928ea7062554b1b047a357696a85c37979ac1f&amp;dn=Wil+Wheaton+-+Just+a+Geek+%5BAudiobook%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jollyjim3939","files":-1,"time":1255290574,"description":"                               Wil Wheaton \n                        - Just a Geek [Audiobook] -\n\nWil Wheaton has never been one to take the conventional path to success. Despite early stardom through his childhood role in the motion picture &quot;Stand By Me&quot;, and growing up on television as Wesley Crusher on &quot;Star Trek: The Next Generation&quot;, Wil left Hollywood in pursuit of happiness, purpose, and a viable means of paying the bills. In the oddest of places, Topeka, Kansas, Wil discovered that despite his claims to fame, he was at heart Just a Geek.\n\nIn this, his newest book, Wil shares his deeply personal and difficult journey to find himself. You'll understand the rigors, and joys, of Wil's rediscovering of himself, as he comes to terms with what it means to be famous, or, ironically, famous for once having been famous. Writing with honesty and disarming humanity, Wil touches on the frustrations associated with his acting career, his inability to distance himself from Ensign Crusher in the public's eyes, the launch of his incredibly successful web site, wilwheaton.net, and the joy he's found in writing. Through all of this, Wil shares the ups and downs he encountered along the journey, along with the support and love he discovered from his friends and family.\n\nThe stories in Just a Geek include:\n\n- Wil's plunge from teen star to struggling actor\n- Discovering the joys of HTML, blogging, Linux, and web design\n- The struggle between Wesley Crusher, Starfleet ensign, and Wil Wheaton, author and blogger\n- Gut-wrenching reactions to the 9-11 disaster\n- Moving tales of Wil's relationships with his wife, step-children, and extended family\n- The transition from a B-list actor to an A-list author\n\nWil Wheaton--celebrity, blogger, and geek--writes for the geek in all of us. Engaging, witty, and pleasantly self-deprecating, Just a Geek will surprise you and make you laugh.\n\n373 MB | mp3 | biography | autobiography\n\n\n\nPLEASE SEED WHEN YOU FINISH THE DOWNLOAD.\n\nEnjoy!!\n\n","torrent":{"xt":"urn:btih:c6928ea7062554b1b047a357696a85c37979ac1f","amp;dn":"Wil+Wheaton+-+Just+a+Geek+%5BAudiobook%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6928ea7062554b1b047a357696a85c37979ac1f","infoHashBuffer":{"type":"Buffer","data":[198,146,142,167,6,37,84,177,176,71,163,87,105,106,133,195,121,121,172,31]},"announce":[],"urlList":[]}}