{"title":"Marvel Premiere","uid":5108811,"size":680185546,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c6afaa9975926ac64c694bef6a731e7833c982ab&amp;dn=Marvel+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1254596750,"description":"Marvel Premiere was an anthology series published by Marvel Comics. It ran for 61 issues from April 1972 to August 1981.\n\nThe series was originally intended to be a testing ground for new characters and the re-introduction of characters who no longer had their own titles.  To some extent it was successful in this endeavor by featuring Doctor Strange beginning with issue #3 and Iron Fist in issue #15, written by Chris Claremont and drawn by John Byrne.  Other, less successul, introductions include the Legion of Monsters, Paladin and Woodgod.  The comic also featured the first appearance of the second Ant-Man (Scott Lang) and the first comic book appearance of rock musician Alice Cooper.  Another feature that would spinoff into its own title was Seeker 3000, but with this difference that this only happened twenty years after its first appearance in Marvel Premiere #41 (1978), with a four issue miniseries published in 1998.\n\nLater on in the title's run Marvel Premiere was also used to finish stories of characters who had lost their own book or feature. One example of this was the Man-Wolf two-parter in #45-46, which continued the story from Creatures on the Loose #37.  Another was the three issue Black Panther series.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:c6afaa9975926ac64c694bef6a731e7833c982ab","amp;dn":"Marvel+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6afaa9975926ac64c694bef6a731e7833c982ab","infoHashBuffer":{"type":"Buffer","data":[198,175,170,153,117,146,106,198,76,105,75,239,106,115,30,120,51,201,130,171]},"announce":[],"urlList":[]}}