{"title":"Handsome - Handsome","uid":6274603,"size":57372195,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c6d0deba97da73a7b2b76155e9b55e6fb6fc6118&amp;dn=Handsome+-+Handsome&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"egg311","files":12,"time":1301209809,"description":"When five pieces from the splintered membership of hardcore's most influential '90s outfits came together, Handsome was formed and the songwriting, textural, and creative limits of an entire genre of rock music were expanded to a previously unimaginable degree. At its center, Handsome was directed by former Helmet guitarist Peter Mengede. While not officially credited as the group's songwriter, Mengede's very identifiable riffs and song structures seem to be a musical basis for Handsome's music. Ex-Quicksand guitarist Tom Capone also had a significant impact on Handsome's tight yet exotic hardcore grind. Joining Mengede and Capone on the band's one and only release -- 1997's eponymous debut on Epic -- are drummer Pete Hines (Cro-Mags, Murphy's Law), bassist Eddie Nappi, and Salt Lake City area vocalist Jeremy Chatelain. Handsome was released in February of 1997 and was met with general confusion due to Epic's marketing of the group via their historic punk lineage. The Terry Date produced record was indeed aggressive but much more melodic and balanced than any Murphy's Law or even Helmet release. The angular hardcore textures and critical lyrics are present, but these elements along with some progressive songwriting and almost pop melodies are tightly packaged in Date's dense but shimmering new metal production that calls to mind distinctly non-punk Date partnerships with the likes of Deftones, Limp Bizkit, and White Zombie. Handsome was really creating a real new metal of their very own that relied on traditional punk and metal architecture and the very distinct vocals of Chatelain. The group supported the release by touring with Silverchair and Local H one their first tour, and then Handsome went out with Less Than Jake and the Descendants. After that, the group went to Europe and performed with artists as diverse as Voodoo Glow Skulls and Wu Tang Clan. Tom Capone quit Handsome before the final tour was finished and guitarist Donni Campion was recruited to finish of the engagements. Not long after Capone's departure, Handsome officially disbanded in 1998.\n\n  \t\n\t \n(I just copied and pasted their biography from allmusic.com) \n","torrent":{"xt":"urn:btih:c6d0deba97da73a7b2b76155e9b55e6fb6fc6118","amp;dn":"Handsome+-+Handsome","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6d0deba97da73a7b2b76155e9b55e6fb6fc6118","infoHashBuffer":{"type":"Buffer","data":[198,208,222,186,151,218,115,167,178,183,97,85,233,181,94,111,182,252,97,24]},"announce":[],"urlList":[]}}