{"title":"Blake Shelton - The Baby","uid":5117817,"size":140990468,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c6d5ad4e1e816f7b7eb54ad27fe8736c34d18bf7&amp;dn=Blake+Shelton+-+The+Baby&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1255159019,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;The Baby&quot; is a song sung by country music singer-songwriter Blake Shelton. The song became Blake's second number-one hit, where it remained for three weeks in early 2003. It was the lead-off single to his second album, 2003's The Dreamer.\n\nThe video shows Shelton singing in a room with blue screens while watching flashbacks of his life and family. The roll of film also shows flashbacks and pictures of the narrator and his family.\n\nThe song debuted at No. 48 on the Hot Country Singles &amp; Tracks chart dated November 2, 2002, making it his highest debut on that chart. It spent 24 weeks on that chart, and became his second Number One single on the chart dated February 22, 2003, holding the top spot for three weeks. It peaked at #28 on the Billboard Hot 100.\n\nThe Dreamer is the title of the second album released by American country music artist Blake Shelton. Released in 2003 on Warner Bros. Records Nashville, it features the Number One single &quot;The Baby&quot;, as well as the singles &quot;Heavy Liftin'&quot; and &quot;Playboys of the Southwestern World&quot;. Like his debut album before it, The Dreamer was certified gold by the RIAA.\n\nBlake Tollison Shelton (born June 18, 1976, in Ada, Oklahoma[2]) is an American country music artist. In 2001, he made his debut with the single &quot;Austin&quot;. Released as the lead-off single from his self-titled debut album, &quot;Austin&quot; went on to spend five weeks at Number One on the Billboard Hot Country Songs charts. This song was the first single from his gold-certified debut album, which also produced two more Top 20 hits. Although the album was released on Giant Records Nashville, Shelton was transferred to Warner Bros. Records Nashville after Giant closed in late 2001.\n\nHis second and third albums, 2003's The Dreamer (his first for Warner Bros. proper) and 2004's Blake Shelton's Barn &amp; Grill, were each certified gold as well. Shelton's fourth album, Pure BS, was issued in 2007, and re-issued in 2008 with a cover of Michael BublÃƒÂ©'s pop hit &quot;Home&quot; as one of the bonus tracks. This cover was also that album's third single. A fifth album, Startin' Fires, was released in November 2008.\n\nOverall, Shelton has charted fifteen singles on the country charts, including five Number One hits: &quot;Austin&quot; (2001), &quot;The Baby&quot; (2003), &quot;Some Beach&quot; (2004-2005), &quot;Home&quot; (2008) and &quot;She Wouldn't Be Gone&quot; (2009). Besides these, three more of his singles have reached Top Ten: a cover version of Conway Twitty's &quot;Goodbye Time&quot;, &quot;Nobody but Me&quot;, and &quot;I'll Just Hold On&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c6d5ad4e1e816f7b7eb54ad27fe8736c34d18bf7","amp;dn":"Blake+Shelton+-+The+Baby","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6d5ad4e1e816f7b7eb54ad27fe8736c34d18bf7","infoHashBuffer":{"type":"Buffer","data":[198,213,173,78,30,129,111,123,126,181,74,210,127,232,115,108,52,209,139,247]},"announce":[],"urlList":[]}}