{"title":"Frank Zappa - Hot Rats TQMP","uid":5116696,"size":347499317,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c705e9037c0f4f656327194b494e29a8102657e8&amp;dn=Frank+Zappa+-+Hot+Rats+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":20,"time":1255100968,"description":"Aside from the experimental side project Lumpy Gravy, Hot Rats was the first album Frank Zappa recorded as a solo artist sans the Mothers, though he continued to employ previous musical collaborators, most notably multi-instrumentalist Ian Underwood. Other than another side project -- the doo wop tribute Cruising With Ruben and the Jets -- Hot Rats was also the first time Zappa focused his efforts in one general area, namely jazz-rock. The result is a classic of the genre. Hot Rats' genius lies in the way it fuses the compositional sophistication of jazz with rock's down-and-dirty attitude -- there's a real looseness and grit to the three lengthy jams, and a surprising, wry elegance to the three shorter, tightly arranged numbers (particularly the sumptuous &quot;Peaches en Regalia&quot;). Perhaps the biggest revelation isn't the straightforward presentation, or the intricately shifting instrumental voices in Zappa's arrangements -- it's his own virtuosity on the electric guitar, recorded during extended improvisational workouts for the first time here. His wonderfully scuzzy, distorted tone is an especially good fit on &quot;Willie the Pimp,&quot; with its greasy blues riffs and guest vocalist Captain Beefheart's Howlin' Wolf theatrics. Elsewhere, his skill as a melodist was in full flower, whether dominating an entire piece or providing a memorable theme as a jumping-off point. In addition to Underwood, the backing band featured contributions from Jean-Luc Ponty, Lowell George, and Don &quot;Sugarcane&quot; Harris, among others; still, Zappa is unquestionably the star of the show. Hot Rats still sizzles; few albums originating on the rock side of jazz-rock fusion flowed so freely between both sides of the equation, or achieved such unwavering excitement and energy.\n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:             &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)\t","torrent":{"xt":"urn:btih:c705e9037c0f4f656327194b494e29a8102657e8","amp;dn":"Frank+Zappa+-+Hot+Rats+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c705e9037c0f4f656327194b494e29a8102657e8","infoHashBuffer":{"type":"Buffer","data":[199,5,233,3,124,15,79,101,99,39,25,75,73,78,41,168,16,38,87,232]},"announce":[],"urlList":[]}}