{"title":"Deep Purple - Made In Europe (1975) WMA320","uid":6296162,"size":112333851,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c7deaaace6229d71a4f3bd5044f40eb9c03aef15&amp;dn=Deep+Purple+-+Made+In+Europe+%281975%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1302001904,"description":"I remember buying this album back in 1979-80, and the new remastered edition is a welcome improvement to the original vinyl recording. Unquestionably, Made in Europe is yet another shining example of Deep Purple's superb live musicianship. All of the songs on this album (Burn, Mistreated, You Fool No One, Lady Doubledealer, and Stormbringer) are infused with an electricity and emotion that I feel make them more enjoyable than the studio versions, especially the live renditions of Burn, Mistreated, and You Fool No one. Each member of the band is firing on all cylinders with his respective instrumental or vocal contribution, making this album an overlooked treasure for both fanatics and casual listeners alike. \n\nI have read in other Amazon reviews a certain bias against Glenn Hughes, which I feel is unwarranted. After listening to his bass playing on this album, I am more impressed with his improvisational skills and his crisp, decisive note playing than before. Actually, and no disrespect intended to Roger Glover, if you listen carefully to this album and compare it to Made in Japan, Glenn Hughes far outshines his Mark II counterpart in a live performance. I do have one small critical remark about the album, and that is the muted guitar on Lady Doubledealer. You really have to crank up the volume to enjoy Blackmore's guitar genius because it is audibly hemmed in by Paice's drums and Lord's keyboards. Otherwise, this live offering is a five-star tour-de-force and well worth the investment. David Coverdale sums it up succintly in his vocal intro to Burn when he says &quot;Rock and Roll.&quot; Made in Europe epitomizes the very best of hard rock music in the 1970s.\n\nby E. Slack\n\nTRACKLIST:\n\n01 - Burn.wma                                                    \n02 - Mistreated.wma                                              \n03 - Lady Double Dealer.wma                                      \n04 - You Fool No One.wma                                         \n05 - Stormbringer.wma\n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!","torrent":{"xt":"urn:btih:c7deaaace6229d71a4f3bd5044f40eb9c03aef15","amp;dn":"Deep+Purple+-+Made+In+Europe+%281975%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7deaaace6229d71a4f3bd5044f40eb9c03aef15","infoHashBuffer":{"type":"Buffer","data":[199,222,170,172,230,34,157,113,164,243,189,80,68,244,14,185,192,58,239,21]},"announce":[],"urlList":[]}}