{"title":"Hirens.BootCD.13.1","uid":6174378,"size":409600998,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c7ed92f8f0d1a2551764c80754768608f5506dc0&amp;dn=Hirens.BootCD.13.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"number11","files":2,"time":1297713531,"description":"Hirens Boot CD 13.1\nContents (from Hirens website):\nHiren's BootCD 13.1\nAll in One Bootable CD which has all these utilities\n\nAntivirus Tools\nAvira AntiVir Personal (07-02-2011) Free anti-virus and anti-spyware on-demand scanner, detects and removes more than 50000 viruses.\nComboFix (07-02-2011) Designed to cleanup malware infections and restore settings modified by malware.\nCWShredder 2.19 Popular CoolWebSearch Trojan Remover tool.\nDr.Web CureIt! Antivirus (07-02-2011) a free standalone anti-virus and anti-spyware on-demand scanner.\nGMER 1.0.15 Hidden services, hidden registry, hidden file scanner, Rootkit Detector and Remover.\nMalwarebytes Anti-Malware 1.50.1 (07-02-2011) anti-malware application that can thoroughly remove even the most advanced malware.\nRemove Fake Antivirus 1.72 a tool to remove virus/malwares which disguises itself to be an antivirus and produces fake alert/warnings and urge you to purchase a useless copy of the fake antivirus.\nRootkitRevealer 1.7.1 Rootkit Revealer is an advanced patent-pending root kit detection utility.\nSpybot - Search &amp; Destroy 1.6.2 (07-02-2011) Application to scan for spyware, adware, hijackers and other malicious software.\nSpywareBlaster 4.4 (07-02-2011) Prevent the installation of spyware and other potentially unwanted software.\nSuperAntispyware 4.47.1000 (07-02-2011) Remove Malware, Rootkits, Spyware, Adware, Worms, Parasites (a must have tool).\nBackup Tools\nCOPYR.DMA Build013 A Tool for making copies of hard disks with bad sectors.\nCopyWipe 1.14 Copy old hard drive to a new hard drive by copying the entire contents of one drive to another, CopyWipe can also help prevent confidential or private data from being recovered, by securely wiping the contents of a drive.\nDiskImage 1.6 Creates and writes disk images files to hard and floppy disks.\nDouble Driver 4.1 Driver Backup and Restore tool.\nDriveImage XML 2.20 backup any drive/partition to an image file, even if the drive is currently in use, a very good freeware alternative to Ghost / Acronis\nDrive SnapShot 1.40 creates an exact Disk Image of your system into a file while windows is running.\nFastCopy 2.06 The Fastest Copy/Delete Software on Windows.\nG4L Ghost 4 Linux 0.34a a hard disk and partition imaging and cloning tool similar to Norton Ghost.\nGImageX 2.0.17 ImageX is used to backup/restore WIM images for Windows XP/Vista and Windows 7.\nImgBurn 2.5.2.0 Lightweight CD/DVD/HD DVD/Blu-ray burning application, supports BIN, CUE, DI, DVD, GI, IMG, ISO, MDS, NRG and PDI, Ability to build DVD/HD/BD Video discs from a VIDEO_TS/HVDVD_TS/BDAV/BDMV folder, Unicode folder/file names (formerly DVD Decrypter).\nInfraRecorder 0.51 An Open source CD/DVD burning software, also create/burn .iso images.\nMacrium Reflect 4.2.2952 Create complete backups of your disk partitions, including operating system, installed programs and all your settings.\nPartition Image - PartImage 0.6.9 supported filesystem includes Ext2, Ext3, Reiserfs, HFS, HPFS, JFS, Xfs, UFS, Fat16, Fat32 and NTFS.\nPartition Saving 3.90 A tool to backup/restore partitions (SavePart.exe).\nRegBak 1.0 a light-weight and simple utility to create backups of Windows registry files.\nRaw Copy 1.2 Useful tool to transfer the data directly from a faulty drive to another drive, built in data recovery function which will also attempt to recover data from bad sectors.\nShadowCopy 1.00 Copy all your files and entire system - even if they are locked by Windows.\nSelfImage 1.2.1.92 to create image files of any mounted or unmounted hard disk partition.\nSeagate DiscWizard 11.8326 Backup drive/partition to an image file, for Seagate owners (Powered by Acronis TrueImage)\nSmart Driver Backup 2.12 Easy backup of your Windows device drivers (also works from PE).\nTeraCopy 2.12 TeraCopy is a compact program designed to copy and move files at the maximum possible speed, providing the user a lot of features includes pause, resume, auto shutdown, verify, error recovery and unicode support.\nWhitSoft File Splitter 4.5a a Small File Split / Join Tool.\nXXClone 0.58.0 The simple way to clone a Windows disk to another disk, it makes a self-bootable clone of Windows system disk.\nBIOS / CMOS Tools\nAward DMI Configuration Utility 2.43 DMI Configuration utility for modifying/viewing the MIDF contents.\n!BIOS 3.20 a powerfull utility for bios and cmos.\nBIOS Cracker 5.0 BIOS password remover (cmospwd).\nBIOS Utility 1.35.0 BIOS Informations, password, beep codes and more.\nCMOS 0.93 CMOS Save / Restore Tool.\nDISKMAN4 a powerful all in one utility.\nKill CMOS a tiny utility to wipe cmos.\nUniFlash 1.40 bios flash utility.\nBrowsers / File Managers\n7-Zip 9.20 File archiver with a high compression ratio Supports 7z, ARJ, BZIP2, CAB, CHM, CPIO, DEB, DMG, FAT, GZ, GZIP, HFS, IMA, IMG, ISO, LZH, LZMA, MBR, MSI, NSIS, NTFS, RAR, RPM, TAR, UDF, VHD, WIM, XAR, XZ, ZIP and Z formats.\nBulk Rename Utility 2.7.1.2 Rename multiple files, change timestamps and rename using EXIF data with the click of a button.\nDos Command Center 5.1 Classic dos-based file manager.\nDos Navigator 6.4.0 Dos File Manager, Norton Commander clone but has much more features.\nEasyUHA 1.1 GUI Tool to create and extract UHA Archives.\nEverything 1.21 Ultra fast file/folder search tool with ftp/http server.\nExplore2fs 1.08b GUI explorer tool for accessing linux ext2 and ext3 filesystems under windows.\nExt2Explore 2.2.71 To explore ext2/ext3/ext4 disk/partition, can also be used to view and copy disk and file system images.\nFile Maven 3.5 an advanced Dos file manager with high speed PC-to-PC file transfers via serial or parallel cable.\nFile Wizard 1.35 a file manager - colored files, drag and drop copy, move, delete etc.\nFastLynx 2.0 Dos file manager with Pc to Pc file transfer capability.\nHashMyFiles 1.68 Calculate MD5/SHA1/CRC32 hashes of your files.\nMini Windows 98 Can run from Ram Drive, with ntfs support, 7-Zip, Disk Defragmenter, Notepad / RichText Editor, Image Viewer, .avi .mpg .divx .xvid Movie Player, etc.\nMini Windows Xp Portable Windows Xp that runs from CD/USB/Ram Drive to repair/recover dead windows operating system. It has LAN and WLAN (Wireless) Network includes 300 WiFi/Ethernet card drivers and can also be customized easily to add your own drivers in HBCD\\Drivers folder. Added some USB 3.0 and SATA/SCSI/SAS Storage drivers and VBS/WSH scripting support. Supported keyboard layouts are: United States, United Kingdom, US Dvorak, Turkish Q, Turkish F, Swiss German, Swiss French, Swedish, Suomi Finnish, Spanish, Slovenian, Slovak, Russian, Portuguese, Polish, Norvegian Norske, Netherlands Dutch, Latin American, Italy, Icelandic, Hungarian, Hebrew, Germany, German Switzerland Luxembourg, Francais Cavier AZERTY, Denmark Daenish, Bulgarian Phonetic, Bulgarian, Brazil Portuguese, Brazil Extended Portuguese and Belgium.\nOpera Web Browser 9.64 One of the fastest, smallest and smartest full-featured web browser.\nSearchMyFiles 1.61 Alternative to 'Search For Files And Folders' module of Windows + Duplicates Search.\nTotal Commander 7.56a A file manager similar to the Windows Explorer features side-by-side file-browsing panes, built-in FTP, archive management, file search/compare/synchronize and more.\nVolkov Commander 4.99 Dos File Manager with LongFileName/ntfs support (Similar to Norton Commander).\nWinMerge 2.12.4.0 Differencing and merging tool which can compare both folders and files, presenting differences in a visual text format that is easy to understand and handle.\nCleaners\nATF Cleaner 3.0.0.2 A personal and easy-to-use temp file removal software to clean all user temp folders, Java cache, Opera/Mozilla browser cache, cookies, history, download history, saved passwords etc.\nCCleaner 3.02.1343 Crap Cleaner is a freeware system optimization and privacy tool.\nCleanUp! 4.5.2 Removes junk files from all user profiles that accumulate over time and litter your hard drive.\nCloneSpy 2.52 Duplicate file cleanup tool, can optionaly create hardlinks to save space.\nData Shredder 1.0 A tool to Erase disk and files (also wipe free space) securely.\nDelete Doctor 2.2 Delete Files that are hard to delete, Option to delete on reboot or via UNC Name.\nDuplicate File Finder 3.5 Scans and identify duplicate files, it compares them based on byte for byte comparison ensures 100% accuracy.\nMyUninstaller 1.70 Alternative to the standard add / remove control panel module.\nRevo Uninstaller 1.90 Remove unnecessary files and registry entries left behind by incomplete program uninstallation routines.\nSpaceMonger 1.4 keeping track of the free space on your computer.\nSpaceSniffer 1.1.2.0 Find lost space on your disks the easy way.\nWinDirStat 1.1.2.80 a disk usage statistics viewer and cleanup tool for Windows.\nEditors / Viewers\nAtlantis Word Processor 1.6.5.3 Compact, fast-loading, but still powerful and efficient, perfect companion for a wide range of your word processing tasks, supports RTF, MS Word DOC 6.0/95/97/2000/XP/2003 and DOCX.\nHxD 1.7.7.0 Hex Editor provides tools to inspect and edit files, main memory, disks/disk images.\nIrfanView 4.28 A free Image Viewer/Editor/Converter and Optimizer.\nPicture Viewer 1.94 Picture viewer for dos, supports more then 40 filetypes.\nQuickView Pro 2.58 movie viewer for dos, supports many format including divx.\nSpread32 1.18 Mini Excel with all of the basic features of a spreadsheet program. Run macros, draw objects, generate charts, calculate functions and formulas, reads and writes xls, csv, text, and pxl formats.\nSumatraPDF 1.1 a free, open source, lightweight PDF Reader for Microsoft Windows.\nFileSystems Tools\nAlternateStreamView 1.15 View/Copy/Delete hidden NTFS Alternate Data Streams.\nEditBINI 1.01 to Edit boot.ini on NTFS Partition.\nFileDisk Mount Tool 25 to mount ISO/BIN/NRG/MDF/IMA/IMG images on windows.\nFilemon 7.04 Monitors and displays file system activity on a system in real-time.\nNewSID 4.10 utility that changes the security ID (SID) for Windows NT, 2000 and XP.\nNTFS Access 2.1 Set NTFS permissions recursively and full access rights to a folder/file owner.\nNTFS Dos 3.02 to read-only access ntfs partitions from Dos.\nNTFS4Dos 1.9 to read and write ntfs partitions from Dos.\nVirtual Floppy Drive 2.1 enables you to create and mount a virtual floppy drive on your NT/2000/XP/Vista.\nHard Disk Tools\nActive Kill Disk 4.1.2393 Securely overwrites and destroys all data on physical drive.\nDarik's Boot and Nuke (DBAN) 1.0.7 Completely deletes the contents of any hard disk it can detect.\nDiskView 2.4 to view graphical map of your disk, allowing you to check where a file is located or, by clicking on a cluster, seeing which file occupies it.\nDiskWipe 1.2 Securely erases the contents of a disk replacing it with random data or leaving the drive completely blank.\nExcelStor's ESTest 4.50 ExcelStor hard disk diagnostic utility.\nFujitsu HDD Diagnostic Tool 7.00 to check IDE drives for possible defects/problems.\nFujitsu IDE Low Level Format 1.0 Low Level Format Tool for Fujitsu Drives.\nGateway GwScan 5.12 Gateway hard drive diagnostic utility.\nHard Disk Sentinel 1.00.5 Hard Disk health, performance and temperature monitoring tool.\nHDAT2 4.53the main function is testing and repair (regenerates) bad sectors for detected devices. A freeware alternative of HDD Regenerator.\nHDD Capacity Restore 1.2 This tool allows you to restore factory capacity of any hard drive. it does not read from or write to the user data area or perform any kind of formatting, only alters HDD firmware (HPA and DCO settings).\nHDD Erase 4.0 Secure erase using a special feature built into most newer hard drives.\nHDD Low Level Format Tool 2.36 Low-level format tool for S-ATA (SATA), IDE (E-IDE), SCSI, USB, Flash Cards and FIREWIRE external drive enclosures.\nIBM Hitachi Drive Fitness Test 4.16 quickly and reliably tests SCSI, IDE and SATA drives.\nIBM Hitachi Feature Tool 2.15 allows you to control some of the features of the the HDD.\nMaxtor amset utility 4.0 Utility for changing Acoustic Management on the hard drives.\nMaxtor Low Level Formatter 1.1 Maxtor's Low Level Format Utility works on any harddrive.\nMaxtor PowerMax 4.23 designed to perform diagnostic read/write verifications on Maxtor/Quantum hard drives.\nMHDD 4.6 Precise diagnostic of the mechanical part of a drive, perform Low-level format, Bad Sector Sepair, access raw sectors, manage S.M.A.R.T. (SMART) and other drive parameters such as acoustic management, security, Host Protected Area, etc.\nSamsung Disk Diagnose (SHDIAG) 1.28 to diagnose the disk when suspected to have failures.\nSamsung ESTOOL 3.01v Drive Diagnostic, Automatic Acoustic Management, Enable/Disable SMART etc.\nSamsung HDD Utility(HUTIL) 2.10 The Drive Diagnostic Utility.\nSeaTools for Dos GUI 2.22 Text 1.10 versions to test Seagate or Maxtor Parallel ATA (PATA and IDE) and Serial ATA (SATA) interface disc drives.\nSmartUDM 2.00 Hard Disk Drive S.M.A.R.T. Viewer.\nToshiba Hard Disk Diagnostic 2.00b Toshiba hard drive diagnostic utility.\nVictoria 3.33e and 3.52rus a freeware program for low-level HDD diagnostics.\nVictoria 4.46 Universal program for testing storage devices\nViVard 1.0 HDD low-level diagnostics, Surface test with remap, SMART-attributes etc.\nWDClear 1.30 Restore/Erases the drive back to a factory condition.\nWDIDLE3 1.05 Modifies the behavior of a Western Digital Green drive to wait longer before positioning the heads in their park position and turning off unnecessary electronics.\nWestern Digital Data Lifeguard Tools 11.2 for the installation of Western Digital EIDE Hard Drives.\nWestern Digital Diagnostics (DLGDIAG) 5.19 to quickly and efficiently verify the status of the drive.\nWestern Digital Data Lifeguard Tools 1.22 to perform drive identification, diagnostics, and repairs on most WD drives\nMBR (Master Boot Record) Tools\nBellaVista 1.1.0.54 Formerly BCD Editor with lots of options to configure Windows for a developer.\nBoot Partition 2.60 add Partition in the Windows NT/2000/XP Multi-boot loader.\nBootFix Utility Run this utility if you get 'Invalid system disk' message.\nBootSect 6.0.6 Boot Sector Manipulation Tool, This tool replaces FixFAT.exe and FixNTFS.exe.\nBootICE 0.80.6 a boot sector manipulation utility.\nDiskMan 4.2 all in one tool for cmos, bios, bootrecord and more.\nFbInst 1.6 A tool to create universal flash boot disk that boots from all computers.\nGrub4Dos installer 1.1 an universal boot loader GRUB for DOS GRLDR installer.\ngrub4dos 2011-01-15 an universal boot loader based on GNU GRUB, can boot off DOS/LINUX or via Windows boot manager/syslinux/lilo or from MBR/CD, builtin BIOS disk emulation.\nHDHacker 1.4 Load/Save/View MBR and BootSector from a physical/logical drive.\nisolinux 4.03 a boot loader for Linux/i386 that operates off ISO 9660/El Torito CD-ROMs in 'no emulation' mode.\nMBRWizard 3.0.73 Directly update and modify the Master Boot Record.\nMbrFix 1.3 to backup, restore, fix the boot code in the MBR.\nMBR Utility 1.05 to manipulate a drive's master boot record (MBR) via the command line.\nMBRWork 1.08 a utility to perform some common and uncommon MBR functions.\nMBRTool 2.3.200 backup, verify, restore, edit, refresh, remove, display, re-write and more.\nMBR SAVE / RESTORE 2.1 BootSave and BootRest tools to save / restore MBR.\nMemDisk 4.03 to allow booting legacy operating systems, floppy images, hard disk images and some ISO images.\nPLoP Boot Manager 5.0.11 a small program to boot different operating systems harddisk, floppy, CD/DVD or from USB, it can boot from an USB/CD/DVD even without BIOS support.\nRMPrepUSB 2.1.617 Partition and format your USB drive and make it bootable.\nSmart Boot Manager 3.7.1 a multi boot manager.\nXOSL 1.1.5 A graphical boot manager that supports multi-booting of various operating systems.\nMs Dos Tools\n1394 Firewire Support 1394 Firewire Drivers for Dos.\nASUSTeK USB Driver 3 ASUS USB CD-ROM Device Driver Version 1.00.\nDos tools Collection of dos utilities extract.exe pkzip.exe pkunzip.exe lha.exe gzip.exe uharcd.exe imgExtrc.exe xcopy.exe diskcopy.com mouse.com undelete.com edit.com fdisk.exe fdisk2.exe fdisk3.exe lf.exe delpart.exe wipe.com zap.com format.com deltree.exe more.com find.exe hex.exe debug.exe split.exe mem.exe attrib.com sys.com smartdrv.exe xmsdsk.exe killer.exe share.exe scandisk.exe guest.exe doskey.exe duse.exe move.exe setver.exe intersvr.exe interlnk.exe loadlin.exe lfndos.exe doslfn.com and more.\nInterlnk support at COM1/LPT1 to access another computer from COM/LPT port.\nSCSI Support SCSI Drivers for Dos.\nSATA Support SATA Driver (gcdrom.sys) and JMicron JMB361 (xcdrom.sys) for Dos.\nUniversal USB Driver 2 Panasonic v2.20 ASPI Manager for USB mass storage.\nUSB CD-Rom Driver 1 Standard usb_cd.sys driver for cd drive.\nNetwork Tools\nAngry IP Scanner 2.21 Scan IP addresses in any range as well as any their ports.\nComplete Internet Repair 0.9.5.955 All in one tool to repair common internet connection issues, it attempts to repair everything internet related on a Windows system.\nCurrPorts 1.85 displays the list of all currently opened TCP and UDP ports on your computer.\nNetwork Password Recovery 1.30 Recover Windows XP/Vista network passwords / Credentials file.\nPuTTY 0.60 r3 PuTTY Tray is a free and open source terminal emulator application which can act as a client for the SSH and Telnet.\nSmartSniff 1.72 Network monitoring utility that allows you to capture TCP/IP packets that pass through your network adapter.\nTCPView 3.02 Lists TCP and UDP endpoints, including the Local/Remote addresses of TCP connections.\nTFtpd32 3.51 Tftpd32 is for Trivial File Transfer Protocol (TFTP) client, including DHCP, TFTP, SNTP and Syslog servers, can also be used for PXE boot.\nWinSCP 4.2.9 A free and open source SFTP/FTP client to secure file transfer between a local and a remote computer.\nXP TCP/IP Repair 1.0 Repair your Windows XP Winsock and TCP/IP registry errors.\nOptimizers\nDefraggler 2.01.239 to defrag your entire hard drive or individual files.\nMyDefrag 4.3.1 Free disk defragment and optimize utility (formerly JkDefrag) for Windows 2000/2003/XP/Vista/Windows 7.\nNT Registry Optimizer 1.1j Registry Optimization for Windows NT/2000/2003/XP/Vista.\nPageDfrg 2.32 System file Defragmenter For NT/2k/XP.\nOther Tools\nCalcute 7.10.4 A compact scientific tape calculator with many features.\nFix NTLDR is missing Fix 'NTLDR is missing, Press any key to restart' for Windows Xp.\nHBCD Customizer 1.6 HBCDCustomizer.exe is a GUI tool to create custom iso images of Hiren's BootCD.\nHBCD Program Launcher 2.1 Hiren's BootCD Program launcher (HBCDMenu.exe and HBCDMenu.csv) can be used to launch all these programs from USB/CD.\nMini Linux Recovery is Possible Linux (RIPLinux 11.1) kernel 2.6.35.4 contains afftools, aria2, beaver, cdrtools, clamav, curl, ddrescue, ddpt, defrag, dump/restore, emelfm2, encfs, epdfview, extundelete, findwild, fuse-exfat, fsarchiver, grub2, hdparm, hpacucli, isomaster, lftp, lynx, lzip, mtpaint, ntfs-3g, openssh, partclone, partimage, pccmoscleaner, pcdiskeraser, pcmanfm, pcloginnow, pcregedit, pidgin, qemu, reiserfsck, rdup, safecopy, smbclient, sylpheed, syslinux, tar, truecrypt, tw_cli, tmux, wiper, xfburn, xfprot, xterm and more.\nMouse Emulator 2.2 You can use your keyboard numpad as a mouse, very useful if your mouse broken or if you are having USB driver problems.\nOn-Screen Keyboard A utility that displays a virtual keyboard on the computer screen that allows people with mobility impairments to type data by using a pointing device or joystick.\nUniversal TCP/IP Network 6.5 MSDOS Network Client to connect via TCP/IP to a Microsoft based network. The network can either be a peer-to-peer or a server based network, it contains 98 different network card drivers.\nWinNTSetup 1.5.0.3 Install Windows 2k/XP/2003 x86/x64 from USB/CD under PE/LiveXp, allows you to apply tweaks and choose driveletter for the new Windows installation.\nPartition Tools\neXtended Fdisk 0.9.3 XFDISK allows easy partition creation and edition.\nFat32 Formatter GUI 1.01 Windows XP cannot format a volume bigger than 32GB with FAT32.\nGParted Partition Editor 0.7.0 to create, copy, paste, delete, hide, resize or move partitions without losing data, a good freeware alternative to Partition Magic.\nMount Drives 1.0 Auto Mount Drives can be used to mount unmounted/hidden drives.\nPartition Table Editor 8.0 Partition Table and Boot Record Editor.\nPartition Wizard Home Edition 5.2 Free Partition Magic Alternative, Partition Resize/Move/Copy/Create/Delete/Format/Convert, Explore, etc.\nRanish Partition Manager 2.44 a boot manager and hard disk partitioner.\nSmart Fdisk 2.05 a simple harddisk partition manager.\nSPecial Fdisk 2000.03v SPFDISK is a partition tool.\nSuper Fdisk 1.0 Create, delete, format partitions drives without destroying data.\nThe Partition Resizer 1.3.4 move and resize your partitions in one step.\nUSB Format Tool Format/make bootable any USB flash drive to FAT, FAT32, or NTFS partition.\nVolume Serial Number Changer 1.2 Allow you to change the drive's serial number on FAT, FAT32 and NTFS file systems.\nPassword Tools\nATAPWD 1.2 Hard Disk Password Utility.\nAutologon 3.0 Enables you to easily configure Windows' built-in autologon mechanism, so you don't have to wait on the login screen.\nBIOS Master Password Generator Collection of password generator tools to reset BIOS Power on Password / Admin password on Dell, Fujitsu Siemens, Compaq, Hewlett Packard, Phoenix and Samsung Laptops.\nBulletsPassView 1.00 Reveal the passwords stored behind the bullet (asterisk) characters in Windows / IE (Updated Asterisk Logger).\nContent Advisor Password Remover 1.01 It Removes Content Advisor Password from Internet Explorer.\nIE PassView 1.25 It allows you to view username and passwords saved by Internet Explorer.\nKon-Boot 1.0 to bypass Login Password of Windows (32bit, any password) and Linux login as kon-usr.\nLicenseCrawler 1.2.0.98 find the license keys and serial numbers of your programs.\nMail PassView 1.70 Recovers mail passwords of Outlook Express, MS Outlook, IncrediMail, Eudora, etc.\nMessenPass 1.40 A password recovery tool that reveals the passwords of several instant messangers.\nNTPWD utility to reset windows nt/2000/xp administrator/user password.\nNTPWEdit 0.3 Password editor for Windows NT based systems to change or remove passwords for local system accounts.\nOffline NT Password Changer 2010-06-27 utility to reset/unlock windows NT/2000/XP/Vista/7 administrator/user password.\nPassword Renew 1.1 Utility to set/reset windows NT/2000/XP/Vista/7 (32bit only) passwords.\nPasswordFox 1.26 Allows you to view the user names and passwords stored by Mozilla Firefox Web browser.\nProduKey 1.45 Recovers lost the product key of your Windows/Office.\nPST (Outlook) Password Recovery 1.15 PstPassword is a small utility that recovers lost password of Outlook .PST (Personal Folders) file.\nRouter IP/Passwords The complete list of Default Router Passwords and Default Router IP Addresses, can be useful if you have misplaced the manual or lost your router password.\nSniffPass 1.12 A password monitoring tool that listens to your network, capture the passwords that pass through your network adapter, it works on POP3, IMAP4, SMTP, FTP, and HTTP protocols and recovers lost Web/FTP/Email passwords.\nWindowsGate 1.1 Enables/Disables Windows logon password validation.\nWinKeyFinder 1.73 Allows you to View and Change Windows XP/2003 Product Keys, backup and restore activation related files, backup Microsoft Office 97, 2000 SP2, XP/2003 keys etc.\nWirelessKeyView 1.34 Recovers all wireless network keys (WEP/WPA) stored in your computer by WZC Wireless Zero Configuration.\nXP Key Reader 2.7 Can decode the XP-key on Local or Remote systems.\nProcess Tools\nDependency Walker 2.2 Checks for missing/invalid DLL/modules/functions for any exe/dll/ocx/sys.\nIB Process Manager 1.04 a little process manager for 9x/2k, shows dll info etc.\nOpenedFilesView 1.47 View opened/locked files in your system, sharing violation issues.\nPocket KillBox 2.0.0.978 can be used to get rid of files that stubbornly refuse to allow you to delete them.\nProcess Explorer 14.1 Shows you information about which handles and DLLs processes have opened or loaded.\nProcess Monitor 2.93 to monitor real-time file system, Registry and process/thread activity, This tool replaces Filemon and Regmon.\nProcessActivityView 1.11 Detailed process access information read/write/opened files etc.\nRKill (24-10-2010) RKill just kills malware processes, imports a Registry file that removes incorrect file associations and fixes policies that stop us from using certain tools.\nRunAsDate 1.10 allows you to run a program in the date and time that you specify.\nUnlocker 1.9.0 This tool can delete file/folder when you get this message - Cannot delete file: Access is denied, The file is in use by another program etc.\nRecovery Tools\nDataRescue DD 1.0 DrDD is a disk imager intended for data recovery and backup of partially corrupted storage devices, the main advantages are Range Selection and Copy Backward Direction.\nDiskDigger 0.8.3.176 Undelete and recover lost photos, videos, music, documents and other formats from your hard drive, memory cards and USB flash drives.\nDiskGenius 3.2 Restore deleted partition, Rebuild MBR, Rebuild partition table, Recover files, Restore formatted partition, Backup files by partition, Disk clone, Backup partition table, Create/Delete/Format Partitions etc.\nIsoBuster 2.8.5 CD/DVD/Blu-ray and Disk Image File data recovery tool that can read and extract files, tracks and sessions from CD-i, VCD, SVCD, CD-ROM, CD-ROM XA, DVD, DVCD BD and HD DVD and other media as well as a wide variety of disk image formats, it also has retry-mechanisms for damaged CD/DVD.\nPartition Find and Mount 2.31 Partition Find and Mount software is designed to find lost or deleted partitions.\nPartitionRecovery 1.0 A freeware tool to recover accidentally deleted partitions.\nPhotoRec 6.12b Tool to Recover File and pictures from Dos/Windows/Linux.\nRecuva 1.39.509 Restore deleted files from Hard Drive, Digital Camera Memory Card, usb mp3 player etc.\nRestoration 3.2.13 a tool to recover deleted files.\nShadowExplorer 0.7 Shadow Explorer allows you to browse the shadow copies created by the Windows Volume Shadow Copy Service and retrieve older versions from files you accidentally deleted or altered.\nSmart Partition Recovery 3.3 Find Lost NTFS partitions and restore them back.\nSoftPerfect File Recovery 1.2 to restore accidentally deleted files from hard drive, USB flash drives, CF and SD memory cards.\nTestDisk 6.12b Tool to check and undelete partition from Dos/Windows/Linux.\nUnstoppable Copier 5.2 Allows you to copy files from disks with problems such as bad sectors, scratches or that just give errors when reading data.\nRegistry Tools\nERUNT 1.1j The Emergency Recovery Utility NT Registry Backup and Restore for Windows NT/2000/2003/XP.\nFix HDC Fix the Hard Drive Controller when replacing your motherboard on an XP system.\nGlary Registry Repair 3.3.0.852 an advanced registry cleaner that allows you to safely scan, clean, and repair registry problems.\nRegFromApp 1.21 Monitors/exports the Registry changes made by the selected application.\nRegistry Editor PE 0.9c Easy editing of remote registry hives and user profiles.\nRegistry Restore Wizard 1.0.4 Restores a corrupted system registry from Xp System Restore.\nRegmon 7.04 A monitoring utility that will show you which applications are accessing your Registry.\nRegScanner 1.83 Tool to find/search in the Registry of Windows.\nRegShot 1.8.2 a registry compare utility that allows you to quickly take a snapshot of your registry and then compare it with a second one - done after doing system changes or installing a new software product.\nRegistry Viewer 4.2 Registry Viewer/Editor for Win9x/Me/NT/2K/XP.\nRemote Control Tools\nAmmyy Admin 2.13 For remote computer access, desktop sharing, file transfer, voice connect remote computer.\nTeamViewer 5.0.8703 Access any remote computer via Internet just like sitting in front of it, even through firewalls.\nTightVNC 2.0.2 Cross-platform Remote Desktop Software to view/control remote pc with mouse and keyboard.\nSecurity / Encryption Tools\nDiskCryptor 0.9 High speed disk encryption tool to encrypt all disk/partitions, including the system partition encryption support.\nTrueCrypt 7.0a On-the-fly Linux/Windows disk encryption tool, can create a virtual encrypted disk within a file and mount it as a real disk, can also encrypt an entire HDD/Partition/USB Drive.\nStartup Tools\nAutoruns 10.06 Displays All the entries from startup folder, Run, RunOnce, and other Registry keys, Explorer shell extensions,toolbars, browser helper objects, Winlogon notifications, auto-start services, Scheduled Tasks, Winsock, LSA Providers, Remove Drivers and much more which helps to remove nasty spyware/adware and viruses.\nHijackThis 2.0.4 a general homepage hijackers detector and remover and more.\nServiWin v1.40 Alternative Windows Services/Drivers Tool.\nSilent Runners Revision 63 A free script that helps detect spyware, malware and adware in the startup process.\nStartup Control Panel 2.8 a tool to edit startup programs.\nStartup Monitor 1.02 it notifies you when any program registers itself to run at system startup.\nSystem Information Tools\nAstra 5.48 Advanced System info Tool and Reporting Assistant.\nBlueScreenView 1.30 Scans minidump files for BSOD (blue screen of death) crash information.\nCPU Identification utility 1.18CHKCPU.EXE Detailed information on CPU.\nCPU-Z 1.56 It gathers information on some of the main devices of your system.\nCTIA CPU Information 2.7 another CPU information tool.\nDrive Temperature 1.0 Hard Disk Drive temperature meter.\nGPU-Z 0.5.0 A lightweight utility designed to give you all information about your video card and GPU.\nHDTune 2.55 HD Tune is a hard disk health, benchmarking, error scanner and information tool.\nHWiNFO 5.5.0 a powerful system information utility.\nNavratil Software System Information 0.60.45 High-end professional system information tool.\nPCI and AGP info Tool (07-02-2011) The PCI System information and Exploration tool.\nPC Wizard 2010.1.961 PCWizard is a powerful system information/benchmark utility designed especially for detection of hardware.\nPCI 32 Sniffer 1.4 (07-02-2011) device information tool which is similar to unknown devices.\nSIW 2010.10.21 Gathers detailed information about your system properties and settings.\nSpeccy 1.07.205 an advanced System Information tool for your PC.\nSystem Analyser 5.3w View extensive information about your hardware.\nSystem Explorer 2.6.1 Shows detailed system information about processes, startups, IE addons, drivers, explorer, etc.\nSysChk 2.46 Find out exactly what is under the hood of your PC.\nUnknownDevices 1.4.20 (07-02-2011) helps you find what those unknown devices in Device Manager really are.\nUpdate Checker 1.038 scans your computer for installed software and checks for newer releases on FileHippo.\nUSBDeview 1.84 View/Uninstall all installed/connected USB devices on your system.\nTesting Tools\nBart's Stuff Test 5.1.4 Long term heavy stress testing storage devices.\nCPU/Video/Disk Performance Test 5.7 a tool to test cpu, video, and disk.\nDisk Speed 1.0 Hard Disk Drive Speed Testing Tool.\nGoldMemory 5.07 Memory Diagnostic Tests.\nH2testw 1.4 Check your USB Flash memory cards, internal/external hard drives and network drives for errors with this tool.\nHDD Scan 3.3 HDDScan is a Low-level HDD diagnostic tool, it scans surface find bad sectors etc.\nIsMyLcdOK (Monitor Test) 1.02 Allows you to test CRT/LCD/TFT screens for dead pixels and diffective screens.\nMemtest86+ 4.20 PC Memory Test.\nMemTest 1.0 a Memory Testing Tool.\nPrime95 25.11 This will detect for errors in CPU or RAM within a matter of minutes if an overclock is not stable, you can run Torture Test (burn-in) overnight to ensure long-term stability of the hardware.\nS&amp;M Stress Test 1.9.1 cpu/hdd/memory benchmarking and information tool, including temperatures/fan speeds/voltages.\nSystem Speed Test 4.78 it tests CPU, harddrive, ect.\nTest Hard Disk Drive 1.0 a tool to test Hard Disk Drive.\nVideo Memory Stress Test 1.7.116 a tool to thoroughly test your video RAM for errors and faults.\nVideo Memory Stress Test CE 1.21 Tests all video RAM accessible by 32-bit CPU address space from a clean environment.\nWindows Memory Diagnostic a RAM Test tool.\nTweakers\nDial a Fix 0.60.0.24 Fix errors and problems with COM/ActiveX object errors and missing registry entries, Automatic Updates, SSL, HTTPS, and Cryptography service (signing/verification) issues, Reinstall internet explorer etc. comes with the policy scanner.\nDisable Autorun A small tweak which disables processing of autorun.inf to protect your PC from usb autorun viruses.\nDisable Compress Old Files This registry tweak is useful when Disk Cleanup Tool Stops Responding While Compressing Old Files.\nEzPcFix 1.0.0.16 Helpful tool when trying to remove viruses, spyware, and malware.\nInstalledCodec 1.15 Disable/Enable Installed Codec drivers and DirectShow filters.\nKeyTweak 2.3.0 a program to Remap Keyboard Layout, you can even customize a broken key to an unused key.\nProtect a Drive from Autorun Virus Protect your pen drive from being infected when you plug it in an infected PC.\nRemoveWGA 1.2 Windows Genuine Advantage Notifications Removal tool.\nRRT - Remove Restrictions Tool 3.0 to Re-enable Ctrl+Alt+Del, Folder Options and Registry tools etc.\nShell Extensions Manager (ShellExView) 1.50 An excellent tool to View and Manage all installed Context-menu/Shell extensions.\nShellMenuNew 1.01 View/Change the list of all menu items in the 'New' submenu of Windows Explorer.\nShow Hidden Devices Device Manager hides nonpresent devices that are not physically present in the system, but still have configuration information in the Registry.\nTweakUI 2.10 This PowerToy gives you access to system settings that are not exposed in Windows Xp.\nUltimate Windows Tweaker 2.1 A TweakUI Utility for tweaking and optimizing Windows Vista.\nWrite Protect USB Devices Tweak your PC to make USB Pen Drive, Memory Card or Thumb Drive as Read Only.\nXp-AntiSpy 3.97.10 it tweaks some Windows XP functions, and disables some unneeded Windows services quickly.","torrent":{"xt":"urn:btih:c7ed92f8f0d1a2551764c80754768608f5506dc0","amp;dn":"Hirens.BootCD.13.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7ed92f8f0d1a2551764c80754768608f5506dc0","infoHashBuffer":{"type":"Buffer","data":[199,237,146,248,240,209,162,85,23,100,200,7,84,118,134,8,245,80,109,192]},"announce":[],"urlList":[]}}