{"title":"Agent 327 1-9 (danish)","uid":6173340,"size":300247831,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c8ac017aa957d84af45085551aacc5081e3a92f1&amp;dn=Agent+327+1-9+%28danish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"data9724","files":10,"time":1297670841,"description":"Jeg blev endelig fÃƒÂ¦rdig med at scanne hele Agent 327 serien, en genial serie om Agent 327 fra den Hollandske efterretningstjeneste.\n\nHer er beskrivelse fra alle 9 albums:\n\nAgent 327 01 - Sagen om De Knuste Glas:\nHvorfor forsvandt operadivaen Maria Trallas? Hvorfor blev kaptajn Tietjerksteradeel's ÃƒÂ¸lbeholdning ÃƒÂ¸delagt? Hvorfor kunne dr. Maybe ikke bestemme sig? Hvorfor mÃƒÂ¥tte hangarskibets besÃƒÂ¦tning gÃƒÂ¥ i bÃƒÂ¥dene? Forvirret? Ikke, nÃƒÂ¥r De har lÃƒÂ¦st &gt;&gt;Sagen om de knuste glas&lt;&lt; hvor den uforfÃƒÂ¦rdede agent 327 endnu en gang sÃƒÂ¦tter sin snilde ind mÃƒÂ¥ alskens ondskab og fordÃƒÂ¦rv.\n\n\nAgent 327 02 - Sagen om Nattevagten:\nDet begyndte sÃƒÂ¥ uskyldigt: En lille dreng legede med sin vandpisol pÃƒÂ¥ Amsterdams kunstmuseum. Hvordan kunne det blive til en sag, der interesserede sÃƒÂ¥vel Hollands Efterretningstjeneste som Amsterdams Kriminalpoliti? Og hvorfor sendt Agent 327 roser til pigen i husbÃƒÂ¥den? FÃƒÂ¥ svaret pÃƒÂ¥ disse spÃƒÂ¸rgsmÃƒÂ¥l - og pÃƒÂ¥ en masse andre, du ikke engang havde tÃƒÂ¦nkt pÃƒÂ¥ at stille - i dette fantastiske album om Hans Harkhoosts bedrifter.\n\n\nAgent 327 03 - 30 ÃƒÂ¥rs Ventetid:\nHvad lavede Hans Harkhoost egentlig under krigen? Og hvornÃƒÂ¥r mÃƒÂ¸dte han for fÃƒÂ¸rste gang den navnkundige chef for Hollands efterretningstjeneste? Disse dunkle punkter opklares i denne sÃƒÂ¦lsomme historie om blÃƒÂ¥ÃƒÂ¸jede videnskabsmÃƒÂ¦nd, trÃƒÂ¦ske sovjetagenter og gamle nazi-officerer. Det drejer sig om noget med ÃƒÂ©t hemmeligt vÃƒÂ¥ben der dukker frem af glemslens lys efter 30 ÃƒÂ¥rs ventetid!\n\n\nAgent 327 04 - Hekseringen:\nAgent 327 og hans trofaste Bernhard er pÃƒÂ¥ spil igen. Det drejer sig om hekseri og trolddom...Og sÃƒÂ¥ er der ogsÃƒÂ¥ en sag om vÃƒÂ¥bensmugleri...Den ene sag har rÃƒÂ¸dder langt tilbage i fortiden, mens den anden har med en yderst nutidig Boris Kloris at gÃƒÂ¸re. I begge sager har Bernhard visse genvordigheder, men mon ikke det lykkes for vor helt, Hans Harkhoost alias Agent 327 fra det hollandske efterretningsvÃƒÂ¦sen, at fÃƒÂ¥ raget kastanierne ud af ilden? LÃƒÂ¦s selv Hekseringen.\n\n\nAgent 327 05 - SÃƒÂ¸ndagsbarnet:\nDet er et par gange lykkedes Agent 327 at stikke en kÃƒÂ¦p i hjulet for Kwaitis diktator, Doktor Papa, og nu vil doktoren have hÃƒÂ¦vn! Til det formÃƒÂ¥l har han allieret sig med en dÃƒÂ¸dsensfarlig international spionring. OgsÃƒÂ¥ verdensomsejleren Frans Tietjerksteradeel bliver blandet ind i affÃƒÂ¦ren, og Agent 372 Harkhoost for brug for alt den hjÃƒÂ¦lp han kan fÃƒÂ¥, bl.a. fra den imponerende schweiziske agentpige Olga Lawina, nÃƒÂ¥r han skal mÃƒÂ¸de sÃƒÂ¸ndagsbarnet!!\n\n\nAgent 327 06 - Syvsoveren:\nEndelig! Her er svarene pÃƒÂ¥ alle gÃƒÂ¥derne; Bermudatrekanten, Sargassohavet, statuerne pÃƒÂ¥ PÃƒÂ¥skeÃƒÂ¸en, livets opstÃƒÂ¥en, Atlantis, ÃƒÂ¥lens vandringer. Ja, det eneste, der ikke bliver opklaret i dette utrolige eventyr med Agent 327, alias Hans Harkhoost fra den hollandske efterretningstjeneste, er, hvorfor det altid regner nÃƒÂ¥r man skal spille golf - men det bliver mÃƒÂ¥ske opklaret i nÃƒÂ¦ste album. Desuden bÃƒÂ¸r det nÃƒÂ¦vnes at den schweiziske super-pige Olga Lawina ogsÃƒÂ¥ er med i lÃƒÂ¸jerne.\n\n\nAgent 327 07 - Terror i Rotterdam:\nAgent 327, alias Hans Harhoost, fÃƒÂ¥r travlt igen. DirektÃƒÂ¸ren for et at Hollands stÃƒÂ¸rste olieselskaber forsvinder, og sporene fÃƒÂ¸rer til det internationals &gt;&gt;spotmarked&lt;&lt; i Rotterdam. Den formidable Olga Lawina blander sig i sagen, der blandet andet fÃƒÂ¸rer vor helt ned i Rotterdams undergrund! Konfrontationer med vilde dyr og mennesker, druknedÃƒÂ¸d og unÃƒÂ¦vnelige pinsler viser vejen til Wu Manchu, vestens svÃƒÂ¸be fra ÃƒÂ¸sten...\n\n\n\nAgent 327 08 - Wu Machus ÃƒÂ¸jne:\nDer sker sÃƒÂ¦re ting i Rotterdam. Mystiske personer flakker om i gaderne fuldstÃƒÂ¦ndig fra sans og samling og fabler om hvide rotter og Wu Manchus ÃƒÂ¸jne! Hvad er der sket? Har Agent 327 ikke en gang for alle gjort kÃƒÂ¥l pÃƒÂ¥ den forbryderiske Wu Manchu og hendes slÃƒÂ¦ng af hjernevaskede slaver? Eller er slaverne mÃƒÂ¥ske begyndet for sig selv? Den hollandske efterretningstjenestes bedste agent (nummer 327 alias Hans Harkhoost) mÃƒÂ¥ igen afsted til Rotterdam og rede de spegede trÃƒÂ¥de ud - og inden han fÃƒÂ¥r gjort det, dukker en andel gammel bekendt ogsÃƒÂ¥ op...\nAlbummet indeholder desuden en kortere historie med selvsamme gamle bekendte.\n\n\nAgent 327 09 - Kunsten Stiger!:\nEt forfalsket maleri kan blive ÃƒÂ¥rsag til de mÃƒÂ¦rkeligste ting; isÃƒÂ¦r hvis det drejer sig om et, der er malet oven pÃƒÂ¥ et ÃƒÂ¦gte maleri! HAVDE det ikke drejet sig om et sÃƒÂ¥dant maleri, var disse linier naturligvis ikke blevet skrevet, og der var mÃƒÂ¥ske slet ikke sket nogen mÃƒÂ¦rkelige ting - men det gÃƒÂ¸r der! Og sÃƒÂ¥ mÃƒÂ¥ den hollandske efterretningstjenestes bedste agent (nummer 327 alias Hans Harkhoost) gÃƒÂ¥ i aktion, hvilket han i allerhÃƒÂ¸jeste grad ogsÃƒÂ¥ gÃƒÂ¸r - bÃƒÂ¥de i historien KUNSTEN STIGER! og da der opstÃƒÂ¥r problemer med sagerne om RÃƒÂ¸gbomben og Resten af verden minus en...\n\n\n\nDesvÃƒÂ¦rre udkom der kun 9 bind pÃƒÂ¥ dansk, men man har vel lov at hÃƒÂ¥be pÃƒÂ¥ at resten kommer en dag.\n\nHvis du kan lide serien, sÃƒÂ¥ er det stadig muligt at fÃƒÂ¥ fat i brugte albums, men nogle af dem kan vÃƒÂ¦re lidt dyre, isÃƒÂ¦r hvis du ikke kan leve med Trumf albummene, men sÃƒÂ¸g lidt rundt pÃƒÂ¥ nettet, du kunne vÃƒÂ¦re heldig :)","torrent":{"xt":"urn:btih:c8ac017aa957d84af45085551aacc5081e3a92f1","amp;dn":"Agent+327+1-9+%28danish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8ac017aa957d84af45085551aacc5081e3a92f1","infoHashBuffer":{"type":"Buffer","data":[200,172,1,122,169,87,216,74,244,80,133,85,26,172,197,8,30,58,146,241]},"announce":[],"urlList":[]}}