{"title":"Flikken Seizoen 8 dvd 4 (Dutch) TBS","uid":6278491,"size":4519761537,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c9b064c7e0ded90472223945493565d4daba9ba7&amp;dn=Flikken+Seizoen+8+dvd+4+%28Dutch%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Mad_Parrot","files":-1,"time":1301350386,"description":"\n\nFlikken Seizoen 8 dvd 4\n\n\n\nDe serie werd gecreÃƒÂ«erd door scenarioschrijver Pierre De Clercq en producent Erwin Provoost en was een coproductie van het productiehuis MMG en VRT en, seizoen 5 en 6, ook de Nederlandse TROS.\n\nDe serie Flikken heeft de Vlaamse stad Gent als achtergronddecor. Het lokale politieteam staat centraal in de serie en niet een of twee hoofdpersonages. De makers hadden bij aanvang van de serie zoveel vertrouwen in de serie, dat de opnames voor de tweede reeks in 1998 al begonnen waren, voordat de eerste aflevering uitgezonden was. \nIn de eerste reeks was er geen doorlopend verhaal tussen de verschillende afleveringen, dit volgde pas in de latere reeksen. Zo gingen de flikken, bijgestaan door de Nederlandse rechercheur Robert Nieuwman (Boudewijn de Groot), in 2004 op zoek naar de seriemoordenaar Luc Feiremans.\n\nIn april 2007 maakte de Vlaamse omroep VRT bekend dat het tiende seizoen van Flikken het laatste zou zijn. De financiÃƒÂ«n speelden hierbij een rol. De serie kostte veel geld, terwijl de VRT veel andere fictiereeksen op de rol had staan. \nHet slotseizoen, dat overigens maar tien afleveringen heeft in plaats van de gebruikelijke dertien, werd van 15 februari tot 19 april 2009 uitgezonden op ÃƒÂ©ÃƒÂ©n.[1]\n\nOm Flikken een waardige afsluiter te geven werd er op zaterdag 18 april 2009 in Gent een Flikkenparty georganiseerd. Op het einde van de dag kon in Kinepolis Gent de laatste Flikken-aflevering in avant-premiÃƒÂ¨re bekeken worden.\n\nSinds september 2007 zendt de TROS een Nederlandse versie van Flikken uit, Flikken Maastricht. Deze serie is qua cast kleinschaliger dan de originele serie.\n\n102 &quot;Rat&quot; 15 april 2007 8.11 \nDe anonieme verklaring van Caron komt hem duur te staan. Pasmans komt in aanvaring met Vanbruane. Ze bleekt nu de functie als commissaris bij de federale politie. John moet tussenbeide komen om orde op zaken te stellen. Nogmaals komt er een interessant feit over Lansknecht bovendrijven. Het net om de bende begint zicht steeds verder te sluiten.  \n\n103 &quot;JLD&quot; 22 april 2007 8.12 \nJohn neemt definitief de leiding van Pasmans weer over. De zoektocht naar Bruno gaat door en er wordt inmiddels onderhandeld met de gijzelaars. Probleem is wel dat ze niet kunnen garaderen dat Bruno nog leeft.  \n\n104 &quot;De Barracuda&quot; 29 april 2007 8.13 \nDe tijd dringt om het leven van Bruno te redden. In het onderzoek naar de Barracudabende en Immoportus worden de laatste eindjes aan elkaar geknoopt. De verbanden tussen beide organisaties worden duidelijk.  \n\n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : ISO \nBron          : Retail\nMenu          : Ja\nExtra's       : Ja\nAudio         : Nederlands\nOndertitels   : Nederlands (instelbaar)\nCover &amp; label : Ja\nGenre         : Actie\n \n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Flikken_(televisieserie)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Flikken_(televisieserie)&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.een.be/programmas/flikken&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.een.be/programmas/flikken&lt;/a&gt;\n\n\n\nBrought to you by TinkerBell @ TBS","torrent":{"xt":"urn:btih:c9b064c7e0ded90472223945493565d4daba9ba7","amp;dn":"Flikken+Seizoen+8+dvd+4+%28Dutch%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9b064c7e0ded90472223945493565d4daba9ba7","infoHashBuffer":{"type":"Buffer","data":[201,176,100,199,224,222,217,4,114,34,57,69,73,53,101,212,218,186,155,167]},"announce":[],"urlList":[]}}