{"title":"Thomas Hardy - Jude (the Obscure) - 1996","uid":5074051,"size":801907763,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c9cc1feb1c1b7d27a8d3292b9e93f8a86aa00579&amp;dn=Thomas+Hardy+-+Jude+%28the+Obscure%29+-+1996&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sheila6","files":-1,"time":1251664336,"description":"Movies : Romance : Other quality : English\n\n\nJude is a 1996 English film, based on the novel Jude the Obscure by Thomas Hardy and directed by Michael Winterbottom, who also directed The Claim, another Hardy-based movie, in 2000. It tells the story of a stonemason pursuing the cousin he loves even though both are married. The screenplay is written by Hossein Amini. The original music score is composed by Adrian Johnston.\n\nThe film gained notoriety for a scene in which Kate Winslet's character is shown giving birth in graphic detail, a scene in which she appeared full-frontal nude.\n\nEccleston shares a brief scene in the film with David Tennant. Nine years later, Tennant succeeded Eccleston in the lead role in Doctor Who. Jude remains the only time that the two have appeared together on-screen.\n\nThe majority of the film was shot in Edinburgh in late 1994.\n\n\n\nSynopsis:\n\nIn the Victorian period, Jude Fawley (Eccleston) is a young man with dreams of receiving a scholarly university education. Circumstances conspire against him, however, forcing him into a job as a stonemason and an unsatisfactory marriage to a country girl, Arabella (Griffiths). He remains true to his dream, however, and months later, after his wife's sudden departure, heads for the city, where he thinks education lies for any man who is willing to work hard. There he encounters his beautiful cousin, Sue Bridehead (Winslet), who shares his intelligence and disdain for convention, and the two develop a romantic relationship. These unlikely lovers must struggle to keep their relationship from a disapproving world, however, or else face the tragic consequences of public scandal.\n\n\n\nMain Cast:\n\nChristopher Eccleston - Jude Fawley\nKate Winslet - Sue Bridehead\nLiam Cunningham - Phillotson\nRachel Griffiths - Arabella\nJune Whitfield - Aunt Drusilla.\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c9cc1feb1c1b7d27a8d3292b9e93f8a86aa00579","amp;dn":"Thomas+Hardy+-+Jude+%28the+Obscure%29+-+1996","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9cc1feb1c1b7d27a8d3292b9e93f8a86aa00579","infoHashBuffer":{"type":"Buffer","data":[201,204,31,235,28,27,125,39,168,211,41,43,158,147,248,168,106,160,5,121]},"announce":[],"urlList":[]}}