{"title":"Aerosmith - Toys In The Attic (1975) *FIXED* vtwin88cube","uid":6182550,"size":90307688,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ca2d362654f10b10cc37808063ff1c7622281be7&amp;dn=Aerosmith+-+Toys+In+The+Attic+%281975%29+%2AFIXED%2A+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1298007570,"description":"\nAerosmith\nToys In The Attic (1975)\nGold Mastersound Edition\n\nAerosmith was one of the most popular hard rock bands of the '70s, setting the style and sound of hard rock and heavy metal for the next two decades with their raunchy, bluesy swagger. The Boston-based quintet found the middle ground between the menace of the Rolling Stones and the campy, sleazy flamboyance of the New York Dolls, developing a lean, dirty riff-oriented boogie that was loose and swinging and as hard as a diamond.\n\nIn the meantime, they developed a prototype for power ballads with &quot;Dream On,&quot; a piano ballad that was orchestrated with strings and distorted guitars. Aerosmith's ability to pull off both ballads and rock &amp; roll made them extremely popular during the mid-'70s, when they had a string of gold and platinum albums. By the early '80s, the group's audience had declined as the band fell prey to drug and alcohol abuse. However, their career was far from over -- in the late '80s, Aerosmith pulled off one of the most remarkable comebacks in rock history, returning to the top of the charts with a group of albums that equalled, if not surpassed, the popularity of their '70s albums.\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tRock\t\t\t\nSource:\t\t\tFlac Conversion\n\nAfter nearly getting off the ground with Get Your Wings, Aerosmith finally perfected their mix of Stonesy raunch and Zeppelin-esque riffing with their third album, Toys in the Attic. The success of the album derives from a combination of an increased sense of songwriting skills and purpose. Not only does Joe Perry turn out indelible riffs like &quot;Walk This Way,&quot; &quot;Toys in the Attic,&quot; and &quot;Sweet Emotion,&quot; but Steven Tyler has fully embraced sleaziness as his artistic muse. Taking his cue from the old dirty blues &quot;Big Ten Inch Record,&quot; Tyler writes with a gleeful impishness about sex throughout Toys in the Attic, whether it's the teenage heavy petting of &quot;Walk This Way,&quot; the promiscuous &quot;Sweet Emotion,&quot; or the double-entendres of &quot;Uncle Salty&quot; and &quot;Adam's Apple.&quot; The rest of Aerosmith, led by Perry's dirty, exaggerated riffing, provide an appropriately greasy backing. Before Toys in the Attic, no other hard rock band sounded like this. Sure, Aerosmith cribbed heavily from the records of the Rolling Stones, New York Dolls, and Led Zeppelin, but they didn't have any of the menace of their influences, nor any of their mystique. Aerosmith was a gritty, street-wise hard rock band who played their blues as blooze and were in it for a good time; Toys in the Attic crystallizes that attitude.\n\n01.Toys In The Attic\n02.Uncle Salty\n03.Adam's Apple\n04.Walk This Way\n05.Big Ten Inch Record\n06.Sweet Emotion\n07.No More No More\n08.Round And Round\n09.You See Me Crying\n\n\nCheers!","torrent":{"xt":"urn:btih:ca2d362654f10b10cc37808063ff1c7622281be7","amp;dn":"Aerosmith+-+Toys+In+The+Attic+%281975%29+%2AFIXED%2A+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca2d362654f10b10cc37808063ff1c7622281be7","infoHashBuffer":{"type":"Buffer","data":[202,45,54,38,84,241,11,16,204,55,128,128,99,255,28,118,34,40,27,231]},"announce":[],"urlList":[]}}