{"title":"Nana.(ebook)(","uid":6141558,"size":2920448,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca8fee74a46025cd437ddffd7ff1249e8a96dc74&amp;dn=Nana.%28ebook%29%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1296518615,"description":"A Carl Streator, periodista de mediana edad, le han encargado que escriba una serie de artÃƒÂ­culos sobre la muerte sÃƒÂºbita infantil, un tema que le resulta familiar pues ÃƒÂ©l mismo perdiÃƒÂ³ a su hijo en circunstancias extraÃƒÂ±as. En el transcurso de la investigaciÃƒÂ³n descubre que en todas las casas donde ha muerto un bebÃƒÂ© hay un ejemplar del mismo libro: una antologÃƒÂ­a de poemas que contiene una nana letal. Esta canciÃƒÂ³n mata a aquel que la escucha; de hecho, su poder es tal que ni siquiera es necesario recitarla, con tan solo memorizarla y odiar a alguien intensamente, este cae fulminado. En una sola maÃƒÂ±ana Streator aniquila a media docena de personas, convirtiÃƒÂ©ndose en un asesino en serie involuntario.\n\nStreator se pone en contacto con Helen Hoover Boyle, una mujer cuyo hijo muriÃƒÂ³ en circunstancias similares y que ahora se ha especializado en vender casas encantadas. Ambos emprenden, acompaÃƒÂ±ados por la secretaria de Helen, Mona, y su novio, Oyster, un activista ecologista ultrarradical, un viaje por carretera con el fin de destruir todos los ejemplares del libro y luego encontrar el grimorio original de donde procede el hechizo.\n\n\n\nCon Nana damos la bienvenida a una nueva familia nuclear, un grupo disfuncional hasta extremos aberrantes. Y a una hilarante alegorÃƒÂ­a sobre la informaciÃƒÂ³n y el poder.\n","torrent":{"xt":"urn:btih:ca8fee74a46025cd437ddffd7ff1249e8a96dc74","amp;dn":"Nana.%28ebook%29%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca8fee74a46025cd437ddffd7ff1249e8a96dc74","infoHashBuffer":{"type":"Buffer","data":[202,143,238,116,164,96,37,205,67,125,223,253,127,241,36,158,138,150,220,116]},"announce":[],"urlList":[]}}