{"title":"Coast to Coast - Mar 28 2011 - Mind Control &amp; Self-Realization","uid":6282772,"size":55889166,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:caa553ab9381c41ddb0a928a2e0ffb1988d54fae&amp;dn=Coast+to+Coast+-+Mar+28+2011+-+Mind+Control+%26+Self-Realization&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mscowlove","files":5,"time":1301502812,"description":"Mind Control &amp; Self-Realization\n\nDate: 03-28-11 \nHost: George Noory \nGuests: Eldon Taylor, Greg Hunter \n\nA doctor of Psychology and Metaphysics, Eldon Taylor discussed his new book What If?, and how people can meet the challenges of self-realization &amp; actualization. He also reviewed his studies of mind programming, and subliminal suggestion. Television, he pointed out, is a type of mind control or hypnosis that puts people in a Alpha brain state, and a higher level of suggestibility. Astonishingly, by the time a person reaches age 65, they will have spent nine years of their lives watching TV, he reported. \n\nAdvertisers sometimes embed demonic or violent subliminal images in order to create a sense of arousal in the consumer, as this will make their product more memorable, he detailed. But, this practice, and the use of increased violence &amp; sex in entertainment vehicles, has caused a desensitization of arousal, wherein ever more graphic images are used to get a reaction from the audience, Taylor said. One possible effect from this is a dramatic decrease in the amount of empathy that teenagers are capable of feeling, he noted. \n\nFurther, advertisers try to keep consumers in an anxious state, so they will feel they need their product to fit in or be liked, Taylor continued. People can experience self-actualization (realizing their potential) by helping those in need-- these actions are rewarded by positive neurochemicals, he shared. Using meditation, or thought experiments, a person can clarify their belief structures, and understand their biases and conflicts, he added. \n\nJapan &amp; Libya Analysis\nFirst hour guest, investigative reporter Greg Hunter talked about Japan, Libya, and current events.The radioactive contamination in Japan from the damaged nuclear plants is an unparalleled problem, he commented, and we don't know the full extent of yet. Regarding the attacks on Libya, he noted that they weren't approved by Congress, and that passing it off to NATO still means there'll be heavy US involvement. \n\nWebsite(s): \neldontaylor.com \nusawatchdog.com \n\nBook(s): \nWhat If? \nWhat Does That Mean?: Exploring Mind, Meaning, and Mysteries \nMind Programming \n\n\n","torrent":{"xt":"urn:btih:caa553ab9381c41ddb0a928a2e0ffb1988d54fae","amp;dn":"Coast+to+Coast+-+Mar+28+2011+-+Mind+Control+%26+Self-Realization","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caa553ab9381c41ddb0a928a2e0ffb1988d54fae","infoHashBuffer":{"type":"Buffer","data":[202,165,83,171,147,129,196,29,219,10,146,138,46,15,251,25,136,213,79,174]},"announce":[],"urlList":[]}}