{"title":"Dave Brubeck - Angel Eyes RELOADED (1962) [Jazz][flac][schon55]","uid":5104851,"size":229762341,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cad5a86fefa2a109e6b471a0d7c5a2a1ba823f12&amp;dn=Dave+Brubeck+-+Angel+Eyes+RELOADED+%281962%29+%5BJazz%5D%5Bflac%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":22,"time":1254282728,"description":"Dave Brubeck - Angel Eyes RELOADED\nOriginal Release Date: July 2, 1962  \nAudio CD: January 27, 1998 \nLabel: Sbme Import\nFormat: Import, Limited Edition, Original recording remastered \nQuality: flac + cue + LOGS\n\nTRACK #7 WAS MISSING ON FIRST UPLOAD.  SORRY !!\n\nI heard this album in 1965, when I was 16. Not a bad introduction to Jazz. The best piano player, alto sax player, and drummer of all time. I got hooked immediately. You know I was listeneing to the pop music of the day. I put this on and heard Joe Morello with that outstanding cymbal playing on &quot;Let's Get Away From It All&quot;, and I was astonished. I'm still astonished from Joe Morello. This is the best quartet of all time. Three players who are leaders and the bass. I only like Dave Brubeck with this quartet, and the drummer is what is driving him. Anyway, Dave Brubeck doesn't need me to criticize him, so let's move on. I wil tell you that the playing of &quot;Angel Eyes&quot;, is absolutely the best reading of this song available. Period. You will feel like you are in a smokey cafe. It's so bluesy; don't tell me Dave Brubeck can't play the blues. It's unbelievable. I would buy the disc for this song alone. &quot;Violets For Your Furs&quot;, is also a favorite. Great playing on these songs. The only thing I don't like about this album is the playing gets tedious on the other cuts, but that's my opinion. You may love the playing. The songs themselves are the things that are not enjoyable. In general, it's a great album and it's my first. I looked all over for this disc. I don't care what it costs. I would pay anything to have this. I'm so glad it's available. Also, the playing is extremely user friendly for the new person first listening to Jazz. I treasure this disc. ~ Steven Meyers\n\nHave tried to find this in CD format for years. Is as enjoyable listening as any Brubeck album I have ever heard. All of the 7 tracks are outstanding. Recordings ar excellent quality. Great solos from Brubeck and Desmond. ~ A Customer, Amazon\n\nDave Brubeck - Angel Eyes Tracks:\n01  Let's Get Away from It All   \n02  Violets for Your Furs   \n03  Angel Eyes   \n04  Will You Still Be Mine?   \n05  Everything Happens to Me   \n06  Little Man With a Candy Cigar   \n07  Night We Called It a Day  \n","torrent":{"xt":"urn:btih:cad5a86fefa2a109e6b471a0d7c5a2a1ba823f12","amp;dn":"Dave+Brubeck+-+Angel+Eyes+RELOADED+%281962%29+%5BJazz%5D%5Bflac%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cad5a86fefa2a109e6b471a0d7c5a2a1ba823f12","infoHashBuffer":{"type":"Buffer","data":[202,213,168,111,239,162,161,9,230,180,113,160,215,197,162,161,186,130,63,18]},"announce":[],"urlList":[]}}