{"title":"Dan Peek","uid":5053478,"size":63531642,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cad9051c914a52b96cd44845d1f2472505091f0e&amp;dn=Dan+Peek&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"freedomp","files":21,"time":1250282246,"description":"Dan Peek (born 1 November 1950, Panama City, Florida) was a member of the rock band, America from 1970 to 1977, together with Gerry Beckley and Dewey Bunnell. He has contributed lead and backing vocals, guitars, bass, keyboards, and harmonica to their recordings during his tenure in the band.\n\nPeek left America shortly after the February 1977 release of the Harbor album. He renewed his Christian faith after years of unhappy recreational drug use and a fast lifestyle, and had begun to seek a different artistic direction than Beckley or Bunnell. He went on to sign with Pat Boone's Lamb &amp; Lion Records, and found success as a pioneering artist in the emerging Christian pop music genre. Outside of rejoining Beckley and Bunnell on stage on one spontaneous occasion several years after, Peek has not reunited with America, contrary to various inaccurate reports which have arisen over the years. Bunnell and Beckley contributed backing vocals on Peek's debut solo album, All Things Are Possible, in 1978, but that was in the context of Peek's solo career, and not as America.\n\nPeek would later release an autobiography entitled An American Band, based on America's most successful period, and his own spiritual journey. [1]\n\nPeek's first album and single became big hits on contemporary Christian music (CCM) radio stations and charts. The single &quot;All Things Are Possible&quot; not only hit number 1 on the CCM singles chart, it also crossed over to the Billboard singles and adult contemporary charts, becoming one of the earliest CCM's crossover hits.\n\nPeek lost much of the momentum gained by the success of his initial hit by not releasing a second album for five years, 1984's Doer of the Word. While several of his songs would make the CCM charts, none crossed over to the Pop or Adult Contemporary charts.\n\nPeek spent much of the 1990s in semi-retirement, occasionally recording music at his home in the Cayman Islands. He released several solo projects and collaborated with Ken Marvin and Brian Gentry as &quot;Peace&quot; on three albums. In recent years he has released music via his web page. [1]","torrent":{"xt":"urn:btih:cad9051c914a52b96cd44845d1f2472505091f0e","amp;dn":"Dan+Peek","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cad9051c914a52b96cd44845d1f2472505091f0e","infoHashBuffer":{"type":"Buffer","data":[202,217,5,28,145,74,82,185,108,212,72,69,209,242,71,37,5,9,31,14]},"announce":[],"urlList":[]}}