{"title":"The John Bonham Story (FLAC)","uid":5613077,"size":433579606,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cb0e1ee9130d5c127abd97d44380d17553a2f8dc&amp;dn=The+John+Bonham+Story+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chug70","files":3,"time":1275957495,"description":"The John Bonham Story\n---------------------\n\nBroadcast on BBC 6 Music on 31st May 2010.\n\nLineage:\n\n(Freeview/UK) DVB-T -&gt; MPEG2 -&gt; WAV -&gt; FLAC -&gt; You.\n\nThe digital audio bit rate is currently 160 kbit/s for BBC 6 Music (see http://dtt.me.uk/)\n\n\n\n\nRock superstar and lifelong Led Zeppelin fan, Dave Grohl, celebrates a man who the Encyclopedia Britannica describes as &quot;the perfect model for all hard rock drummers that have followed.&quot;\n\nJohn Henry 'Bonzo' Bonham, drummer with legendary rock outfit Led Zeppelin was born on 31 May 1948 and died, tragically, on September 25th 1980. Featuring exclusive new interview material from stars including Robert Plant, Jimmy Page, and Carmine Appice, as well as the key industry figures and family and close friends - this is his story.\n\nOn September 25th 1980, John Bonham drank four quadruple vodkas for breakfast and continued drinking throughout the day. He was found dead the next morning, aged 32.\n\nPresented by none other than 'Nirvana', 'Foo Fighters' and 'Them Crooked Vultures' star Dave Grohl, this programme takes the listener through Bonham's extraordinary life, to his legendary playing with Led Zeppelin to his tragic and untimely death. Not only does Grohl offer rock star profile, he also brings a real and deep understanding of the subject, both as a fellow drummer and a Zeppelin fan, and enormous musical credibility amongst his peers and his audience.\n\nBeginning in Redditch, we hear of Bonham's boyhood obsession with rhythm, beating his mother's pots and pans into submission before moving into his early drumming education with bands across the West Midlands. From 1968 onwards, we piece together the moment Bonham's time as a session drummer ended with an invitation to join 'The New Yardbirds', led by Jimmy Page.\n\nTold with wit, pace and a genuine love for the subject, this is the electrifying story of a rock'n'roll legend which will paint a picture of the greatest of rock drummers. With touching tales of his focus on family and friends alongside the infamous rock and roll excess. Set to a rich soundtrack of music the programme also shows how Led Zeppelin changed the course of rock history.\n\nAs the programme closes the listener will be left with an enduring image of a man whose destiny would be forged by his ferocious drumming style and his insatiable appetite for living life to the full.\n\nchug70 07/06/10\n","torrent":{"xt":"urn:btih:cb0e1ee9130d5c127abd97d44380d17553a2f8dc","amp;dn":"The+John+Bonham+Story+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb0e1ee9130d5c127abd97d44380d17553a2f8dc","infoHashBuffer":{"type":"Buffer","data":[203,14,30,233,19,13,92,18,122,189,151,212,67,128,209,117,83,162,248,220]},"announce":[],"urlList":[]}}