{"title":"X Japan &amp; co (hide, Yoshiki) Choplair big video collection","uid":5134910,"size":25892442823,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cb97fd2a315ad9557c6ae31aa24be106452150de&amp;dn=X+Japan+%26+co+%28hide%2C+Yoshiki%29+Choplair+big+video+collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"choplair","files":222,"time":1256404397,"description":"In the early 2000 years, any serious Western fan of the famous Visual Kei band X Japan (+ hide and Yoshiki solo carreers) should connect to the WinMX p2p network to download music videos of these artists from the Japanese users.\n\nIt was long, sources were limited, quality not that of today (smaller Internet connection band-which, no great codec), but with patience I could manage to get some hundreds of files with various promotional videos, TV / concert lives, interviews, commercials and documentaries about X Japan.\n\nIf I'm correct, WinMX severs got down in 2002 so do not expect to find videos released after this date (actually there are some little exception).\nIt is mostly indie, X (with Taiji) and X Japan untill 1997 disband era videos. (Almost) no content about the 2007-to-present band reunion.\n\nThere are 222 files (.MPG for most part) exactly, totalizing 24 GigaBytes of X Japan &amp; co (hide, Yoshik) video data. Files are individually downloadable, check torrent detail for the full list (I indicated date and some other information in filename when possible).\nSome are well spread videos, some are harder to find.\n\nI'm not aware of anyone ever released such a big X Japan video compilation as a torrent, so please, if you grab some part of it, if you want it to remains online : SEED !!\n\nCheers,\nChoplair\n","torrent":{"xt":"urn:btih:cb97fd2a315ad9557c6ae31aa24be106452150de","amp;dn":"X+Japan+%26+co+%28hide%2C+Yoshiki%29+Choplair+big+video+collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb97fd2a315ad9557c6ae31aa24be106452150de","infoHashBuffer":{"type":"Buffer","data":[203,151,253,42,49,90,217,85,124,106,227,26,162,75,225,6,69,33,80,222]},"announce":[],"urlList":[]}}