{"title":"The Red Green Show - Season 7","uid":5176236,"size":3369020397,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cc2af7760bd2024fc400457360a5f2065f7bf8e4&amp;dn=The+Red+Green+Show+-+Season+7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"theanonymousentity","files":21,"time":1258992465,"description":"Season 7 of The Red Green Show, ripped from the 1997 season DVD set. Only the 1997 to 2001 seasons were released on DVD, so season 7 is where we start.\n\nThis includes the following episodes:\n\nRunning of the Bulls - The guys at Possum Lodge stage a wild race. \nSwiss It Up - Red and Harold sell the show to Switzerland. \nThe Implosion - A fundraiser for the Historical Society goes awry. \nAdopt-a-Highway - Possum Lodge adopts a challenging stretch of highway. \nThe Strange Ranger - Ranger Gord goes missing from his tower. \nBig Guy, Little Guy - Red joins a Big Brothers club just for the soapbox derby. \nThe Movie - Red and Harold make a feature film on Super 8 MOS. \nExpropriation - Red speculates in real estate after a new highway is announced. \nThe Stool Pigeons - Harold creates an informer's club to snitch on criminals. \nCelebrity - Werner Klemperer buys a cottage in the Possum Lake area. \nLet Me Count the Ways - The men fix up their cabins for their wives' visit to the lake. \nPardi Gras - Possum Lodge inherits 137 tubas and the guys decide to have a parade. \nThe Splinter Lodge - Some of the men rebel against Red's leadership. \nThe Good Old Hockey Game - The men argue for hockey and against curling. \nStep Outside - Red encourages Harold to stand up and fight for himself. \nThe Town Mall - Using the sewers, the men turn downtown into a mall. \nThe Winter Carnival - The men stage a carnival to entertain their wives.\n\nI've included a folder with a few snapshots as a preview of quality. \n\nEnjoy!","torrent":{"xt":"urn:btih:cc2af7760bd2024fc400457360a5f2065f7bf8e4","amp;dn":"The+Red+Green+Show+-+Season+7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc2af7760bd2024fc400457360a5f2065f7bf8e4","infoHashBuffer":{"type":"Buffer","data":[204,42,247,118,11,210,2,79,196,0,69,115,96,165,242,6,95,123,248,228]},"announce":[],"urlList":[]}}