{"title":"Get a Girlfriend (Teleseminar)-Mantesh","uid":6177215,"size":133088462,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cc6da340fe137acaab8284fba6d0b621b6a90419&amp;dn=Get+a+Girlfriend+%28Teleseminar%29-Mantesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MANTESH","files":6,"time":1297811971,"description":" &lt;a href=&quot;http://img716.imageshack.us/img716/9700/cjckw.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img716.imageshack.us/img716/9700/cjckw.jpg&lt;/a&gt;\n\n\n\n\n\n\n\nCaptain Jack - Get a Girlfriend (Teleseminar)\n\n\n Captain Jack \n2009 \nISBN: N/A \nAudiobook\nMp3+PDF\n48 KBPS\n126.92 MB\n\nDid you know there is something you should NEVER do within the first 30 minutes of meeting a girl if you have any desire at all to make her your girlfriend, fuck buddy or mLTR? (Or, at the very least, if you want to keep those options on the table.) Ninety-Five of all guys do this, even in &quot;The Community.&quot;\n\nI'm going to tell you a little more about that and the real reason girls like &quot;bad boys&quot; in this post. I'll also discuss what I consider one of true &quot;missing ingredients&quot; to success in getting good.\nBut, first, I want you to do something.\nGet out your cell phone and text this to the women you are Gaming:\n&quot;Hey sexy, we should hang out soon...\nI'm starting to forget what you look like.&quot;\nDo it now... I'll wait...\n\nYou may have already seen this on my blog. It got great responses from my readers (maybe you were one of them). A few of them went on to have dates, make out with girls, have sex with them and so forth. Do you know why it works so well? It's based on a marketing psychology principle called &quot;Loss Aversion.&quot;\n\nYou see, that text message tells her that she already has a certain favorable status in your mind. Further, it tells her in a very simple, non-needy and non-irritating way, &quot;You're about to lose something!&quot;\nBut, not only that, you've told her how to keep it! (...&quot;we should hang out soon...&quot;).\n\nLet's say her desire to go out with you before that little nifty text message was at 12%. The psych guys suppose that this little tactic will probably triple that, maybe even quadruple it.\nAll that PSYCHOLOGY in a little 15 word text message.\n\nI got the idea for this text while reading a psychology/marketing journal for a client. The authors said that a pile of studies have shown that a person is many times MORE LIKELY to take action to save something they already have than to get something they don't.\nYou know how it seems like girls like &quot;bad boys.&quot; Well, there are a FEW reasons why this is true but one of the more little known was recently revealed in a scene in a popular movie.\nA little four year old girl is on the playground having a great time. She is going on the slide, playing on the monkey bars and having a blast.\nWhile she's in line, Johnny, a snot-nosed punk kid (also 4 years old) pushes her down, calls her a name and steals her turn on the slide. Naturally, she runs crying to her mother, who says,\n&quot;Honey, Johnny is just being mean and calling you names...\nBecause He Likes You!&quot;\n\nSo, at a mere 4 years old, in a moment of extreme duress she gets it implanted by THE ULTIMATE AUTHORITY FIGURE in her little world that &quot;bad boys&quot; actually LIKE her! Now, there are two other reasons BUT this IS a major one and it, all by itself, is enough to do the trick.\nYou may recall a few weeks ago I posted a survey link on my blog about &quot;How to Get a Girlfriend.&quot;\n\nHere's why I did the survey: When I first posted the info about the Sexual Framing Teleseminar I had a few guys email me and ask about getting a girlfriend.\nNow, my own personal method for getting a girlfriend is real simple. I do my normal thing of going for a Same Night Lay. Then, I'll just continue to suck up more and more of her time and continue framing what we're doing (ever so subtly) as a relationship until it's pretty much an unspoken assumption that we're together.\nThat's how I got the 28 Year Old ER Nurse who ALSO owned over a million dollars of real estate and a sex drive bigger and longer than the Great Wall of China. I literally started pumping iron again, just so I could last through the hurricane onslaught of her sex drive! (P.S. She paid for everything the entire time we went out!)\nIt's how I got the &quot;girl next door&quot; (with DD boobies) in Law School at Baylor University.\n\nAnd, the Pediatric Nurse who a few people said looked like a Latin Angelina Jolie. (hmm... I'm noticing a &quot;Rich Latina Nurse&quot; trend here...)\nOne of the coolest things about having a constant stable of fuck buddies was I could satisfy my sexual urge with the physical type I wanted.\nFeeling like Really Big boobs? Call the Law School chick.\n\nElegant Brunnette who ALWAYS dressed impeccably and wore more jewelry than a rapper? Call the Real Estate Chick.\nA California blonde who could've easily starred in a Rock video?\n\nI could go on, but I think you get the point. (But, unless you are already a master at Same-Night-Lays, I don't recommend it's how YOU get a girlfriend.)\nHowever, I realize... You may not want to go through all the blood, sweat and tears to become a Top 5 PUA and spend years perfecting my system for getting girls to have sex with you the same night.\nBut, I had to make sure that the stuff you were having trouble with, the questions you had and your struggles were all something I could really, really help you with............\n\n\n\n[/color][/code][/b]","torrent":{"xt":"urn:btih:cc6da340fe137acaab8284fba6d0b621b6a90419","amp;dn":"Get+a+Girlfriend+%28Teleseminar%29-Mantesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc6da340fe137acaab8284fba6d0b621b6a90419","infoHashBuffer":{"type":"Buffer","data":[204,109,163,64,254,19,122,202,171,130,132,251,166,208,182,33,182,169,4,25]},"announce":[],"urlList":[]}}