{"title":"[2003] Vodka Lemon - Hiner Saleem","uid":5051701,"size":732941596,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ccbabe5cb3d7e2b39d6185a10fa26ebeb28acf61&amp;dn=%5B2003%5D+Vodka+Lemon+-+Hiner+Saleem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"just_nobody","files":-1,"time":1250197835,"description":"Actually, the audio is on Language: Armenian, Kurdish, Russian and French.\nThere are Hebrew, Czech, Turkish and Russian subs on OpenSubtitles, but since I couldn't check the sync, I didn't add this subs to the torrent. \n\nA poverty-stricken widower finds new love in a cemetery in this engaging dark comedy from Kurdish filmmaker Hiner Saleem. Hamo (Romen Avinian) is an elderly man living in a small Armenian community which has fallen on hard times since the collapse of the Soviet Union -- where the Soviets at least provided the villagers with free water and electricity, in their current &quot;free&quot; state the locals have to pay for such things, which is no easy task since work is very difficult to find. Hamo, who is attempting to support himself, his eldest son, and his granddaughter on a meager military pension, has put nearly all his faith in one of his sons, who has supposedly found work in Paris. While Hamo waits for word (and a check) from France, he makes frequent visits to the local cemetery, where he visits his late wife. One day, while paying his respects, he meets Nina (Lala Sarkissian), a widow who similarly comes by to chat with her late husband and works as a barmaid at one of the few taverns left in town. Hamo becomes quite fond of Nina, and she responds in kind, but between his loyalty to his deceased bride and her shyness, neither is naturally inclined to make the first move. Vodka Lemon was the winner of the San Marco Prize at the 2003 Venice Film Festival.\n\nFile Name .........................................: Vodka.Lemon.2003.DVDRip.XviD-PROMiSE.avi\nFile Size (in bytes) ............................: 732,903,424 bytes\nRuntime ............................................: 1:26:09\n\nVideo Codec ...................................: XviD 1.0.1\nFrame Size ......................................: 640x336 (AR: 1.905)\nFPS .................................................: 25.000\nVideo Bitrate ...................................: 994 kb/s\nBits per Pixel ...................................: 0.185 bpp\nB-VOP, N-VOP, QPel, GMC.............: [B-VOP], [], [], []\n\nAudio Codec ...................................: 0x0055 MPEG-1 Layer 3\nSample Rate ...................................: 48000 Hz\nAudio Bitrate ...................................: 127 kb/s [2 channel(s)] VBR\nNo. of audio streams .......................: 1\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'\t\t","torrent":{"xt":"urn:btih:ccbabe5cb3d7e2b39d6185a10fa26ebeb28acf61","amp;dn":"%5B2003%5D+Vodka+Lemon+-+Hiner+Saleem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccbabe5cb3d7e2b39d6185a10fa26ebeb28acf61","infoHashBuffer":{"type":"Buffer","data":[204,186,190,92,179,215,226,179,157,97,133,161,15,162,110,190,178,138,207,97]},"announce":[],"urlList":[]}}