{"title":"Pink Mountaintops - axis of evol","uid":5111095,"size":83195356,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ccd8d3c5e7ae1c1a09ec51afd3cb8873ee2f5e9e&amp;dn=Pink+Mountaintops+-+axis+of+evol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neon","files":-1,"time":1254741880,"description":"Pink Mountaintops is Stephen McBean (and also many of his friends when the full band is assembled to play live). McBean has been in numerous groups over the last two decades. As a thirteen-year old, he played in a band called Jerk Ward, playing hardcore influenced by the Neos, Discharge, Crucifix and whoever else was fast or the fastest. His other bands to date have been a straight out punk outfit, a crusty punk/metal band, and, most recently, a psych-tinged maximal rock group whose self-titled debut record, Black Mountain, captured a great amount of critical acclaim (and meteorically became Jagjaguwar's best-selling title.) With Axis of Evol, Pink Mountaintops' second full-length record, McBean has once again created something much greater than the sum of his influences. Axis of Evol begins with a forboding spiritual called &quot;Comas&quot;, the kind that McBean and only a very few other songwriters of this generation could pull off. It includes the tone-setting lyrical phrase &quot;I have been wrestling a dead angry deer, and she is still with me after all of these years'. The record then almost immediately ramps up into a thumping, buzzing, blissful haze, at various parts sounding like the Velvet Underground or Spacemen 3 or the Jesus and Mary Chain circa Psycho Candy. And at the end, the album then segues into a hypnotic, Smog-like meditation called &quot;How We Can Get Free&quot;. Throughout the record, McBean sings about love and war, the love of war, and the war of love -- on the body, on the mind and on the soul. Home-recorded and largely self-produced, Axis of Evol is a further testament to the vital prolificacy of Stephen McBean. His mind, body and soul have once again created something that can't be simply measured, coded or decoded. Experience it, then think about it in more than one way.  \n\n\n\nSONG LIST:\n\nComas\nCold Criminals\nNew Drug Queens\nSlaves\nPlastic Man, You're The Devil\nLord, Let Us Shine\nHow We Can Get Free \n\n\n320 kbs             Thank you for seeding :o)\n \n","torrent":{"xt":"urn:btih:ccd8d3c5e7ae1c1a09ec51afd3cb8873ee2f5e9e","amp;dn":"Pink+Mountaintops+-+axis+of+evol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccd8d3c5e7ae1c1a09ec51afd3cb8873ee2f5e9e","infoHashBuffer":{"type":"Buffer","data":[204,216,211,197,231,174,28,26,9,236,81,175,211,203,136,115,238,47,94,158]},"announce":[],"urlList":[]}}