{"title":"Akimbo: Kung-Fu Hero (2001) [DEViANCE]","uid":5598068,"size":472264084,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cd2da5b57139b57285454cf85e01708a1c1cec71&amp;dn=Akimbo%3A+Kung-Fu+Hero+%282001%29+%5BDEViANCE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Rajkrishna","files":-1,"time":1275128887,"description":"Please RATE, COMMENT and SEED\nBuy the game if you like it and support the developers/publishers\n\n******************************************************************************\n\nTEAM DEViANCE presents...\n\n------------------------------------------------------------------------------\n|                                                                            |\n|              Akimbo - Kung Fu Hero (c) Iridon Interactive                  |\n|                                                                            |\n------------------------------------------------------------------------------\n------------------------------------------------------------------------------\n|  Cracker:\tTeam DEViANCE       |   RAR Count:\t [32 x 15 MB]        |\n|  Date:\tApril 2001          |   Protection:\t N/A                 |\n------------------------------------------------------------------------------\n|Requirements: W9x, P2 300, 32MB RAM, 300 MB HD, 3dcard, DX8a, DXMedia       |\n------------------------------------------------------------------------------\n                     \t\t\t\t\t\t             \n    Game Notes:\n    ~~~~~~~~~~~\n\n    Akimbo chronicles the tale of the titular Kung-Fu hero of the same name,\n    who enjoys a life of peaceful contemplation until a note in a bottle\n    washes up on the shore of his beachfront home. The note summons him to\n    Turtle Island, where an evil dragon named Fang is wreaking havoc. It\n    seems that Fang has used dark magic to enslave the peaceful inhabitants\n    of the island, bending their wills to his own. The twenty shamans that\n    call Turtle Island home are the only ones unaffected by Fang's spell,\n    and have gone into hiding. Akimbo must journey through six different\n    sections of the island, collecting the pieces of another magical spell --\n    one that can defeat Fang and return peace to Turtle Island.\n\n    Though liberating the hypnotized populace of Turtle Island may seem a\n    daunting task, Akimbo is a master of Kung-Fu in addition to being \n    exceptionally agile. He has several fighting moves, ranging from a simple\n    punch or kick, to a roundhouse or a double back flip. Despite these \n    formidable offensive capabilities, Akimbo is rather fragile, only able\n    to withstand one hit from his foes. As with many of the great platform\n    heroes, he is better off avoiding enemies using his leaping talents. If\n    the worst should happen, however, Akimbo receives three lives per game,\n    represented by vials filled with red liquid. He also has limited stamina,\n    which is used up as he delivers his martial arts maneuvers. Akimbo can\n    stay in good shape by collecting various food items such as apples,\n    bananas, and cherries, that are found scattered throughout the levels\n    he'll progress through. \n\n    Our hero's impressive abilities can also be augmented with a variety\n    of powerups found on the island, hidden in chests or in plain view.\n    These include weapons, such as the katana sword, throwing stars, and\n    exploding vials; while other powerups grant Akimbo special powers such\n    as flight or the ability to somersault in mid-jump, adding height to his\n    leap. In addition to these items, Akimbo can collect gold doubloons, one\n    hundred of which will reward him with an extra life. Players will also\n    encounter friendly animals that will aid them in their travels by\n    helping to overcome obstacles. For example, in an early stage, Akimbo\n    will come across a pit of deadly spikes. In order to pass them, he must\n    awaken his turtle friend Bobby Bump, who will then carry him across.\n    The aid of these items and animal companions is invaluable as Akimbo\n    explores the vast landscape of the island. \n   \n\n    Features:\n    ~~~~~~~~~\n\n    - Over forty levels in total, plus several secret areas.\n\n    - Multiple powerups, such as katanas, shurikens, and bombs.\n\n    - Animal companions help Akimbo overcome obstacles.\n\n    - Loads of Kung-Fu moves: punches, sidekicks, back flips, round kicks,\n      low kicks, spin downs, and jumping round kick combos.\n\n    - Beautiful blend of 3D and 2D graphics.\n\n    - Collect coins and food items for special bonuses.\n\n    - Non-violent; suitable for all ages.\n    \n\n    More info on: http://akimbo.iridon.com\n\n------------------------------------------------------------------------------\n\n    Instructions:\n    ~~~~~~~~~~~~~\n\n    1. Unrar (WinRAR: click on first archive, then 'Extract to [x]')\n    2. Mount/burn image\n    3. Install, play &amp; enjoy\n\n------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:cd2da5b57139b57285454cf85e01708a1c1cec71","amp;dn":"Akimbo%3A+Kung-Fu+Hero+%282001%29+%5BDEViANCE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd2da5b57139b57285454cf85e01708a1c1cec71","infoHashBuffer":{"type":"Buffer","data":[205,45,165,181,113,57,181,114,133,69,76,248,94,1,112,138,28,28,236,113]},"announce":[],"urlList":[]}}