{"title":"The Gentile Times Reconsidered - Refuting Jehovahs Witnesses","uid":5168572,"size":7414001,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf7b1ffe396a16cd90f937e6f524b2d568c3d528&amp;dn=The+Gentile+Times+Reconsidered+-+Refuting+Jehovahs+Witnesses&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EdwardTeach","files":-1,"time":1258558410,"description":"The Jehovah's Witnesses assert that Jerusalem was destroyed by the Babylonians in 607 BC.  This date is critical to their selection of 1914 for the arrival of Christ in kingly power and 1918 as the year when Jesus entrusted the anointed members of the faithful and discreet slave class  to care for all his Kingdom interests here on earth. Without the 607 date, this whole chronological structure collapses together with the claim that Jehovah's Witnesses are God's sole representative on earth today.\n\nCarl Olof Jonsson crushes the 607 date completely by force of historical, unrefutable physical evidence and arrives at the one  true conclusion: The Watch Tower Society is in error about the 607 date and by claiming divine selection turns out to be guilty of false prophecy. \n\n2 Cor 11:13-15 &quot;God's messengers?&quot; They are counterfeits of the real thing, dishonest practitioners masquerading as the messengers of Christ. Nor do their tactics surprise me when I consider how Satan himself masquerades as an angel of light. It is only to be expected that his agents shall have the appearance of ministers of righteousness, but they will get what they deserve in the end.\n\n","torrent":{"xt":"urn:btih:cf7b1ffe396a16cd90f937e6f524b2d568c3d528","amp;dn":"The+Gentile+Times+Reconsidered+-+Refuting+Jehovahs+Witnesses","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf7b1ffe396a16cd90f937e6f524b2d568c3d528","infoHashBuffer":{"type":"Buffer","data":[207,123,31,254,57,106,22,205,144,249,55,230,245,36,178,213,104,195,213,40]},"announce":[],"urlList":[]}}