{"title":"Vince Seneri - Three Albums - Jazz Organ","uid":5081522,"size":357947359,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:cfb5b48a6b425f2c84f99f5f2ab2dc1d364a99db&amp;dn=Vince+Seneri+-+Three+Albums+-+Jazz+Organ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"L_Hammond","files":37,"time":1252346507,"description":"Vince Seneri - Three Albums - Jazz Organ\n\n\nVince Seneri is considered to be one of the best jazz organists around. He is one of these cats capable of playing advanced bass lines himself while at the same time soloing on top with great complexity and dexterity. All with a really great groove.\n\nRaised in Hackettstown, NJ, Vince Seneri began his musical career at the age of six. His father, Peter Settineri, was an accordionist, who played professionally with his own band, and introduced the instrument to Vince. Later, his father bought a Hammond M-3 organ, and introduced that instrument to him as well. He learned the accordion, then devoted himself to the Hammond organ and piano.\n\nDuring his teens, it was the great jazz organist Jimmy Smith who musically influenced Vince the most.\n\nVince Seneri has performed and recorded several albums, with some of the best musicians in the business today including: Randy Brecker, Dave Valentin, Houston Person, David 'Fathead' Newman, Paul Bollenback and Buddy Williams.\n\n\nList of included albums:\n\n2003 Urban Paradise\n2005 Street Talk\n2008 The Prince's Groove\n\n----------\n\nMP3 format. All songs are tagged by the book.\n\nIf you encounter errors during the file sharing, please, place this material as close to the root of the hard disk as possible and restart the file sharing (e.g. as close as possible to C: in Windows). This is in order to make the path (drive, directory and filename) as short as possible. Operating systems have limits regarding how long a path including the filename can be, and if this limit is exceeded there will be errors.\n\n----------\n","torrent":{"xt":"urn:btih:cfb5b48a6b425f2c84f99f5f2ab2dc1d364a99db","amp;dn":"Vince+Seneri+-+Three+Albums+-+Jazz+Organ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfb5b48a6b425f2c84f99f5f2ab2dc1d364a99db","infoHashBuffer":{"type":"Buffer","data":[207,181,180,138,107,66,95,44,132,249,159,95,42,178,220,29,54,74,153,219]},"announce":[],"urlList":[]}}