{"title":"Reba McEntire - I Keep On Loving You (2nafish)","uid":5602616,"size":97654788,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d0b9c5c793c11afd26943e56070b12488fef31d8&amp;dn=Reba+McEntire+-+I+Keep+On+Loving+You+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1275353703,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;I Keep On Loving You&quot; is the title of a song recorded by American country music singer Reba McEntire. Written by Ronnie Dunn and Terry McBride, it is the third single from McEntire's studio album Keep On Loving You. The song was released to radio in February 2010 as her eighty-fourth chart single.\n\n&quot;I Keep On Loving You&quot; was written by Ronnie Dunn of Brooks &amp; Dunn, along with his frequent co-writing partner, former McBride &amp; the Ride lead singer Terry McBride. In the song, the female narrator expresses patience with her partner after he has made mistakes, telling him that she &quot;keep[s] on loving&quot; him.\n\nMcEntire told The Boot that she identified with the song because of her long marriage to her manager, Narvel Blackstock, as well as Dunn's long marriage to his wife, Janine: &quot;We have been through rough times and tough times and arguments, but we made up over and over again.&quot; Reba also performed this song on the Faith Hill special: Home for the Holidays, for people giving their love to tell their adopted kids to show how much they mean to them.\n\nA video for the song was released to heavy rotation in mid March 2010, featuring a couple from the CBS Soap The Young &amp; The Restless, Michael &amp; Lauren Baldwin; played by Christian LeBlanc and Tracey E. Bregman, respectively.\n\nShe performed the song at the 2010 ACM Awards.\n\nKeep On Loving You is the twenty-ninth studio album by American country artist, Reba McEntire. The album was released August 18, 2009 on Starstruck/Valory and on Humphead Records in the UK, and was produced by Tony Brown, Mark Bright, and McEntire.\n\nKeep On Loving You is McEntire's first solo studio album in six years, since the release of 2003's Room to Breathe and her first for the Valory label (in conjunction with her company, Starstruck Entertainment). In 2008, she exited her label of twenty five years, MCA Nashville after the release of Reba: Duets (2007). The album contains &quot;Strange,&quot; which is the highest-debuting single of McEntire's career, as well as the hit single &quot;Consider Me Gone,&quot; McEntire's first Number One hit since &quot;Somebody&quot; in August 2004. The album's third single, the title track, was released in February 2010.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d0b9c5c793c11afd26943e56070b12488fef31d8","amp;dn":"Reba+McEntire+-+I+Keep+On+Loving+You+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0b9c5c793c11afd26943e56070b12488fef31d8","infoHashBuffer":{"type":"Buffer","data":[208,185,197,199,147,193,26,253,38,148,62,86,7,11,18,72,143,239,49,216]},"announce":[],"urlList":[]}}