{"title":"Distrito.9.(2009).DVDSCR.Xvid.Spanish.LanzamientosDivx.es","uid":5085574,"size":1465456640,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d15b98d1b32dd17ed6a6c33b5b51669f9ebd7fc5&amp;dn=Distrito.9.%282009%29.DVDSCR.Xvid.Spanish.LanzamientosDivx.es&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LDivx","files":1,"time":1252689214,"description":"TÃƒÂ­tulo: \nTÃƒÂ­tulo original: District 9\nPaÃƒÂ­s: USA \nEstreno en USA: 14/08/2009 \nEstreno en EspaÃƒÂ±a: 11/09/2009 \nProductora: TriStar Pictures (Sony) \nDirector: Neill Blomkamp \nGuiÃƒÂ³n: Neill Blomkamp, Terri Tatchell \nReparto: Sharlto Copley, Jason Cope, David James, Mandla Gaduka, William Allen Young, Vanessa Haywood, Kenneth Nkosi, Devlin Brown\n\n\nSinopsis:Hace mÃƒÂ¡s de veinte aÃƒÂ±os los alienÃƒÂ­genas contactaron por primera vez con la tierra. La raza humana esperÃƒÂ³ un ataque hostil o un gran avance en la tecnologÃƒÂ­a. No ocurriÃƒÂ³ ninguna de las dos cosas. Los alienÃƒÂ­genas eran refugiados, los ÃƒÂºltimos supervivientes de su planeta originario. Al tiempo que las naciones del mundo intentaban ponerse de acuerdo en lo que tenÃƒÂ­an que hacer con ellas, las criaturas fueron instaladas de forma temporal en el Distrito 9 de SudÃƒÂ¡frica. \n\nAhora, la paciencia en cuanto a la situaciÃƒÂ³n de los alienÃƒÂ­genas se ha agotado. El control sobre los extraterrestres ha sido delegado en la Multi-National United (MNU), una compaÃƒÂ±ÃƒÂ­a privada que lo que le interesa no es el bienestar de los alienÃƒÂ­genas sino las formidables ganancias que les podrÃƒÂ­a reportar, en el caso de que pudieran hacerlo funcionar, su impresionante armamento. Hasta el momento no lo han logrado; la activaciÃƒÂ³n de las armas requiere ADN alienÃƒÂ­gena. \n\nLa tensiÃƒÂ³n entre los aliens y los humanos llega a un punto crÃƒÂ­tico cuando un operario de campo, Wikus van der Merwe (Sharlto Copley), contrae un misterioso virus que empieza a transformar su ADN. Wikus de la noche a la maÃƒÂ±ana se convierte en el hombre mÃƒÂ¡s perseguido del mundo y, a la vez, el mÃƒÂ¡s valioso, porque es la clave para descubrir los secretos de la tecnologÃƒÂ­a alienÃƒÂ­gena. Marginado y sin amigos, solo le queda un lugar en el que poder ocultarse: el Distrito 9. ","torrent":{"xt":"urn:btih:d15b98d1b32dd17ed6a6c33b5b51669f9ebd7fc5","amp;dn":"Distrito.9.%282009%29.DVDSCR.Xvid.Spanish.LanzamientosDivx.es","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d15b98d1b32dd17ed6a6c33b5b51669f9ebd7fc5","infoHashBuffer":{"type":"Buffer","data":[209,91,152,209,179,45,209,126,214,166,195,59,91,81,102,159,158,189,127,197]},"announce":[],"urlList":[]}}