{"title":"The Unit - Seizoen 1 NL_Subbed - ZodiacNL","uid":5617500,"size":4757315655,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d18ee1ecb088336df437f4d8015f7461e9ebb865&amp;dn=The+Unit+-+Seizoen+1+NL_Subbed+-+ZodiacNL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Zodiac_NL","files":15,"time":1276121509,"description":"From Executive Producers David Mamet and Shawn Ryan, THE UNIT is an action drama that follows a covert team of Special Forces operatives as they risk their lives on undercover missions around the globe, while their families maintain the home front, protecting their husbands' secrets. Jonas Blane (Dennis Haysbert) leads the Unit on missions out in the field and is responsible for taking new recruit Bob Brown (Scott Foley) under his wing. The Unit includes Jonas, Colonel Tom Ryan (Robert Patrick), Mack Gerhardt (Max Martini), Charles Grey (Michael Irby), Hector Williams (Demore Barnes) and Bob Brown, all highly skilled, trustworthy, brave and dependable soldiers whose ability to rely on each other is what creates their brotherhood. Jonas' wife, Molly (Regina Taylor), is the base matriarch who comforts and counsels the other wives as they cope with the fear and uncertainty they experience when their husbands leave home. Molly and Tiffy Gerhardt (Abby Brammell), a wife hiding her own dark secrets, help Bob's pregnant wife, Kim (Audrey Marie Anderson), acclimate to the stress of her new secret life.\n\nSeed starts 6-9-2010 11:00 GMT+1","torrent":{"xt":"urn:btih:d18ee1ecb088336df437f4d8015f7461e9ebb865","amp;dn":"The+Unit+-+Seizoen+1+NL_Subbed+-+ZodiacNL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d18ee1ecb088336df437f4d8015f7461e9ebb865","infoHashBuffer":{"type":"Buffer","data":[209,142,225,236,176,136,51,109,244,55,244,216,1,95,116,97,233,235,184,101]},"announce":[],"urlList":[]}}