{"title":"THE OXFORD BOOK OF HEALTH FOODS.pdf","uid":5085791,"size":16013573,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d24dab5c948739faecb793e2f291aa624d0c1556&amp;dn=THE+OXFORD+BOOK+OF+HEALTH+FOODS.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1252701025,"description":"Review\n\n&quot;A thorough guide to more than 100 popular herbs, grains, fruits and dietary supplements. Beautifully illustrated, each entry includes a description of the plant and its origin; culinary and nutritional value; popular claims and folklore; evidence of the plant's usefulness for health; and drug interactions and other warnings.... From ginkgo to henna, to nettle, nuts, and popular ingredients in sports supplements, the book offers a good base for further research into foods and supplements that many of us ingest regularly but may not know much about.&quot;--Chicago Tribune\n&quot;A handy guide to more than a hundred types of food for which health claims have been made.&quot;--Catholic Library World\n\n\nProduct Description\nThe health food industry is a billion-dollar business in the United States today and is thriving worldwide. However, despite the widespread consumption of these foods, little information is available to validate their actual therapeutic and nutritional value.\nThe Oxford Book of Health Foods is a comprehensive, up-to-date, and scientifically based guide to a variety of foods associated with good health. From fruits, herbs, and grains to vitamins, minerals, and dietary supplements, this new resource offers not only the claims associated with each food, but also the scientific truths behind these claims. Written in elegant and accessible prose, the book begins with an account of modern concepts of human nutrition, followed by a series of over one hundred entries on individual health foods and dietary supplements. Each entry provides full information on the food's origins, a thorough description, the claims and myths associated with it, and the scientific evidence to support--or refute--these claims. Beautifully illustrated throughout with botanical drawings, electron micrograph scans, and photographs (all in full color), the text is further supplemented by a glossary explaining the more technical terms and a bibliography listing sources for further reading. A straightforward and authoritative reference, The Oxford Book of Health Foods is a must-have for all who are interested in general health and nutrition. \n &lt;a href=&quot;\nhttp://www.amazon.com/Oxford-Book-Health-Foods/dp/0192806807/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1252692836&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Oxford-Book-Health-Foods/dp/0192806807/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1252692836&amp;sr=8-1&lt;/a&gt;","torrent":{"xt":"urn:btih:d24dab5c948739faecb793e2f291aa624d0c1556","amp;dn":"THE+OXFORD+BOOK+OF+HEALTH+FOODS.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d24dab5c948739faecb793e2f291aa624d0c1556","infoHashBuffer":{"type":"Buffer","data":[210,77,171,92,148,135,57,250,236,183,147,226,242,145,170,98,77,12,21,86]},"announce":[],"urlList":[]}}