{"title":"3T featuring Michael Jackson - Why","uid":5009209,"size":152309764,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d28e38e7e966567ea35e0b7f8e9aeaf3f5b4a6d5&amp;dn=3T+featuring+Michael+Jackson+-+Why&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1247901868,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Why&quot; is a song by 3T. It was written by Babyface and it featured Michael Jackson. This single belongs to the album Brotherhood and it was released in 1996. The song was selected to be part of HIStory: Past, Present and Future - Book I, but it was taken out and Michael Jackson decided to give it away to his nephews. This song was well received in European and Asian charts.\n\nA music video was produced to promote the single.\n\n3T is an American R&amp;B music group featuring the three sons of Tito Jackson (from The Jackson 5) and Delores &quot;Dee Dee&quot; Jackson. The band members include, from eldest, Tariano Adaryll Jackson (also known as Taj), Taryll Adren Jackson and Tito Joe Jackson (also known as TJ).\n\n3T released their debut album in 1995, titled Brotherhood. Michael Jackson gave the group extensive creative freedom on their album and they wrote 8 of the 12 songs on it. Their album sold approximately three million copies worldwide. They achieved an international hit with their debut single, titled &quot;Anything&quot; and released several hit singles in Europe including &quot;24/7&quot;, &quot;Why&quot; (a duet with their uncle, Michael Jackson), &quot;I Need You&quot; (with a brief vocal appearance of Michael Jackson), &quot;Tease Me&quot; and &quot;Gotta Be You&quot;. In 1996, they were ranked second, behind the Spice Girls, as the biggest-selling group in Europe. 3T have also written and produced songs for soundtracks to films as The Jacksons: An American Dream, Free Willy and Free Willy 2, Men in Black, and Trippin'.\n\nThe group continued to perform in France, the Netherlands and Belgium after getting signed to a French label TF1/NRJ in 2003 and for the Netherlands they were signed to a Dutch label, Digidance, in 2004, for Dutch releases, appearances and performances. The album titled Identity was released on March 23, 2004. Two singles were released from that album: &quot;Stuck On You&quot; (a cover of the Lionel Richie song) (Released 2003 in France and Belgium, 2004 in The Netherlands) and &quot;Sex Appeal&quot; (Released 2004).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:d28e38e7e966567ea35e0b7f8e9aeaf3f5b4a6d5","amp;dn":"3T+featuring+Michael+Jackson+-+Why","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d28e38e7e966567ea35e0b7f8e9aeaf3f5b4a6d5","infoHashBuffer":{"type":"Buffer","data":[210,142,56,231,233,102,86,126,163,94,11,127,142,154,234,243,245,180,166,213]},"announce":[],"urlList":[]}}