{"title":"Little Feat - Late Night Truck Stop  [2001]  [Robbie60] [FLAC] [","uid":6189227,"size":609573513,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d2a3b8a5b4dfc9fe6715b279d2f03798c2dbf519&amp;dn=Little+Feat+-+Late+Night+Truck+Stop++%5B2001%5D++%5BRobbie60%5D+%5BFLAC%5D+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robbie6ty","files":-1,"time":1298224467,"description":"Little Feat\nLate Night Truck Stop Live At Ebbetsfield, Colorado 19th July 1973\n\n\n\n\nLabel: Burning Airlines\nReleased: 2001\nRecorded: 1973\nSource: Original CD \nSize Torrent: 581 MB\nFormat: FLAC\n\n\n\n\n\n\nWhile Little Feat continue, to this day, to gig and release records, for many fans the band officially ceased to exist on June 29th 1979 - the day that Lowell George, their lead singer, guitarist and songwriter, succumbed to heart failure in Arlington, Virginia. This must irk the band somewhat, but it has to be remembered that it was George who originated their southern-fried funk sound and, along with Ry Cooder, defined the sound of late 1960s slide guitar playing. To most, Lowell George, until his hard living caught up with him, was Little Feat. As the majority of West Coast bands moved from psychedelia into country-rock, George - an eclectic genius who had paid his dues as one of Zappa's Mothers Of Invention, pushed Little Feat towards a more surreal vibe. He had a love of all musical styles from country and folk to jazz and the avant garde and it was his &quot;cartoon consciousness&quot; which permeated their eminently danceable tunes and suffuses this sweaty live recording. \n\nLate Night Truck Stop captures the band at their peak in 1973, at Ebbetsfield, Colorado, when they reformed with an expanded six-piece line-up. This allowed a more soulful approach, owing much to the New Orleans funk of bands such as the Meters - indeed, one of the highlights here is the gorgeous &quot;On Your Way Down&quot; by Alan Toussaint. Lowell was known to prefer a smaller, intimate gig, actually producing the band's own bootlegs - such as their classic Electric Lycanthropy set - from such gigs and this album is from that mould. Rumbling percussion, courtesy of Richie Hayward and Sam Clayton, propels classic numbers such as &quot;Dixie Chicken&quot; and &quot;Fat Man In The Bathtub&quot; while the set is peppered with more laid back examples of Lowell's songcraft such as &quot;Willin'&quot; and &quot;Sailin' Shoes&quot;. This is the sound of a band that loved to play together. Their more complex arrangements never waver from the goal of letting the audience have a good time and, as the sleeve notes from Bob Harris reiterate, they had the &quot;God-given groove&quot;. Amen to that...\n\n\n\n\n\nPersonnel\n\nLowell George: Guitar, Vocals; \nPaul Barrere: Guitar, Vocals; \nKenny Gradney: Bass, Vocals; \nBill Payne: Keyboards, Vocals; \nSam Clayton: Percussion, Vocals; \nRichie Hayward: Drums, Vocals. \n\n\n\n\n\nTrack Listing\n\n\nDisc One\n\n01. Apolitical Blues  \n02. Two Trains  \n03. Got No Shadow (Part 1)  \n04. The Fan  \n05. Texas Rose Cafe  \n06. Snakes On Everything  \n07. Cat Fever  \n08. Fan Man In Bathtub  \n09. Walkin' All Night  \n10. Sailin' Shoes \n\n\nDisc Two\n\n01. Dixie Chicken  \n02. Hamburger Midnight  \n03. Got No Shadow (Part 2)  \n04. On Your Way Down  \n05. Willin'  \n06. Cold, Cold, Cold  \n","torrent":{"xt":"urn:btih:d2a3b8a5b4dfc9fe6715b279d2f03798c2dbf519","amp;dn":"Little+Feat+-+Late+Night+Truck+Stop++%5B2001%5D++%5BRobbie60%5D+%5BFLAC%5D+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2a3b8a5b4dfc9fe6715b279d2f03798c2dbf519","infoHashBuffer":{"type":"Buffer","data":[210,163,184,165,180,223,201,254,103,21,178,121,210,240,55,152,194,219,245,25]},"announce":[],"urlList":[]}}