{"title":"X-Files Season 6","uid":6170305,"size":3022475264,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d30e8a7b4c23cd88e2ab4f621303755a7bbad07f&amp;dn=X-Files+Season+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"IRISHMANb","files":22,"time":1297544037,"description":"Following the X-Files feature film in the summer of 1998, &quot;The Beginning&quot; quickly crowbars an attempt at fitting the film into the TV chronology before it picks up plot points left dangling from the fifth-season finale, &quot;The End&quot; (note the guard asleep at the nuclear power plant console is named Homer!). Between arc threads are several pleasing excursions: time travel to a Bermuda Triangle boatload of Nazis (&quot;Triangle&quot;), further temporal escapades akin to Groundhog Day (&quot;Monday&quot;), a demonic baby case featuring genre stalwart Bruce Campbell (&quot;Terms of Endearment&quot;), and Duchovny being able to play someone else via personality switching (&quot;The Dreamland, Parts 1 and 2&quot;). Back in the real scheme of things, Mulder chases &quot;S.R. 819,&quot; a Senate resolution tying conspiracies together. &quot;Two Fathers&quot; and &quot;One Son&quot; indicate that the abductee experiments are intended to cure the black oil disease. The year finishes with &quot;BioGenesis,&quot; in which we're asked to ponder, are we from Mars? A beach-buried UFO leaves Scully wondering. --Paul Tonks\n[color=#FF0000]Synopsis[/color]\nDana Scully (Gillian Anderson) and Fox Mulder (David Duchovny) continue to investigate that which cannot be explained in this collection of series six of the series. Every episode from the 1998-1999 campaign is included, as a millennial frenzy builds and cover-ups abound. Episodes included in this collection are &quot;Triangle,&quot; &quot;Dreamland,&quot; &quot;Arcadia,&quot; &quot;The Rain King,&quot; &quot;Agua Mala,&quot; &quot;The Unnatural,&quot; &quot;Milagro,&quot; &quot;One Son,&quot; and &quot;Two Fathers.&quot; \n\n[color=#00FF00]A Good Season of One of the Greatest TV Series', 2 Feb 2003\nBy A Customer[/color]\n[i]This review is from: The X Files: Season 6 [DVD] [1994] (DVD)\nThe X-Files' Sixth Season marked a turning point for the show in that it was the first to have moved away from Vancouver to be entirely produced in Los Angeles, and it does show in the overall feel and look. Although many fans would describe Season Six as their favourite, my view is that Seasons Three and Five represented the highest points that the series ever achieved creatively.\n\nStill, there is plenty of merit to this set of 22 episodes that kicks off with the aptly titled &quot;The Beginning&quot; that picks up some of the threads from the 1998 theatrical movie &quot;Fight the Future&quot; while focussing more broadly on the story of last season's finale that the film bridges. Mimi Rogers returns in her role as Agent Diana Fowley (appearing in a total of four episodes), as does the thorn in Mulder's side turned ally - his half brother Agent Jeffrey Spender. This leads to the biggest change in direction of all as Mulder and Scully are denied reassignment to the X-Files unit and must instead report to Assistant Director Alvin Kersh (who features more prominently in Seasons Eight and Nine right up to the series finale).\n\nThis half-season long diversion doesn't affect the focus of the stories too much however, as we are dealt a whole load of comedy episodes. This leaves the second half of the season stocked with monster-of-the-week shows, all of which are fine (except maybe the dull &quot;Alpha&quot;) but you can't help but think a little spacing out and mixing would have improved the finished article no end. As it is the balance is not quite right.\n\nIn one of the classics, &quot;Triangle&quot;, Mulder gets caught up in the Bermuda Triangle and even more laughs come when he swaps bodies with your average man-in-black in the two-part tale &quot;Dreamland&quot;. If that wasn't enough, the FBI duo get caught up in a haunted house on Christmas Eve in &quot;How the Ghosts Stole Christmas&quot; with comedy and satire a plenty.\n\nThis takes us into the quintessential mythology double &quot;Two Fathers&quot; and &quot;One Son&quot;, one of the high points of the entire series. While it spells the unfortunate end for the old conspiracy arc, if it had to go then this was the way to do it. Further highlights include the beginning of an under-used Krycek/Skinner arc in &quot;S.R. 819&quot;, the old time-loop plot of &quot;Monday&quot;, the Lone Gunmen show &quot;Three of a Kind&quot;, and &quot;The Unnatural&quot; written and directed by David Duchovny. All of these culminate in the season cliffhanger &quot;Biogenesis&quot; that leaves Scully standing over a buried spacecraft on the shores of the Ivory Coast.\n\nOverall, Season Six is a good one yet not the very best. The indivudual stories are great for the most part, but the character development and ongoing themes are somewhat lacking. The attractive DVD box set includes every episode across 6 discs in anamorphic wide screen format, with plenty of special features including a brand new summary documentary, a character profile on the Cigarette-Smoking Man (taken directly from the &quot;One Son&quot; feature video), episode commentaries on &quot;Triangle&quot; by Chris Carter and &quot;Milagro&quot; by director Kim Manners, and plenty more of the usual format - TV spots, interview clips, a whole host of deleted scenes, et cetera.\n\nA must buy for any fan of The X-Files, and enough stand-alones that make excellent viewing for others too.[/i] \n","torrent":{"xt":"urn:btih:d30e8a7b4c23cd88e2ab4f621303755a7bbad07f","amp;dn":"X-Files+Season+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d30e8a7b4c23cd88e2ab4f621303755a7bbad07f","infoHashBuffer":{"type":"Buffer","data":[211,14,138,123,76,35,205,136,226,171,79,98,19,3,117,90,123,186,208,127]},"announce":[],"urlList":[]}}