{"title":"Craig Taborn - Light Made Lighter (2001)","uid":6203955,"size":223143189,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d456303526d62d825e136cff4dd6e22a076c9819&amp;dn=Craig+Taborn+-+Light+Made+Lighter+%282001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mariorg","files":-1,"time":1298680360,"description":"Thirsty Ear Recordings 57111 &lt;a href=&quot;\nhttp://www.thirstyear.com/album_detail.php?artist=Craig%20Taborn&amp;album=Light%20Made%20Lighter&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thirstyear.com/album_detail.php?artist=Craig%20Taborn&amp;album=Light%20Made%20Lighter&lt;/a&gt;\n\n* Craig Taborn: piano\n* Chris Lightcap: bass\n* Gerald Cleaver: drums\n\nOne of the best jazz CDs of 2001. Amazon.com: &lt;a href=&quot;\nhttp://www.amazon.com/dp/B00005QK7I&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/dp/B00005QK7I&lt;/a&gt;\n\nReview\n~~~~~~ &lt;a href=&quot;\nhttp://www.allmusic.com/album/r555357&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/r555357&lt;/a&gt;\nby Thom Jurek\n\nThe second album by Michigan jazz pianist Craig Taborn -- known to most jazz\nfans as a sideman to James Carter -- is a giant leap past the adept musicianship\nshown on his DIW debut. Taborn's trio, with drummer extraordinaire Gerald\nCleaver and new bassist Chris Lightcap, plays a kind of jazz that's new in a\nsense, even though it is rooted in time-honored traditions. In Taborn's pianism,\nAndrew Hill and Randy Weston meet Duke Pearson, Horace Silver, and Hilton\nRuiz. There is an elegance of concentration and presentation that exceeds\nrhythmic and stylistic rigidities. The opener, &quot;Bodies We Came Out Of&quot; (which\nopens and closes the album, making the entire presentation a kind of suite),\nechoes the opening bars of &quot;Don't Stop the Carnival&quot; before it moves through\nLatin phrasings and textures into a modal openness that shifts toward a funkier,\ndirtier kind of blues. In a blazing time signature, Taborn layers sevenths and\nninths over augmented minor chords and plays as rhythmically as\nCleaver. Lightcap, for his part, doesn't just keep it on track; he insures the\nentire thing sings by moving the track toward Cleaver, who juices the rhythm and\ndouble-times Taborn. But in his solo, Taborn leaves the melody and undoes the\nharmony, filling it with legato phrasing and sharp angular arpeggios that equate\nhim playing counterpoint to himself. Taborn's read of &quot;I Cover the Waterfront&quot;\nis clearly influenced by the man who signed him, Matthew Shipp. Taborn\ndeconstructs the harmony while leaving the melody intact, coursing over it with\na series of bop arpeggios and moving the entire tune into overdrive before\nreturning it altered, and simmering from so much trio heat. There is plenty of\nballadry left in Taborn's playing, as evidenced in &quot;Morning Creatures&quot; and the\ntitle track, and his blues are blacker than ever as evidenced by the intensely\nrhythmic &quot;Whiskey Warm,&quot; which pits all three members of the ensemble take turns\nshifting the meter against the key changes and dive deep into the funk. This is\none of the best records in Thirsty Ear's &quot;Blue&quot; series thus far, and, more\nimportantly, it reveals to American audiences what a monster Taborn really is as\na pianist.","torrent":{"xt":"urn:btih:d456303526d62d825e136cff4dd6e22a076c9819","amp;dn":"Craig+Taborn+-+Light+Made+Lighter+%282001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d456303526d62d825e136cff4dd6e22a076c9819","infoHashBuffer":{"type":"Buffer","data":[212,86,48,53,38,214,45,130,94,19,108,255,77,214,226,42,7,108,152,25]},"announce":[],"urlList":[]}}