{"title":"Lucinda Williams - Blessed  D.E. (2011) mp3 320 vtwin88cube","uid":6258694,"size":259803289,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d4d2b15227f1868064334631006922278d9d808e&amp;dn=Lucinda+Williams+-+Blessed++D.E.+%282011%29+mp3+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1300675559,"description":"Lucinda Williams\nBlessed Deluxe Edition (2011)\n\n\nThe object of cultish adoration for years, singer/songwriter Lucinda Williams was universally hailed as a major talent by both critics and fellow musicians, but it took quite some time for her to parlay that respect into a measure of attention from the general public. Part of the reason was her legendary perfectionism: Williams released records only infrequently, often taking years to hone both the material and the recordings thereof. Plus, her early catalog was issued on smaller labels that agreed to her insistence on creative control but didn't have the resources or staying power to fully promote her music. Yet her meticulous attention to detail and staunch adherence to her own vision were exactly what helped build her reputation. When Williams was at her best (and she often was), even her simplest songs were rich in literary detail, from her poetic imagery to her flawed, conflicted characters. Her singing voice, whose limitations she readily acknowledged, nonetheless developed into an evocative instrument that seemed entirely appropriate to her material. So if some critics described Williams as &quot;the female Bob Dylan,&quot; they may have been oversimplifying things (Townes Van Zandt might be more apt), but the parallels were certainly too strong to ignore. \n\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nAudio Quality:\t\tVery High (Lossy)\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tPop/Rock\nLabel:\t\t\tLost Highway\n\n\nBlessed, the stunning new album from three-time Grammy Award-winner Lucinda Williams is set for release on March 1st 2011 by Lost Highway. Considered by many to be one of America's greatest living songwriters, Williams lives up to that and more by delivering 12 new songs that cover an even wider emotional spectrum than her previous work, without moving too far in any one direction. Blessed opens with the gritty kiss-off &quot;Buttercup&quot; then moves seamlessly into the sultry blues of &quot;Born To Be Loved&quot;. Williams delves into a heavier subject as she questions the motives for a suicide on the hard-driving &quot;Seeing Black&quot;, which features blistering guitar from Elvis Costello. The thoughtful title track slowly builds to a melodic climax as it offers an eye-opening look at what's right in front of us, but too often unnoticed. The poignant and powerful &quot;Soldier's Song&quot; simultaneously tells a tragic story of the soldier overseas and his wife and child back home. On the gorgeous &quot;Kiss Like Your Kiss&quot;, Williams lays down one of the most beautiful and fragile vocals she has ever recorded. The original version of &quot;Kiss Like Your Kiss&quot; appeared on the True Blood: Music From The HBO Original Series - Volume 2 and was just nominated for a Grammy Award for Best Song written for motion picture, television or other visual media. It's nothing new to see Williams tug at the heartstrings and stimulate the mind with her songs, but there is a vibe throughout Blessed that is unique to this album in-particular. It's the sound of the wisdom and experience Williams has gained through her years as an uncompromising talent. Combine that with Grammy Award-winning producer Don Was at the helm, and something special is born. Was co-produced Blessed with Eric Liljestrand and Tom Overby, who co-produced Williams highly-praised Little Honey (2008). Blessed features special guests Rami Jaffe on keyboards, Matthew Sweet on vocals Greg Leisz and Elvis Costello on guitar.\n\n\n\nTrack List:\n\n\nDisc One\n\n01.Buttercup\n02.I Don't Know How You're Livin'\n03.Copenhagen\n04.Born To Be Loved\n05.Seeing Black\n06.Soldier's Song\n07.Blessed\n08.Sweet Love\n09.Ugly Truth\n10.Convince Me\n11.Awakening\n12.Kiss Like Your Kiss\n\n\nThe Deluxe Edition comes with a bonus disc called 'The Kitchen Tapes'. These are the demos Lucinda recorded of the songs that became Blessed right as they were born at her kitchen table, where she does most of her writing. To further enhance Lucinda's vision, The Deluxe Edition is available with 8 different album cover images randomly distributed through the manufacturing process. The one cover you get may not be the one you see here, but we're sure you'll agree it's an equally powerful image and another facet of this incredible album. \n\n\nDisc Two - The Kitchen Tapes\n\n01.Buttercup\n02.I Don't Know How You're Livin'\n03.Copenhagen\n04.Born To Be Loved\n05.Seeing Black\n06.Soldier's Song\n07.Blessed\n08.Sweet Love\n09.Ugly Truth\n10.Convince Me\n11.Awakening\n12.Kiss Like Your Kiss\n\n\n\n\n           \n\n              ****Support the artists &amp; buy it if you like it. ****\n\n\n                    ****Please don't forget to seed!****\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:d4d2b15227f1868064334631006922278d9d808e","amp;dn":"Lucinda+Williams+-+Blessed++D.E.+%282011%29+mp3+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4d2b15227f1868064334631006922278d9d808e","infoHashBuffer":{"type":"Buffer","data":[212,210,177,82,39,241,134,128,100,51,70,49,0,105,34,39,141,157,128,142]},"announce":[],"urlList":[]}}