{"title":"Apeiron X v1.0.3 UB Cracked","uid":5515124,"size":7540059,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:d66dec48a0ac21cfe31cadd651f778740be15169&amp;dn=Apeiron+X+v1.0.3+UB+Cracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"73sad73","files":1,"time":1272223746,"description":"Released by The One Byte Wonder \n\nApeiron X is Ambrosia's highly acclaimed classic, &quot;Apeiron&quot;, given a new lease of life. With updated 16 bit graphics, OS X compatability, and the same fast paced, frantic gameplay. Also, you can now see how you rank against the best, with the built Internet High Scores! Got what it takes?\n\nDuring a port through the looking glass, the mirror shatters and your ethereal energy (you know, the stuff that allows you to get up and go to work on a Monday morning...) is trapped within one of the crystal shards. Immediately, the residents of the mushroom patch sense your presence. Lead by the Pentipede, this motley crew of mushroom patch misfits relentlessly hunt the crystal ( You! ), intent upon sucking out the trapped energy. The Pentipede is a sinister creature that has the ability to divide. So, if you think your troubles are over when you shoot this sneakered psycho once, you are twice as wrong. The Pentipede is joined by a ruthless assortment of animated killers, and your situation is further complicated by a few unpleasant &quot;environmental&quot; hazards. Luckily you are not defenseless; with plasma cannon blazing, you must hold out as long as possible. Shooting certain mushrooms can be very beneficial to your mission. Several power up coins are scattered throughout the garden. Find one of these and you can teach the Pentipede and his pals the meaning of &quot;full auto.&quot;\n\nSystem Requirements: Mac OS 10.3.9 and up\n\nLink for more information:","torrent":{"xt":"urn:btih:d66dec48a0ac21cfe31cadd651f778740be15169","amp;dn":"Apeiron+X+v1.0.3+UB+Cracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d66dec48a0ac21cfe31cadd651f778740be15169","infoHashBuffer":{"type":"Buffer","data":[214,109,236,72,160,172,33,207,227,28,173,214,81,247,120,116,11,225,81,105]},"announce":[],"urlList":[]}}