{"title":"We-Travel + Mappacks Offline Navi for BlackBerry/Java-Phones","uid":5613261,"size":1519597279,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:d95b9d17eb60bbdb065f04019f2fe6cdb43f7096&amp;dn=We-Travel+%2B+Mappacks+Offline+Navi+for+BlackBerry%2FJava-Phones&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mr44er","files":63,"time":1275967230,"description":"Welcome to We-Travel !\nFree navigation, 3D maps, voice guidance and tourist information always available on your java enabled mobile phone, without network connection\n\nWe-Travel is a personal initiative to develop a free navigation solution for Java enabled mobile phones. To complete this initiative, we need your help.\n\nIf you are looking for a bullet proof navigation system, please take a look here.\n\n \nThe key features of We-travel are :\nTurn-by-Turn Voice Guided Navigation :\nBased on your location, We-Travel gives you clear voice directions to reach your destination in an optimal way, either by car, bike or foot, supported by a 3D 'bird's eye' rotating map display.\n\nAlways Available  :\nAll map data is stored locally on your phone. This ensures  We-Travel works offline in places where there is no mobile phone reception, abroad or in the countryside. And as a plus, there are no telecom costs associated with route calculation or map display ! (except for online services, like weather information,...)\n\nFree :\nWe-Travel is a free navigation software for java enabled mobile phones, based on map data from Open Street Map. No good map navigation maps available for your area ? Help Open Street Map ! Our map download server provides up to date maps for most of the world. Note that due to bandwidth restrictions, the number of free download slots is restricted. Our paying map download services should allow you to donwload maps at any time for a small amount.\n\nNew Features :\nCurrent We-Travel versions also offer :\n\n    * Track recording\n    * Fully customizable map, skin, menu and theme layouts\n    * Possibility to visualise raster maps from various sources\n    * Track graphs showing track overview, speed and altitude profiles\n    * Possiblity to download rich POI descriptions from Wikipedia, Wikitravel, ...\n    * Online/offline reporting of speed camera's or your favorite places\n    * Enhanced reality POI superimposition on camera image (on selected phones)\n    * Satellite view, along with the sun, the moon and major star constellations\n    * Possibiliy to develop additional screens as plugins\n    * Possibility to follow a pre recorded track\n    * Support for Garmin and TomTom POI formats\n    * Uploading and sharing of track on the We-Travel website\n\n\n\n==========================\n\nnote: \t\ni asked the guys to help them out with a working torrent, but i have no answer yet.\nbut i think/hope it's ok.\n\nthis is the (nearly) complete pack with all maps and stuff, which i could download, because their server breaks most of the time.\n\nshould work with:\n\n9500 storm\n9520 storm 2\n8900 curve\n8310\n9000 bold\n9700 bold 2\n\n\n\n\nw995\nSE-G705\nSE K880\nLG KC910 Renoir\nsony ericsson c702\n\n\ninstalling:\n\ntested on blackberry 9700 (bold 2)\nfirmware: Blackberry9700AllLang_PBr5.0.0_rel1111_PL5.1.0.153_A5.0.0.656\n\n1.) extract the wetravel directory from to_sdcard.7z to the root of your sdcard\n    the tree should look like this:\n    sdcard/wetravel/Atlases\n\t\t   /Config\n\t\t   /CurrentTraces\n\tetc.\n\n2.) choose your desired map pack(s) and unpack the dir in the .7z to sdcard/wetravel/Maps/\n    the tree should look like this:\n    sdcard/wetravel/Maps/China\n    sdcard/wetravel/Maps/India\n    sdcard/wetravel/Maps/Germany_OSM_241209\n\t\n\tetc.\n\n3.) unpack main_app.7z to a tempdir on your pc, maybe c:/navi\n    \n\t(here i assume, you have installed the newest BlackBerry Desktop Manager 5.0.1)\n\n\tconnect your bb-device\n\n\tinstall the BBLight manually with the Desktop Manager, reboot your device if needed (this app is to \t\tkeep on the backlight, which still isn't working properly in WE Travel)\n\t\n\tinstall BBSAKv1.5_Installer.msi and run it\n\n\tenter your bb-password, otherwise leave blank\n\n\tclick on Install COD, choose the WeTravelMidletSuite.cod (here it's going buggy again, i reconnected the \tdevice once, with the second try it worked.)\n\n\tif you see 3 items in the download folder on your device (hw, RecorderMidlet and WeTravelMain), your done \t\twith the hard work.\n\n4.) \trun WeTravelMain\n\n\tif it asks to search for root, say no\n\t\n\tgo to menu-&gt;settings-&gt;advanced-&gt;files\n\n\tgo INTO! sdcard/wetravel/ and choose 'set we-travel root'\n\n\trestart WeTravelMain\n\n\tgo to menu-&gt;settings-&gt;advanced-&gt;screen details\n\n\tchoose your language, skin, menu and theme\n\n\ti suggest you try skin:commuter, menu:menucarbon26, theme:blue for best results on the 9700\n\n\tit's important, that you press bb-key and then choose ok to save the config you made\n\n\trestart WeTravelMain\n\n\tgo to menu-&gt;settings-&gt;advanced-&gt;map config\n\n\tchoose your map, bb-key, ok\n\n\trestart WeTravelMain\n\n\tgo to menu-&gt;settings-&gt;gps\n\n\tchoose internal gps (jsr-179), bb-key, ok\n\n\tgo to menu-&gt;settings-&gt;screen-&gt;sound\n\n\tchoose your favourite voice (BUT never use mp3-voice, it will crash the whole bb. i included this to have a \tcomplete package for other mobile phones, where it should work)\n\n5.) \tconfigure bblights to your needs and have fun navigating :)\n\tif you want to add maps, simply extract the map like in part 2 and choose it in WeTravel\n\n\n=================================\n\nfor other phones:\n\n\nsame procedure as in part 1 and 2 then use the jad and jar files. nokias will install them automatically, when run in the phone explorer.\n\ni didn't try this, so i can't tell if the configuration works the same on other mobile phones.","torrent":{"xt":"urn:btih:d95b9d17eb60bbdb065f04019f2fe6cdb43f7096","amp;dn":"We-Travel+%2B+Mappacks+Offline+Navi+for+BlackBerry%2FJava-Phones","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d95b9d17eb60bbdb065f04019f2fe6cdb43f7096","infoHashBuffer":{"type":"Buffer","data":[217,91,157,23,235,96,187,219,6,95,4,1,159,47,230,205,180,63,112,150]},"announce":[],"urlList":[]}}