{"title":"'Bigger Than Jesus' - Beatles Documentary  (BBC Radio)","uid":5101373,"size":54212816,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d95dd482dd66c928f77f20ea6bd370304531f48d&amp;dn=%5C%27Bigger+Than+Jesus%5C%27+-+Beatles+Documentary++%28BBC+Radio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eddie1969","files":-1,"time":1254003914,"description":"Bigger than Jesus - Audio Documentry - BBC Radio 2 via DVB-T\n\n1 x 60 minutes episode - 128k - MP3\n\n\n\n\nOn 4 March 1966 the Evening Standard published an interview between Maureen Cleave and John Lennon entitled How Does A Beatle Live? In the course of a description of the Beatle's everyday life in Weybridge, Cleave quoted Lennon as saying: &quot;Christianity will go. It will vanish and shrink. I needn't argue about that. I'm right and I will be proved right. We're more popular than Jesus now. I don't know which will go first - rock 'n' roll or Christianity.&quot;\n\nThe interview caused little controversy on publication in England, where it was regarded as just another example of the waning relevance of the church for the younger generation. But when it was reprinted in an American magazine four months later, on the eve of a Beatles tour of the States, it caused outrage and the Beatles' American tour of 1966 took place against a background of death threats and fear.\n\nAlthough Lennon expressed regret for any offence caused by his remarks at an uneasy press conference in Chicago, he wouldn't withdraw them. The traditionally asinine encounter between press and pop star had been replaced by a crackling confrontation and Lennon was now cast in the role of spokesman for a generation. A new type of journalism would soon emerge that reflected this change: When Rolling Stone first appeared the following year, its cover star was John Lennon.\n\nPaul McGann tells the story of this extraordinary event and its aftermath. It's a story of fame, the mass media, pop music and religion, of two cultures clashing. Illustrated with contemporary sound archive, listeners will hear from those who were in the Beatles' inner circle at the time and from those who protested against them.\n\nContributors include Maureen Cleave who conducted the original interview with Lennon; the Alabama DJs who burned Beatle records in protest; Cynthia Lennon, who helped Lennon sort the sacks of mail that arrived at their Weybridge home; press officers Tony Bramwell and Tony Barrow; Barry Tashian, whose group The Remains were the support act on the Beatles' stormy tour of North America; Lennon biographer Ray Connolly; and legendary rock 'n' roll PR (and former Lennon publicist) BP Fallon.\n\nFirst broadcast in December 2005, five days before 25th anniversary of John Lennon's death.\n\n\n\n\nAudio Format    : MP3\nDuration Approx : 58mn 54s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n","torrent":{"xt":"urn:btih:d95dd482dd66c928f77f20ea6bd370304531f48d","amp;dn":"%5C%27Bigger+Than+Jesus%5C%27+-+Beatles+Documentary++%28BBC+Radio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d95dd482dd66c928f77f20ea6bd370304531f48d","infoHashBuffer":{"type":"Buffer","data":[217,93,212,130,221,102,201,40,247,127,32,234,107,211,112,48,69,49,244,141]},"announce":[],"urlList":[]}}