{"title":"Constantine DVDRip Spanish 2005","uid":5095455,"size":734043302,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:da2c62b8577205fd534613a2818c1eb9b16e97cc&amp;dn=Constantine+DVDRip+Spanish+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":2,"time":1253528339,"description":"John Constantine (Keanu Reeves) ha estado en el infierno y ha vuelto. Nacido con un don que no deseaba, la capacidad de reconocer claramente a los ÃƒÂ¡ngeles y a los demonios hÃƒÂ­-bridos que andan por la tierra bajo un aspecto humano, Constantine se vio empujado a quitarse su propia vida pa-ra escapar de la atormentadora claridad de su visiÃƒÂ³n. Pero fracasÃƒÂ³. Resucitado en contra de su voluntad, se encontrÃƒÂ³ de nuevo en el mundo de los vivos. Ahora, marcado por su intento de suicidio con una esperanza de vida temporal, patrulla la frontera terrenal entre el cielo y el infierno, esperando en vano ganarse el camino a la salva-ciÃƒÂ³n enviando a los esbirros del diablo de vuelta a las profundida-des. Pero Constantine no es ningÃƒÂºn santo. Desilusionado por el mundo que le rodea y enfrentado con el del mÃƒÂ¡s allÃƒÂ¡, es un hÃƒÂ©roe amargado que bebe en exceso, lleva una vida dura y desprecia la sola idea de heroÃƒÂ­smo. Constantine lucharÃƒÂ¡ para salvar tu alma pe-ro no quiere tu admiraciÃƒÂ³n ni tu agradecimiento, y por supuesto no quiere tu simpatÃƒÂ­a. Todo lo que quiere es un aplazamiento. Cuando una desesperada pero escÃƒÂ©ptica detective de policÃƒÂ­a, Angela Dod-son (Rachel Weisz), consigue su ayuda para resolver la misteriosa muerte de su querida hermana gemela (tambiÃƒÂ©n interpretada por Weisz), su investigaciÃƒÂ³n les lleva a travÃƒÂ©s del mundo de demonios y ÃƒÂ¡ngeles que subyace justo bajo el paisaje de la actual ciudad de Los Angeles. Atrapados en una catastrÃƒÂ³fica serie de acontecimien-tos sobrenaturales, los dos se encuentran inextricablemente involu-crados y tratan de encontrar su propia paz a cualquier precio. ","torrent":{"xt":"urn:btih:da2c62b8577205fd534613a2818c1eb9b16e97cc","amp;dn":"Constantine+DVDRip+Spanish+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da2c62b8577205fd534613a2818c1eb9b16e97cc","infoHashBuffer":{"type":"Buffer","data":[218,44,98,184,87,114,5,253,83,70,19,162,129,140,30,185,177,110,151,204]},"announce":[],"urlList":[]}}