{"title":"Cidade_Dos_Homens_2_Temporada","uid":5045864,"size":4649947247,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:da92cdf5db53dc98434975e3548ad0799ca1e727&amp;dn=Cidade_Dos_Homens_2_Temporada&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiagofavi2612","files":3,"time":1249628253,"description":"Esse ÃƒÂ© o segundo ano da sÃƒÂ©rie Cidade dos Homens, com Laranjinha e Acerola, agora com 15 anos, vivendo e sobrevivendo numa favela do Rio de Janeiro. \n\nCidade dos Homens ÃƒÂ© uma criaÃƒÂ§ÃƒÂ£o da mesma equipe do premiado longa-metragem Cidade de Deus, interpretada pelos mesmos atores. Nesse ano, foram 5 episÃƒÂ³dios, alguns cÃƒÂ´micos, outros dramÃƒÂ¡ticos. Os temas variaram: das tentativas de namoro ao envolvimento com traficantes, da integraÃƒÂ§ÃƒÂ£o de raÃƒÂ§as ao baile funk, das areias de Ipanema ÃƒÂ s bocas de fumo no morro. Em todos os episÃƒÂ³dios, o destaque sÃƒÂ£o os atores do NÃƒÂ³s do Morro e NÃƒÂ³s do Cinema, ONGs criadas para dar suporte a atores e formar profissionais de cinema nas comunidades cariocas. \n\n\nOs Episodios\n\nSÃƒÂ¡bado\n\nO episÃƒÂ³dio se passa em um baile funk, onde adolescentes estÃƒÂ£o comeÃƒÂ§ando a lidar com amor, sexo e conquistas. No meio disso tudo, acontece um concurso de &quot;bondes&quot; do trÃƒÂ¡fico.\n\nDois Pra BrasÃƒÂ­lia\n\nLaranjinha (Darlan Cunha) e Acerola (Douglas Silva) vÃƒÂ£o ÃƒÂ  Capital Federal para tentar entregar uma carta ao Presidente Lula. O objetivo dos meninos ÃƒÂ© pedir ajuda para libertar da prisÃƒÂ£o o avÃƒÂ´ da namorada de Acerola, detento que jÃƒÂ¡ cumpriu pena em uma penitenciÃƒÂ¡ria do Rio de Janeiro, mas que, por entraves burocrÃƒÂ¡ticos, continua preso. Ainda no episÃƒÂ³dio, durante a viagem atÃƒÂ© BrasÃƒÂ­lia, Laranjinha e Acerola lembraram a histÃƒÂ³ria do velho presidiÃƒÂ¡rio, retirante nordestino que imigrou para SÃƒÂ£o Paulo no mesmo pau-de-arara em que o entÃƒÂ£o menino Lula se mudou com a famÃƒÂ­lia de Pernambuco para capital paulista, nos anos 50. \n\nTem Que Ser Agora \n\nA histÃƒÂ³ria mostrarÃƒÂ¡ que a praia ÃƒÂ© o lugar onde o Brasil ÃƒÂ© mais democrÃƒÂ¡tico, onde todas as classes se encontram, mas que tambÃƒÂ©m ÃƒÂ© muito confuso, pois ÃƒÂ© difÃƒÂ­cil saber se uma pessoa ÃƒÂ© do morro ou do asfalto. Laranjinha (Darlan Cunha) paquera Camila (Izabela Campos) e descobre que ela ÃƒÂ© rica. JoÃƒÂ£o (Thiago Martins), que ÃƒÂ© do asfalto, foge de Pedro (Rodolfo Almeida) quando descobre que ele ÃƒÂ© da favela. Acerola (Douglas Silva) namora Lidiane (Thaissa Izidoro), e ambos sÃƒÂ£o do morro. No meio dessas combinaÃƒÂ§ÃƒÂµes, um grupo de pitboys quer fazer uma balbÃƒÂºrdia na praia. \n\nOs OrdinÃƒÂ¡rios\n\nNeste episÃƒÂ³dio, Acerola (Douglas Silva), casualmente, salva um &quot;playboy&quot; que estÃƒÂ¡ se afogando. Isso gera uma ligaÃƒÂ§ÃƒÂ£o entre os meninos do morro e os garotos do asfalto. Durante as fÃƒÂ©rias, este grupo de amigos fica junto e cria o grupo &quot;os ordinÃƒÂ¡rios&quot;, descobrindo que ÃƒÂ© possÃƒÂ­vel a convivÃƒÂªncia entre os dois lados da cidade. \n\nBuraco Quente\n\nEsta histÃƒÂ³ria mostra Laranjinha (Darlan Cunha) e Acerola (Douglas Silva) tentando ajudar Espeto (Phellipe Haagensen) a sair do mundo do crime. Os dois fazem, de certa maneira, o papel da &quot;consciÃƒÂªncia&quot; de Espeto. Ora vÃƒÂªem as vantagens de estarem envolvidos e, ora, os altos riscos de fazer parte do trÃƒÂ¡fico. ","torrent":{"xt":"urn:btih:da92cdf5db53dc98434975e3548ad0799ca1e727","amp;dn":"Cidade_Dos_Homens_2_Temporada","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da92cdf5db53dc98434975e3548ad0799ca1e727","infoHashBuffer":{"type":"Buffer","data":[218,146,205,245,219,83,220,152,67,73,117,227,84,138,208,121,156,161,231,39]},"announce":[],"urlList":[]}}