{"title":"Two and a Half Men, TVSeries (divx), S07E01-04, NL Subs, DMT","uid":6208814,"size":983394074,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:daab71616ee1a7f48fb2ca24aad86a09627e3892&amp;dn=Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S07E01-04%2C+NL+Subs%2C+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MeMar","files":-1,"time":1298906301,"description":"Two and a Half Men, TVSeries (divx), S07E01-04, NL Subs, DMT\n\n\nVerenigde Staten\nCategorie: Beeld\nFormaat: DivX\nOndertitels (ingebakken): Nederlands\nGenre: Sitcom\nBron: Retail\nDuur: ongeveer 20 minuten per aflevering\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0369179/episodes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0369179/episodes&lt;/a&gt; &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Two_and_a_Half_Men&lt;/a&gt;\n\nDe hoofdrollen worden vertolkt door Charlie Sheen, Jon Cryer en Angus T. Jones.\n\nIn seizoen 7 heeft Cupido eindelijk zijn pijlen gericht op het hart van Charlie Harper, \nin plaats van op een ander lichaamsdeel - en het was helemaal raak. Jazeker, Charlie heeft ontdekt dat Chelsea serieus is en \nin seizoen 7 probeert hij alles om haar vast te houden. Aardig zijn voor haar ouders. Doen alsof hij luistert als ze praat. \nZelfs, ehm, trouw blijven. (Proberen, zeiden we.) Dat betekent een hoop lol voor de fans van de mannen. Maar Charlie is niet \nde enige Harper die vast zit in het liefdesweb. Alan is ervan overtuigd dat hij alleen wat meer haar nodig heeft voor \nde status van dekhengst, dus probeert hij de variant uit een spuitbus. En Jake besluit dat hij de ruwe golven van het daten \nop tienerleeftijd wel door zal komen met wat advies. Van Charlie.\n\nAflevering 1: 818-jklpuzo\nCharlie loopt toevallig zijn ex-verloofde Mia tegen het lijf. Die is op zoek naar een pianist om haar muziekcarriÃƒÂ¨re te \nlanceren, maar Charlie weigert het aanbod. Zijn huidige verloofde Chelsea spoort hem echter toch aan om haar te helpen,\n tenzij hij natuurlijk nog altijd gevoelens voor haar koestert. Ze vertrouwt hem, maar Charlie twijfelt of dat wel zo'n goed idee is.\n\nAflevering 2:  Whipped Unto the Third Generation\nCharlie houdt voet bij stuk: hij wil niet dat Alans vriendin Melissa bij hen intrekt. Hij beseft echter niet dat dit ondertussen \nal lang gebeurd is. Chelsea kan Charlie overtuigen Melissa te laten blijven. Maar daar krijgt hij al snel spijt van: \nAlan en Melissa doen voortaan enkel nog hun eigen zin. Voor Charlie is de maat vol: hij vertrekt.\n\nAflevering 3: Mmm, Fish. Yum\nAlan past op de baby van Judith en Herb, wanneer zijn alcohol- en medicijnverslaafde ex-schoonmoeder volledig de \npedalen verliest tijdens de afwezigheid van haar dochter. Ondertussen rijdt Charlie per ongeluk Chelsea's kat Sir Lancelot dood. \nCharlie wil alle bewijzen doen verdwijnen, maar dat is zonder Jake gerekend. \nDie besluit zijn oom te chanteren zodat hij met zijn Mercedes kan rijden.\n\nAflevering 4: Laxative Tester, Horse Inseminator\nAlan besluit in dienst te treden van zijn moeder zodat hij eindelijk een eigen plek kan veroorloven en meer tijd met Melissa kan doorbrengen. \nMaar daarvoor hoeft hij niet noodzakelijk te verhuizen: hij kan net zo best vrijen met Melissa in de leegstaande woningen die hij \nmoet showen aan potentiÃƒÂ«le kopers. Ondertussen probeert Charlie al het mogelijke te doen om ervoor te zorgen dat Chelsea en Jake \nmet elkaar kunnen opschieten, maar dat blijkt niet eenvoudig.\n\n\nDeze serie wordt u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:daab71616ee1a7f48fb2ca24aad86a09627e3892","amp;dn":"Two+and+a+Half+Men%2C+TVSeries+%28divx%29%2C+S07E01-04%2C+NL+Subs%2C+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daab71616ee1a7f48fb2ca24aad86a09627e3892","infoHashBuffer":{"type":"Buffer","data":[218,171,113,97,110,225,167,244,143,178,202,36,170,216,106,9,98,126,56,146]},"announce":[],"urlList":[]}}