{"title":"Jetstream - Part 2  (So you want to be a Fighter Pilot?)","uid":5055415,"size":2609225195,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dabeaa51199db0e6f9ed143dcedb9c3123d95419&amp;dn=Jetstream+-+Part+2++%28So+you+want+to+be+a+Fighter+Pilot%3F%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sheila6","files":5,"time":1250383350,"description":"TV : Documentary : DVD quality : English\n \n\n\n\n\nFollow 7 Canadian fighter pilot trainees and see who can make the grade!\n\nEpisode 5: Fight's On\n\nEpisode 6: Dream Killer\n\nEpisode 7: Do or Die\n\nEpisode 8: Bombs Away.\n\n\n\n\n\nThe Pilots:\nLieutenant Shamus Allen, Peterborough, Ontario.\nAllen has an outgoing personality and independent spirit. He enlisted in the military at 18 and graduated from Royal Military College with a degree in mechanical engineering. Allen has dreamt of being a fighter pilot since a fourth grade field trip found him up in a Cessna 150.\n\nCaptain Tim Coffin, Pisquid, Prince Edward Island.\nThis impossibly positive pilot craves a challenge - and has never met one that he couldn't master. Coffin attended Royal Military College and obtained a degree in business administration. He was inspired by his older sister who joined the military four years before him.\n\nCaptain Mike Dunning, Richmond, British Columbia.\nDunning is the only student on this course who did not earn his degree at Royal Military College. When this funny, sarcastic and down-to-earth guy doesn't have his head in the books studying, he finds stress relief on the rugby field.\n\nCaptain Riel Erickson, Millarville, Alberta.\nErickson has always been aggressive, athletic, competitive, a hard worker and is used to being the best at everything she attempts. She graduated from Royal Military College with a degree in mechanical engineering and if Erickson completes this program she will become only the second active woman fighter pilot in Canada.\n\nCaptain Yannick Jobin, Ste-Catherine-de-la-Jacques-Cartier, Quebec.\nJobin was a serious competitive gymnast from the age of eight to 18, but soon traded in the high bar for high flying. What this modest and reserved rookie didn't trade in is his drive, passion and intensity. Jobin graduated from Royal Military College with a degree in physics.\n\nCaptain Mike Lewis, Calgary, Alberta.\nLewis graduated Royal Military College with a bachelor in business. For anyone in the fighter force, this is the guy you want on your team. The instructors have high hopes for this senior student with many hours under his belt. Lewis is a true military man.\n\nCaptain Tristan Mckee, Whitby, Ontario.\nIt was in high school that Mckee made the decision to apply to Royal Military College to jumpstart his career aspirations of becoming a pilot. He has always been studious, methodical and a by-the-book kind of guy - habits that should serve anyone well during intense training.\n\nLieutenant Dave McLeod, Victoria, British Columbia.\nMcLeod is in a unique situation in that he arrives in Cold Lake a month after the course started, filling in for one of the pilots who unexpectedly left program. For a hard working, focused pilot with positive attitude like McLeod's, a little catch up shouldn't be a problem. A graduate of Royal Military College, he was inspired by his older brother who is a commercial pilot.\n\n\n\nThe Instructors:\nPutting the rookies through their paces at Cold Lake, some of the instructors featured in Jetstream include:\n\nMajor Mike Ayling, call sign &quot;Flayling&quot; \nAyling is the Standards Officer who keeps a close watch on the students' progress. He's known for high expectations and a low tolerance for attitude.\n\nMajor John Argue, call sign &quot;Spanky&quot;\nArgue is the Deputy Commanding Officer, a combat veteran and one of the most senior instructors.\n\nCaptain Patrick Pelletier, call sign &quot;Peanut&quot; \nPelletier has cheated death several times. He's a guy who likes to live on the edge in his airtime and his spare time.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:dabeaa51199db0e6f9ed143dcedb9c3123d95419","amp;dn":"Jetstream+-+Part+2++%28So+you+want+to+be+a+Fighter+Pilot%3F%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dabeaa51199db0e6f9ed143dcedb9c3123d95419","infoHashBuffer":{"type":"Buffer","data":[218,190,170,81,25,157,176,230,249,237,20,61,206,219,156,49,35,217,84,25]},"announce":[],"urlList":[]}}