{"title":"Rick Veitch Early Comics [ADULT]","uid":5019019,"size":353701411,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:db4b87cb133aaab7a39bb949e9e11424fb9f26c6&amp;dn=Rick+Veitch+Early+Comics+%5BADULT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1248368427,"description":"Collection of early work by artist and writer Rick Veitch.  Pack includes:\n\nAbraxas And The Earthman\nAbducted from earth by space whalers, Cetologist John Isaac endures physical and spiritual mutation by order of the ship's master, Rotwang. Pressed into the mad captain's hunt for Abraxas, Isaac finds his own destiny in the belly of the monstrous red-horned whale.\n\nBrat Pack\nA very dark satire on superhero sidekicks, influenced partly by the fans' decision to kill off Batman's sidekick Jason Todd, but also built on other long-standing rumors and undercurrents in the history of the superhero genre, prominently commercialism, homosexuality, pedophilia, violence, and the fascist tendencies inherent in superheroes.\n\nHeartburst\nOn far off Epsilon Bootis, young Sunoco Firestone is branded a criminal for falling under the musky spell of a native Green Girl.\n\nMaximortal\nA painful cautionary story of two naÃƒÂ¯ve young men who create a superhero named &quot;True-Man,&quot; only to see the creation lead to their own artistic and spiritual ruin. Veitch offers a warped view of the real story of Superman's creators Jerry Siegel and Joe Shuster, adding a dark, violent examination of what a real superbaby from another planet might be like.\n\nTeenage Mutant Ninja Turtles v1 24-26 - The River\nAfter Raphael has the Mutagen that transformed him into a Ninja Turtle sucked out of him by a giant leech the remaining turtles go in search the Bloodsucker hoping they can cure Raphael.\n\nThe One\nAt the height of the cold war, a madman tricks the United States and the Soviet Union into launching their missiles and super-hero agents against each other. But instead of nuclear Armageddon, the act releases the secret cosmic potential of the human race.\n\nDue to scenes of nudity and graphic violence this torrent comes with an ADULT rating.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:db4b87cb133aaab7a39bb949e9e11424fb9f26c6","amp;dn":"Rick+Veitch+Early+Comics+%5BADULT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db4b87cb133aaab7a39bb949e9e11424fb9f26c6","infoHashBuffer":{"type":"Buffer","data":[219,75,135,203,19,58,170,183,163,155,185,73,233,225,20,36,251,159,38,198]},"announce":[],"urlList":[]}}