{"title":"The Sweet - The Sweet TQMP","uid":5099146,"size":467060566,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:db4e10d5c018069b6d6977d2ec5600dee71e315d&amp;dn=The+Sweet+-+The+Sweet+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":26,"time":1253823771,"description":"Let's go back in time, to Sweet 70's!\n\n\nSweet (originally The Sweet) is a British rock band that rose to prominence as one of the main glam rock acts in the 1970s, with the original line-up consisting of Brian Connolly, Steve Priest, Frank Torpey, and Mick Tucker. Torpey was later replaced by Mick Stewart and then by Andy Scott in August 1970.\n\nDuring the early years of 1971 and 1972, Sweet's musical style followed a marked progression from the Archies-like bubblegum style of the first hit, &quot;Funny Funny&quot;, to a Who-influenced heavy rock style supplemented by a striking use of high-pitched backing vocals. The band achieved notable success in the UK charts, with thirteen Top 20 hits during the 1970s alone, five reaching number 2 and one, &quot;Block Buster!&quot;, reaching number 1.\n\nSweet membership has undergone a number of changes, and during different periods Scott, Connolly and Priest also each formed their own &quot;Sweet&quot;, resulting in the separate bands Andy Scott's Sweet, BC Sweet and Steve Priest's Sweet.\n\nConnolly died in 1997, and Tucker in 2002.\n\nTwo of the bands are still in existence: the U.S. version of The Sweet, founded by original bass player Steve Priest, and the U.K. version of The Sweet, featuring Andy Scott.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:     &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)\t\t","torrent":{"xt":"urn:btih:db4e10d5c018069b6d6977d2ec5600dee71e315d","amp;dn":"The+Sweet+-+The+Sweet+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db4e10d5c018069b6d6977d2ec5600dee71e315d","infoHashBuffer":{"type":"Buffer","data":[219,78,16,213,192,24,6,155,109,105,119,210,236,86,0,222,231,30,49,93]},"announce":[],"urlList":[]}}