{"title":"Aloha Bobby &amp; Rose (1975)","uid":5021736,"size":768658254,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dc0d6c028930eea98b35ba0cedae56d0f3943e95&amp;dn=Aloha+Bobby+%26+Rose+%281975%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cashsale","files":-1,"time":1248490903,"description":"I saw this film on the big screen in first release. I completely enjoyed this film. Many of the filming locations in Los Angeles were places I hung out at as a teenager. (The original Irwindale Raceway, Pinks hot dog stand on La Brea, Tower Records on Sunset) And yes, I'm a fan of old Detroit Iron.\n \nThe film stars Paul LeMat (American Graffiti) and Dianne Hull. Tim McIntire, Robert Carridine, Noble Willingham (Walker, Texas Ranger) and a young Edward James Olmos (as Eddie Olmos) round out the cast. All give a good performance and the cinematography is excellent.\n\nThe soundtrack which uses songs of Elton John, Emerson, Lake and Palmer, Little Eva, Undisputed Truth, The Temptations and others, truly add to the overall enjoyment of the film.\n\nIf you were part of the late sixties and early seventies Southern California street rod culture, you will appreciate and enjoy this film. \n\nTrivia: There are several references in the film to the Los Angeles FM radio station, &quot;KKDJ&quot; This station, on 102.7 Mhz, later became the world famous, KIIS-FM\n\nXviD Avi","torrent":{"xt":"urn:btih:dc0d6c028930eea98b35ba0cedae56d0f3943e95","amp;dn":"Aloha+Bobby+%26+Rose+%281975%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc0d6c028930eea98b35ba0cedae56d0f3943e95","infoHashBuffer":{"type":"Buffer","data":[220,13,108,2,137,48,238,169,139,53,186,12,237,174,86,208,243,148,62,149]},"announce":[],"urlList":[]}}