{"title":"Hubble Captures Rare Jupiter Collision","uid":5023388,"size":1873284,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:dc87c8d51b076c40d6d00473e1b9e29c4e153725&amp;dn=Hubble+Captures+Rare+Jupiter+Collision&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"the_Phyrexian","files":6,"time":1248573141,"description":"July 24, 2009: NASA scientists have interrupted the checkout and calibration of the Hubble Space Telescope to aim the recently refurbished observatory at a new expanding spot on the giant planet Jupiter. The spot, caused by the impact of a comet or an asteroid, is changing day to day in the planet's cloud tops. The Hubble picture, taken on July 23, is the sharpest visible-light picture taken of the impact feature. The observations were made with Hubble's new camera, the Wide Field Camera 3 (WFC3). WFC3 is not yet fully calibrated, and while it is possible to obtain celestial images, the camera's full power cannot yet be realized for most observations. The WFC3 can still return meaningful science images that will complement the Jupiter pictures being taken with ground-based telescopes. \n\nNASA scientists have interrupted the checkout and calibration of the Hubble Space Telescope to aim the recently refurbished observatory at a new expanding spot on the giant planet Jupiter. The spot, caused by the impact of a comet or an asteroid, is changing day to day in the planet's cloud tops.\n\nFor the past several days the world's largest telescopes have been trained on Jupiter. Not to miss the potentially new science in the unfolding drama 360 million miles away, Space Telescope Science Institute director Matt Mountain allocated discretionary time to a team of astronomers led by Heidi Hammel of the Space Science Institute in Boulder, Colo.\n\nThe Hubble picture, taken on July 23, is the sharpest visible-light picture taken of the impact feature. The observations were made with Hubble's new camera, the Wide Field Camera 3 (WFC3).\n\n&quot;This image of the impact on Jupiter is fantastic,&quot; said U.S. Senator Barbara A. Mikulski, D-Md., chairwoman of the Commerce, Justice and Science Appropriations Subcommittee. &quot;It tells us that our astronauts and ground crew at the Goddard Space Flight Center successfully repaired the Hubble telescope.&quot;\n\n&quot;This is just one example of what Hubble's new, state-of-the-art camera can do, thanks to the STS-125 astronauts and the entire Hubble team,&quot; said Ed Weiler, associate administrator of NASA's Science Mission Directorate. &quot;However, the best is yet to come!&quot;\n\n&quot;Hubble's truly exquisite imaging capability has revealed an astonishing wealth of detail in the 2009 impact site,&quot; said Hammel. &quot;By combining these images with our ground-based data at other wavelengths, our Hubble data will allow a comprehensive understanding of exactly what is happening to the impact debris. My sincerest congratulations and thanks to the team who created Wide Field Camera 3 and to the astronauts who installed it!&quot;\n\nCo-investigator Imke de Pater of the University of California at Berkeley said: &quot;The combination of the Hubble data with mid-infrared images from the Gemini telescope will give us an insight into changes of the vertical structure of the atmosphere due to the impact.&quot;\n\nDiscovered by Australian amateur astronomer Anthony Wesley on Sunday, July 19, the spot was created when a small object plunged into Jupiter's atmosphere and disintegrated. The only other time in history such a feature has been seen on Jupiter was 15 years ago.\n\n&quot;This is strikingly similar to the comet Shoemaker Levy 9 that impacted Jupiter in July 1994,&quot; said team member Keith Noll of the Space Telescope Science Institute in Baltimore, Md.\n\n&quot;Since we believe this magnitude of impact is rare, we are very fortunate to see it with Hubble,&quot; added Amy Simon-Miller of NASA's Goddard Space Flight Center in Greenbelt, Md. She explained that the details seen in the Hubble view shows a lumpiness to the debris plume caused by turbulence in Jupiter's atmosphere. The spot is presently twice the length of the United States.\n\nSimon-Miller estimated that the diameter of the object that slammed into Jupiter was at least the size of several football fields. The force of the explosion on Jupiter was thousands of times more powerful than the suspected comet or asteroid that exploded over the Tunguska River Valley in Siberia in June 1908.\n\nThe WFC3, installed by the STS-125 astronauts in May, is not yet fully calibrated. So while it is possible to obtain celestial images, the camera's full power cannot yet be realized for most observations. The WFC3 can still return meaningful science images that will complement the Jupiter pictures being taken with ground-based telescopes.\n\nThis is a natural color image of Jupiter as seen in visible light.\n\nCredit: NASA, ESA, and H. Hammel (Space Science Institute, Boulder, Colo.), and the Jupiter Impact Team\n\nThe members of the Jupiter Impact Team are:\n\nDr. Heidi B. Hammel (Space Science Institute, Boulder, Colo.)\nDr. Amy Simon-Miller (NASA's Goddard Space Flight Center, Greenbelt, Md.)\nDr. Keith S. Noll (Space Telescope Science Institute, Baltimore, Md.)\nDr. Michael H. Wong (Space Telescope Science Institute, Baltimore, Md.)\nProf. John T. Clarke (Boston University, Boston, Mass.)\nProf. Imke de Pater (University of California, Berkeley, Calif.)\nDr. Glenn S. Orton (Jet Propulsion Laboratory, Pasadena, Calif.)\nDr. Agustin Sanchez-Lavega (University of the Basque Country, Spain)\nCONTACT\n\nDwayne Brown\nHQ, Washington\n202-358-1726\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;0d697a6c746368236e236f7f627a634d636c7e6c236a627b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nRay Villard\nSpace Telescope Science Institute, Baltimore, Md.\n410-338-4514\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;7006191c1c1102143003040313195e151405&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n\nAbout the Object  \t\nObject Name: \t        Jupiter\nObject Description: \tPlanet\nDistance: \t        The semi-major axis of Jupiter's orbit about the sun is 5.2 ________________________astronomical units (483 million miles or 778 million km). ________________________On July 23, 2009 Jupiter was 368 million miles from Earth.\n\nDimensions: \t        The planet has a diameter of roughly 88,789 miles (142,984 ________________________km) at the equator.\n\nAbout the Data \t\nData Description: \tThe image was created from Hubble data from proposal 12003: ________________________H. Hammel (Space Science Institute), A. Simon-Miller (NASA ________________________Goddard Space Flight Center), J. Clarke (Boston ________________________University), I. de Pater (University of California, ________________________Berkeley), K. Noll (STScI), G. Orton (Jet Propulsion ________________________Laboratory), A. Sanchez-Lavega (University of the Basque ________________________Country, Spain), and M. Wong (STScI).\n\nInstrument: \t        WFC3/UVIS\nExposure Date(s): \tJuly 23, 2009 19:00 UT\nFilters: \t        F225W (225 nm), F275W (275 nm), FQ378N (378 nm), \n                        FQ437N (437 nm), FQ508N (508nm), FQ634N (634 nm), \n                        FQ727N (727 nm), FQ889N (889 nm), FQ906N (906 nm), \n                        FQ924N (924 nm)\n\nAbout the Release \t\nCredit: \t        NASA, ESA, H. Hammel (Space Science Institute, Boulder,\n                        Colo.), and the Jupiter Impact Team\nRelease Date:          \tJuly 24, 2009\nColor:           \tThe image is a composite of separate exposures made by the\n                        WFC3 instrument on the Hubble Space Telescope. Three \n                        filters were used to sample narrow wavelength ranges. \n                        The color results from assigning different hues (colors) to\n                        each monochromatic image. \n\nIn this case, the assigned colors are:\nFQ437N (437 nm) \tblue\nFQ508N (508nm) \t        green\nFQ634N (634 nm) \tred","torrent":{"xt":"urn:btih:dc87c8d51b076c40d6d00473e1b9e29c4e153725","amp;dn":"Hubble+Captures+Rare+Jupiter+Collision","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc87c8d51b076c40d6d00473e1b9e29c4e153725","infoHashBuffer":{"type":"Buffer","data":[220,135,200,213,27,7,108,64,214,208,4,115,225,185,226,156,78,21,55,37]},"announce":[],"urlList":[]}}