{"title":"S.M.V. Thunder (2008) FLAC TQMP","uid":5012228,"size":382047074,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dc99a33f61d3c91b495f53f023f256484a6d2ad2&amp;dn=S.M.V.+Thunder+%282008%29+FLAC+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"farty","files":18,"time":1248048754,"description":"From the Artist\n&quot;We wanted to make a bass record with a sound that would be somewhat unexpected to the listener,&quot; says Stanley Clarke, the elder statesman of the three-man crew, all of whom share songwriting credits on the recording. &quot;The biggest hurdle was to make a record with three basses - very low-end instruments, by definition - that would still be as musical as possible, and I think we achieved that.&quot;\n\n&quot;Vic had had this idea to do a bass thing a while back, but we really didn't know when we'd do it,&quot; Marcus Miller explains. &quot;After we jammed at the award ceremony, it was clear that it would be pretty easy to do musically. Each one of us found a space to operate that didn't compete with the other. We fell into it pretty naturally. I saw Stanley at the airport the next day and said, `You know we should do this soon, right?' he agreed. We knew Vic was down, because it was his idea in the first place.&quot;\n\nVictor Wooten was definitely down: &quot;That performance made us realize how easy it was to play together,&quot; he says. &quot;We knew that we had to do it again. We were able to naturally find our own space with and around each other. That's not always easy, especially when three people are all playing the same instrument.&quot;\n\nProduct Description\nSMV is a bass supergroup formed in 2008. The group's name comes from the initials of each of its members, Stanley Clarke, Marcus Miller, and Victor Wooten. SMV's debut release is the &quot;Thunder&quot; album. Marcus Miller (bass clarinet, synthesizer, electric bass); Stanley Clarke (acoustic bass, electric bass) and Victor Wooten (electric bass). \n\nA Quality TQMP release!\n\nEnjoy!","torrent":{"xt":"urn:btih:dc99a33f61d3c91b495f53f023f256484a6d2ad2","amp;dn":"S.M.V.+Thunder+%282008%29+FLAC+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc99a33f61d3c91b495f53f023f256484a6d2ad2","infoHashBuffer":{"type":"Buffer","data":[220,153,163,63,97,211,201,27,73,95,83,240,35,242,86,72,74,109,42,210]},"announce":[],"urlList":[]}}