{"title":"Jennifer Pena - Seduccion","uid":6292576,"size":47626689,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dce5b73de4c3ffcd538a1d3e2afc88946898088e&amp;dn=Jennifer+Pena+-+Seduccion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"WipLash1","files":13,"time":1301874718,"description":"Latina performer Jennifer Pena was born to a Mexican family in Texas, just like her idol Selena. When Pena paid tribute to Selena at the tender age of 12, her taped performance led Selena's aggrieved parents to help her get a record deal. As a teen, with her backing group, Los Jetz, Pena became one of the most popular voices in the Tejano world. In 2002, at age 18, she broke out on her own with the acclaimed LIBRE.\n\nSEDUCCION is a fitting title for the second record from the young chanteuse, who imbues her music with an easy sensuality that, when paired with her brash confidence, produces an engaging sound. While her songs, sung entirely in Spanish, derive much of their fervor from her Mexican roots, the songs possess a distinctly pop feel. &quot;Para Olvidarte De Mi&quot; and &quot;Como Saber&quot; would be as much at home on country radio as Latin stations. Even tracks like the upbeat, accordion-driven &quot;Ya Veras&quot; possess hooks owing equal parts to regions both north and south of the border. Jennifer Pena proves once and for all she's more than just a teen singer on SEDUCCION, a robust, sexy record.\n\nPersonnel: Jennifer PeÃƒÂ±a (vocals); Jennifer PeÃƒÂ±a; Rudy PÃƒÂ©rez, Manny LÃƒÂ³pez (guitar, keyboards, bass guitar, programming); Clay Perry (guitar, keyboards, programming); Tulio Cremisini (electric guitar, keyboards, programming); Julio Hernandez (bajo sexto, background vocals); JosÃƒÂ© Luis Arroyave (keyboards, programming); Archie Pena (percussion); Mora Arriaga, GaitÃƒÂ¡n Bros. (programming); Vicky Echeverri (background vocals); Sergio Minski, AndrÃƒÂ©s Castro (acoustic guitar, electric guitar); Daniel Betancourt (keyboards, programming); Richard Bravo (percussion).\n\n\n\n\n\nTrack List\n\n\n1 Vivo y Muero en Tu Piel\n2 Cumba Iho\n3 Para Olvidarte de MÃƒÂ­\n4 Hasta el Fin del Mundo\n5 Ya VerÃƒÂ¡s\n6 CÃƒÂ³mo Saber\n7 Si Yo Me Vuelvo a Enamorar\n8 Fuera de Mi Vida\n9 No Hay Nadie Igual Como TÃƒÂº (Can't Take My Eyes Off of You)\n10 Aunque Me Cueste la Vida\n11 Vivo y Muero en Tu Piel [Cumbia NorteÃƒÂ±a]\n12 Vivo y Muero en Tu Piel  [*]\n13 Hasta el Fin del Mundo [Cumbia NorteÃƒÂ±a] \n\n\nEnjoy and Please Seed!!!","torrent":{"xt":"urn:btih:dce5b73de4c3ffcd538a1d3e2afc88946898088e","amp;dn":"Jennifer+Pena+-+Seduccion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dce5b73de4c3ffcd538a1d3e2afc88946898088e","infoHashBuffer":{"type":"Buffer","data":[220,229,183,61,228,195,255,205,83,138,29,62,42,252,136,148,104,152,8,142]},"announce":[],"urlList":[]}}