{"title":"Osman-Christianity-Ancient Egyptian Religion(egyptian roots of i","uid":5110118,"size":13537779,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd4eb91a82f7f7b9654bff48daab1564e5d40a01&amp;dn=Osman-Christianity-Ancient+Egyptian+Religion%28egyptian+roots+of+i&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1254684316,"description":"This is Ahmed Osman's mindblowing book Christianity - An Ancient Egyptian Religion (2005) which contends that the roots of Christian belief came not from Judaea but instead from Egypt. Osman compares the chronology of the Old Testament and its factual content with ancient Egyptian records to show that the major characters of the Hebrew scriptures - including Solomon, David, Moses, and Joshua - are all based on Egyptian historical figures. He further suggests that not only were these personalities and the stories associated with them cultivated on the banks of the Nile, but the major tenets of Christian belief - the One God, the Trinity, the hierarchy of heaven, life after death, and the virgin birth - are all Egyptian in origin. He likewise provides a convincing argument that Jesus himself came out of Egypt. With the help of modern archaeological findings, Osman shows that Christianity survived as an Egyptian mystery cult until the fourth century A.D., when the Romans embarked on a mission of suppression and persecution. In A.D. 391 the Roman-appointed Bishop Theophilus led a mob into the Serapeum quarter of Alexandria and burned the Alexandrian library, destroying all records of the true Egyptian roots of Christianity. The Romans' version of Christianity, manufactured to maintain political power, claimed that Christianity originated in Judaea. Christianity - An Ancient Egyptian Religion restores Egypt to its rightful place in the history of Christianity - as its very origin. 290 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:dd4eb91a82f7f7b9654bff48daab1564e5d40a01","amp;dn":"Osman-Christianity-Ancient+Egyptian+Religion%28egyptian+roots+of+i","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd4eb91a82f7f7b9654bff48daab1564e5d40a01","infoHashBuffer":{"type":"Buffer","data":[221,78,185,26,130,247,247,185,101,75,255,72,218,171,21,100,229,212,10,1]},"announce":[],"urlList":[]}}