{"title":"Frank Zappa - Cheap Thrills TQMP","uid":5193182,"size":360941684,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ddad6841b92bf2f24ac64b0e33f99d5ecaa82921&amp;dn=Frank+Zappa+-+Cheap+Thrills+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":25,"time":1259796664,"description":"Cheap Thrills is designed for the curious listener who has always wanted to explore Frank Zappa but was intimidated by his overwhelming catalog. Of course, so is Strictly Commercial, which contains all of Zappa's most familiar songs, but Cheap Thrills has the advantage of being cheap, plus giving an idea of the weird diversity of Zappa's catalog, since it's filled with cult favorites, live tracks, smutty jokes, and assorted album tracks. It's not necessarily the most accessible introduction to Zappa -- again, that would be Strictly Commercial -- but it's more accessible than the average album while giving a sense of what the albums feel like. And you can't ask for much more than that from a budget-priced introduction.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:                                  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay &quot;thank you&quot; by seeding... just seed, it is not harmful to your health:-)\t\t","torrent":{"xt":"urn:btih:ddad6841b92bf2f24ac64b0e33f99d5ecaa82921","amp;dn":"Frank+Zappa+-+Cheap+Thrills+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddad6841b92bf2f24ac64b0e33f99d5ecaa82921","infoHashBuffer":{"type":"Buffer","data":[221,173,104,65,185,43,242,242,74,198,75,14,51,249,157,94,202,168,41,33]},"announce":[],"urlList":[]}}