{"title":"Sub 0~ Ice Man Edition [2010]Dvdrip -GOD-","uid":6139168,"size":2102943966,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:de309c6c4feb6c79b000ee3038a22eeb7326cf59&amp;dn=Sub+0%7E+Ice+Man+Edition+%5B2010%5DDvdrip+-GOD-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1296426783,"description":"\n\nDescription\n\nLet's face it. You're not just getting a DVD here when you cop that new SUB-0 joint. You're getting an fares paid one-way pass to the strip club. I mean, Goddamn, Sub-0 DVD straight lives in the strip club. When you buy that SUB-O DVD, you're getting that completely uncensored, unfiltered look at the life of a stripaholic. Shout out to Freeze.\n\nThat PSA aside, this is the Ice Man Edition DVD from Sub-0, the king of the clubs, featuring a real world grimey behind-the-scenes look into the New York city hoods of your favorite NYC rappers. Sub-0 is down with Dipset by law, so you know there's gonna be plenty of features from the Dips, this time around mainly coming from The Capo Jim Jones. The Ice Man Edition is also held down by the Bad Boy Records CEO and hip-hop mogul extraordinaire Sean 'Diddy' Combs. How many of these lil rapper DVDs got the one-and-only Puff Daddy on their DVD? Not many.\n\nSince Puff is reppin' you know there's plenty of Ciroc flowing, and since the Ciroc Boyz is what you want...that's what you're gonna get. Speaking of Ciroc Boyz and Puffy's henchmen, this DVD features Shakedown gangster Red Cafe puttin on for the NYC and the town of Brooklyn. Also featured on this DVD is NYC all-star French Montana, Philly's emerging new emcee Tone Trump, plus some of the veterans of the game -- including Freeway, Papoose, Sheek Louch and more.\n\nFEATURING: Pinky, Pebblez, Stacie Lane, Vain and more lovely ladies from Freeze's everyday strip club travels.\n\nDON'T FORGET: The strippers, exotic dancers, dolla bill collectaz, video girlz, pin-ups, dimepieces and all that other good stuff Sub-0 is known for. \n\nALSO FEATURING: Reek Da Villian, the Bartendaz, Tyga, a live &quot;Block 52&quot; fight between Big K-Wan and Lord Romel and mad more.\n\nScreenshots\n\n\nAudio/ Video\n\nVideo: MPEG4 Video (H264) 640x480 30.00fps 1671Kbps [Video 0]\nAudio: Dolby AC3 48000Hz stereo 192Kbps [Audio 1]","torrent":{"xt":"urn:btih:de309c6c4feb6c79b000ee3038a22eeb7326cf59","amp;dn":"Sub+0%7E+Ice+Man+Edition+%5B2010%5DDvdrip+-GOD-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de309c6c4feb6c79b000ee3038a22eeb7326cf59","infoHashBuffer":{"type":"Buffer","data":[222,48,156,108,79,235,108,121,176,0,238,48,56,162,46,235,115,38,207,89]},"announce":[],"urlList":[]}}