{"title":"a-ha - The Sun Always Shines On TV","uid":5134451,"size":174682116,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dec07db0b0349d1fa01b86face072b88966b5b78&amp;dn=a-ha+-+The+Sun+Always+Shines+On+TV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":1,"time":1256380115,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;The Sun Always Shines on T.V.&quot; is a song by Norwegian band a-ha, from their debut album Hunting High and Low, released in 1985. In many countries the single was not as successful as the band's previous, &quot;Take on Me&quot;, which hit #1 in the U.S. and several countries around the world. In the UK and Ireland, however, &quot;The Sun Always Shines on T.V.&quot; actually improved upon the #2 charting of their debut, remaining at the top spot on the UK Singles Chart for two weeks in January 1986. The single was certified Silver in the UK.\n\nThe song was re-released in a live version in 2003 with some minor success in Eastern Europe.\n\nThe music video opens with a continuation of the &quot;Take on Me&quot; video, featuring rotoscoped animation.\n\nThe love story between Morten Harket and Bunty Bailey established in the previous video is given an unexpectedly bitter end. The two lovers are admiring each other in a dark forest when Harket's hand starts reverting to its animated state. Soon his whole body is consumed by the animation. Hunched over, Harket sees his beloved for the last time as she bites her lip, knowing that the two cannot coexist in the same world. After exchanging painful parting glances, Harket runs into the distance and a blue explosion swallows him up, sending him back to his comic book world. The girl is left all alone in the forest. Only at this point does the song begin. The rest of the video features a-ha performing in a church (St Albans, now The Landmark Arts Centre, Teddington, London) &quot;accompanied&quot; by mannequins. The video ends as the three band members are cut out from the background and become a still frame. The music video for the band's next single, &quot;Train of Thought&quot;, was to pick up from this shot, as a continuation of a trilogy.\n\n&quot;The Sun Always Shines on T.V.&quot; was released in autumn 1985, becoming the second successful single from Hunting High and Low and one of the band's most recognizable and popular songs. The song peaked at number twenty on the Billboard Hot 100 chart. It also went Top 5 in Germany, Sweden, the Netherlands, and the band's home country of Norway, and reached number one in Ireland and on the British Singles Chart.\n\nTim DeGravine of Allmusic later wrote of the song,\n\n    &quot;The Sun Always Shines on T.V.&quot; is just as thrilling (as &quot;Take on Me&quot;). Starting as a sad ballad, it explodes into something much more, as chugging guitars and operatic synths keep pace with Harket's evocative vocal stylings. If ever a 1980s song qualified as Wall of Sound, &quot;The Sun Always Shines on T.V.&quot; would be it.&quot;\n\nNone of the versions released on the single were available on the band's album. The single mix was shortened down to 4:30, while the 12&quot; featured an extended mix and instrumental version mixed by Steve Thompson. The b-side, &quot;Driftwood&quot; is a non-album track produced by the band.\n\nThere are two versions of the extended mix. The first one is 8:25, while the second, rarer one is 7:09 and starts with a slow piano intro.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:dec07db0b0349d1fa01b86face072b88966b5b78","amp;dn":"a-ha+-+The+Sun+Always+Shines+On+TV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dec07db0b0349d1fa01b86face072b88966b5b78","infoHashBuffer":{"type":"Buffer","data":[222,192,125,176,176,52,157,31,160,27,134,250,206,7,43,136,150,107,91,120]},"announce":[],"urlList":[]}}