{"title":"Funkadelic - Uncle Jam Wants You .flac files","uid":6257869,"size":324274907,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:df09a02ae7d1f4db7bb6ca7e6013d7151fc3fc66&amp;dn=Funkadelic+-+Uncle+Jam+Wants+You+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ulikes","files":11,"time":1300643859,"description":"1979. The very peak of George Clinton's vast P-Funk empire. Bootsy had just released &quot;Player Of The Year&quot; and Parliament scored another great album with &quot;The Motor Booty Affair&quot; With numerous number 1 singles under their belt, George Clinton and Funkadelic decided to continue the formula that made their previous album &quot;One Nation Under A Groove&quot; so successful. Not many changes were made to Funkadelic. Resulting in a great dance album that had great potential but suffers when it becomes bland and lacking in some areas.\n\n&quot;Freak Of The Week&quot; A song about a disco dancing lady, starts off the album. The beat and tone of the whole song is very commercial, but still contains that great P-Funk vibe that makes us love the music.\n\nNext comes the number 1 single: &quot;(Not Just) Knee Deep.&quot; An excellent up tempo dance number. Probably Funkadelic's most recognized song of all time. While this song is great, it suffers from an extraneous song length. P-Funk will later try to duplicate the sound this song in further singles and fail miserably.\n\n&quot;Uncle Jam&quot; is the closest to 'true funk' you will get on the album. Written along old school Funkadelic greats Bootsy Collins and Bernie Worrell, ... Bootsy gets things going with a great bass line and Uncle Jam shows us why we should funk for his army. This is an excellent song.\n\n&quot;Field Maneuvers&quot; is an excellent instrumental that is slightly more commercial than previous instruments, but grooves just as great. Great soloing by guitarist Michael Hampton is the highlight of this song.\n\n&quot;Holly Wants To Go To California&quot; is a ballad sung by George Clinton with talking sound effects in the background. Nuff said-\n\n&quot;Foot Soldiers (Star-Spangled Funky)&quot; is an alright number that features great vocals, but is not interesting enough to keep the listener's attention for the duration for the full duration of the song.\n\nWhile &quot;Uncle Jam&quot; may not be Funkadelic's greatest album. It is still a good record and is a fine starting place for funkateers in training. If George had spent more time into this album it could have been excellent, but due to all the numerous side projects he was putting out at the time, this album was not as fully focused as previous Funkadelic greats. Get this album if you really love the later more commercial Parliament stuff. \n\nWell Funkateers, this will be the last Funkadelic upload for at least a week. Tales of Kidd Funkadelic is on it's way in the mail and I have misplaced Cosmic Slopp. As soon as I find it I will post it to complete the collection. But fear not, I have several George Clinton's releases from his post Parliament/Funkadelic days post for you to collect and I will also be adding the complete Parliament catalog to give you more of what you are funkin' for, all in .flac of course so you get every funking sound. So Funkateers, stay tuned, same Funk time, same Funk channel and keep checking back.\n\nUntil then, enjoy and please seed.","torrent":{"xt":"urn:btih:df09a02ae7d1f4db7bb6ca7e6013d7151fc3fc66","amp;dn":"Funkadelic+-+Uncle+Jam+Wants+You+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df09a02ae7d1f4db7bb6ca7e6013d7151fc3fc66","infoHashBuffer":{"type":"Buffer","data":[223,9,160,42,231,209,244,219,123,182,202,126,96,19,215,21,31,195,252,102]},"announce":[],"urlList":[]}}