{"title":"Earths Oldest Rocks - (Malestrom)","uid":5168860,"size":35499198,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df4a89608202dfe7481fe37b4b7bc8d258fe8b23&amp;dn=Earths+Oldest+Rocks+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1258571382,"description":" &lt;a href=&quot;http://bayimg.com/iaelfaAco&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/iaelfaAco&lt;/a&gt;\n\n\n\nRelease: 2007\nPublisher: Elsevier Science\nFormat: PDF 1330 pages\nISBN: 0444528105 (0-444-52810-5)\nISBN 13: 9780444528100 (978-0-444-52810-0)\n\n\nDescription:\nEarth's Oldest Rocks provides a comprehensive overview of all aspects of early Earth, from planetary accretion through to development of protocratons with depleted lithospheric keels by c. 3.2 Ga, in a series of papers written by over 50 of the world's leading experts. The book is divided into two chapters on early Earth history, ten chapters on the geology of specific cratons, and two chapters on early Earth analogues and the tectonic framework of early Earth. Individual contributions address topics that range from planetary accretion, a review of Earth meteorites, significance and composition of Hadean protocrust, composition of Archaean mantle and deep crust, all aspects of the geology of Paleoarchean cratons, composition of Archean oceans and hydrothermal environments, evidence and geological settings of early life, early Earth analogues from Venus and New Zealand, and a tectonic framework for early Earth.\n\n* Contains comprehensive reviews of areas of ancient lithosphere on Earth, of planetary accretion processes, and of meteorites\n* Focuses on specific aspects of early Earth, including oldest putative life forms, evidence of the composition of the ancient atmosphere-hydrosphere, and the oldest evidence for subduction-accretion\n* Presents an overview of geological processes and model of the tectonic framework on early Earth ","torrent":{"xt":"urn:btih:df4a89608202dfe7481fe37b4b7bc8d258fe8b23","amp;dn":"Earths+Oldest+Rocks+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df4a89608202dfe7481fe37b4b7bc8d258fe8b23","infoHashBuffer":{"type":"Buffer","data":[223,74,137,96,130,2,223,231,72,31,227,123,75,123,200,210,88,254,139,35]},"announce":[],"urlList":[]}}