{"title":"Doorway to Nightmare (Madame Xanadu)","uid":5122382,"size":215748103,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:df51d5a847db4b09ab34714b4f99deb25788e389&amp;dn=Doorway+to+Nightmare+%28Madame+Xanadu%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1255424918,"description":"Doorway to Nightmare, introduced in 1978, was the last of the DC &quot;Mystery&quot; line of titles in the 1970s, which became the forerunners of Vertigo.  Although it did not, by design, have a consistent creative team (the intent was to create writer-artist pairings that had never occurred before), other than Michael William Kaluta on the covers, Madame Xanadu (who debuted in Doorway to Nightmare #1), the star of the series was not a host, but an active participant, although never the main character in her stories, similar to a position that the Phantom Stranger would take.  \n\nMadame Xanadu was designed by cover artist Michael William Kaluta at the request of Joe Orlando (editor), based on Kaluta's unnamed host character (later known as Charity in the pages of Starman) from the DC Comics mystery title &quot;Forbidden Tales of Dark Mansion&quot; (seen only on that title's indicia page) and the person of Cathy Ann Thiele. The original storyline was developed by David Michelinie and Val Mayerik. The character is based on the mythical nymph Nimue made popular by Sir Thomas Malory's compilation of French and English romances, Le Morte d'Arthur (The death of Arthur).\n\nThe stories were typically structured around a protagonist stumbling upon Madame Xanadu's shop and deciding to enter.  They would tell a story of romance that was frustrated by an outside element. Xanadu, through a Tarot reading, always determined this element to be of an occult nature, then sent the protagonist to do some task in which she would intervene with the use of her powers.  Upon concluding the story, the occult element would wind up in a mason jar in her back room. \n\nThe Doorway to Nightmare strip lasted for ten issues, five in its own series, four in The Unexpected, and one issue of Madame Xanadu, which was DC's second direct sales only comic.  When the title was moved from its own series to a revamped, 68 page version of The Unexpected (the stories were actually expanded from 17 to 22 pages with the move, part of the DC Implosion), she was shown to be friendly with Abel in the inside front covers, which may or may not have been in continuity. She never met Abel in an actual story.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:df51d5a847db4b09ab34714b4f99deb25788e389","amp;dn":"Doorway+to+Nightmare+%28Madame+Xanadu%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df51d5a847db4b09ab34714b4f99deb25788e389","infoHashBuffer":{"type":"Buffer","data":[223,81,213,168,71,219,75,9,171,52,113,75,79,153,222,178,87,136,227,137]},"announce":[],"urlList":[]}}