{"title":"I ragazzi di Villa Emma - ragazzi ebrei in fuga [XviD Ita] [Tntv","uid":5051109,"size":352051200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:df8698899642d6b9ba72a6cd77f208484b22658d&amp;dn=I+ragazzi+di+Villa+Emma+-+ragazzi+ebrei+in+fuga+%5BXviD+Ita%5D+%5BTntv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darayava","files":1,"time":1250180944,"description":"Visit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=antone&amp;sb=1&amp;sd=0&amp;cat=0\n\nVisit this info link: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=86876 http://img255.Imageshack.us/img255/1313/guerraitaliani288x150px1.png Visit this info link: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=111976  Visit this link: http://img518.Imageshack.us/img518/2470/giornatamemoria288x150nx2.png\n\nI ragazzi di Villa Emma, ragazzi ebrei in fuga\nLa Storia Siamo Noi\n\n\n&quot;La Storia siamo noi&quot; (condotta da Giovanni Minoli, socio Fondatore della Fondazione Giorgio Perlasca) presenta &quot;I ragazzi di Villa Emma. Ragazzi ebrei in fuga&quot; di Aldo ZappalÃƒÂ \n\n\n73 bambini, per la maggior parte ebrei di origine tedesca, che con le SS alle calcagne vengono prima accolti in Jugoslavia, poi in Slovenia, infine in Italia, a Nonantola un paesino vicino Modena dove rimangono un anno. Ma con l'otto settembre 1943 a Modena arrivano le SS. I ragazzini saranno nascosti dagli abitanti del paese e aiutati a fuggire a piccoli gruppi in Svizzera.\nLa storia di Villa Emma e dei bambini ebrei sottratti alla persecuzione nazista non puÃƒÂ² spiegarsi senza la generositÃƒÂ  e il coraggio degli abitanti di Nonantola che fecero di tutto per stendere un invisibile muro protettivo attorno ai piccoli ebrei.\nGiugno 1942: 40 ragazzi ebrei in fuga scendono alla stazione di Nonantola. Ad attenderli Villa Emma, residenza di campagna dove troveranno rifugio, tra paure e sogni in attesa della terra promessa. I 40 bambini ebrei, che arrivarono il 17 giugno 1942 a Nonantola, erano in realtÃƒÂ  in fuga verso la Palestina, quando l'occupazione tedesca e italiana della Jugoslavia gli bloccÃƒÂ² la strada nel 1941. Nell'aprile del 1943 si aggiunse un secondo gruppo di 33 piccoli ebrei arrivati da Spalato. \nIn tutto 73 ragazzi, di etÃƒÂ  dai 6 ai 21 anni, tutti orfani che avevano perso i genitori nei campi di concentramento. A  Villa Emma i bambini e ragazzi vissero insieme ai loro accompagnatori e ai loro educatori, Josef Indig, Marco Schoky e il pianista Boris Jochverdson, in condizioni modeste. Eppure molti di loro ricorderanno quel periodo come uno dei piÃƒÂ¹ felici della loro vita.\nCon l'occupazione tedesca dell'Italia dopo l'8 settembre 1943 e l'arrivo delle truppe tedesche a Nonantola, la situazione cambiÃƒÂ² radicalmente.  In meno di 48 ore Villa Emma fu abbandonato e le ragazze e i ragazzi trovarono rifugio presso il seminario dell'Abbazia e nelle case dei contadini, degli artigiani e negozianti dei dintorni. \nUn grande coraggio in questa situazione fu dimostrato da Don Arrigo Beccari. Per sfuggire ai rastrellamenti tedeschi venne organizzata la fuga attraverso la frontiera con la Svizzera, che avvenne tra il 28 settembre al 16 ottobre 1943. Nell'oscuritÃƒÂ  i bambini guadarono il fiume Tresa e arrivarono in Svizzera da dove la maggior parte di loro, dopo una fuga durata 5 anni, arrivÃƒÂ² in Palestina nel maggio del 1945. Uno dei ragazzi, ammalatosi  di tubercolosi e ricoverato in un sanatorio, non riuscÃƒÂ¬ a fuggire. Il suo nome si ritrova nell'elenco di un convoglio per Auschwitz.   \nDon Arrigo Beccari e il medico Giuseppe Moreali sono stati in seguito onorati nello Yad Vashem per l'aiuto coraggioso e generoso da loro prestato, ed ÃƒÂ¨ stato loro dedicato un albero nel Viale dei Giusti.\n\n\n\nDati tecnici del file\n========================================\nNome..............: I ragazzi di villa Emma - La storia siamo noi.avi\nDimensione........: 335 MB (or 343,800 KB or 352,051,200 bytes)\nDurata............: 01:00:33 (90,818 fr)\nVideo Codec.......: XviD\nVideo Bitrate.....: 641 kb/s\nRisoluzione.......: 608x384 (1.58:1) [=19:12]\nFPS (Frames/sec)..: 25.000\nQF (Frame quality): 0.110 bits/pixel\nAudio Codec.......: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate.....: 128 kb/s (64/ch, stereo) CBR \nFreq Audio........: 48000 Hz\n\n\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:df8698899642d6b9ba72a6cd77f208484b22658d","amp;dn":"I+ragazzi+di+Villa+Emma+-+ragazzi+ebrei+in+fuga+%5BXviD+Ita%5D+%5BTntv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df8698899642d6b9ba72a6cd77f208484b22658d","infoHashBuffer":{"type":"Buffer","data":[223,134,152,137,150,66,214,185,186,114,166,205,119,242,8,72,75,34,101,141]},"announce":[],"urlList":[]}}