{"title":"Flikken Seizoen 9 dvd 2(Dutch) TBS","uid":6285748,"size":4519183781,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e037b3afdb67891956ca56d5448105a581b2f1fb&amp;dn=Flikken+Seizoen+9+dvd+2%28Dutch%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mad_Parrot","files":-1,"time":1301606710,"description":"\nFlikken Seizoen 9 dvd 2\n\n\n\nDe serie werd gecreÃƒÂ«erd door scenarioschrijver Pierre De Clercq en producent Erwin Provoost en was een coproductie van het productiehuis MMG en VRT en, seizoen 5 en 6, ook de Nederlandse TROS.\n\nDe serie Flikken heeft de Vlaamse stad Gent als achtergronddecor. Het lokale politieteam staat centraal in de serie en niet een of twee hoofdpersonages. De makers hadden bij aanvang van de serie zoveel vertrouwen in de serie, dat de opnames voor de tweede reeks in 1998 al begonnen waren, voordat de eerste aflevering uitgezonden was. \nIn de eerste reeks was er geen doorlopend verhaal tussen de verschillende afleveringen, dit volgde pas in de latere reeksen. Zo gingen de flikken, bijgestaan door de Nederlandse rechercheur Robert Nieuwman (Boudewijn de Groot), in 2004 op zoek naar de seriemoordenaar Luc Feiremans.\n\nIn april 2007 maakte de Vlaamse omroep VRT bekend dat het tiende seizoen van Flikken het laatste zou zijn. De financiÃƒÂ«n speelden hierbij een rol. De serie kostte veel geld, terwijl de VRT veel andere fictiereeksen op de rol had staan. \nHet slotseizoen, dat overigens maar tien afleveringen heeft in plaats van de gebruikelijke dertien, werd van 15 februari tot 19 april 2009 uitgezonden op ÃƒÂ©ÃƒÂ©n.[1]\n\nOm Flikken een waardige afsluiter te geven werd er op zaterdag 18 april 2009 in Gent een Flikkenparty georganiseerd. Op het einde van de dag kon in Kinepolis Gent de laatste Flikken-aflevering in avant-premiÃƒÂ¨re bekeken worden.\n\nSinds september 2007 zendt de TROS een Nederlandse versie van Flikken uit, Flikken Maastricht. Deze serie is qua cast kleinschaliger dan de originele serie.\n\n108 &quot;Gratuit Geweld (1)&quot; 30 maart 2008 9.04 \nEen eetcafÃƒÂ© wordt op gewelddadige wijze overvallen. De buit valt tegen. De gasten van het cafÃƒÂ© vermoeden dat het criminelen uit het voormalige Oostblok zijn. Uit het onderzoek blijkt dat daar geen enkele aanleiding voor is. John begint te vermoeden dat er iets verzwegen word.  \n\n109 &quot;Gratuit Geweld (2)&quot; 6 april 2008 9.05 \nEen van de gasten wordt nu ook thuis op gewelddadige wijze lastiggevallen. Het onderzoek brengt nog meer niet verwachte inzichten aan het licht. De verkrachte bedienster Mira verzwijgt bijvoorbeeld haar relatie met de getrouwde eigenaar.  \n\n110 &quot;Toprendement (1)&quot; 13 april 2008 9.06 \nEen bevriende beleggingmakelaar van John onderneemt een zelfmoordpoging. Die mislukt doordat zijn vrouw onverwacht thuis komt. De volgende morgen is de man verdwenen. Zijn vrouw meldt dit bij John. John draagt de zaak over aan Pasmans vanwege zijn vriendschappelijke relatie.  \n\n111 &quot;Toprendement (2)&quot; 20 april 2008 9.07 \nDe beleggingmakelaar blijkt ontvoerd te zijn. Dan komt de aap uit de mouw dat de makelaar in zware financiÃƒÂ«le problemen verkeerde. Dit heeft zo ook zijn gevolgen voor John die ook bij zijn vriend een investering had gedaan.  \n\n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : ISO \nBron          : Retail\nMenu          : Ja\nExtra's       : Ja\nAudio         : Nederlands\nOndertitels   : Nederlands (instelbaar)\nCover &amp; label : Ja\nGenre         : Actie\n \n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Flikken_(televisieserie)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Flikken_(televisieserie)&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.een.be/programmas/flikken&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.een.be/programmas/flikken&lt;/a&gt;\n\n\n\nBrought to you by TinkerBell @ TBS","torrent":{"xt":"urn:btih:e037b3afdb67891956ca56d5448105a581b2f1fb","amp;dn":"Flikken+Seizoen+9+dvd+2%28Dutch%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e037b3afdb67891956ca56d5448105a581b2f1fb","infoHashBuffer":{"type":"Buffer","data":[224,55,179,175,219,103,137,25,86,202,86,213,68,129,5,165,129,178,241,251]},"announce":[],"urlList":[]}}