{"title":"Big Time Rush S01E07-Big Time Break-[hmovies Release]","uid":5557864,"size":200640627,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e174962ce30dcf1586100419413fa536c4cad9b0&amp;dn=Big+Time+Rush+S01E07-Big+Time+Break-%5Bhmovies+Release%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"izialcita","files":3,"time":1273746788,"description":"hmovies release Torrents\n\n*Visit hmovies[dot]info for more releases~\n\n*Please Continue to Seed ^^.~\n\n*Use VLC player if it doesnt work on WMP..\n -download to http://www.videolan.org\n\nTv Series   : Big Time Rush\nTV Title    : Big Time Break\nSeason\t    : 01\nEpisode\t    : 07\nWikipedia   : The boys are relieved to finally be able to spend some time apart after finding out that Gustavo is taking the day off to play tennis. Logan is determined to get into a math lecture taught by one of his crushes (Pheobe Nachee), but is disappointed when he finds out no boys are allowed into the school where it's taking place. Carlos panics when he realizes his helmet is missing, but gets a surprise visit from his father who accompanies him on a mission to retrieve his helmet. James decides to spend his day off trying to set off his acting career with the help of Camille. Kendall is desperate to spend time with his crush Jo, but is discouraged when she continuously reminds him she has a boyfriend. However, when Katie finds out Jo doesn't have a boyfriend, Kendall is determined to get the truth out of her. When Kendall asks Jo about her boyfriend, she hesitates and says (in despiration) that her boyfriend is coming over to visit today. Kendall waits in the lobby, and Jo brings over her &quot;boyfriend&quot;, but he forgets his lines (his name was supposed to be Travis but he called it Trever, Truntun, Tobhat or Trixie). Kendall and Jo get angry at each other and leave, but Kendall then asks her out and she say yes, with Katie baffled at the results. Meanwhile, James gets the part of Witches of Rodeo Drive, but rejects it after Camille doesn't get the part. Also, Logan dresses up as a girl, with the help of Mrs. Knight, to be able to get into the school, but he tears it off in anger at the school after Pheobe say that girls are smarter than boys, and the girls then beat him up. Also, Carlos and his father find out that Lightning (the TV Wonder Dog) stole the helmet, along with Mr. Bitters's bologna, Tyler's froggy slippers, Buddha Bob's stereo, a lavalamp from room 3B, a disco ball from the game room, and a bearskin rug from Mr. Bitters's office. After all the events that happened, Carlos, James, and Kendall are all psyched to tell their story, and Carlos's father asks how they were going to decide who tells their story first, but just then Logan bursts through the door, costume on and beat up, and everyone says &quot;Logan goes first&quot;.\n\nAbsent: Tanya Chisolm as Kelly / Matt Riedy as Griffin / Denyse Tontz, Spencer Locke and Savannah Jayde as the Jennifers\n\nSpecial Guest Star(s): Maggie Henry as Pheobe Nachee / Erik Estrada as Officer Garcia / Katelyn Tarver as Jo / Daran Norris as Buddha Bob / Parker Young as &quot;Travis&quot;\nNote: Witches of Rodeo Drive is a parody to the popular Disney Channel sitcom Wizards of Waverly Place. This is also the first time that Kelly is absent. \n\nFile Size   : 191 MB\nAspect Ratio: 16:9\nVideo\t    : Avi File\n\t      XVID Mpeg-4 Visual (Advance Simple@L5)\n\t      1000 Kbps Bitrate\n\t      624x352 pixels\n\t      29.970 fps\nAudio       : Mp3 Audio\n              128 Kbps Bitrate\n              48.0 KHz\n    \nDON'T DOWNLOAD AND RUN PLEASE SEED :D","torrent":{"xt":"urn:btih:e174962ce30dcf1586100419413fa536c4cad9b0","amp;dn":"Big+Time+Rush+S01E07-Big+Time+Break-%5Bhmovies+Release%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e174962ce30dcf1586100419413fa536c4cad9b0","infoHashBuffer":{"type":"Buffer","data":[225,116,150,44,227,13,207,21,134,16,4,25,65,63,165,54,196,202,217,176]},"announce":[],"urlList":[]}}