{"title":"Bull Durham Dvdrip H264 Bookerdog.mp4","uid":5015615,"size":819792122,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e17e366dd97f0d0b8ea6d8d8c6a851363214327d&amp;dn=Bull+Durham+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bookerdog","files":-1,"time":1248207732,"description":"Category\tComedies, Dramas, Adventure, Romance, Recommended, Self-Discovery, AFI Top 100 Laughs\nStarring\tKevin Costner, Susan Sarandon, Tim Robbins, Trey Wilson\nDirector\tRon Shelton\nKevin Costner, Robert Wuhl, Susan Sarandon, Tim Robbins, Trey Wilson - Director: Ron Shelton\nNorth Carolina's Durham Bulls have just acquired a hot new pitcher, &quot;Nuke&quot; LaLoosh, who has a Major League arm but Little League aim. The management has sent for veteran Minor League catcher Crash Davis to train the rookie and get him ready for the upcoming season. The team's biggest fan, an English professor at the local college, has a tradition of choosing one Bulls player each year to be her lover and baseball/poetry prodigy, and this year she must choose between two players that have caught her eye, the pitcher and the catcher. The two ball players bait each other on and off the field, compete for the woman's affections, and eventually, send the Bulls on a winning streak.\n\nThe Durham Bulls are in a slump and have spent a hefty sum of money acquiring an untested young pitcher in the hopes of reversing their standings. Crash Davis, a 12-year veteran ballplayer who has spent most of his time bumming around as a minor league catcher, is assigned to mature the rookie pitching phenom named &quot;Nuke.&quot; But a beautiful and enigmatic team groupie comes between the tutor and his student, enlightening both with her game of life, love and verse.","torrent":{"xt":"urn:btih:e17e366dd97f0d0b8ea6d8d8c6a851363214327d","amp;dn":"Bull+Durham+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e17e366dd97f0d0b8ea6d8d8c6a851363214327d","infoHashBuffer":{"type":"Buffer","data":[225,126,54,109,217,127,13,11,142,166,216,216,198,168,81,54,50,20,50,125]},"announce":[],"urlList":[]}}