{"title":"The Howling (1981)","uid":5136261,"size":845361815,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e203d989c7c8c26c9750d3d74d73888a4028c126&amp;dn=The+Howling+%281981%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FuckFCC","files":2,"time":1256502088,"description":"The Howling - Plot summary\n\nTelevision reporter/anchor Karen White is taking part in a dangerous police operation intended to trap psychopath Eddie Quist. When confronted by Eddie face-to-face, she witnesses something horrifying enough to trigger selective amnesia.\n\nPlagued by a series of violent nightmates, Karen decides to admit herself to a posh recovery resort known as &quot;the Colony&quot;, run by her eccentric New Age therapist Dr. George Waggner, and bring along her husband R. William &quot;Bill&quot; Neill for support. The night after they arrive, Karen and Bill are unnerved by eerie howling in the woods. Back in Los Angeles, Chris Dugan and Terry Fisher have been investigating Eddie's background after discovering that his body has disappeared from the morgue. Sifting through Eddie's possesions, they find a strange collection of artwork depicting wolf-like creatures, and decides to consult with Walter Paisley, the owner of an occult bookshop, on werewolf lore. Though he claims not to believe in the stuff he's selling, Paisley nevertheless convinces Chris to purchase a handful of silver bullets...just in case.\n\nBack at the Colony, Dr. Waggner has organized a hunting party after hearing Karen's account of the nocturnal howling, but the men find nothing but a rabbit, which Bill is told to bring to the cabin of the sultry Marsha Quist to prepare for dinner. After resisting Marsha's less-than-subtle sexual overtures, Bill is attacked by a wolf while returning to his cabin. The following moonlit night, the sleepless Bill wanders finds Marsha waiting and the two make love by the campfire, their bodies undergoing a frightening transformation. Just as Karen is beginning to suspect that her husband is hiding a secret far more threatening than marital infidelity, Chris and Terry have come to realize; too late in Terry's case; that Eddie Quist is not only still alive, but not quite human...and he knows he's being followed. Chris arrives at the Colony too late to save Terry, but manages to find Karen just as the Colony's residents; all of whom are werewolves including Dr. Waggner; are assembling to decide her fate.\n\nTagline: Imagine your worst fear a reality.","torrent":{"xt":"urn:btih:e203d989c7c8c26c9750d3d74d73888a4028c126","amp;dn":"The+Howling+%281981%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e203d989c7c8c26c9750d3d74d73888a4028c126","infoHashBuffer":{"type":"Buffer","data":[226,3,217,137,199,200,194,108,151,80,211,215,77,115,136,138,64,40,193,38]},"announce":[],"urlList":[]}}