{"title":"The Nazi Officer's Wife","uid":5065303,"size":1566005248,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e2a18b7a53db2cb14ca6fbc835015b21d6d9ac3c&amp;dn=The+Nazi+Officer%5C%27s+Wife&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eddie1969","files":1,"time":1250984159,"description":"TV : Documentary : DVD Rip : English\n\n\n\n\nThe Nazi Officers Wife\n\nBiography, History Documentary hosted by Susan Sarandon and published by Others in 2005 - English narration\n\n \n\nInformation\n------------------------------\n\nThe extraordinary story of Edith Hahn in The Nazi Officer's Wife. Using old newsreel footage, personal photos, and interviews with Hahn, her daughter Angela, and various acquaintances, with narration by Susan Sarandon and Julia Ormond (who reads excerpts from Hahn's autobiography), the film explores how Hahn, a Jewish woman living in Vienna during the Nazi takeover of Austria, survived. \n\nThe film begins the tale with Hahn's childhood, including her education, the death of her father, and her college romance with a half-Jewish intellectual. As the Nazis grew in power, and Hahn's sisters fled for Palestine, he insisted that they would be safe in Vienna. Soon, Hahn, a law student, found herself in a slave labour camp. By the time she returned to Vienna, her mother had been sent to a concentration camp in Poland. Certain to be deported herself, Hahn chose instead to remove the yellow star from her clothing and go into hiding. \n\nFinding help from the unlikeliest of sources (including two prominent members of the Nazi party,) Hahn took on a new identity as a young Aryan woman, and left Vienna, travelling to Munich, in the heart of the Third Reich, where she got a job working as a nurse's aide for the Red Cross. There, visiting a museum, she met a bright and well-spoken Nazi, Werner Vetter, who approached her. Soon, against Hahn's better judgment, the two had started a romance, which eventually led to an unlikely marriage and a child. All the while, Hahn kept up her disguise to all but her husband, even suppressing her own vital personality, and taking on the role of a subservient Aryan housewife.\n\n\n \n\nTechnical Specs\n------------------------------\n\n\n* Video Codec: XviD\n* Video Bitrate: 1911 kbps\n* Video Resolution: 640 x 480\n* Video Aspect Ratio: 1:33\n* Audio CodecAC3\n* Audio Bitrate: 224kbps 48000Hz\n* Audio Languages: English\n* Part Size: 1,493mbs\n* RunTime: 97 mins\n* Ripped By: artistharry\n\n\n\n\nEnjoy and Seed!!\n\n","torrent":{"xt":"urn:btih:e2a18b7a53db2cb14ca6fbc835015b21d6d9ac3c","amp;dn":"The+Nazi+Officer%5C%27s+Wife","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2a18b7a53db2cb14ca6fbc835015b21d6d9ac3c","infoHashBuffer":{"type":"Buffer","data":[226,161,139,122,83,219,44,177,76,166,251,200,53,1,91,33,214,217,172,60]},"announce":[],"urlList":[]}}