{"title":"The Joe Blow Conspiracy Show - 091007 - Gossip,","uid":5116273,"size":28801674,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e2b35c856edce76b26ce84a267453a0a86713a94&amp;dn=The+Joe+Blow+Conspiracy+Show+-+091007+-+Gossip%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"joeblowman","files":-1,"time":1255085531,"description":"OoOoOoOoOoOoOoOoOoOOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoO\n*** The Joe Blow Conspiracy Show - Gossip, Opinions, History, News\n*** 8pm US CST Fri and 2am EU CET Sat on Revere Radio\n*** joeblow@umunu-com skype:joeblowman\n\n*** To come on the show, meet us at our Bittorrent tracker/AJAX chat/forum!\n*** \n*** Download/listen to the shows at the following locations:\n\nOoOoOoOoOoOoOoOoOoOOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoOoO\n\nThe Joe Blow Conspiracy Show - 091007 - Gossip, Opinions, History, News\n\n1. Joe is joined by DJChronic, TarasBulba, Vigilius (nerdmann, TheHatefulNerd), and we discuss:\n\n* The coming destruction of America and how glad we are to see it.\n+ All these Patriot and Conspiracy show are complaining about how America is about to fall.\n- They say &quot;When America falls, so will the rest of the world&quot;.\n. Joe says &quot;Shut the fuck up, the rest of the world will be glad!&quot;.\n+ Chronic thinks that it will take a while, but eventually it shall occur.\n- He thinks that an Unified Econimic System worldwide is a good thing.\n- Americans did not do enough and are all responsible.\n+ Taras thinks that Nuclear Weapons will prevent the future invasion.\n- The Federal Government will help the EU/Chinese troops go through the borders.\n+ Vigilus thinks that because Americans are well-armed, they shall not be conquered.\n- They did not do shit during Hurricane Katrina, G20 Summit, et al.\n+ When the Peace-Keepers are in the streets, at least 50% of the population will burn their own flags.\n+ The country will be split among EU, Canada, China, Mexico, and Russia.\n+ U.S. soldiers in Iraq and Afghanistan are the foot soldiers of the NWO.\n- They did not go there to defend the Constitution, rather because they could not find a job.\n- Joe is very happy that they are getting sick from Depleted Uranium.\n+ They pretend to support Israel, but really do not give a shit, they are just too cowardly to tell the truth.\n- Callers are saying &quot;The 'Illuminati' (translation: the jew) are going to make us live like the Palestinians!&quot;.\n+ FEMA Camps are not needed, all they have to do is turn off the food/water/electricity.\n+ After society falls, people will use Marihuana and Blow-jobs as currency, LOL!\nhttp://www.kontraband.com/videos/168/Bill-Hicks-Drugs-Blow-Jobs/\n\n* Vigilius is a confirmed Gnostic and believes that the first Christians were all Gnostics.\n+ Gnosticism consists of various belief systems that believe humans are divine souls trapped in a material world created by an imperfect god.\nhttp://www.gnosis.org\n- Total fucking Satanic bullshit!!!\n+ Vigilius accuses Joe of being a Black-Poper and supporter of the Vatican-led NWO theory.\n+ Vigilius defends the jew and tows the Alex Jones line that &quot;The Illuminati is made up of different Criminal Organizations.&quot;.\n- 95% of Commissars during the Russian Revolution were fucking, dirty jew-kike bastards.\n- All of the Global Banking Families who run the USA/EU are jews.\n\n* The most stupidest JFK Assissination Theory is discussed: The Umbrella Men and Dart Gun.\n+ In the Zapruder Film, a man holding a umbrella (TUM) which was actually a DART PROJECTORY SYSTEM.\n- As JFK's car approached, TUM released a poison &quot;flechette&quot; that entered JFK's throat just above his shirt collar.\n- This poison dart almost instantly paralyzed JFK and caused his body to stiffen and his head to remain stable.\n- This made him a &quot;sitting duck&quot; for a sniper hidden elsewhere in the Grassy Knoll.\n+ All the participants laughed their asses off and made NO-PLANES = NO-DARTS jokes.\n+ Joe creates a new JFK theory &quot;Jackie O. was giving him a hand-job, that is why he was not moving.&quot;, bwahahaha!\n\nMusic:\n\nDaniel Decatur Emmett - Dixie's Land 1916\nAzar Shiva - Soltane Ghalbha\n\nJoe Blow recommends these websites:\n\nSend tips to joeblow@umunu-com or call skype:joeblowman","torrent":{"xt":"urn:btih:e2b35c856edce76b26ce84a267453a0a86713a94","amp;dn":"The+Joe+Blow+Conspiracy+Show+-+091007+-+Gossip%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2b35c856edce76b26ce84a267453a0a86713a94","infoHashBuffer":{"type":"Buffer","data":[226,179,92,133,110,220,231,107,38,206,132,162,103,69,58,10,134,113,58,148]},"announce":[],"urlList":[]}}