{"title":"Extraordinary Animals in the Womb","uid":5066903,"size":1174786048,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e3c4b38ed97c40baaf7630a546b89ef495a2265d&amp;dn=Extraordinary+Animals+in+the+Womb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eddie1969","files":1,"time":1251057842,"description":"TV : Documentary : DVD Rip : English\n\n\n\nExtraordinary Animals In The Womb\n\nNature, Science Documentary hosted by Dilly Barlow and published by Channel 4 in 2008 - English narration\n\n \nUsing ground-breaking photography techniques, state-of-the-art special graphics, revolutionary 4D scanning techniques and highly realistic models, Extraordinary Animals in the Womb opens a window on the amazing journeys and survival strategies of sharks, kangaroos, penguins and wasps. From embryo to birth.\n\nThe embryonic journeys of four remarkable animals are brought to life as they develop, from conception to birth. The shark, whose cannibalistic embryos will eat their own siblings to survive; the emperor penguin, whose egg-bound chicks must battle the coldest weather on the planet; the kangaroo, whose underdeveloped foetus will undergo an exceptionally premature birth; and the parasitic wasp, whose larvae must hijack and exploit the body of another creature.\n\nFilming across three continents, and making use of the latest HD camera technology, the Animals in the Womb team swam with pregnant sharks and witnessed up close the torment of parasitized caterpillars. Groundbreaking photography takes us inside the pouch of a kangaroo, and remarkable scans and special effects reveal 14 half-metre-long young inside the womb of a wild shark.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:e3c4b38ed97c40baaf7630a546b89ef495a2265d","amp;dn":"Extraordinary+Animals+in+the+Womb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3c4b38ed97c40baaf7630a546b89ef495a2265d","infoHashBuffer":{"type":"Buffer","data":[227,196,179,142,217,124,64,186,175,118,48,165,70,184,158,244,149,162,38,93]},"announce":[],"urlList":[]}}