{"title":"Legend.of.the.Seeker.S02E15.H264[quark]","uid":5491009,"size":56084990,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e42c211b0a1b6c53adfb03f77d9319c9c58ae540&amp;dn=Legend.of.the.Seeker.S02E15.H264%5Bquark%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twentyforty","files":1,"time":1270998266,"description":"EXPERIMENTAL, just to demonstrate now small file-size could be.\nDO NOT download if you watch on high resolution TV or monitors.\nNOT for handhelds or phones, just computers. \nPlayable in VLC, WMP and MPC with CoreCodec and DivX 7 AAC DShow filter, \nmplayer, KMplayer and of course, in QuckTime Player.\nHowever, picture is better than 90% of CAMs and definitely watchable.\nPLEASE, think about the ones who have Internet but cannot afford download of big files.\nEvery day I have 10% of my peers on dial-up and ancient hardware who need whole day to download a &quot;normal&quot; sized 350MB.\nPlease, I beg you for understanding of my work, let them through and if you can - help them by downloading and seeding afterward as long as you can. These people have slow download and it helps them a lot (please, be generous - on such file having ratio 11.7:1 is like 1:1 on normal-sized XviD).. \nThank you.\n\n**************************************************************************\n\nQuarks are point particles (no size) unlike protons and neutrons. \nProtons and neutrons are made of quarks. Quarks come in different types. There are six different types: up, down, charm, strange, top and bottom. For example, a proton is comprised of two up quarks and one down quark. Quarks have electric charge, color charge, spin and mass. But they have no internal structure, they behave like mathematical points.\n\nElectrons are members of the lepton family. Like the quarks, leptons are also point particles. \n\n**************************************************************************\n\nNOTE: I would be forced to stop doing [quark] encodings and torrents\n      because, as happened with comedy shows (files are small - 60 to 80 MB); \n      people treat them as GARBAGE.\n      NOT TO SHARE with others and NOT TO SEED defies the whole game, isn't it?\n      Number of Hit&amp;Runs is even HIGHER then I ever have imagined - up to 99%.\n      1864 downloads and 14 people (same ones) stayed as seeders longer then \n      6 hours. 1282 &quot;humans&quot; just grabbed and ran. Rest seeded up to ratio 0.14.\n      It's not silly. It's not what was expected. It is sad.\n      Another proof of dying love and care for others. As I said much earlier \n      &quot;You cannot get even with a world. \n      These people here are not the ones to blame.\n      Yes, they are the strangers, the &quot;others&quot; but not the ones who \n      have caused your personal or our collective misery. These people \n      here are most likely people same as you...\n\n      SEED after the download or I will remove [quark] from my uploads.\n      \n      If [quark] is bad idea or encodes looks ugly (what I doubt judging from \n      the comments) do not download [quark] torrents. These are for normal, but \n      less fortunate  people, who cannot afford whole day or 15% of they \n      traffic limit,\n      just for one download of one episode in XviD format (for what I and most of\n      you need roughly 180 seconds). \n      They have Internet, they have some old PC, they are \n      maybe hungry, too sick or too far from the movie theaters or \n      have no money for the cable and/or TV.\n\n     That's why I have asked for understanding and for HELP from the people who\n     have Flat-Rate (pays no matter traffic) and are willing to stay as seeders.\n     Is that so hard to understand? Or do? We all get even at the end, right?\n     Seed. Share. Give. Care.\n","torrent":{"xt":"urn:btih:e42c211b0a1b6c53adfb03f77d9319c9c58ae540","amp;dn":"Legend.of.the.Seeker.S02E15.H264%5Bquark%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e42c211b0a1b6c53adfb03f77d9319c9c58ae540","infoHashBuffer":{"type":"Buffer","data":[228,44,33,27,10,27,108,83,173,251,3,247,125,147,25,201,197,138,229,64]},"announce":[],"urlList":[]}}