{"title":"Shea Fisher - Shea [AUS][2009][CD][320Kbps] - [dulhanr]","uid":5049312,"size":89421124,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e430b11691f61189ed0b937769d0cbd55072b279&amp;dn=Shea+Fisher+-+Shea+%5BAUS%5D%5B2009%5D%5BCD%5D%5B320Kbps%5D+-+%5Bdulhanr%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dulhanr","files":12,"time":1249823388,"description":"This Is The Australian Released Album of Shea Fisher - Shea\nAll Songs Are Encoded At 320 Kbps As Mentioned On The Title,\nExcellent Quality, Check It Out For Yourselves...\n\nAlbum Contents :-\n\n01 - Shea Fisher - Suitcase\n02 - Shea Fisher - Easy Come, Easy Go\n03 - Shea Fisher - Getaway Heart\n04 - Shea Fisher - Children\n05 - Shea Fisher - What He Did To Me\n06 - Shea Fisher - Don't Chase Me (AUS Version)\n07 - Shea Fisher - A Little Bit Of Love\n08 - Shea Fisher - Bein' With My Baby - Co-written By Taylor Swift\n09 - Shea Fisher - Another Day In The Sun\n10 - Shea Fisher - Make You Want To\n11 - Shea Fisher - You Will\n\nThe Debut Single Released - Don't Chase Me, As Far As I Know is the Australian Version, Bein' With My Baby, was Co-Written by Reputed Song-Writer And Coutry Artist - Taylor Swift , \nFor More Info \n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Taylor_Swift_discography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Taylor_Swift_discography&lt;/a&gt;\n\nLook Under &quot;Writing Credits&quot;\n\nOriginal Encoder - misshacker.com\nSomething About The Artist - \n\nThe dream started here . . .\n. . . says Shea Fisher, smiling as she recalls her first visit to the United States at age 10. Her father, a champion bull rider, had brought the family from Australia as he chased his own dreams, but it was American country music that caught Shea's imagination. A champion barrel racer herself, Shea had become a huge fan of Reba McEntire while in Australia, but her world changed when she first heard Shania Twain's music while performing in a school play in tiny Elida, New Mexico.\n\n&quot;I sang 'Any Man of Mine' before I even knew who Shania was,&quot; she says. &quot;Then I bought her album, and from then on I was the kid who wound the window down and sang at the top of her lungs. I remember seeing her perform on TV and thinking, &quot;I want to be that one day. I want to do that.&quot;\n\nTen years later, just 21 years old, Shea is fulfilling that dream, introducing her own brand of cutting-edge country to American music fans. In between, she followed a path Reba knew well, singing the national anthem (in this case Australia's) at rodeo events, then hitting the road to pay the dues that would earn her a growing legion of fans as she polished her performing and songwriting skills.\n\nAs sure as Shea introduces a top-notch young singer to American audiences, it introduces an upbeat force of nature as well.\n\n&quot;I believe the sky's the limit,&quot; she says, &quot;for me and for everyone. Dream big. Work hard and you'll get there. It's just a matter of time. I'm going to keep dreaming big and keep striving to achieve new things every day.&quot;\n\nAnd, with the hard-won wisdom of one for whom being bucked from a horse or bull is no mere metaphor, she adds, &quot;If you fall, get back up again and keep going. Whatever you want to do is possible if you want to make it happen.&quot;\n\nOfficial Sites -\n &lt;a href=&quot;\nhttp://www.sheafisher.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sheafisher.com&lt;/a&gt;\n\nThanking You;\nYet Again Another Brand New Upload by,\ndulhanr &lt;a href=&quot;\nhttp://thepiratebay.se/user/dulhanr/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/dulhanr/&lt;/a&gt;","torrent":{"xt":"urn:btih:e430b11691f61189ed0b937769d0cbd55072b279","amp;dn":"Shea+Fisher+-+Shea+%5BAUS%5D%5B2009%5D%5BCD%5D%5B320Kbps%5D+-+%5Bdulhanr%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e430b11691f61189ed0b937769d0cbd55072b279","infoHashBuffer":{"type":"Buffer","data":[228,48,177,22,145,246,17,137,237,11,147,119,105,208,203,213,80,114,178,121]},"announce":[],"urlList":[]}}