{"title":"Electric Light Orchestra - Out Of The Blue TQMP","uid":4995293,"size":516034915,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e5120f204c9b47aafb036e117c29c6a762318055&amp;dn=Electric+Light+Orchestra+-+Out+Of+The+Blue+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":40,"time":1247247000,"description":"Electric Light Orchestra, commonly abbreviated ELO, were a symphonic rock group from Birmingham, England, who released eleven studio albums between 1971 and 1986 and another album in 2001. ELO were formed to accommodate Roy Wood and Jeff Lynne's desire to create modern pop songs with heavily classical overtones, but falling under a light rock category. However, the band's direction for most of their existence was set by Lynne who, after the band's debut record, wrote and arranged all of the group's original compositions and produced every album.\n\nThe band was first successful in the United States, billed as 'The English guys with the big fiddles'. They soon gained a cult following despite lukewarm reviews back in their native United Kingdom. They were managed by agent Don Arden, father of Sharon Osbourne.\n\nBy the mid-1970s, they had become one of the biggest selling bands in music. From 1972 to 1986, ELO accumulated twenty-seven Top 40 hit single appearances in both the UK and the US. The group also scored twenty Top 20 U.K. hit singles, as well as nineteen Top 20 hit singles in the U.S. Billboard charts, with fifteen in the Hot 100. The band also holds the record for having the most Billboard Hot 100 Top 40 hits of any band in US chart history without ever having a #1 single.\n\nDespite the fact that the majority of the group's material was never researched, audited and certified, ELO collected 21 RIAA awards, 38 BPI awards, and sold well over 100 million records worldwide, not including singles; 50 million of those being sold in a period of only eleven years, from 1971 to 1982.\n\nOut Of The Blue\n\nJeff Lynne wrote the entire album in three and a half weeks after a sudden burst of creativity whilst hidden away in his rented chalet in the Swiss Alps. It took a further two months to record in Munich. The album had 4,000,000 pre-ordered copies and quickly went multi-Platinum upon release. Out of the Blue spawned five hit singles in different countries, and was ELO's most commercially successful studio album. It was also the first double album in the history of the UK music charts to generate four top twenty hit singles. Side three of the original double LP consisted of the symphonic Concerto for a Rainy Day, composed of four separate tracks which together made up a cohesive suite. The inclement weather effects heard on &quot;Concerto&quot; were real and recorded by Jeff Lynne during a very rainy summer in Munich 1977. The Concerto suite would be Lynne's last dabbling in symphonic rock.\n\nJeff Lynne considers A New World Record and Out of the Blue to be the group's crowning achievements and both sold extremely well, reaching multi-platinum according to RIAA Certification. Capital Radio and The Daily Mirror Rock and Pop Awards (forerunner to The Brit Awards) named it &quot;Album of the Year&quot; in 1978. Jeff Lynne, the album's composer, received his first Ivor Novello award for Outstanding Contributions to British Music the same year.\n\nThe large spaceship on the album's cover (by now symbolic of the group) was designed by Shusei Nagaoka and Ria Lewerke with Kosh based on Kosh's earlier logo he designed for the previous album A New World Record which connected with Star Wars and Close Encounters of the Third Kind fever. It also looks like a space station with a docking shuttle from 2001: A Space Odyssey (1968). The number JTLA 823 L2 which is featured on the shuttle arriving at the space station is the original catalogue number for the album. The album also included an insert of a cardboard cutout of the space station. The space theme was carried onto the live stage in the form of a huge glowing flying saucer stage set, inside which the band performed.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:e5120f204c9b47aafb036e117c29c6a762318055","amp;dn":"Electric+Light+Orchestra+-+Out+Of+The+Blue+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5120f204c9b47aafb036e117c29c6a762318055","infoHashBuffer":{"type":"Buffer","data":[229,18,15,32,76,155,71,170,251,3,110,17,124,41,198,167,98,49,128,85]},"announce":[],"urlList":[]}}