{"title":"RADICI (Roots) S01e01 [Mux XviD - ITA ENG Mp3 - sub ITA] [Tntvil","uid":5134672,"size":764989826,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e52eeeea40cf4fa187c342663c18462ed0fd3c22&amp;dn=RADICI+%28Roots%29+S01e01+%5BMux+XviD+-+ITA+ENG+Mp3+-+sub+ITA%5D+%5BTntvil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darayava","files":2,"time":1256393175,"description":"Visit this info link: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=188732  Visit this link: http://img518.Imageshack.us/img518/2470/giornatamemoria288x150nx2.png\n\nRADICI (Roots)\nPrimo episodio\n\n\n Visit this link: http://uptiki.com/images/azilwmmhr7ziyrp4n547.jpg\n\n\nRadici ÃƒÂ¨ una miniserie televisiva realizzata negli Stati Uniti nel 1977 e basata sul romanzo omonimo di Alex Haley.\nLa serie ha realizzato gli ascolti piÃƒÂ¹ alti di tutti i tempi (130 milioni di telespettatori).\nFu segnalata per quasi una quarantina di Emmy Award e ne vinse nove. Fu inoltre premiata con un Golden Globe ed un Peabody Award.\nTra gli interpreti si segnalano LeVar Burton, Leslie Uggams, Ben Vereen, Brad Davis e Louis Gossett Jr.\nÃƒË† stata trasmessa per la prima volta in Italia da Rai Due in otto puntate a partire dall'8 settembre 1978.\nAd essa ÃƒÂ¨ seguita una seconda serie, Radici: le nuove generazioni (1979).\nVisit thelink:\nVisit the IMDB link: http://www.Imdb.com/title/tt0075572\n\n\nTrama\nUna storia lunga duecento anni, quella di una famiglia africana e del suo capostipite deportato nelle piantagioni americane, per raccontare le difficoltÃƒÂ  delle diverse generazioni, dagli antenati venduti come schiavi al lungo processo di emancipazione dei neri dopo la guerra civile americana.\n\nLe vicende narrate in Radici hanno inizio con la nascita di Kunta Kinte, nel 1750, nel villaggio di etnia mandinka di Juffure, in Gambia, nella valle del fiume Kambi Bolongo. Quando Kunta raggiunge l'adolescenza, nel villaggio hanno cominciato a circolare voci circa alcuni taubob (uomini bianchi) che si aggirano nella foresta. Nello stesso periodo, diversi uomini dei villaggi vicini spariscono senza lasciare tracce. All'etÃƒÂ  di 16 anni, Kunta si spinge nella foresta per cercare il legno adatto per fabbricare un nuovo tamburo; qui viene catturato da un gruppo di trafficanti di schiavi, che lo incatenano e lo trasportano in America.\nIn un'asta di schiavi, Kunta viene venduto per 850 dollari a John Waller della contea di Spotsylvania, in Virginia. Waller lo battezza &quot;Toby&quot; e lo mette a lavorare nelle sue piantagioni.\nNegli anni successivi Kunta tenta ripetutamente la fuga; ogni volta viene ripreso e punito sempre piÃƒÂ¹ severamente. Al suo quarto tentativo di fuga viene punito con l'amputazione di una parte del piede destro, per impedirgli di correre.\n\nVisit thelink:\n\nGenesi del romanzo\nHaley decise di scrivere Radici ispirato dalle numerose storie che la sua famiglia tramandava circa le proprie origini africane. In particolare, il suo interesse ebbe origine dalle storie che sentiva raccontare dalla nonna materna Cynthia, che era stata emancipata dalla schiavitÃƒÂ¹ nel 1865. A partire dai racconti della nonna, Haley ricostruÃƒÂ¬ le vicende del ramo materno della sua famiglia a partire dal suo antenato Kunta Kinte catturato dagli schiavisti in Gambia nel 1767 e deportato in America. La famiglia di Haley aveva tramandato per generazioni numerosi racconti sulla vita di Kunta Kinte, insieme ad alcune parole africane che lo stesso Kunta Kinte aveva insegnato alla figlia.(wikipedia)\n\n\n\nDati tecnici\n========================================\nNome..............: 1.avi\nDimensione........: 729 MB (or 747,058 KB or 764,987,392 bytes)\nDurata............: 01:32:13 (138,315 fr)\nVideo Codec.......: XviD\nVideo Bitrate.....: 838 kb/s\nRisoluzione.......: 640x480 (1.33:1) [=4:3]\nFPS (Frames/sec)..: 25.000\nQF (Frame quality): 0.109 bits/pixel\nAudio Codec.......: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate.....: 128 kb/s (64/ch, stereo) CBR \nFreq Audio........: 48000 Hz\nSottotitoli formato .srt\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:e52eeeea40cf4fa187c342663c18462ed0fd3c22","amp;dn":"RADICI+%28Roots%29+S01e01+%5BMux+XviD+-+ITA+ENG+Mp3+-+sub+ITA%5D+%5BTntvil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e52eeeea40cf4fa187c342663c18462ed0fd3c22","infoHashBuffer":{"type":"Buffer","data":[229,46,238,234,64,207,79,161,135,195,66,102,60,24,70,46,208,253,60,34]},"announce":[],"urlList":[]}}