{"title":"EASEUS Partition Master v5.5.1 Home Edition Portable","uid":5492486,"size":11879570,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e541e949662badc74038e00f610778a3cbbd5242&amp;dn=EASEUS+Partition+Master+v5.5.1+Home+Edition+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoExcuses","files":1,"time":1271089871,"description":"Easeus Partition Master v5.5.1 Home made Portable.\n\nNo need to install it!\nOr, if you want to, go to the link below. The program is free.\n\nEASEUS Partition Master Home Edition is a FREE  ALL-IN-ONE partition solution and disk management utility. It allows you to extend partition (especially for system drive), manage disk space easily, settle low disk space problem under Windows 2000/XP/Vista/Windows 7 (Only for 32 bit, figure out Windows 32 bit or 64 bit). The most popular hard disk management functions are brought together with powerful data protection including: Partition Manager, Partition Recovery Wizard and Disk &amp; Partition Copy Wizard.\n\nTop Benefits:\n\n    * FREE FOR HOME USERS. No Adware and Toolbar.\n    * Extend system partition to maximize computer performance.\n    * Partition Manager utility for better hard disk management and computer performance maximization.\n    * Partition Recovery Wizard to perform PC disaster recovery to save data.\n    * Copy Wizard to copy partition or migrate entire hard disk to another without Windows system reinstallation.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.partition-tool.com/personal.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.partition-tool.com/personal.htm&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:e541e949662badc74038e00f610778a3cbbd5242","amp;dn":"EASEUS+Partition+Master+v5.5.1+Home+Edition+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e541e949662badc74038e00f610778a3cbbd5242","infoHashBuffer":{"type":"Buffer","data":[229,65,233,73,102,43,173,199,64,56,224,15,97,7,120,163,203,189,82,66]},"announce":[],"urlList":[]}}