{"title":"(Blues) Rory Block - The Lady And Mr. Johnson","uid":6231979,"size":102700319,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e5a3228941ae24b9f1dc3919dd5c58aa2daeab25&amp;dn=%28Blues%29+Rory+Block+-+The+Lady+And+Mr.+Johnson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1299740750,"description":"Styles: Modern Acoustic Delta Blues\nRecorded: 2006\nReleased: 2006\nLabel: Rykodisc\nFile: mp3 @ 320 kbps\nSize: 96.1 MB\nTime: 40:54\nArt: Full Covers\n\n1. Cross Road Blues - 3:19\n2. Preaching Blues (Up Jumped the Devil) - 3:04\n3. Milkcow's Calf Blues - 2:29\n4. Walking Blues - 2:44\n5. 32-20 Blues - 4:15\n6. Rambling On My Mind - 2:59\n7. Terraplane Blues - 3:21\n8. Me And The Devil Blues - 3:17\n9. Last Fair Deal Gone Down - 3:22\n10. Come In My Kitchen - 3:09\n11. Hellhound On My Trail - 2:48\n12. If I Had Possession Over Judgement Day - 2:49\n13. Kind Hearted Woman Blues - 3:11\n\nPersonnel: \nRory Block - Guitar, Vocals\n\n\nOn Rory Block's masterpiece concept album, 'The Lady and Mr. Johnson', it becomes obvious that she and her guitar are one in the same. The two use each other and live through one another. Block's adoration for the blues has allowed her to explore its various sides, while always remaining true to the sound of her blues idols. Since she first became enthralled with the music of Robert Johnson, sometime around 1964, she had the goal of releasing an album of her covering select songs by the King of Delta Blues - and 42 years later, boy, did she ever do it. After years of studying and perfecting Johnson's style, Block refers to the album as her Ph.D. 'The Lady and Mr. Johnson' features Block at her Delta blues best. The entire album, save for a gospel choir intro on the first track, is entirely Block. It's just a woman, her voice, and her guitar. Block's guitar playing is impeccable, almost unbelievable as she has completely nailed Johnson's technique - adding a little 21st century edge to it without taking away from the original music's raw beauty. As with any cover album, certain songs work better for Block than others. Possibly the album's best track, for both its neck-chilling slide intro and Block's soulful vocals, is 'Last Fair Deal Gone Down,' and the same goes for 'Come in My Kitchen.' Until the winter of 2006, just months before Block released 'The Lady and Mr. Johnson', she had thought that Johnson had no living relatives, but had often desired to find any if they had existed. Turns out, he has a large family living in Mississippi, including his son. Block phoned the family and arranged a meeting. The album's artwork largely consists of various photos of Block with Johnson's son, grandson, and great grandson. 'The Lady and Mr. Johnson' is a flawless album, easily one of the few solid Delta blues releases by any artist in recent years, and could easily turn out to be Block's leading pride and joy of her entire career. \n\n","torrent":{"xt":"urn:btih:e5a3228941ae24b9f1dc3919dd5c58aa2daeab25","amp;dn":"%28Blues%29+Rory+Block+-+The+Lady+And+Mr.+Johnson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5a3228941ae24b9f1dc3919dd5c58aa2daeab25","infoHashBuffer":{"type":"Buffer","data":[229,163,34,137,65,174,36,185,241,220,57,25,221,92,88,170,45,174,171,37]},"announce":[],"urlList":[]}}