{"title":"The Ufo Files Vol. 2/4 ENG avi","uid":5043396,"size":732864512,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e5aaf9ac37b3bc8d55b58af0ad1b80dda12a6fe8&amp;dn=The+Ufo+Files+Vol.+2%2F4+ENG+avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Duracell72","files":1,"time":1249502049,"description":"The Ufo Files Vol. 2/4 ENG avi\n\n- ROSWELL\n- ROSWELL / AREA 51 CONNECTION\n- HUDSON VALLEY UFO\n- BELGIAN UFO\n- FALCON LAKE UFO\n- UFO HEALING\n\nThe Roswell incident is an event happened at Roswell (New Mexico, USA) in July 1947, in \n\nwhich the second dell'ufologia supporters there would be the crash of a UFO. The first \n\npress release published by the Roswell Air Base on 8 July 1947 he spoke in fact just a \n\n&quot;flying saucer&quot;. The official statement of U.S. authorities, however, was that it was a simple \n\nball probe. The theory of the fall of an alien artifact has become popular with the media and \n\namong ufologist, such that between June 2 and July 3 in 1947 would have occurred \n\nphenomena ufologist character in this city and in nearby Corona (California), culminating \n\nJuly 2 with the crash in the desert of a hypothetical spacecraft of extraterrestrial origin. \n\nThe story began July 3 1947 in Roswell, an isolated village of New Mexico, where the owner \n\nof a ranch, W. W. Mac Brazel, found the remains of the metal in the property where he \n\nworked for this and contacted the Sheriff of Roswell. \nFor ten days Roswell became caught the U.S. Air Force and the desert surrounding the city \n\nwas enclosed and kept under surveillance, after days of research Aeronautics reported \n\nthat the mysterious object fell at Roswell was a balloon probe that had detections on the \n\nweather. The Roswell Daily Record newspaper, 8 July 1947, announced on its front page \n\nthe &quot;capture&quot; of a &quot;flying saucer&quot;. The event found space in other local newspapers, to \n\nfilter later in the national, beginning with a real media phenomenon. \nOn 8 July of that year, he announced to the aviation radio and newspapers, that the \n\nmysterious accident was caused by a flying saucer. Came the FBI. \nAfter several days of discussions, the soldiers showed Roswell scrap a balloon, which was \n\nused for the research program Mogul, a surveillance system designed to monitor Soviet \n\nactivities in the nuclear field. \nOver the years there were several messages from the residents of Roswell about the Air \n\nForce and FBI. Some people said that sometimes the staff of the aircraft was carrying \n\nwreckage and bodies in non-human FBI truck. All these allegations were denied by the U.S. \n\ngovernment. \nSpouses Wilmot claimed later that one month before the accident they had seen a flashing \n\nobject on the road to Roswell, the couple reported that they fell from the car and they \n\nremained for about a minute to observe the object: this was apparently a oval-shaped and \n\nadopted a light, went very fast, but not issued any noise. \nAround June 3 local radio said that the farm of Foster had been found flying discs, the \n\nnews was interrupted dall'FBI that interrupted on that day all the radio programs of Roswell \n\nand Corona. \nFor about a week Brazel was accepted dall'aeronautica to say all he had seen at the ranch \n\nwhere he worked, when it was issued, denied that he had previously stated. \nThe newspapers that are dedicated to the Roswell event were many: most described the \n\nevent by giving credit to the hypothesis alien, then spoke of the crash of a UFO, some \n\nspoke instead of a cover (cover-up). It was the birth of a popular UFO conspiracy theory \n\nsurvived until today. \nAccording to ufologist June 30 of that year F. Kaufmann, NCO of a polygon of aeronautics, \n\nwas sent with a squadron in a stream, where they found a spaceship at a triangular shape, \n\nwith notches suscritte; within walking distance dall'astronave the squadron had found five \n\nbodies of extraterrestrials, and on site would be called for doctors to perform autopsies. \nThe FBI in July of 1947 had sent a telegram to J. Edgar Hoover, then director of the Federal \n\nBureau, which indicated the discovery of an extraterrestrial object array and its \n\ncomponents. \n\nInitial denials \n\nThe version of the discovery of a flying saucer was immediately denied by senior army. In \n\nparticular, by General Roger M. Ramey, who officially declared that those belonged to \n\nscrap high-altitude balloon Rawin probe used for meteorological research. The more Jesse \n\nMarcel was photographed with a scrap ball in hand. Following the denial of official \n\ngovernment local people who were witnesses of the facts declared stopped talking about it. \n\nThe army, in agreement with the government, claimed that it was merely allegations and the \n\ncivil authorities is adapted to this version of events. \n\nWitnesses \n\nThe first witness was a crash dell'ipotetico contadino of Corona, a Mac Brazel. The man \n\nclaimed to have heard a strong explosion from his ranch and that the next day, left home, \n\nnoticed fragments of strangers to him throughout his ranch and the surrounding area, the \n\nman brought the most to sheriff of Roswell, George Wilcox. The sheriff, in turn, judged them \n\nvery strange and led them to look at the military base in Roswell. Here, the more Jesse \n\nMarcel and the team deemed them not belonging to a missile or a balloon, but probably \n\nbelonging to a spaceship. \nThe news of the fall of a UFO was immediately contradicted by the press, in which senior \n\nmilitary communicate that more detailed research led to light the remains of a ball probe. \nThe then Lieutenant Walter Haut, who had a mandate to heal the public relations of the \n\nmilitary base in Roswell and was responsible for the famous press release of 8 July 1947, \n\nhe left a statement signed and sealed to be opened only after his death (on 15 December \n\n2005). In it he says in essence that the first version published in the press release in \n\nquestion was exactly truthful about the facts: &quot;I am convinced that what I personally looked \n\nwas a type of plane and its crew from another area.&quot; \n\nConspiracy theories and ufologist \n\nAccording to the proponents of the theory of the fall of a spaceship, the officers found the \n\nmain body of the disc wheel and a few miles away they found the bodies of the \n\nextraterrestrials that would have been driving underscores. \nAll this was brought to the military base to Wright Patterson and, after several years of \n\nresearch and studies, the UFO and the remains of aliens would be transferred within the \n\nso-called Area 51, a U.S. military base that for this reason since then has a People's level of \n\na certain reputation. \nAfter the Roswell case, the U.S. began to deny the hard UFO cases. This was interpreted by \n\nsupporters dell'ufologia and conspiracy theories as the beginning of a &quot;conspiracy of \n\nsilence&quot;, which would be the attempt by the governments of secretaire want the truth about \n\ncontacts with aliens. \n\nSantilli dell'autopsia movie of an alien \n\nIn 1991, a producer in London, the Ray Santilli, said they came into possession of a few \n\nreels of film to regain one of the aliens at Roswell precipitated in 1947. \nThe producer said that while looking for music videos of the famous singer Elvis Presley, a \n\nformer U.S. cameramen, Jack Barnett (pseudonym), had sold the film that showed the \n\nautopsy from two doctors to a hypothetical extraterrestrial, what according to ufologist is \n\nthe description of a gray medium. \nFilming in black and white, are sound and have some cuts. In 1994, the movie arrives in \n\nItaly, sent broadcast by the television program Rai Mysteries, led by Lorenza Foschini. \nThe sequences were very sensation but, as a result of numerous studies conducted on the \n\nframes and the presumed location of the laboratory, experts have classified the film as \n\nabsolutely false. Telephones, electrical outlets and other details that are classified in the \n\nshooting, are indeed anachronistic compared to 1947, the year of the alleged crash \n\nunderscores.","torrent":{"xt":"urn:btih:e5aaf9ac37b3bc8d55b58af0ad1b80dda12a6fe8","amp;dn":"The+Ufo+Files+Vol.+2%2F4+ENG+avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5aaf9ac37b3bc8d55b58af0ad1b80dda12a6fe8","infoHashBuffer":{"type":"Buffer","data":[229,170,249,172,55,179,188,141,85,181,138,240,173,27,128,221,161,42,111,232]},"announce":[],"urlList":[]}}