{"title":"Mysterious Creatures- A Guide to Cryptozoology, 2 Volume Set.","uid":5192463,"size":9398416,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5c86571306a1a8de17b31bdb1a9808d2af5de4e&amp;dn=Mysterious+Creatures-+A+Guide+to+Cryptozoology%2C+2+Volume+Set.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"smoothiee","files":-1,"time":1259772581,"description":"From Booklist\nBig Foot, mermaids, and the Loch Ness Monster are familiar to most readers, but hundreds of other equally strange creatures have been logged in this work for the high-school level and up. Some of these creatures, or cryptids, are real, some extinct, some legendary, some hallucinatory.\n\nThe purpose of the work is to seriously study cryptids as distribution anomalies, unknown variations of known species, survivors thought to be extinct, mythical animals, paranormal creatures with animal-like characteristics, and hoaxes. More than 1,085 unknown animals are covered in field-guide format, some with pictures or drawings. Most articles include an etymology of the name, scientific name if available, variant names, physical description, behavior, habitat, significant sightings, present status, and possible explanations, such as misidentification of a known species or survival of an extinct species. The articles end with lists of chronologically arranged sources, many of them primary materials, and include both print and Internet resources. There are also entries for 40 major cryptid categories such as birds and sea monsters; these entries have useful cross-references to entries on specific creatures. Following the A-Z entries are lists of 431 species discovered or rediscovered since 1900 (such as the thylacine, a canid marsupial of Australia believed to be extinct since 1936 but seen by reliable witnesses up to the present time) and freshwater bodies in which unknown animals have been reported. A geographical index and a &quot;Cryptid Index&quot; close the set.\n\nThis reference work is more scientific and comprehensive than Cryptozoology A-Z (Fireside, 1999) and will be an asset to public, school, and academic libraries where patrons are interested in cryptozoology. It is useful as a biological guide, a folklore reference, and a study of paranormal creatures.\n\nRBB\nCopyright Ã‚Â© American Library Association. All rights reserved\nProduct Details\n\n* Hardcover: 722 pages\n* Publisher: ABC-CLIO (December 17, 2002)\n* Language: English\n* ISBN-10: 1576072835\n* ISBN-13: 979-1576072836 ","torrent":{"xt":"urn:btih:e5c86571306a1a8de17b31bdb1a9808d2af5de4e","amp;dn":"Mysterious+Creatures-+A+Guide+to+Cryptozoology%2C+2+Volume+Set.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5c86571306a1a8de17b31bdb1a9808d2af5de4e","infoHashBuffer":{"type":"Buffer","data":[229,200,101,113,48,106,26,141,225,123,49,189,177,169,128,141,42,245,222,78]},"announce":[],"urlList":[]}}