{"title":"Red Riders - Drown In Colour [CD 2009 320k][Cov+CD][Bubanee]","uid":5007450,"size":96629001,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e5ea964be114067bfdcd9026d17fdacad3bf2046&amp;dn=Red+Riders+-+Drown+In+Colour+%5BCD+2009+320k%5D%5BCov%2BCD%5D%5BBubanee%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bubanee","files":14,"time":1247818710,"description":"In this collection i have included the covers and CD jpegs [Pictures]\nCD Rip to 320Kbps MP3\nPlease SEED for others to Enjoy!\nCheers, Bubanee\n\nRed Riders have scored some serious support slots over the past couple of years, opening for the likes of JET, Franz Ferdinand, The Living End and The Sleepy Jackson. On the face of it, this would place the Sydney four-piece on the way up, ready to break out as the next big thing on the local indie scene, and their sophomore LP Drown In Colour may well get them there.\nRed Riders's sound is fairly straight-ahead indie rock, replete with up-and-down guitar changes and the most syncopated drum lines heard since the Stone Roses debut album. Like many local alt-indie acts, the Red Riders occasionally sound somewhat derivative, at times strongly reminiscent of The Cure, U2, Franz Ferdinand and even Radiohead (minus the Thom Yorke-ness), but they get away with it by going all out and putting everything into the songs.\nWhile Drown in Colour is solid throughout, the standout, radio-friendly tracks are the strongest by far. This is particularly true of The Beginning of the End of the Night, which heavily references British indie ala The Charlatans, the anthemic Never Gonna Be Enough. The jaunty Over Again, album opener Tomorrow/Today and the moody, downbeat closer Farewell Cruel City are also choice picks from this excellent album.\nThere is no doubt that Red Riders wear their influences for all to see, but they give their songs so much energy and play with enough skill and conviction that it's hard not to like Drown In Colour.\n\nTracks:\n1. Tomorrow/Today\n2. Ordinary\n3. You've Got a Lot of Nerve\n4. Feels Like Grace\n5. All Mine\n6. So Long\n7. Over Again\n8. The Beginning of the End of the Night\n9. Never Gonna Be Enough\n10. The Siren Sings\n11. Farewell Cruel City","torrent":{"xt":"urn:btih:e5ea964be114067bfdcd9026d17fdacad3bf2046","amp;dn":"Red+Riders+-+Drown+In+Colour+%5BCD+2009+320k%5D%5BCov%2BCD%5D%5BBubanee%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5ea964be114067bfdcd9026d17fdacad3bf2046","infoHashBuffer":{"type":"Buffer","data":[229,234,150,75,225,20,6,123,253,205,144,38,209,127,218,202,211,191,32,70]},"announce":[],"urlList":[]}}