{"title":"R.E.M. - Accelerate (2008) WMA320","uid":6154768,"size":89668958,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e638b4480281cafd89b1b1db8415402e9885b685&amp;dn=R.E.M.+-+Accelerate+%282008%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1297004182,"description":"In the decade since the departure of drummer Bill Berry, R.E.M. could seem at times schizophrenic. Their albums of the era, which veered from the experimentalism of Up and reaffirmation of Reveal to 2004's more diffuse, reflective Around the Sun, often stood in stark contrast to the vibrancy of their live act. But here the alt-rock godfathers have resolved that dichotomy with their most focused and satisfying album in over a decade; a collection that doesn't so much revisit the bracing ethos of the band's '80s coming-of-age, as boil it down to its essence and supercharge it with the energy of their contemporary stage shows. That sensibility is evident from the opening track, &quot;Living Well's the Best Revenge,&quot; where Peter Buck's aggressive, distortion-drenched riffs and Michael Stipe's gruff snarl set the tone for &quot;Mansized Wreath,&quot; &quot;Horse to Water,&quot; and &quot;Supernatural Serious&quot;; rockers that bristle with the abandonment and aggressive energy of a band half their tenure. Yet it's no mere blast-from-the-past. The inclusion of the band's recent touring musicians (Scott McCaughey on second guitar and drummer Bill Rieflin) into the session mix, as well as working out much of the material live onstage in Dublin, has yielded something more sonically akin to R.E.M. 2.2. Stipe's penchant for the lyrically opaque has been largely supplanted by an edgy, articulate passion that variously explores &quot;Houston'&quot;s displaced Katrina refugees, the bluegrass-tinged &quot;Until the Day is Done,&quot; and the more typical, quiet self-examination of &quot;Hollow Man,&quot; before exploding in the album's unlikely, upbeat elegy &quot;I'm Gonna DJ,&quot; where singer and band find renewed hope in not only music, but themselves. \n\nby Jerry McCulley \n\nTRACKLIST:\n\n01 - Living Well Is The Best Revenge.wma                            \n02 - Man-Sized Wreath.wma                                            \n03 - Supernatural Superserious.wma                                   \n04 - Hollow Man.wma                                                  \n05 - Houston.wma                                                     \n06 - Accelerate.wma                                                  \n07 - Until The Day Is Done.wma                                       \n08 - Mr Richards.wma                                                 \n09 - Sing For The Submarine.wma                                      \n10 - Horse To Water.wma                                              \n11 - I'm Gonna Dj.wma\n\nWMA 320Kbps 44100Hz STEREO ","torrent":{"xt":"urn:btih:e638b4480281cafd89b1b1db8415402e9885b685","amp;dn":"R.E.M.+-+Accelerate+%282008%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e638b4480281cafd89b1b1db8415402e9885b685","infoHashBuffer":{"type":"Buffer","data":[230,56,180,72,2,129,202,253,137,177,177,219,132,21,64,46,152,133,182,133]},"announce":[],"urlList":[]}}