{"title":"Herman's Hermits - The Very Best Of  FLAC","uid":5604206,"size":604059787,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e6ae2ca13eae688b710ffe758e688717dc5bc615&amp;dn=Herman%5C%27s+Hermits+-+The+Very+Best+Of++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"keeybee","files":69,"time":1275492644,"description":"Please seed!\n\nHerman's Hermits were an English rock band, formed in Manchester in 1963 as Herman &amp; The Hermits. The group's management and producer, Mickie Most (who controlled the band's output), emphasized a simple, non-threatening and clean-cut image, although the band originally played R&amp;B numbers. This helped Herman's Hermits become hugely successful in the mid-1960s. Their first hit was &quot;I'm Into Something Good&quot; (written by US songwriters Gerry Goffin and Carole King), which reached No. 1 in the UK and No. 13 in the US in 1964. They never topped the British charts again, but had two US No. 1's with &quot;Mrs. Brown, You've Got a Lovely Daughter&quot; (originally sung by Tom Courtenay in a 1963 British TV play) and &quot;I'm Henry the Eighth, I Am&quot; (a British music hall song by Harry Champion dating from 1911). These songs were aimed at a US fan-base,\nwith Peter Noone exaggerating his Manchester accent; the band was not fond of either song and they were never released as singles in Britain.\nAnd yes, Trevor Peacock, one of the writers of &quot;Mrs. Brown, You've Got a Lovely Daughter&quot; is the very same who plays Jim &quot;no, no, no, no&quot; Trott in the Vicar of Dibley. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Herman%27s_Hermits&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Herman%27s_Hermits&lt;/a&gt;\n\nThis set is mostly in mono.\n\nHerman's Hermits - The Very Best Of Herman's Hermits [Disc 1]\nThis compilation 2005\n\n01  Herman's Hermits - The Very Best Of  - I'm Into Something Good\n02  Herman's Hermits - The Very Best Of  - Your Hand In Mine\n03  Herman's Hermits - The Very Best Of  - Show Me Girl\n04  Herman's Hermits - The Very Best Of  - I Know Why\n05  Herman's Hermits - The Very Best Of  - Silhouettes\n06  Herman's Hermits - The Very Best Of  - Can't You Hear My Heartbeat\n07  Herman's Hermits - The Very Best Of  - Wonderful World\n08  Herman's Hermits - The Very Best Of  - Dream On\n09  Herman's Hermits - The Very Best Of  - Just A Little Bit Better\n10  Herman's Hermits - The Very Best Of  - Take Love Give Love\n11  Herman's Hermits - The Very Best Of  - A Must To Avoid\n12  Herman's Hermits - The Very Best Of  - The Man With The Cigar\n13  Herman's Hermits - The Very Best Of  - You Won't Be Leaving\n14  Herman's Hermits - The Very Best Of  - Listen People\n15  Herman's Hermits - The Very Best Of  - This Door Swings Both Ways\n16  Herman's Hermits - The Very Best Of  - For Love\n17  Herman's Hermits - The Very Best Of  - No Milk Today (2003 Digital Remaster)\n18  Herman's Hermits - The Very Best Of  - My Reservation's Been Confirmed\n19  Herman's Hermits - The Very Best Of  - East West\n20  Herman's Hermits - The Very Best Of  - What Is Wrong - What Is Right\n21  Herman's Hermits - The Very Best Of  - There's A Kind Of Hush\n22  Herman's Hermits - The Very Best Of  - Gaslite Street\n23  Herman's Hermits - The Very Best Of  - Museum\n24  Herman's Hermits - The Very Best Of  - Moonshine Man\n25  Herman's Hermits - The Very Best Of  - I Can Take Or Leave Your Loving\n26  Herman's Hermits - The Very Best Of  - Marcel's\n27  Herman's Hermits - The Very Best Of  - Sleepy Joe\n28  Herman's Hermits - The Very Best Of  - Just One Girl\n\nHerman's Hermits - The Very Best Of Herman's Hermits [Disc 2]\nThis compilation 2005\n\n01  Herman's Hermits - The Very Best Of  - Sunshine Girl\n02  Herman's Hermits - The Very Best Of  - Nobody Needs To Know\n03  Herman's Hermits - The Very Best Of  - Something Is Happening\n04  Herman's Hermits - The Very Best Of  - The Most Beautiful Thing In My Life\n05  Herman's Hermits - The Very Best Of  - My Sentimental Friend\n06  Herman's Hermits - The Very Best Of  - My Lady\n07  Herman's Hermits - The Very Best Of  - Here Comes The Star\n08  Herman's Hermits - The Very Best Of  - It's Alright Now\n09  Herman's Hermits - The Very Best Of  - Years May Come Years May Go\n10  Herman's Hermits - The Very Best Of  - Smile Please\n11  Herman's Hermits - The Very Best Of  - Bet Yer Life I Do\n12  Herman's Hermits - The Very Best Of  - Searching For The Southern Sun\n13  Herman's Hermits - The Very Best Of  - Lady Barbara\n14  Herman's Hermits - The Very Best Of  - Don't Just Stand There\n15  Herman's Hermits - The Very Best Of  - Oh You Pretty Thing\n16  Herman's Hermits - The Very Best Of  - Leaning On A Lamp Post\n17  Herman's Hermits - The Very Best Of  - Hold On\n18  Herman's Hermits - The Very Best Of  - I'm Henry The VIII, I Am\n19  Herman's Hermits - The Very Best Of  - The End Of The World\n20  Herman's Hermits - The Very Best Of  - Mrs. Brown You've Got A Lovely Daughter\n21  Herman's Hermits - The Very Best Of  - I Gotta Dream On\n22  Herman's Hermits - The Very Best Of  - Dandy\n23  Herman's Hermits - The Very Best Of  - Don't Go Out Into The Rain (You're Gonna Melt)\n24  Herman's Hermits - The Very Best Of  - Heartbeat\n25  Herman's Hermits - The Very Best Of  - For Your Love\n26  Herman's Hermits - The Very Best Of  - Bus Stop\n27  Herman's Hermits - The Very Best Of  - Wings of Love\n28  Herman's Hermits - The Very Best Of  - The London Look","torrent":{"xt":"urn:btih:e6ae2ca13eae688b710ffe758e688717dc5bc615","amp;dn":"Herman%5C%27s+Hermits+-+The+Very+Best+Of++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6ae2ca13eae688b710ffe758e688717dc5bc615","infoHashBuffer":{"type":"Buffer","data":[230,174,44,161,62,174,104,139,113,15,254,117,142,104,135,23,220,91,198,21]},"announce":[],"urlList":[]}}