{"title":"Receiving Blessings from the Enlightened Ones Thaddeus Sanaya Ro","uid":5126023,"size":111219728,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e6af19c66a61d11a8baff4724b773b1fa1d8f590&amp;dn=Receiving+Blessings+from+the+Enlightened+Ones+Thaddeus+Sanaya+Ro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iloveabrahamhicks","files":5,"time":1255624751,"description":"Thaddeus calls upon three Enlightened Beings to transmit energy to you as you listen, to assist you in being liberated from whatever has kept you bound to a lesser level of light, to release pain and suffering, and to bring you blessings of inspiration, vision, wisdom, love, joy, abundance, and freedom. \n\nMusic is peaceful and harmonious, uplifting and reverential. It contains long sustained chords, angelic voices, orchestral, strings, and other sounds to lift you into higher states of consciousness as you listen. We use this music in our seminars often, and it is very popular.\n\nYou can play this music as background to help you sustain high, peaceful states, and to support feelings of joy and well-being. It can also assist you in shifting into spiritual spaces, and to maintain those spaces throughout the day. It can assist you in falling asleep at night, or at any time when you want to calm down or go at a slower pace, as it is very relaxing.\n\n1.Lord of Love\nThaddeus' music calls forth a great being who embodies Divine Love and offers you the blessings of love. Allow your heart to open and experience more of the love within and about you. Open to a higher expression of love in your life as you expand your compassion for yourself and others. Very harmonious, relaxing music, with long sustained notes, angelic voices, strings, and more.\n\n2.Lord of Harmony\nThaddeus' music calls upon the Lord of Harmony who radiates peace and harmony. Receive the blessings being offer to you as you listen to experience greater peace, to release battles, struggle, and pain, and to experience the peace and harmony of your Divine Self\n\n3.The Blessed One\nThis is one of the highest beings you can call upon to assist you in receiving the blessings of consciousness that lead to enlightenment and expansion of every level of your being. Music is very peaceful and relaxing, with long sustained notes and harmonies, angelic voices, strings, and more.\n\n4.Liberation \nExperience the light of your innermost Self, guided by the Enlightened Ones and Thaddeus' music. Contact with your Divine Self transforms your mind, body, emotions, and personality and brings freedom and liberation. This music was designed to assist you in releasing imprisoning thoughts, feelings, and beliefs that have bound you to a lesser level of light so your spirit can soar. Music is very reverential, has wonderful harmonies, angelic voices, strings, and more.\n\nEach musical program is 30-33 minutes in length and is ideal for meditation, healing, relaxation, and for pure listening enjoyment. &lt;a href=&quot;\nhttp://www.orindaben.com/catalog/prodno/MS213/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.orindaben.com/catalog/prodno/MS213/&lt;/a&gt;","torrent":{"xt":"urn:btih:e6af19c66a61d11a8baff4724b773b1fa1d8f590","amp;dn":"Receiving+Blessings+from+the+Enlightened+Ones+Thaddeus+Sanaya+Ro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6af19c66a61d11a8baff4724b773b1fa1d8f590","infoHashBuffer":{"type":"Buffer","data":[230,175,25,198,106,97,209,26,139,175,244,114,75,119,59,31,161,216,245,144]},"announce":[],"urlList":[]}}