{"title":"Programming Interactivity","uid":5074030,"size":10361107,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e6d6db95fca1528ba684d625987746fd1f8b6a35&amp;dn=Programming+Interactivity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Canoe171","files":-1,"time":1251662315,"description":"Make cool stuff. If you're a designer or artist without a lot of programming experience, this book will teach you to work with 2D and 3D graphics, sound, physical interaction, and electronic circuitry to create all sorts of interesting and compelling experiences -- online and off.\n\nProgramming Interactivity explains programming and electrical engineering basics, and introduces three freely available tools created specifically for artists and designers:\n\n    * Processing, a Java-based programming language and environment for building projects on the desktop, Web, or mobile phones\n    * Arduino, a system that integrates a microcomputer prototyping board, IDE, and programming language for creating your own hardware and controls\n    * OpenFrameworks, a coding framework simplified for designers and artists, using the powerful C++ programming language \n\nBTW, you don't have to wait until you finish the book to actually make something. You'll get working code samples you can use right away, along with the background and technical information you need to design, program, build, and troubleshoot your own projects. The cutting edge design techniques and discussions with leading artists and designers will give you the tools and inspiration to let your imagination take flight.","torrent":{"xt":"urn:btih:e6d6db95fca1528ba684d625987746fd1f8b6a35","amp;dn":"Programming+Interactivity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6d6db95fca1528ba684d625987746fd1f8b6a35","infoHashBuffer":{"type":"Buffer","data":[230,214,219,149,252,161,82,139,166,132,214,37,152,119,70,253,31,139,106,53]},"announce":[],"urlList":[]}}