{"title":"Michael Cremo - Hidden History of the Human Race (1993)","uid":6183908,"size":335935899,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e6e2ecd203e6c463a4ffb06b4fd2e07a2b6805ee&amp;dn=Michael+Cremo+-+Hidden+History+of+the+Human+Race+%281993%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DragonKP","files":-1,"time":1298052093,"description":"Hidden History - Archeology.\n\n-------\nFriendly WARNING for Audio Quality Purists:\nIt's COMPUTER GENERATED VOICE and NOT book read by human reader!\n\nIf you don't like this fact then simply DO NOT download it and complain later.\n-------\n\nSome info about book:\n\nHistory is the lie commonly agreed upon, according to Voltaire. Henry T. Ford updated the sentiment for the 20th century by saying that &quot;history is bunk.&quot;\n\nThe commonly accepted picture of prehistory (man evolved from apes via a &quot;missing link&quot; approximately 4 million years ago) may be largely incorrect as evidenced by a multitude of archeological finds that are routinely suppressed by mainstream science. Bones and artifacts have been discovered over the past two centuries showing that humans (like contemporary man) existed millions of years ago, but ruling archeologists use prejudices based on current scientific theory as a &quot;knowledge filter&quot; to suppress these finds when they write their textbooks. Instead, probable guesses are paraded as facts throughout our schools of primary, secondary, and higher learning.\n\nThe Hidden History of the Human Race by Michael A. Cremo and Richard L. Thompson, first published by Govardhan Hill in 1993, is a controversial challenge to rethink our understanding of human origins, identity and destiny. The authors call for a change in today's rigid scientific mindset and the accepted methods of science itself.\n\nStatus Quo Suppression\n\nA product of years of painstaking research, this book catalogues much of the mounds of evidence indicating the origin of the human race predates by millenia what is currently accepted. It also reveals how and why these finds have been suppressed, ignored, and forgotten. Reprinted with this article is a table listing several of these archeological finds and their age in millions of year (Myr.). When you read this book you will never cease to be surprised at how much archeological evidence has been &quot;buried&quot; by mainstream scientists.\n\nWho created a grooved metallic sphere 2.8 billion years ago, or the shoe print over 505-590 million years ago? While the ruling archeologists in the big universities are busy bickering over whether man originated 4 million years ago or 4.5 or 3.5, independent investigators continue to turn up human skeletons and footprints from 286-320 million years ago! &quot;My mind's made up, don't bother me with the facts&quot; is the pervading attitude that keeps the status quo in their positions of power, and ridicule is a great deterrent, especially when large egos are at stake.\n-----\n\nMore info at:\nArcheological Finds Debunk Darwinism. &lt;a href=&quot;\nhttp://www.henrymakow.com/forbidden_archeology.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.henrymakow.com/forbidden_archeology.html&lt;/a&gt;","torrent":{"xt":"urn:btih:e6e2ecd203e6c463a4ffb06b4fd2e07a2b6805ee","amp;dn":"Michael+Cremo+-+Hidden+History+of+the+Human+Race+%281993%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6e2ecd203e6c463a4ffb06b4fd2e07a2b6805ee","infoHashBuffer":{"type":"Buffer","data":[230,226,236,210,3,230,196,99,164,255,176,107,79,210,224,122,43,104,5,238]},"announce":[],"urlList":[]}}