{"title":"Fleetwood Mac - Tusk [promo].VOB","uid":6130471,"size":210534400,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e6fba4f478192a7c7aba7633da738dfc1bd94bc2&amp;dn=Fleetwood+Mac+-+Tusk+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1296109240,"description":"Fleetwood Mac - Tusk [promo].VOB\n\n\n\nHQ very rare promo music video. &quot;Tusk&quot; is a song by Fleetwood Mac from the 1979 double LP of the same name. The song reached #8 on the U.S. charts, #6 in the U.K. and #3 in Australia and Canada.\n\nLooking for a title track for the as yet unnamed album, Mick Fleetwood suggested that they took the rehearsal riff that Lindsey Buckingham used for sound-checks. Producers Richard Dashut and Ken Caillat hence created a drum-driven production.\n\nThe single was recorded live together with the supporting video at Dodger Stadium (without an audience) in Los Angeles, California in collaboration with the University of Southern California Trojan Marching Band. The performance was also filmed for the song's music video. John McVie was in Tahiti during the Dodger Stadium recording, but he is represented in the video by a cardboard cutout carried around by Mick Fleetwood and later positioned in the stands with the other band members.\n\nThe band's part would both set a record for the highest number of musicians performing on a single and earn the marching musicians a platinum disc. Lindsey Buckingham, Stevie Nicks and Mick Fleetwood presented it to the Trojan band on \nOctober 4, 1980 during a game at the Los Angeles Memorial Coliseum, this time in front of a huge crowd. The song was also performed live during Fleetwood Mac's concert in 1997 in conjunction with the Trojan band.\n\nThe single was released with two different picture sleeves in many territories: The first featured the black and white picture of a dog snapping at a trouser leg, the same as that used for the album cover, whilst the second featured a plain cover with the same font as the album cover but without the dog picture. A very limited promotional 12-inch version, featuring mono and stereo versions, was also released to US radio stations.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Tusk_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Tusk_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/HadjJaADI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/HadjJaADI&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7800kbps\n   Audio: PCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:14\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated September 7, 2010!\n\n*Media Player Classic Home Cinema*        &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:e6fba4f478192a7c7aba7633da738dfc1bd94bc2","amp;dn":"Fleetwood+Mac+-+Tusk+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6fba4f478192a7c7aba7633da738dfc1bd94bc2","infoHashBuffer":{"type":"Buffer","data":[230,251,164,244,120,25,42,124,122,186,118,51,218,115,141,252,27,217,75,194]},"announce":[],"urlList":[]}}