{"title":"Mercyful Fate - Live From The Depths Of Hell Complete  !!!!!!!","uid":6286018,"size":117283556,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e744eb6cffc7dd8b084e13dfaa05e85792d96fd2&amp;dn=Mercyful+Fate+-+Live+From+The+Depths+Of+Hell+Complete++%21%21%21%21%21%21%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":15,"time":1301615295,"description":"Created by Ratio: 0.52HeywoodPeace 16 hours ago\nMusic : Metal : MP3/256Kbps\nThis is a rare compilation of bootleg stuff released to the MF fan club. For many years I could never find a decent copy of this online. The only one I ever found sounded like it was recorded with a microphone up to a speaker. So a couple of years ago I decided to digitize my LP that I bought at an import shop as a teenager. Once I did so I realized that it could really use some work. The songs were from 3 shows, but jumbled up randomly. Parts were transferred out of phase. Parts sounded like crap. So I phase corrected the bad parts, took the bits of the separate shows and grouped them together and EQd them as well as possible. I then shared this on DC++.\n\nSince then I sold the album for a fair bit of cash. Then tragedy struck. An unfortunate harddrive crash left me without the lossless files, although I still had a CD burned of it. But again fate was out to destroy Fate. A girlfriend made off with about 700 CDS of mine, including this one. If not for my son having a backup mp3 in his collection the entire thing would have been lost for good.\n\nSo that is what I offer you here. Sorry I couldn't post a lossless version. I am working on getting a new copy now and will redo the work if it happens, but for now this is the best I can offer.","torrent":{"xt":"urn:btih:e744eb6cffc7dd8b084e13dfaa05e85792d96fd2","amp;dn":"Mercyful+Fate+-+Live+From+The+Depths+Of+Hell+Complete++%21%21%21%21%21%21%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e744eb6cffc7dd8b084e13dfaa05e85792d96fd2","infoHashBuffer":{"type":"Buffer","data":[231,68,235,108,255,199,221,139,8,78,19,223,170,5,232,87,146,217,111,210]},"announce":[],"urlList":[]}}