{"title":"Parliament Trombipulation .flac files","uid":6223733,"size":356838611,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e7a48b24be2c1edf8e8ee3ec23b27db2ab3ab944&amp;dn=Parliament+Trombipulation+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ulikes","files":13,"time":1299435548,"description":"Ill circumstances with George Clinton aside this is the final Parliament studio album on Cassablanca and interestingly enough it pointed to a very compelling change in direction. Now the same basic band that waxed P-Funk classics like Mothership Connection and instrumentally it\\'s also surprising how much this still resembles that era for the musical collective. Over the years,Digital Underground aside this album has gotton a lot ribbing from longtime P-Funk fans for a lot of different reasons.\n One of the things that does set this apart is the in terms of sound and songwriting this album is very much akin to the latter 70\\'s P-Funk sound which was now very much a sound a lot of funk bands were getting in on. Not only that but Bernie Worrell and Junie Morrison\\'s style of playing,as well as Clinton\\'s arrangements here are more fluidly arranged and tightly arranged than much of anything in the P-Funk world. Yes we all heard that change coming to some degree on \\&quot;Knee Deep\\&quot; and even One Nation Under a Groove and here it\\'s streched across the entire album. \n  Conceptually this album comes to something of a full circle for Parliament. The Sir Nose character is returning to the Pyramids to find his ancestors the Cro Nasal Sapiens and in the end seems to win out. What a metaphore for where R&amp;B was headed during the post disco freeze out in the early 80\\'s. Considering how much of a priority the characters of Starchild,Dr. Funkenstein and his clones had gotton on the 70\\'s Parliamnt albums it\\'s kind of fitting that this,to a degree extends on themes explored on the Motor Booty Affair. \n  Musically \\&quot;Crush It\\&quot;,\\&quot;Peek A Groove\\&quot; and to much larger extent \\&quot;Long Way Around\\&quot; and \\&quot;New Doo Review\\&quot; all embrace that tightly arranged and more stripped down sound (by P-Funk standards) with a mixture of choral vocals and orchestration that anticipates Prince\\'s similar hybrids of minimal funk and orchestral arrangements as well as,to a certain extent the new wave inflected \\&quot;naked funk\\&quot; that....P-Funk had helped to inspire to start with to a degree. Other songs such as the title song,\\&quot;Agony Of Defeet\\&quot; and the keyboard crazy\\&quot; \\&quot;Body Language\\&quot; are examples of the spirit of more traditional P-Funk if the style is that definable. \n  None really do so more as the famously sampled and very loopable on it\\'s own \\&quot;Let\\'s Play House\\&quot; with Bernie\\'s liquid synthesizers and the Horny Horns punctuating everything all the way. The excellent inner cover art,aside from it\\'s wittisisms also says a lot more than a lot of people might think. In it George Clinton is depicted with both the Sir Nose snout and a process hairstyle similar to what he had earlier in his career. Again it reflected the \\&quot;going back to go forward\\&quot; musical mentality to come so,in that sense as well as musically this album is very futurist even though it represents an ending of an era of sorts. Either way this is a highly underrated and listenable album that is sadly the only Parliament album to date that\\'s out of print domestically. \n  This is one of the hardest Parliament CD\\'s to get today. A new copy cost $118 on Amazon.com. I was able to get it for $40 on ebay used, which is about average today. The files are in the .flac format so you don\\'t lose any of the sound, and comes with the original artwork to use how you want. If you are a Funkadelic/Parliament fan bookmark my list because at some point I will be offering every one of their releases at some point.\n\nMp3 is dead! Long live Flac!!!!","torrent":{"xt":"urn:btih:e7a48b24be2c1edf8e8ee3ec23b27db2ab3ab944","amp;dn":"Parliament+Trombipulation+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7a48b24be2c1edf8e8ee3ec23b27db2ab3ab944","infoHashBuffer":{"type":"Buffer","data":[231,164,139,36,190,44,30,223,142,142,227,236,35,178,125,178,171,58,185,68]},"announce":[],"urlList":[]}}