{"title":"Reloading for Shotgunners, 5th Edition","uid":5020126,"size":169106239,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e902eb5577a8837b73be8572337b1fd0f5ce6a30&amp;dn=Reloading+for+Shotgunners%2C+5th+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RecycledElectrons","files":1,"time":1248425307,"description":"FORWARD: \n\nThe continually evolving nature of shot shell reloading\nis one of the most apparent things that set our hobby\napart from other pursuits. In my case, state of the art\nmakes it far more interesting to stand in front of a\nreloading press than say, a potter's wheel, with my fingers\nendlessly circumnavigating a clump of clay.\nChronicling the state of the art of shotshell ammunition is\nsimilar to the very nature of shotgun sports: getting a fix on\na moving target, calculating your lead and following through.\nIn Reloading for Sbotgunners^ 5t h Edition, Rick Sapp has\nstepped up to make some noise and break a few clays.\nModern, non-toxic pellets and the recipes to make\nshotgun ammunition are, in many cases, superior to similar\nlead-pellet loads.This is an outcome many of us hardly dared\ndream of 25 years ago, when it became federal law to use\nnontoxic pellets for migratory waterfowl hunting.At that\ntime, the ammunition industry had to re-examine everything,\nincluding the most fundamental question: &quot;What makes\nan effective shotshell?&quot; Everything until that point seemed\nrather self-evident.\nA modern shotshell is defined differently than it was\neven 10 years ago, when the previous edition of Reloading\nfor Sbotgunners was published with Mic McPherson and\nmyself contributing.Today, we have several new non-toxic\npellet choices for handloading. Some of these, like HeviShot,\nare denser than lead. In 2005, we can shoot waterfowl and\nupland game carrying favorite old double guns, loaded with\nBismuth NoTox pellets in any gauge, without worrying\nthat the pellets will damage our barrels and without leaving\ntoxic ejecta scattered in the marsh. Steel shot handloading\ncontinues to evolve over the course of time. Handloaders\nhave new powders with customized burn rates available;\nthese powders are specifically designed for steel shot\npayloads. We have improved, tweaked and designed steel\nshot load data, components and classifications in this time as\nwell. By any standard, modern steel loads are recognized as\nexcellent waterfowling ammunition. Furthermore, because\nsteel pellets are the new industry standard for waterfowl\nloads, their use has become an economical option.\nRick's perspective and research in Reloading for\nSbotgunners #5 are fresh.The book is not just a reference\nmanual; his writing style will keep you reading. Even if you\nalready know everything there is to know about reloading\nshotshells, reading this book adds up to a chance for you to\nsee your hobby in a different light - focusing perhaps on\npreviously unremarked contours of hand-loaded shells.\nThough time away from the potter's wheel may mean we\nuse store-bought coffee mugs and ashtrays, I contend that\nreloading shotshells is also a productive, useful way to spend\nsome leisure time. Reloading, for many of us, is a rewarding\npursuit, an end in itself, particularly if part of your enjoyment\ncomes from shooting the shells you make.This immediate\nfeedback will keep your brain in motion, considering\nimprovements for the &quot;next batch.&quot; For these reasons, making\n&quot;the best shotshell possible&quot; will remain forever interesting\nand grass will not be growing underfoot.","torrent":{"xt":"urn:btih:e902eb5577a8837b73be8572337b1fd0f5ce6a30","amp;dn":"Reloading+for+Shotgunners%2C+5th+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e902eb5577a8837b73be8572337b1fd0f5ce6a30","infoHashBuffer":{"type":"Buffer","data":[233,2,235,85,119,168,131,123,115,190,133,114,51,123,31,208,245,206,106,48]},"announce":[],"urlList":[]}}