{"title":"The Genius of Charles Darwin (Part 2 of 3)","uid":5024806,"size":366688256,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e924e8c3463a7886a511bb578c4189dfd5d8aa10&amp;dn=The+Genius+of+Charles+Darwin+%28Part+2+of+3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ILKnight","files":1,"time":1248640249,"description":"The best quality available in internet. Previous uploaded torrents have defects in the picture so I find it from other source and upload it again here.\n\nGood quality and defects free!\n\n\nDOCUMENTARY DETAILS:\n\nThe Genius of Charles Darwin is a three-part television documentary, written and presented by evolutionary biologist Richard Dawkins.\n\nIt was first shown in August 2008 on Channel 4. It won Best TV Documentary Series 2008 at the British Broadcast Awards in January 2009.\n\n\nPart 2: The Fifth Ape\nIn the second episode Richard Dawkins deals with some of the philosophical and social ramifications of the theory of evolution.\n\nDawkins starts out in Kenya, speaking with palaeontologist Richard Leakey. He then visits Christ is the Answer Ministries, Kenya's largest Pentecostal church, to interview Bishop Bonifes Adoyo. Adoyo has led the movement to press Kenya's national museum to sideline its collection of hominid bones pointing to man's evolution from ape to human. The collection includes the Turkana Boy discovered by Kamoya Kimeu, a member of a team led by Richard Leakey in 1984.\n\nDawkins discusses social darwinism and eugenics, explaining how these are not versions of natural selection, and that &quot;Darwin has been wrongly tainted&quot;.\n\nHe then meets with evolutionary psychologist Steven Pinker to discuss how morals can be compatible with natural selection. He goes on to explaining sexual selection, with peafowls as an example. To find out whether sexual selection plays a role for altruism and kindness among humans, he visits women who are looking for sperm donors, as well as a sperm bank manager. Dawkins also explains kin selection and selfish genes.\n\n\nYou can find the other parts in here:\nThe Genius of Charles Darwin (Part 1 of 2): http://thepiratebay.se/torrent/5030451\nThe Genius of Charles Darwin (Part 3 of 3): http://thepiratebay.se/torrent/5024808","torrent":{"xt":"urn:btih:e924e8c3463a7886a511bb578c4189dfd5d8aa10","amp;dn":"The+Genius+of+Charles+Darwin+%28Part+2+of+3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e924e8c3463a7886a511bb578c4189dfd5d8aa10","infoHashBuffer":{"type":"Buffer","data":[233,36,232,195,70,58,120,134,165,17,187,87,140,65,137,223,213,216,170,16]},"announce":[],"urlList":[]}}