{"title":"George Martin - Instrumentally Salutes 'The Beatle Girls'","uid":6281095,"size":57263598,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e991b7253366c41167b1145e43ee65c59f53a710&amp;dn=George+Martin+-+Instrumentally+Salutes+%5C%27The+Beatle+Girls%5C%27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lopow","files":13,"time":1301438651,"description":"George Martin - Instrumentally Salutes 'The Beatle Girls'\n\nGeorge Martin is best known as the producer of most of the Beatles' recordings from 1962 through 1969. His actual credits are diverse, encompassing artists ranging from 1950s jazz bandleader Humphrey Lyttleton, the comic talents of Peter Sellers and Michael Bentine, legendary vocalists like Ella Fitzgerald, and rock acts as different as Billy J. Kramer &amp; the Dakotas, America, Peter Gabriel, and Celine Dion.\nThe association with the Beatles alone made him the most well-known and successful record producer in the history of popular music. In the time of his own professional prime, that distinction might have rated him a mention in some trade magazines. But with over a billion copies sold of records and songs whose making he supervised (and they are still selling, with billions of pounds and dollars spent on them), he has earned a knighthood and been the subject of a 151-song, six-CD set devoted to his work as a music director. Few record producers -- John Hammond Sr., Sam Phillips, Leonard Chess, and Willie Dixon -- rate as his peer, in terms of influencing the shape and direction of music.\nGeorge Martin was born in 1926 in London. Although his family wasn't especially musically oriented, Martin became interested in the piano before the age of eight, and taught himself a good deal about the instrument. His education was disrupted by the economic depression that afflicted England during the 1930s, and then by the outbreak of war. In addition to music, Martin was drawn to architecture and design, and aeronautics, and at one point considered trying to become an aircraft designer. There were no opportunities available, however, and he was further thwarted when he was rejected in his bid to join the Royal Air Force, in hope of learning to fly. Instead, he joined the Fleet Air Arm, the aviation branch of the Royal Navy, where he was eventually trained and commissioned as a flying officer, but missed seeing any action by the abrupt end of the war in August of 1945. Martin was in uniform for another year, at the end of which, after passing through a clerk's job, he entered the Guildhall School of Music, studying composition, conducting, orchestration, and theory, and taking up the oboe as a second principal instrument.\n\n\n01.Girl\n02.Eleanor Rigby\n03.She Said She Said\n04.I'm Only Sleeping\n05.Anna\n06.Michelle\n07.Got To Get You Into My Life\n08.Woman\n09.Yellow Submarine\n10.Here, There And Everywhere\n11.And Your Bird Can Sing\n12.Good Day Sunshine\n\n\n256 kbps CD rip\n\nPlease seed! ","torrent":{"xt":"urn:btih:e991b7253366c41167b1145e43ee65c59f53a710","amp;dn":"George+Martin+-+Instrumentally+Salutes+%5C%27The+Beatle+Girls%5C%27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e991b7253366c41167b1145e43ee65c59f53a710","infoHashBuffer":{"type":"Buffer","data":[233,145,183,37,51,102,196,17,103,177,20,94,67,238,101,197,159,83,167,16]},"announce":[],"urlList":[]}}