{"title":"The Trip 1967 Full Untouched RIP Dennis Hopper","uid":5601952,"size":4391051973,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e9b996ce6e0010c0777fd9fa46fc91e2a8ac47be&amp;dn=The+Trip+1967+Full+Untouched+RIP+Dennis+Hopper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"shango","files":28,"time":1275366688,"description":"I shared this because this is a great movie and I love the hippie generation. I am very saddened to see Dennis Hopper die and I intend to share a few more of his greater/rarer movies. \n\nThis is a full untouched dvd ripped using anydvd. Please do your part and stop sharing 700mb and dvds ripped to fit on dvd5! This is 2010. People can learn how to shrink their own damn dvds and if you are still on dialup stop being a cheap fucker and get a job! If you dont own a dvd burner thats ridiculous.\n\nPaul Groves (Peter Fonda), a television commercial director, is in the midst of a personality crisis. His wife Sally (Susan Strasberg) has left him and he seeks the help of his friend John (Bruce Dern), a self-styled guru who's an advocate of LSD. Paul asks John to be the guide on his first &quot;trip&quot;. John takes Paul to a &quot;freak-out&quot; at his friend Max's (Dennis Hopper) pad. Splitting the scene, they score some acid from Max and return to John's split-level pad with an indoor pool. Paul experiences visions of sex, death, strobe lights, flowers, dancing girls, witches, hooded riders, a torture chamber, and a dwarf. He panics but John tells him to &quot;go with it, man.&quot; Would you trust John?  \n\n#  Format: Anamorphic, Closed-captioned, Color, Dubbed, DVD, Subtitled, Widescreen, NTSC\n# Language: English (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono)\n# Subtitles: English, Spanish, French\n# Region: Region 1 (U.S. and Canada only. Read more about DVD formats.)\n# Aspect Ratio: 1.85:1\n# Number of discs: 1\n# Rating: NR (Not Rated)\n# Studio: MGM (Video &amp; DVD)\n# DVD Release Date: April 15, 2003\n# Run Time: 168 minutes\n\nI believe the above info is correct and this may indeed include the movie psychout per amazon below: &lt;a href=&quot;\nhttp://www.amazon.com/Psych-Out-Trip-Susan-Strasberg/dp/B00008973J/ref=sr_1_1?ie=UTF8&amp;s=dvd&amp;qid=1275360780&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Psych-Out-Trip-Susan-Strasberg/dp/B00008973J/ref=sr_1_1?ie=UTF8&amp;s=dvd&amp;qid=1275360780&amp;sr=8-1&lt;/a&gt;\n\nI would have to look. I cant remember if this was the version that only included that movie or not.\n\nMy scifi movie list: &lt;a href=&quot;\nhttp://freetexthost.com/d3kg3o5t1x&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freetexthost.com/d3kg3o5t1x&lt;/a&gt;\n\nThese are the movies currently in my scifi directory. I have about 100 more to move around I just am fixing some stuff on my server. I have a lot of other really strange odd movies that I want to share as well. I thought I would hit a few sci fi movies for now but would take requests. I am not going to share the stuff that is easy to find or that is readily available through other torrents. I can make a list of my movie folder as well. I have my collection sorted by genre.\n","torrent":{"xt":"urn:btih:e9b996ce6e0010c0777fd9fa46fc91e2a8ac47be","amp;dn":"The+Trip+1967+Full+Untouched+RIP+Dennis+Hopper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9b996ce6e0010c0777fd9fa46fc91e2a8ac47be","infoHashBuffer":{"type":"Buffer","data":[233,185,150,206,110,0,16,192,119,127,217,250,70,252,145,226,168,172,71,190]},"announce":[],"urlList":[]}}