{"title":"Oingo Boingo - Little Girls [promo].mp4","uid":6164244,"size":236372838,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e9c081f398dcb62112e213eb5cead91271a80a43&amp;dn=Oingo+Boingo+-+Little+Girls+%5Bpromo%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1297329942,"description":"Oingo Boingo - Little Girls [promo].mp4\n\n\nHQ very rare promo music video. &quot;Little Girls&quot; is a song from Only a Lad, the full-length debut album by Oingo Boingo, released in 1981 following their self-titled EP. The album's musical arrangements, by vocalist Danny Elfman and guitarist Steve Bartek, complete the group's switch from a cabaret act to a New Wave band (see Oingo Boingo - The Mystic Knights Years). Only a Lad features complex and frequently changing time signatures and keys, often incorporating harmonies borrowed from jazz and 20-century classical music, all hallmarks of Elfman's songwriting.\n\nThe album's success was somewhat limited, but, largely due to the backing of Los Angeles radio station KROQ, the album established Oingo Boingo as a permanent fixture in the Southern California music scene.\n\nOn the cover of the album, if one looks closely at Johnny's (the &quot;Lad's&quot;) shirt, one would see the image of the cat drawn by Louis Wain that appeared on the cover of the Oingo Boingo EP\n\nOingo Boingo was an American new wave band. They are best known for their influence on other musicians, their soundtrack contributions and their high energy Halloween concerts. The band was founded in 1972 as a performance art group called The Mystic Knights of the Oingo Boingo, and from 1976 it was led by songwriter/vocalist Danny Elfman, who has since achieved substantial renown as a composer for film and television.\n\nThe group's format changed twice. In 1979, it changed from a semi-theatrical music and comedy troupe into a ska-influenced New Wave octet and shortened their name to Oingo Boingo. In 1994, the band reshuffled its lineup, adopted an alternative rock sound and rechristened themselves Boingo. The band retired after a farewell concert on Halloween 1995, having reverted to the name Oingo Boingo for the concert.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Only_a_Lad&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Only_a_Lad&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/IADicaaDm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/IADicaaDm&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG4 Video (H264) 640x480 29.97fps 8049kbps\n   Audio: AAC (Advanced Audio Codec) 48000Hz stereo 268kbps\n   Duration: 00:03:47\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated September 7, 2010!\n\n*Media Player Classic Home Cinema*        &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n","torrent":{"xt":"urn:btih:e9c081f398dcb62112e213eb5cead91271a80a43","amp;dn":"Oingo+Boingo+-+Little+Girls+%5Bpromo%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9c081f398dcb62112e213eb5cead91271a80a43","infoHashBuffer":{"type":"Buffer","data":[233,192,129,243,152,220,182,33,18,226,19,235,92,234,217,18,113,168,10,67]},"announce":[],"urlList":[]}}