{"title":"THE DOORS OF THE 21ST CENTURY - NEW YEARS EVE 2003-4","uid":5035814,"size":1134865023,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e9f4d6352a3457c3503bd0492a50d92eb869921a&amp;dn=THE+DOORS+OF+THE+21ST+CENTURY+-+NEW+YEARS+EVE+2003-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"trent_reznor","files":23,"time":1249115607,"description":"*** THE DOORS OF THE 21ST CENTURY ***\n\n*** LIVE IN LOS ANGELES, NEW YEARS EVE 2003-4 ***\n\ni have collected every Doors of the 21st Century recording (whether it's a bootleg or official release).   overall, this limited edition new years eve concert on 12-31-03 has the best overall sound and inspired performance of anything i have (in my opinion).   although jim morrison could never be replicated to the whole worlds satisfaction, ian astbury does a fantastic job singing and almost literally kicks the audiences ass into being the rowdy crowd the doors enjoyed performing for back in the 60's.   ray and robby are in perfect form - angelo barbera does a superb job on bass guitar - and they couldn't have a better guy on the drums than ty dennis - would've been nice to have densmore filling that corner of the diamond, but he opted out of the reincarnation band - why?   because he was burnt out and claimed he had tinnitus (regardless of being in a drum band) - so he sued ray and robby for using the name DOORS, subsequently won the case, and the doors of the 21st century then became &quot;riders on the storm&quot; - soon after this show, angelo barbera was replaced (by phil chen) due to his fear of flying (which is a big problem for overseas shows) - also, ian astbury eventually left to further the repertoire and legacy of &quot;the cult&quot;.   brett scallions stepped in as singer for the newly named &quot;riders on the storm&quot; band.   nothing against brett, but i think ian had the role nailed down about as good as it gets.\n\nSO, download these FLAC files created from the original discs, get your favorite buzz on, crank your stereo and enjoy!!\n\ni have plenty more shows and will upload some if requested.\n\nplease help SEED...  once your download is complete, leave your torrent active so others can download from you - you like fast DL speeds, so does everybody else.\n\nSEED!!!!!\n\ndownload my music at: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5037491&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5037491&lt;/a&gt;\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5037643/bill_dahlberg_-_parisian_dream_-_collaboration_with_jim_morrison&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5037643/bill_dahlberg_-_parisian_dream_-_collaboration_with_jim_morrison&lt;/a&gt;","torrent":{"xt":"urn:btih:e9f4d6352a3457c3503bd0492a50d92eb869921a","amp;dn":"THE+DOORS+OF+THE+21ST+CENTURY+-+NEW+YEARS+EVE+2003-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9f4d6352a3457c3503bd0492a50d92eb869921a","infoHashBuffer":{"type":"Buffer","data":[233,244,214,53,42,52,87,195,80,59,208,73,42,80,217,46,184,105,146,26]},"announce":[],"urlList":[]}}