{"title":"Disco_Ensemble-Back_On_The_MF_Street-(EP)-2009-FNT","uid":5053585,"size":41491446,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ea10a95e69ee377d2ee0b5454270cb49a149933f&amp;dn=Disco_Ensemble-Back_On_The_MF_Street-%28EP%29-2009-FNT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Omerta-U","files":9,"time":1250288055,"description":"- Release Info -------------------------------------------------------------- -\n\n  Artist:      Disco Ensemble\n  Album:       Back On The MF Street\n  Label:       Fullsteam Records\n  Playtime:    26:34 min\n  Genre:       Rock\n  URL:        &lt;a href=&quot; http://www.discoensemble.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.discoensemble.com/&lt;/a&gt;\n  Rip date:    2009-04-16\n  Street date: 2009-04-22\n  Size:        41.48 MB\n  Type:        Normal\n  Quality:     212 kbps / 4410kHz / Joint Stereo\n\n- Release Notes ------------------------------------------------------------- -\n\n   Living in Ulvila (a small town of 12.000 residents in the west coast of\n   Finland, close to the city of Pori), grade school classmates Jussi Ylikoski\n   and Mikko Hakila started playing together at the age of 12. The dynamic duo\n   learned their instruments by playing Metallica and AC/DC songs in Hakila's\n   parents' shed or outdoors. Having incorporated a bass player and a singer,\n   the group played their first live gigs in 1997. After a while, they chose to\n   be called DisCo. The name was born out of tongue-in-cheek idea of people\n   thinking that they're going to a regular disco but end up at a punk gig.\n\n\n   Digging bands like Refused and Snapcase, DisCo. got to play in the local punk\n   shows, mostly in the cellar of a semi-legendary squat/culture centre Annis in\n   Pori. Around the year 2000, Miikka Koivisto, the vocalist of another local\n   band, was asked to join DisCo. to play second guitar and eventually sing.\n   Being a fan of the group he agreed instantly. Around this time, a pop band\n   also called Disco emerged. Our quartet added the word &quot;Ensemble&quot; into their\n   name to avoid awkward mix-ups.\n\n\n   After the release of Ghosttown Effect EP. (2001) the boys started to work\n   with a D.I.Y. agent Juha KyyrÃƒÂ·, who eventually signed the band for his\n   newly-founded Fullsteam Records. Mikko, Jussi and Miikka all moved to\n   Helsinki to study. Helsinki-born Lasse Lindfors was found for the bass. Lasse\n   had plenty of experience as he had played with numerous groups, and was a\n   miraculously good fit.\n\n\n   In 2003, the debut album &quot;Viper Ethics&quot; received rave reviews and gained\n   Disco Ensemble a pole position amongst the indie/punk crowd. Splitting the\n   time between studies and rock'n'roll became harder and harder as the band\n   continued to play tons of club shows and festivals in Finland and embarked on\n   their first European tour.\n\n\n   The sophomore album First Aid Kit (2005) gave D.E. an even bigger push up the\n   ladder. The record hit the 9th spot in the official Finnish album chart and\n   the foursome were now considered to be the most popular alternative rock act\n   in Finland. Boasted to become the next big Finnish rock export, D.E. stepped\n   on the main stages of the biggest festivals on their home turf, earned slots\n   in Roskilde, Hultsfred, Rock am Ring/Park and Glastonbury, to name but a few,\n   and toured clubs relentlessly around Europe and the UK. The buzz around the\n   band led to an international record deal with Vertigo/Universal, who released\n   &quot;First Aid Kit&quot; in over 20 countries. The guys suddenly noticed that a vague\n   dream had become reality and a dear hobby had turned into full-day mayhem.\n\n\n   In the spring of 2008 D.E. release their third full-length album titled\n   &quot;Magic Recoveries&quot;. Produced by Pelle Gunnerfeldt (The Hives, Refused, The\n   Robocop Kraus), the record shows the band flourishing, stretching their\n   abilities as song writers and performers. Finding a perfect balance between\n   fury and grace, &quot;Magic Recoveries&quot; is a confident assortment of innovative\n   rock'n'roll, celebrating primal inspiration as the ultimate outlet in a\n   confusing world.\n\n\n   Dear Mr / Ms Journalist!\n   If you plan to ask Disco Ensemble a question about the origin of their\n   admittedly strange name, you will find the answer from the text above.\n   Further enquiries about the subject will be met with frustrating sighs and a\n   blunt, possibly totally made up answer. Thank you.\n\n- Track List ---------------------------------------------------------------- -\n\n  01. Back On The MF Street                                             ( 3:25)\n  02. Golden Years                                                      ( 3:29)\n  03. The Alps                                                          ( 4:26)\n  04. Abandoned                                                         ( 3:52)\n  05. Bad Luck Charm (Them Shepherds Remix)                             ( 6:21)\n  06. Bad Luck Charm (Mr. Velcro Fastener Remix)                        ( 5:01)\n\n- --------------------------------------------------------------------------- -\n\n\n\n","torrent":{"xt":"urn:btih:ea10a95e69ee377d2ee0b5454270cb49a149933f","amp;dn":"Disco_Ensemble-Back_On_The_MF_Street-%28EP%29-2009-FNT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea10a95e69ee377d2ee0b5454270cb49a149933f","infoHashBuffer":{"type":"Buffer","data":[234,16,169,94,105,238,55,125,46,224,181,69,66,112,203,73,161,73,147,63]},"announce":[],"urlList":[]}}