{"title":"Judas Priest - Unleashed In The East expanded and resequenced","uid":6206784,"size":544320633,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:eb27e3b23da40d4bef243239c7979bcacca5e4bf&amp;dn=Judas+Priest+-+Unleashed+In+The+East+expanded+and+resequenced&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Flyfisher61","files":26,"time":1298836939,"description":"Judas Priest\nUnleashed In The East\nFebruary 10, 1979 Koseinenkin Hall and\nFebruary 15, 1979 Nakano Sunplaza Hall\nJapan\n\n\nWhat we have here is the Unleashed In The East album resequenced to follow the actual setlist of the shows it was recorded at and with the extra non album tracks thrown in as well.\n\nI've always been a big fan of this album. I am an accomplished singer, and I owe it all to UitE. I found a Japanese version of this at a record show many years ago that featured extra tracks tacked on to the end and I was astonished and had to have it. My research showed that these were from the Japanese Epic/Sony release, titled Priest In The East, which included a 4-song bonus EP from the same shows, featuring: &quot;Rock Forever&quot;, &quot;Delivering The Goods&quot;, &quot;Hell Bent For Leather&quot; and &quot;Starbreaker&quot;. These songs were later added to the end of the worldwide release when the Priest remasters were released in 2001.\n\nTwo other songs, however, were not added back into the album. When the LP was initially released to the UK, it was given the title Unleashed In The East, and it too had a bonus EP that featured three songs from the same shows: &quot;Rock Forever&quot;, &quot;Hell Bent For Leather&quot; and &quot;Beyond The Realms Of Death&quot;. Although the first two were the same tracks as on the Japanese EP, the final song was unique to this release. A 15th track from the shows, &quot;Evil Fantasies&quot;, surfaced in 1980 as a B-side to the Living After Midnight 12&quot; maxi-single. Two additional songs performed at the Tokyo shows, &quot;White Heat, Red Hot&quot; and &quot;Take On The World&quot;, have never been released apart from bootlegs.\n\nAfter years of searching I recently managed to track down these two missing songs. They were on a Russian fan club compilation of all the unusual b-sides and remixes. Unfortunately they are mp3 sourced. I believe that whomever originally torrented the CD did it as this and that no lossless sources are circulating. Sometimes, as Jim Morrison advised, you have to take it as it comes.\n\nI resequenced the tracks from the CD in the order they were played at the Nakano Sunplaza show and added in the extra b-sides also. This is as complete a document of these shows as you are going to find in a professionally recorded release.\n\nIs it really live? A lot of people don't think so, but I found this page online &lt;a href=&quot;\nhttp://maddrakket.com/UNLEASHEDINTHEEAST.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://maddrakket.com/UNLEASHEDINTHEEAST.html&lt;/a&gt;\nthat states this:\n\nDuring the recorded Tokyo shows, Rob had been suffering from partial laryngitis, therefore his vocals weren't up to the standard of their usual shows. So during the mixing session at Ringo's place, a small party of people were in attendance and at one point, Rob was seen out on the patio wearing a set of headphones and singing his vocal lines into a microphone. Word leaked out about the vocals being redone and the rumors grew to the point where it was being reported that all the instruments were redone and the audience was a canned Japanese recording dubbed in. While the rumors were unfounded, it unfortunately prompting critics to call the album 'Unleashed In The Studio' and to this day, many fans are confused about the album's integrity. A rare bootleg of the February 15 show does a lot to prove the authenticity of the performance (Rob's voice only needed minimal repairs and the audience really did have that &quot;canned Japanese&quot; sound) and Priest's guitarists have confirmed that the band's musical parts are legitimately 100% live.\n\n\n01 Exciter\n02 Running Wild\n03 The Ripper\n04 Diamonds And Rust\n05 Rock Forever\n06 Beyond The Realms of Death*\n07 THe Green Manalishi (With The Two Pronged Crown)\n08 Delivering The Goods\n09 Sinner\n10 Evil Fantasies*\n11 Victim Of Changes\n12 Genocide\n13 Starbreaker\n14 Hell Bent For Leather\n15 Tyrant\n\n* originally mp3 sourced, but converted to lossless both to smoothly sequence into the album and to avoid further degradation\n\n\nSo there it is. Unleashed In The East (nearly) complete. Sorry. I have no skills with Photoshop, so the art still reflects the original tracklist.\n\nMore to come. Enjoy!","torrent":{"xt":"urn:btih:eb27e3b23da40d4bef243239c7979bcacca5e4bf","amp;dn":"Judas+Priest+-+Unleashed+In+The+East+expanded+and+resequenced","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb27e3b23da40d4bef243239c7979bcacca5e4bf","infoHashBuffer":{"type":"Buffer","data":[235,39,227,178,61,164,13,75,239,36,50,57,199,151,155,202,204,165,228,191]},"announce":[],"urlList":[]}}