{"title":"Japan (David Sylvian) - Quiet Life [1979, 320 kbps]","uid":5083670,"size":173302454,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eb2c64d41af06d343e486419591eba0b1900dc10&amp;dn=Japan+%28David+Sylvian%29+-+Quiet+Life+%5B1979%2C+320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"musicalibera","files":24,"time":1252541151,"description":"JAPAN - Quiet Life (1979)\n\nCodec: mp3.\nDescription: MPEG-1 Audio Layer 3.\nBit rate: 320 kbps.\nSample rate: 44100 Hz joint stereo.\nTags: ID3V1 &amp; ID3V2.\nSource format: CD, 2004 re-issue trks 1-10, 12-14 (see below).\nNumber of tracks: 14.\n\n\nAllmusic.com:\n&quot;Quiet Life is the album that transformed Japan from past-tense glam rockers into futuristic synth popsters, though they'd been leaning in that direction for a while. It's also a solid proto-New Romantic synthesizer record, enhanced by Mick Karn's superb fretless bass work and David Sylvian's smooth, sneering vocals spread over pop hits like the title track and &quot;Fall in Love with Me.&quot; \n\nAmazon.com reviews:\n\n&quot;Over their relatively brief recorded career--five studio albums--Japan made a huge about-face. From a glam-rock band with arty pretenses they became the epitome of the &quot;New Romantics&quot;, wearing their classical and world-beat influences on their ruffled sleeves. &quot;Quiet Life&quot;, the third of their five albums, is the first fully removed from traditional rock.\nThe title track opens the album with hectic drums and percolating synthesizers offsetting the tremendously controlled guitar and rubbery bass. This song, and indeed album, also introduce the style of vocals that David Sylvian would use for the rest of the band's career--a cross between David Bowie and Bryan Ferry that is much more pleasant to listen to than descriptions would indicate. &quot;Despair&quot;, with its piano, saxophone, and swelling synthesizer, is clearly modeled after thesecond half of Bowie's &quot;Low&quot;, as well as being the second of Sylvian's compositions paying overt homage to composer Erik Satie. A cover of the Velvet Underground classic &quot;All Tomorrow's Parties&quot; is completely dominated by Mick Karn's bass playing, though the rest of the band does their best to keep up. &quot;Quiet Life&quot; is an essential road sign in the career of a fascinating band.&quot;\n\n&quot;Quiet Life&quot; was an emormous leap for Japan. Released less than two years after their debut and just fifteen months after their most recent album, it seems as if just about everything about the band changed in that window. \nGone were the overt guitars, the aggressive rock songs, and nearly all of the glam overtones in the music. David Sylvian's compositions became more atmospheric, relying heavily on synthesizers rather than the guitars that were so prevelent and taking advantage of Mick Karn's saxophone talents to add more variety to the music. Equally critical were the stylistic developments of both Sylvian's vocal and Karn's bass playing-- coming nearer to their final sound, Sylvian sung in a more comfortable tenor-- not quite the smoky depth he'd pursue in his solo career, but without that nasal/glam edge he'd been singing with, and Karn totally embraced the fretless bass, having developed into the organic and rubbery sound that he would use for the remainder of his career. From the opener, this is clear--&quot;Quiet Life&quot; is synth driven, with a dance beat and glistening guitars providing a highlight. Rob Dean's guitar solo, when it arrives, it largely ebow driven, weaving in and out of the synthesizers. And while admittedly, there are songs that show the pedigree of the last album (the excellent &quot;Fall in Love With Me&quot;), largely it's this new synth pop direction that dominates (moody &quot;In Vogue&quot;, a superb cover of the Velvet Underground's &quot;All Tomorrow's Parties&quot;), with an occasional nod towards Sylvian's minimalist instincts as a composer that are starting to manifest (moody ballad &quot;Despair&quot;, closer &quot;The Other Side of Life&quot;). &quot;\n\n\n\nNote to Sony-BMG Music Entertainment (UK/Europe): the next time you release another repackaged/expanded/copy-protected and supposedly 'digitally remastered' version of this album, or any other Japan compilation a) could you do us all a favour and master all titles from the actual master tapes - including the bonus tracks - as opposed to from vinyl or in some cases very obviously cassettes? b) could you then do us all a favour and use some sort of tape-hiss noise reduction? c) could you do us all a favour and make sure that there are no sound drop outs on any of the tracks? d) could you do us all a favour and make sure that all tracks really are in proper stereo as opposed to one side of the two-track mix spread across both channels? e) could you do us all a favour and make sure that you don't accidentally delete the opening bar to any of the tracks? f) could you do us all a favour and make sure that you don't accidentally delete parts of the vocals on one of the tracks? f) could you do us all a favour and make sure that you don't accidentally delete the drums/bass/guitars/synths etc. on any of the other tracks? g) could you do us all a favour and make sure that you don't 'accidentally' include the album version of a track twice and then label one of them as &quot;12&quot; Mix&quot;, &quot;Extended Version&quot;, &quot;New Edit&quot; or &quot;Remix&quot;? h) could you do us all a favour and make sure that the tracks, versions and mixes listed on the album cover also are those on the actual disc? Thank you.\n  \nFor further info on Sony-BMG's re-issues of the Japan back catalogue: &lt;a href=&quot;\nhttp://www.nightporter.co.uk/pages/completedisc.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nightporter.co.uk/pages/completedisc.html&lt;/a&gt;\n\nTRACK LIST\n\nQuiet Life\n============\n01. Quiet Life (Album Version a.k.a. &quot;12&quot; Version&quot;)\n\n02. Fall In Love With Me\n\n03. Despair\n\n04. In Vogue\n\n05. Halloween\n\n06. All Tomorrow's Parties\n\n07. Alien\n\n08. The Other Side of Life\n\n+\n\n09. A Foreign Place (Non-album track, 1980)\n\n10. Quiet Life (7&quot; Fade-Out Version a.k.a. &quot;Single Version&quot;, 1980)\n\n11. Quite Life (7&quot; Edit a.k.a. &quot;Album Version&quot;, 1981)\n\n12. All Tomorrow's Parties (Alternate Version, 1981)\n\n13. All Tomorrow's Parties (Steve Nye 7&quot; Remix, 1983)\n\n14. All Tomorrow's Parties (Steve Nye 12&quot; Remix, 1983)\n\n\nEnjoy and - most importantly - share with your fellow man. A special thanks to all of you out there who have both downloaded and seeded these torrents so far.\n\n\n\n\n","torrent":{"xt":"urn:btih:eb2c64d41af06d343e486419591eba0b1900dc10","amp;dn":"Japan+%28David+Sylvian%29+-+Quiet+Life+%5B1979%2C+320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb2c64d41af06d343e486419591eba0b1900dc10","infoHashBuffer":{"type":"Buffer","data":[235,44,100,212,26,240,109,52,62,72,100,25,89,30,186,11,25,0,220,16]},"announce":[],"urlList":[]}}