{"title":"Harry Potter 4 (2005) - DvDrip - Omifast Greek","uid":5009519,"size":942854695,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eb5696514fd545c3de086794bb0458d9bdd4a38f&amp;dn=Harry+Potter+4+%282005%29+-+DvDrip+-+Omifast+Greek&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"OmifastGR","files":-1,"time":1247878145,"description":"Optional Greek Subtitles\n\nOriginal DvDrip to AVC H264 Nero Digital\n\n-----------------------------------------------------------------------------------\n\nHarry Potter and the Goblet of Fire (2005) &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0330373/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0330373/&lt;/a&gt;\n\nBeset by nightmares, Harry Potter is all too happy to escape his disturbing dreams by attending the Quidditch World Cup.\n\nBut something sinister ignites the skies at the Quidditch campsite--the Dark Mark, the sign of the evil Lord Voldemort.\n\nIt's conjured by his followers, the Death Eaters, who haven't dared to appear in public since Voldemort was last seen thirteen years ago--the night he murdered Harry's parents. Harry longs to get back inside the safe walls of Hogwarts School of Witchcraft and Wizardry, where Professor Dumbledore can protect him.\n\nBut Dumbledore announces that Hogwarts will host the Triwizard Tournament, one of the most exciting and dangerous of the wizarding community's magical competitions. One champion will be selected from each of the three most prestigious wizarding schools to compete in a series of life-threatening tasks in pursuit of winning the coveted Triwizard Cup.\n\nMinistry of Magic official Barty Crouch and Professor Dumbledore preside over a candlelit ceremony as the enchanted Goblet of Fire selects one student from each school to compete.\n\nAmidst a hail of sparks and flames, the cup names Durmstrang's Institute's Quidditch superstar Victor Krum, followed by Beauxbatons' Academy exquisite Fleur Delacour and finally, Hogwarts' popular all-around golden boy Cedric Diggory.\n\nBut then, inexplicably, the Goblet spits out one final name: Harry Potter. Suspecting that whoever entered Harry's name wants to put him in grave danger, Dumbledore asks Alastor &quot;Mad-Eye&quot; Moody, the eccentric new Defense Against the Dark Arts professor, to keep his magical eye trained on the teenage wizard. Events take an ominous turn when someone is murdered on Hogwarts grounds.\n\nAs they edge closer to the Triwizard Cup, Harry soon finds himself hurtling toward an encounter with true evil.\n\nAwards:\nNominated for Oscar. Another 9 wins &amp; 28 nominations &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0330373/awards&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0330373/awards&lt;/a&gt;\n\nStarring:\nDaniel Radcliffe, Rupert Grint, Emma Watson, Robbie Coltrane, Ralph Fiennes\n\nDirected by: Mike Newell\n\n-----------------------------------------------------------------------------------    &lt;a href=&quot;\nhttp://thepiratebay.se/user/OmifastGR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/OmifastGR&lt;/a&gt;\n\n\n!","torrent":{"xt":"urn:btih:eb5696514fd545c3de086794bb0458d9bdd4a38f","amp;dn":"Harry+Potter+4+%282005%29+-+DvDrip+-+Omifast+Greek","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb5696514fd545c3de086794bb0458d9bdd4a38f","infoHashBuffer":{"type":"Buffer","data":[235,86,150,81,79,213,69,195,222,8,103,148,187,4,88,217,189,212,163,143]},"announce":[],"urlList":[]}}