{"title":"The Norman Conquest, A Very Short Introduction","uid":6238864,"size":2888285,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb6fffb3038cc9fbaecaea1ed33ad8c47753303d&amp;dn=The+Norman+Conquest%2C+A+Very+Short+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"lkk100","files":-1,"time":1299979215,"description":"* Publisher: Oxford University Press, USA; 1 edition (January 4, 2010)\n* Language: English\n* ISBN-10: 0192801619\n* ISBN-13: 978-0192801616\n\nProduct Description\n\nThe Norman Conquest in 1066 was one of the most profound turning points in English history, dramatically transforming a disparate collection of small nations into a powerful European state. But what actually happened? How was the invasion viewed by those who witnessed it? And how has its legacy been seen by generations since? In this fascinating Very Short Introduction, George Garnett--a leading expert on the Norman Conquest and its aftermath--reveals how dramatically English life was changed, transforming everything from its language to its law, and introducing a more sophisticated form of government as well as an enduring and intense dislike of the French. He sheds light on the differing ways the conquest has been viewed by historians and in folklore over nearly a millennium, revealing how much of what we understand today about the Norman Conquest was colored by the values of the Victorian Age, and showing how historians have pieced together the events of 1066, including the invasion by William the Conqueror and its climactic moment at the Battle of Hastings.\nAbout the Author\n\nGeorge Garnett is Tutorial Fellow in Modern History at St Hugh\\'s College and St Hugh\\'s Tutor in Medieval History at Oxford University. He is the author of Conquered England: Kingship, Succession, and Tenure 1066-1166.\nProduct Details\n","torrent":{"xt":"urn:btih:eb6fffb3038cc9fbaecaea1ed33ad8c47753303d","amp;dn":"The+Norman+Conquest%2C+A+Very+Short+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb6fffb3038cc9fbaecaea1ed33ad8c47753303d","infoHashBuffer":{"type":"Buffer","data":[235,111,255,179,3,140,201,251,174,202,234,30,211,58,216,196,119,83,48,61]},"announce":[],"urlList":[]}}