{"title":"RONS MEGA COLLECTION-The Big Photoshop Bundle","uid":5608707,"size":2183855811,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ec31ec513c453f126b72f155f9ba49e75b7f745d&amp;dn=RONS+MEGA+COLLECTION-The+Big+Photoshop+Bundle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Godoid","files":599,"time":1275734004,"description":"# 51 Complete Graphics Packages\n# 41 High-Resolution Photoshop Brush Sets\n# 4 High-Resolution Pattern Sets\n# 7 Highly Detailed PDS File Sets, Featuring Solid Objects on Transparent Backgounds\n# 3 Easy to Apply Layer Styles\n# 2 Portable Freeware Brush Viewers\n\nThe Creator\n\nRon Deviney Works as an illustrator at Ft. Knox, Kentucky, for the US Military.\nHe started as a sign painter using paints and brushes, which no doubt gives Ron\nan affinity for Photoshop Brush Creation.\n\n* NEW Content\n\nCollection Contents\n\nAging Dirt And Grit - 45 High-resolution Photoshop brushes of dirt and grit. You can mix-n-match\nand use blend modes for Vintage looks with backgrounds, antiquing, aging effects, toning,\ngrudging, and overlay on art work to create a non-polished look and feel. These are huge\nbrushes that can easily be used in print work.\n\nArtistic Edges - 30 templates that can be used for clipping masks or frame and border effects.\nAll the pre-made artistic film type edge templates were made with my film edge Photoshop brushes.\nAn alpha channel is also included with every template.\n\nBirds - 140 High-Resolution Photoshop Brushes of Birds, silhouettes, flocks, flying, standing,\nsitting and some trees\n\nBlood - 45 High-Resolution Photoshop layers of blood on it's own transparent background\nready to drop in your frightfully shocking, terrifying, or revolting creation.\n\nBokeh - 181 High-Resolution Photoshop Bokeh Brushes, depicting glints, glares, flares and\nlighting effects. Bokeh (derived from Japanese boke a noun form of bokeru\n&quot;become blurred or fuzzy&quot;) is a photographic term referring to the appearance of out-of-focus\nareas in an image produced by a camera lens using a shallow depth of field.\n\nClearwater - 57 High-resolution Photoshop brushes of clear water effects such as splashes,\nthrown water, water fountains, showers, standing water, water streams, pouring water, droplets,\nobjects tossed in water, and so much more!\n\nCobwebs - 60 High-Resolution Photoshop Brushes featuring entangled meshes of webbing,\nfinely spun and highly detailed, to accent your horror art fantasy.\n\nConcrete Patterns And Brushes - 54 High-Resolution Seamless and Tiling Patterns and 72\nHigh-Resolution Photoshop Brushes, of concrete surfaces, textures cracks and other imperfections,\nall of which make a perfect addition to your graphics arsenal.\n\nCracks - 120 High-Resolution Photoshop Brushes of real genuine cracks of pavement, wood, ceramic,\nwalls and some hairline fractures. Also included are custom brushes to make your own cracks!\n\nCracks II - 59 High-Resolution New Photoshop Brushes in this, the second Crack Brush Set.\nIn this version is cracking and crumbling plaster walls, paint, rock, superfine hairline cracks\nand some special cracks of Glass, and dirt &amp; grit overlays\n\nDarkside Backgrounds - 10 Backgrounds in two Layered PSD Files, of Horror and grunge backgrounds,\ncreated with multiple layers (as many as 10 to 15 layers), overlaided with different blend modes\n&amp; blending options. The depth of detail and texture will make your project, really stand out.\n\nDead Tech - 110 High-Resolution Photoshop Brushes of rivets, nuts, bolts, welds, old military\nequipment, pipes, grunge edges, rusted overlays, whole bars w/rivets, aged textures, stains,\ndents, scratches, dirt and mechanical elements.\n\nExtreme Grunge - This complete package includes 66 high-resolution Photoshop brushes of some of\nthe nastiest and Extreme Grunge you might find; such as: barbed wire, metal mesh, industrial\nsludge gears, wires, faded/aging effects, bar codes, signs, numbers, rips, tears, scratches,\nrust, sprayed paint, weathered bits and pieces, urban grunge, and much more.\n\nFlames - 40 High-resolution Photoshop brushes of flames and fire. Plus 40 Additional traditional\nflames and a tutorial. The 'Flames' brushed have the real fire look and using the included PDF\ntutorial, you will be able to make astoundingly photorealistic flames for your creations.\n\nFlourishes - 651 High-Resolution Photoshop Brushes of swirls, curls &amp; twirls for the Photoshop\nuser. Each element was created by Ron Deviney using Adobe Illustrator and a WACOM tablet.\n\nFog - With these 69 High-Resolution Photoshop Brushes, it's easy to simulate a wide variety of\natmospheric effects. If you are trying to inspire, create a mood, or atmosphere with a range\nof feelings from solitude to serenity, then Rons Fog Brushes will bring clarity to your vision.\n\nGrunge - 73 Hi-res grunge brushes make it easy to add a grunge touches to any surface,\nbringing a depth of texture to progects and renders.\n\nGrunge 2 - 82 High-Resolution Photoshop Grunge Brushes of various surface materials and elements,\nfor Painting. There are splatter paint, postage marks, more half tones, torn book spines, signs,\nwords and letters, polar grids, coffee stains, grunge lines, and border effects.\n\nGrunge Edges - 101 High-Resolution Photoshop Grunge Edge Brushes and 8 Grunge Overlay Brushes.\nThese extraordinary brushes were 'Stamped' to create crackles, spots, faded areas and fine detail.\n\nGrunge Overlay - 50 High-Resolution Photoshop Brushes to give your images an attitude adjustment!\nDrop these overlays onto any image for an instant makeover. Add layer styles and different\nblend modes for subtle or dramatic effects for unlimited creations.\n\nHi-Tech Cityscape - 84 High-Resolution Photoshop Brushes of industrial and architecture\nstructures, which will create the look of Hi-Tech detail, quickly to add depth of texture\nto accentuate the industrial look.\n\nNatural Grunge Patterns - 64 High-Resolution, seamless and tiling patterns of natural and organic\nsubjects, to add that extra touch of texture to projects.\n\nNuts Bolts And Holes - 164 High-Resolution Photoshop Brushes of nuts, bolts, and holes with\nlittle surprises. A real time saver for designers and artists, which will make your\ndesigns sizzle\n\nOld Style Patterns - 60 High-Resolution, seamless and tiling patterns of all things OLD and\nweathered, to add that extra touch of texture to your projects.\n\nPinstriping - 280 Original hand crafted High-Resolution designs most over 2000 px. This Brush\nset features Center and Edge designs, plus Mirrored images. The elements are free flowing and\norganic, mimicking hand brushed pinstriping, using paint and a 'dagger'.\n\nRons Designs - 18 High Resolution Unique Themed Backdrops in Layered Photoshop PSD File format.\nUsing these robust and highly customisable illustrations, you can push the creative\nboundries of any project.\n\nand many more\n\nBrush Viewing Utilities\n\nABRView Portable Photoshop Brush Viewer - Portable Photoshop Brush Viewer (Freeware). Automatically\ngenerates Brush Thumbnails and a collage view, in the ABRView.exe location.\n\nABRViewer.NET Portable Photoshop Brush Viewer - Portable Photoshop Brush Viewer (Freeware).\nOpens Photoshop Brush Files (ABR) anywhere on the system and / or \nGenerates Brush Thumbnails and saves them to any location.","torrent":{"xt":"urn:btih:ec31ec513c453f126b72f155f9ba49e75b7f745d","amp;dn":"RONS+MEGA+COLLECTION-The+Big+Photoshop+Bundle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec31ec513c453f126b72f155f9ba49e75b7f745d","infoHashBuffer":{"type":"Buffer","data":[236,49,236,81,60,69,63,18,107,114,241,85,249,186,73,231,91,127,116,93]},"announce":[],"urlList":[]}}