{"title":"Monty Python's Personal Best Six-Pack (Multisubs)","uid":6221410,"size":17562796032,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ec4e3f9c2e161abbffc1569e2497fa9e40357fa4&amp;dn=Monty+Python%5C%27s+Personal+Best+Six-Pack+%28Multisubs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":6,"time":1299343182,"description":"Monty Python's Personal Best is a miniseries of six one-hour specials, each showcasing the contributions of a particular Monty Python member. Produced by Python (Monty) Pictures Ltd., the series first aired on PBS stations February 22, 2006, though two episodes were initially released on Region 1 DVD in 2005; the remaining episodes were released in late February 2006.\n\nThe five surviving members (Eric Idle, Terry Jones, Terry Gilliam, Michael Palin and John Cleese) were invited to select favourite sketches they wrote or starred in, from the Monty Python's Flying Circus TV series as well as the troupe's films. \n\nAll five collaborated on the sixth episode, a tribute to deceased Python Graham Chapman.\n\nWith the exception of Graham Chapman's episode, each Personal Best segment features one or more wraparound sketches written by and starring the featured member:\n\n* Eric Idle's Personal Best: Reporting live from the Bollywood Howl [sic] , a newscaster (Eric Idle) introduces his interviews with several people about what they thought about Eric Idle, including Idle's mother and a former Nazi soldier living in South America (both also played by Idle). Throughout the segments, the reporter confuses the members of Python with The Beatles, an homage to Idle's work on All You Need Is Cash, a parody film featuring The Rutles.\n\n* John Cleese's Personal Best: The show begins with a plaintext &quot;memorial&quot; to the &quot;late&quot; John Cleese. It then cuts to a fairytale starring the troupe (&quot;The Princess With The Wooden Teeth&quot; from Monty Python's Fliegender Zirkus), which then cuts to a poolside interview of a cranky, senile old man (Cleese) by Dayna Devon, a reporter. The supposedly 96-year-old Cleese usually answers her questions in the raunchiest manner possible, culminating in his &quot;death&quot; (by heart attack, apparently) at the end of the show. This caused an Internet crisis, with many Python fans asking on sites whether Cleese had actually died.\n\n* Terry Gilliam's Personal Best: The show begins with Gilliam claiming Monty Python's Flying Circus was originally to be his show alone, with animations only. The &quot;viewer&quot; flips a switch that turns on the lights to reveal that Gilliam and his workshop are really animations. General pandemonium ensues as the episode shows a vast collage of Gilliam's famously neurotic animations.\n\n* Michael Palin's Personal Best: The show is a pseudo-documentary about fish-slapping, with Michael Palin playing the same character he played in the original sketch hosting the show. The sketches are supposedly added because the show originally introduced the world to fish-slapping. Michael Palin &quot;travelling&quot; to the original filming location of the Fish-Slapping Dance jokingly references his current popularity as a travel documentarian.\n\n* Terry Jones' Personal Best: From his lavish home, Jones discusses how he conceived of Monty Python as a showcase for his own considerable talents, how he reluctantly let the other members join and that 'Monty Python' is an anagram from 'Terry Jones'. Several sketches are personally (and often inaccurately) introduced by Jones.\n &lt;a href=&quot;\nhttp://pics.coldline.hu/pics/187256-20110302-O2IUP1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pics.coldline.hu/pics/187256-20110302-O2IUP1.jpg&lt;/a&gt;\n\nDVD-PAL-ISO\n\nMonty Python's Personal Best - Eric Idle\nMonty Python's Personal Best - Graham Chapman\nMonty Python's Personal Best - John Cleese\nMonty Python's Personal Best - Michael Palin\nMonty Python's Personal Best - Terry Gilliam\nMonty Python's Personal Best - Terry Jones\n______________________________________________________________________\n\nSubtitles: Arabic, Chech, Croatian, Danish, Dutch, English, Finish, French, German, Greek, Hindi, Hungarian, Icelandic, Norvegian, Polish, Portuguese, Romanian , Spanish, Slovenski, Swedish, Turkish.\n","torrent":{"xt":"urn:btih:ec4e3f9c2e161abbffc1569e2497fa9e40357fa4","amp;dn":"Monty+Python%5C%27s+Personal+Best+Six-Pack+%28Multisubs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec4e3f9c2e161abbffc1569e2497fa9e40357fa4","infoHashBuffer":{"type":"Buffer","data":[236,78,63,156,46,22,26,187,255,193,86,158,36,151,250,158,64,53,127,164]},"announce":[],"urlList":[]}}