{"title":"The Rolling Stones - Sticky Fingers (1971) WMA320","uid":6308051,"size":118982592,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ec60664498f9898a57350aed3bcb643aa4208b5b&amp;dn=The+Rolling+Stones+-+Sticky+Fingers+%281971%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1302426770,"description":"When the Technicolour dream of the 1960s finally ended, it was time to face the reality of the new decade, especially for rock bands. The Beatles bowed out early, so their friendly rivals the Rolling Stones were left standing to sit atop the throne. However, that is not to say things happened to the band behind the scenes that could easily have caused them to go the Beatles' way. \n\nFormer guitarist Brian Jones died mysteriously on July 3, 1969, and had been replaced by Mick Taylor only a few songs into the sessions for LET IT BLEED. December 6 of that year was the infamous Altamont free concert that officially signified the dream of peace &amp; love was over. But instead of coming unglued, the Stones were merely softened (at least temporarily), and thus encouraged to become more introspective. 1971's STICKY FINGERS was certainly their lowest-key album yet, save for some obvious rockers. \n\nThat STICKY FINGERS manages to be a uniformly outstanding affair is a wonder considering that the songs were recorded in different places at different times, rather than going for a certain ambience in that one studio. It also even had songs that were essentially outtakes, but went on to become classics all the same. That is right, &quot;Brown Sugar&quot; &amp; &quot;Wild Horses&quot; had been recorded in Muscle Shoals, during the Stones' infamous 1969 American Tour. That they stand as some of STICKY FINGERS' hardest tracks comes as no surprise. \n\nYes, &quot;Brown Sugar&quot; became the Stones' sixth #1 hit in America in spite of (or maybe because of) its questionable lyrics that were either racist, sexist, drug-related...or all three. Still, even the most politically correct listeners cannot deny that it is one of the Stones' gloriously rocking tunes ever, especially with Keith Richards' most inventive opening guitar riff until &quot;Start Me Up&quot;. Jim Price &amp; Bobby Keys' horns still manage to cut through the aural hysteria like a razor. \n\nEven the considerably more subdued &quot;Wild Horses&quot; has a pronounced edge to it, managing to sound heartwarming even with a vocal from Mick Jagger that was probably rough from cigarettes &amp; alcohol. Sure, it only reached #28 &amp; does not get the kind of airplay &quot;Brown Sugar&quot; still does, yet &quot;Wild Horses&quot; showed the Stones were still releasing quality singles at a time when AM Gold pop was reigning supreme. \n\n&quot;Can't You Hear Me Knocking&quot; is more like an embryonic song idea that is just the launching pad for a 7-minute scorching jam that is not unlike what Santana would have created on any of their first 3 albums. \n\nThe only other song on STICKY FINGERS that equals the madness of &quot;Brown Sugar&quot; is &quot;Bitch&quot;, once again with the horns practically being the main reason why it rocks so hard. Of course, the tendency is to assume a legendarily-chauvinistic band like the Stones is creating yet another song about a bad little woman. But however, the song basically is saying that life is a bitch, not a certain unnamed female. I wonder if calling the song by this name was rather revolutionary for 1971 (considering the eventual controversy over 1973's &quot;Star Star&quot;). \n\nWith a great part of STICKY FINGERS having been recorded at Mick Jagger's house with the Stones' newly-built mobile unit, there you have the reason why the album has a reputation of being one of their looser, less heavy affairs. The aforementioned &quot;Bitch&quot; was recorded there, but about everything else was more mellowed, yet uneasily so. &quot;Sway&quot; has a menacing vibe to it even with a rhythm that invites the title action rather than headbanging. \n\nThe Stones return to their blues roots with Reverend Gary Davis' &quot;You Gotta Move&quot; which follows &quot;Street Fighting Man&quot;'s method of creating an air of terror without an electric guitar in sight. Aerosmith's recent cover has absolutely nothing on the Stones' take, showing that not all white boys have soul, but a few have been blessed. \n\n&quot;I Got The Blues&quot; is said to have been the song that inspired Jon Bon Jovi to start writing songs, and maybe he knows something other listeners do not because it is indeed one of the Stones' truly lost classics. Sounding like a lost Stax outtake, the horns again come close to stealing the show, alongside Billy Preston's trusty organ work. Oh, how people like Otis Redding or Wilson Pickett could have tore this one up! \n\nThe drug exploits of the Stones in the 1970s (especially those of Keith Richards) are foreshadowed eerily on &quot;Sister Morphine&quot;, partly inspired by Mick Jagger's then-girlfriend Marianne Faithfull's near-fatal heroin overdose. One song that is openly scary &amp; not afraid to be so, even now, you may want to listen to this song only in the daytime, and even better, it may scare you off drugs for good. \n\nTowards the end of STICKY FINGERS, the nightmarish atmosphere somewhat lifts on the final two tracks. &quot;Dead Flowers&quot; sends up twang-heavy country music even as it manages to be a fine document of the genre itself. I cannot find a song that has a major Keith Richards influence (he had just begun to sing lead on a song or two per album), but given his friendship with country-rock pioneer Gram Parsons, I can guess this would be a reasonable antecedent. &quot;Dead Flowers&quot; also manages to be yet another inventive way of telling a mistreating mate where to go. \n\nThe sun then finally rises on the closing &quot;Moonlight Mile&quot;, which gives probably the best idea of the communal vibe that surrounded STICKY FINGERS &amp; would continue onto 1972's EXILE ON MAIN ST. The strings &amp; vocals may have been added later, but the rest of the music was done live, and the warmth it all radiates is palpable. After a nearly 40-minute long musical bad dream (but a glorious one nevertheless), &quot;Moonlight Mile&quot; is the song that helps you realize it was one after all. \n\nWhile the Beatles may have caved in before the decade was barely new, the Rolling Stones proved to be just at the beginning of their superstar period when STICKY FINGERS became their first #1 album in 6 years, and also was the first in an enviable stretch of 8 consecutive albums to top the charts. Some would say a few of those reached that position undeservedly, but you certainly could not include STICKY FINGERS in that category because it managed to rock like hell even when the menace was more seductive than violent.\n\nby Eric N Andrews\n\nTRACKLIST:\n\n01 - Brown Sugar.wma                                                  \n02 - Sway.wma                                                         \n03 - Wild Horses.wma                                                  \n04 - Can't You Hear Me Knocking.wma                                   \n05 - You Gotta Move.wma                                               \n06 - Bitch.wma                                                        \n07 - I Got The Blues.wma                                              \n08 - Sister Morphine.wma                                              \n09 - Dead Flowers.wma                                                 \n10 - Moonlight Mile.wma\n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!\t","torrent":{"xt":"urn:btih:ec60664498f9898a57350aed3bcb643aa4208b5b","amp;dn":"The+Rolling+Stones+-+Sticky+Fingers+%281971%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec60664498f9898a57350aed3bcb643aa4208b5b","infoHashBuffer":{"type":"Buffer","data":[236,96,102,68,152,249,137,138,87,53,10,237,59,203,100,58,164,32,139,91]},"announce":[],"urlList":[]}}