{"title":"Magic Matt Ellison Triple Impact","uid":6173103,"size":91061076,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ed309a868967c468cc5f8d01706825a0a8926b80&amp;dn=Magic+Matt+Ellison+Triple+Impact&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cheekychap","files":11,"time":1297661042,"description":"If you enjoy this, and want many more other killer effects,\n\nThen you are welcome to come share with us on www.magicprop.com on the 20th, as we are a Unique LEVEL 10 Tracker\nSo read the txt file, and screeners for a demo of what we have\n\n\nTriple Impact will totally blow your spectators away with an impossible triple prediction that is so clean your spectators will question their own free will!\n\nA spectator cleanly selects 3 cards from a red deck and places them in to 3 separate pockets of his choice. With no fishing or funny moves the magician/mind reading guru reaches into his top pocket and removes a blue backed prediction card, your spectator removes the red back card, which he freely placed in to his top pocket, and they match! (same card, same pocket).\n\nThe magician now removes a card from his right hand pocket, the spectator does the same and they match (same card, same pocket, and remember the magician removes his prediction first so it is in full view).\n\nThe tension is building as the magician reaches in to his left hand pocket and removes a card, the card is shown, and yes it matches the spectator's card (once again same card, same pocket).\n\nYour audience will truly believe that the future is in your control.\n\nThis is a self-working masterpiece in mental magic.\n\n* No Sleight Of Hand.\n* Easy To Do.\n* Only one prediction card is in each pocket. Your pockets may be freely shown empty after each prediction card is removed.\n* Nothing added or taken away from the pockets or the deck at any time.\n* No Palming.\n* No Rough and Smooth.\n* The Predictions are in your pocket before you start.\n* Easily reset and extremely practical.\n\nThis is one effect that you will be asked to perform time and time again! In the midst of the many card tricks available today, Triple Impact is something you will USE for many years to come!\n\n\nIf you enjoy this, and want many more other killer effects,\n\nThen you are welcome to come share with us on www.magicprop.com on the 20th, as we are a Unique LEVEL 10 Tracker\nSo read the txt file, and screeners for a demo of what we have","torrent":{"xt":"urn:btih:ed309a868967c468cc5f8d01706825a0a8926b80","amp;dn":"Magic+Matt+Ellison+Triple+Impact","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed309a868967c468cc5f8d01706825a0a8926b80","infoHashBuffer":{"type":"Buffer","data":[237,48,154,134,137,103,196,104,204,95,141,1,112,104,37,160,168,146,107,128]},"announce":[],"urlList":[]}}