{"title":"jv16 PowerTools 2009 v1.9.0.598 Portable","uid":5121161,"size":11056075,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ed9b3ecac838aebb6fc6c02b2e3a107a672dc4ee&amp;dn=jv16+PowerTools+2009+v1.9.0.598+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoExcuses","files":3,"time":1255357585,"description":"No need to install it!\nOr, if you want to, Setup and License are included. Copy the file in the Install Dir.\n\n\njv16 PowerTools is the ultimate Windows optimization and tuneup utility suite. The bottom line is that it keeps your computer running smooth and fast and greatly improves its overall stability. The program allows users to remove hidden traces of previously uninstalled software, to clean the Windows registry for optimal performance and stability, and to fix many registry-based problems with a single mouse click. The highly improved multilingual user interface allows the software to be used in all major languages, while automatic backup and safety features make the program very safe to use.\n\njv16 PowerTools is a full Windows optimization utility suite containing 27 different main tools. Each of these tools is carefully crafted with the experience of 10 years of extensive Windows utility and registry cleaning experience to form a solid foundation to a smoother and faster system. jv16 PowerTools 2009 optimizes, repairs, and maintains Windows-based PCs making them running fast, safe, and free of problems.\n\nEven the smallest details in the product have been designed with your ease of use in mind. The Windows Control Panel like user interface and the intuitive graphic tabs for example make the product easy to learn. And, the automatic backup creation makes it safe to use - even if you are learning by trying and make a mistake sometime, you can always just restore the backup created by the program and you're safe again.\n\nWith jv16 PowerTools you can:\n* Instantly make your Windows run faster and smoother, by disabling certain features which have no useful function and by modifying a few key aspects of the system's behavior.\n* Automatically clean your Windows registry from obsolete and unneeded data.\n* Automatically fix many kinds of registry errors, such as broken file references.\n* Easily uninstall leftover traces of software you have thought you have already uninstalled ages ago.\n* Detect and remove unneeded history data and MRU (most recently used) lists that can contain sensitive information about you.\n* Locate and delete unneeded files, including temp files and duplicate files.\n* And much, much more!\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.macecraft.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.macecraft.com/&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:ed9b3ecac838aebb6fc6c02b2e3a107a672dc4ee","amp;dn":"jv16+PowerTools+2009+v1.9.0.598+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed9b3ecac838aebb6fc6c02b2e3a107a672dc4ee","infoHashBuffer":{"type":"Buffer","data":[237,155,62,202,200,56,174,187,111,198,192,43,46,58,16,122,103,45,196,238]},"announce":[],"urlList":[]}}