{"title":"Big Time Rush S01E09-Big Time Party-[hmovies Releas]","uid":5557879,"size":201043857,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:edc5fb80d1db42f97fc74e45f267ffb5acd867e6&amp;dn=Big+Time+Rush+S01E09-Big+Time+Party-%5Bhmovies+Releas%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"izialcita","files":3,"time":1273747021,"description":"hmovies release Torrents\n\n*Visit hmovies[dot]info for more releases~\n\n*Please Continue to Seed ^^.~\n\n*Use VLC player if it doesnt work on WMP..\n -download to http://www.videolan.org\n\nTv Series   : Big Time Rush\nTV Title    : Big Time Party\nSeason\t    : 01\nEpisode\t    : 09\nWikipedia   : When the boys find out they are not invited to their own party (which is at Rocque Records,) they decide to throw their own in Palmwoods, even though Mr. Bitters does not allow it. They call the party a 'social gathering', since there is no rule forbidding them, and the boys agree on only inviting 3 friends each. Kendall invites Jo, as his 'guest-friend-person-thing', while James invites the 3 hottest girls on his phone. It is unknown who Logan invited. Carlos can't decide and ends up inviting the first 3 contacts on his phone and one of them is 'All Contacts' (Carlos thought it was &quot;Al Contacts&quot;, thus inviting his whole phone). During the &quot;social gathering,&quot; everybody in Carlos phone is now in the party which causes a problem. Camille and Mercedes arrive at the party trying to spend some time with Logan which causes a problem. So now Logan tries to spend time with both of them without them knowing. Kendall and Jo finds out that they don't have much in common. Back at Rocque Records, Gustavo, who is hosting the party the boys were kicked out of, says his party is horrible. In order to impress and entertain Fugizaki and Griffin, he and Kelly dress up as Russian Acrobats and try to perform. Meanwhile in Palmwoods, Bitters 'smells' a party and suits up in search for it, in hopes to give the boys their 3rd 'strike' and kick them out of the Palmwoods. Kendall tells James and Carlos to get the party out of the apartment, while he and Jo try to distract Bitters. They succeed in moving the party outside to the pool, which was not what Kendall meant. Jo and Kendall fake a party and trap Bitters in Gustavo's 'Super Party Fun Box'. Back at the party, Camille and Mercedes found out about Logan's plan. So Mercedes is so sad that she decides to break up with him and become Guitar Dude's girlfriend. Camille comes to Logan and says that she is so mad that she would not talk to him for the rest of the week. Logan looks shocked when Camille says that &quot;We can still dance.&quot; He smiles and tells her she is a &quot;cool person&quot;. Then, at Rocque Records, Gustavo hears about the boys' party so Kelly decides to tell everyone to come to the boys' party. To wrap everything up to make the perfect ending, Kendall and Jo finally finds what they have in common (which is dancing, music, and tricking hotel mangers) and started dancing, Camille and Logan danced as well, Griffin and Fugizaki is actualling enjoying the party, and James and Carlos name themselves &quot;The Official Hollywood Party Kings of Hollywood.&quot;\n\nSong(s) Featured: The City Is Ours / Halfway There / Any Kind of Guy / Big Time Rush / preview of the song &quot;Famous&quot;\nSpecial Guest Star(s): Katelyn Tarver as Jo / Carlie Casey as Mercedes Griffin \n\n\nFile Size   : 192 MB\nAspect Ratio: 16:9\nVideo\t    : Avi File\n\t      XVID Mpeg-4 Visual (Advance Simple@L5)\n\t      1000 Kbps Bitrate\n\t      624x352 pixels\n\t      29.970 fps\nAudio       : Mp3 Audio\n              128 Kbps Bitrate\n              48.0 KHz\n    \nDON'T DOWNLOAD AND RUN PLEASE SEED :D","torrent":{"xt":"urn:btih:edc5fb80d1db42f97fc74e45f267ffb5acd867e6","amp;dn":"Big+Time+Rush+S01E09-Big+Time+Party-%5Bhmovies+Releas%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edc5fb80d1db42f97fc74e45f267ffb5acd867e6","infoHashBuffer":{"type":"Buffer","data":[237,197,251,128,209,219,66,249,127,199,78,69,242,103,255,181,172,216,103,230]},"announce":[],"urlList":[]}}