{"title":"Audio Book. The Protocols Of Zion. (MP3 48 kbps)","uid":6147098,"size":70827335,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:edf3295d64fb96030295e5ebd6af10dded16b890&amp;dn=Audio+Book.+The+Protocols+Of+Zion.+%28MP3+48+kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asma272727","files":-1,"time":1296733040,"description":"\n\nMP3 Audio Book.\n\n48 kbps, 22 Hz \n\n\n\nIf the document were indeed a &quot;forgery&quot; as the jewish media claims it to be, why is it that one could be shot and killed on sight for mentioning this document in Bolshevik (jew) run Russia?  Why is it when the first (abridged) version of the protocols was published by Pavel Krushevan, there was an attempt made on his life? \nSee HERE.  \n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Pavel_Krushevan&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Pavel_Krushevan&lt;/a&gt;\n\n    After a homicidal attempt by a P. S. Dashevsky, it was reported that Krushevan lived in constant fear, kept weapons close at hand and was accompanied by a personal cook out of fear to be poisoned.\n\nAnother man by the name of Sergei Nilus published the first copy of the protocols in full in Russia in 1905. Some information about him can be found HERE.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Sergei_Nilus&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Sergei_Nilus&lt;/a&gt;\n\nFor this act, he was imprisoned and tortured by the jewish Bolshevik &quot;Cheka&quot;, as per this source HERE.\n\n\n    In 1924 Professor Nilus was arrested in Kiev by the &quot;Cheka&quot;, imprisoned, and then tortured. He was told by the president of the court (who was Jewish) that this treatment was meted out to him for &quot;having done them incalculable harm in publishing the Protocols&quot;. He was freed afterwards, and detained again a few months later, this time in Moscow; he was confined, and later sent to exile, where he died in 1929.\n\n\n\n\n\n\n\n00 The Protocols Of Zion - Preface, Introduction,Who are the Elders.\n\n01 The Protocols Of Zion - Protocol 1, The Basic Doctrine.\n\n02 The Protocols Of Zion - Protocol 2, Economic Wars.\n\n03 The Protocols Of Zion - Protocol 3, Methods of Conquest.\n\n04 The Protocols Of Zion - Protocol 4, Materialism Replace Religion.\n\n05 The Protocols Of Zion - Protocol 5, Despotism and Modern Progress.\n\n06 The Protocols Of Zion - Protocol 6, Take-Over Technique.\n\n07 The Protocols Of Zion - Protocol 7, World-Wide Wars.\n\n08 The Protocols Of Zion - Protocol 8, Provisional Government.\n\n09 The Protocols Of Zion - Protocol 9, Re-education.\n\n10 The Protocols Of Zion - Protocol 10, Preparing for Power.\n\n11 The Protocols Of Zion - Protocol 11, The Totalitarian State.\n\n12 The Protocols Of Zion - Protocol 12, Control of the Press.\n\n13 The Protocols Of Zion - Protocol 13, Distractions.\n\n14 The Protocols Of Zion - Protocol 14, Assault on Religion.\n\n15 The Protocols Of Zion - Protocol 15, Ruthless Suppression.\n\n16 The Protocols Of Zion - Protocol 16, Brainwashing.\n\n17 The Protocols Of Zion - Protocol 17, Abuse of Authority.\n\n18 The Protocols Of Zion - Protocol 18, Arrest of Opponents.\n\n19 The Protocols Of Zion - Protocol 19, Rulers and People.\n\n20 The Protocols Of Zion - Protocol 20, Financial Programme.\n\n21 The Protocols Of Zion - Protocol 21, Loans and Credit.\n\n22 The Protocols Of Zion - Protocol 22, Power of Gold.\n\n23 The Protocols Of Zion - Protocol 23, Instilling Obedience.\n\n24 The Protocols Of Zion - Protocol 24, Qualities of the Ruler.","torrent":{"xt":"urn:btih:edf3295d64fb96030295e5ebd6af10dded16b890","amp;dn":"Audio+Book.+The+Protocols+Of+Zion.+%28MP3+48+kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edf3295d64fb96030295e5ebd6af10dded16b890","infoHashBuffer":{"type":"Buffer","data":[237,243,41,93,100,251,150,3,2,149,229,235,214,175,16,221,237,22,184,144]},"announce":[],"urlList":[]}}