{"title":"HDD temperature","uid":5015401,"size":4560384,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ee1434ce3e7e7034a40901ec7e092571a17bd0c4&amp;dn=HDD+temperature&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fredpc","files":2,"time":1248200906,"description":"The 4th generation of HDD Temperature has been re-designed and re-coded from the scratch for faster performance and smaller footprint than ever before.\n\nBrand-New User Interface\nThe new interface of HDD Temperature is geared towards users. It's simpler to use and easier to understand. All information about your hard drive is laid out conveniently by the drive letter.\n\nDetailed Report on Your Hard Drives\nAll you ever wanted to know about your hard disks is fully disclosed by HDD Temperature 4. Learn about who manufactured your disk and when, the exact model number and the number of hours the disk has been used. Oh, and it monitors and reports the disks' temperatures, too!\n\nSupports All Kinds of Disks\nNew-generation HDD Temperature supports all types of hard drives in a single tool, including IDE, Serial ATA, SCSI, and even USB.\n\nBasic Disk Health Control\nPrevent data loss due to hard disk failures! The updated HDD Temperature now reports basic information about the health of your hard disks, thus increasing data safety and storage reliability of your entire system. Detailed disk health reports are available with HDDlife, a dedicated disk health monitor.\n\n\nTechnical Information\nHDD Temperature 4 is easily usable even in limited user accounts, and does not require administrative privileges to run. It does not trigger Vista's UAC prompts, too!\n\nThe disk temperature monitor can be used in non-interactive mode by network administrators. All communications such as email notifications and turning off workstations are performed from within a system service, and do not require user interaction or logged-in users.\nInstallation:\n\n__________________________________________________________________________________\n1) when the instalation finish dont run the program\n2) copy the crack included in the CRACK folder\n3) and paste it in the HDD Temperature folder\n4) replace it","torrent":{"xt":"urn:btih:ee1434ce3e7e7034a40901ec7e092571a17bd0c4","amp;dn":"HDD+temperature","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee1434ce3e7e7034a40901ec7e092571a17bd0c4","infoHashBuffer":{"type":"Buffer","data":[238,20,52,206,62,126,112,52,164,9,1,236,126,9,37,113,161,123,208,196]},"announce":[],"urlList":[]}}