{"title":"Fast.And.Furious.Solo.Parti.Originali.2009.iTAL.DVDRip.XviD-Repu","uid":5031791,"size":1467983872,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eea2354f2ef9751aac05d24cb79cb3a93718f48e&amp;dn=Fast.And.Furious.Solo.Parti.Originali.2009.iTAL.DVDRip.XviD-Repu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Volpebianca","files":2,"time":1248948304,"description":":::Scheda del film:::\nTitolo originale: Fast &amp; Furious\nNazione: U.S.A.\nAnno: 2009\nGenere: Azione\nDurata: 107'\nRegia: Justin Lin\nSito ufficiale: www.fastandfuriousmovie.net\nCast: Vin Diesel, Paul Walker, Michelle Rodriguez, Jordana Brewster, Liza Lapira, Gal Gadot, John Ortiz, Sung Kang, Laz Alonso, Wilmer Calderon\nProduzione: Neal H. Moritz Productions, Original Film, Relativity Media, Universal Pictures\nDistribuzione: UIP\nData di uscita: 17 Aprile 2009 (cinema)\n:::Trama:::\nSono passati otto anni da quando l'ex galeotto Dominic Toretto (Diesel) ha varcato in macchina la frontiera messicana, scegliendo un'esistenza da fuggitivo. Adesso, arenato in una capanna su una spiaggia della Repubblica Dominicana, e vivendo perennemente in fuga con l'unica cosa che gli resta del suo passato, Letty (Rodriguez), cerca di rifarsi una vita. Ma sa che le autoritÃƒÂ  gli stanno col fiato sul collo. Quando la tragica scomparsa di qualcuno che ama lo riporta a Los Angeles, Dom riprende la sua contesa con l'agente Brian O'Conner (Walker). PoichÃƒÂ© sono costretti a confrontarsi con un nemico comune, uno spacciatore sociopatico che sta inondando gli Stati Uniti di una droga letale, Dom e Brian devono cedere e fidarsi a malincuore l'uno dell'altro, nella speranza di toglierlo di mezzo e vendicare la tragedia che ha causato nella loro piccola famiglia allargata. Infiltrarsi nella rete clandestina significa guadagnarsi un posto nel gruppo di delinquenti che fanno passare l'eroina quasi pura dalla frontiera del Messico attraverso tunnel praticamente impraticabili scavati nelle grotte. Due capi del cartello, Campos (John Ortiz) e Fenix (Laz Alonso), sono gli unici che possono offrire a Dom e Brian le risposte che stanno cercando. Quando Dom, sua sorella Mia (Brewster) e Brian rinsaldano i legami di famiglia che erano stati spezzati tanto tempo prima, gli improbabili alleati si ritrovano a doversi misurare l'uno con l'altro in una gara che li porta a spingersi oltre ogni limite. Adesso, dalle fughe in carovana attraverso la campagna collinosa della Repubblica Dominicana, allo sgusciare velocissimi nelle gallerie sotto al deserto messicano, due uomini troveranno il modo migliore per vendicarsi: estendere i limiti di quello che ÃƒÂ¨ possibile fare al volante.","torrent":{"xt":"urn:btih:eea2354f2ef9751aac05d24cb79cb3a93718f48e","amp;dn":"Fast.And.Furious.Solo.Parti.Originali.2009.iTAL.DVDRip.XviD-Repu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eea2354f2ef9751aac05d24cb79cb3a93718f48e","infoHashBuffer":{"type":"Buffer","data":[238,162,53,79,46,249,117,26,172,5,210,76,183,156,179,169,55,24,244,142]},"announce":[],"urlList":[]}}