{"title":"Van Morrison - Enlightenment [1980] [ [Robbie60] [FLAC]","uid":6229856,"size":327474371,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ef5e0e43d8e4432b8c17227e37b1de220e4682a1&amp;dn=Van+Morrison+-+Enlightenment+%5B1980%5D+%5B+%5BRobbie60%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robbie6ty","files":-1,"time":1299668842,"description":"Van Morrison\nEnlightenment\n\n\nLabel: Polydor\nReleased: 1990\nSource: Original CD \nSize Torrent: 312 MB\nFormat: FLAC\n\n\n\n\n\n\nThroughout Van Morrison's long career, his hit records have usually been followed by more obscure ones, so it should come as no surprise that 1990's Enlightenment was more subtle than its hit predecessor, Avalon Sunset. The intention of Enlightenment is marked by its first two songs, the scorching Celtic rhythm &amp; blues of the opener, &quot;Real Real Gone,&quot; and the pained spiritual yearning of the title track, a midtempo ballad drenched in nylon-string guitars, atmospheric synths, a gorgeous melody, and a tough Wurlitzer piano. The first tune, with its raucous horns, B-3, and crackling hi-hat and snare work, comes from the shouting R&amp;B singer we've known since Moondance. It's addressed to a nameless other, with a call-and-response horn section answering his every line like it was the gospel truth. The slippery bridge-like lines at the ends of the verses and his invocation of truths from the gods of soul -- &quot;And Sam Cooke is on the radio and the night is filled with space/Wilson Pickett said 'In the Midnight Hour'/That's when my love comes tumblin' down/Solomon Burke said, 'If you need me, why don't you call me'/James Brown said, 'When you're tired of what you got, try me'/ Gene Chandler said, 'There's a rainbow in my soul'&quot; -- suggest he's almost found the truth in these moments from his past, a past that haunts him and whose secrets pour from his mouth when he sings, though they elude him. We can add to these, &quot;Van Morrison said, 'Real, real gone/I can't stand up by myself/Don't you know I need your help/I'm real real gone.'&quot; This is only underscored in &quot;Enlightenment,&quot; where these koans mix with those of the Buddhist masters. Some of them come literally from Zen, others from the pit of the protagonist's life: &quot;I'm in the here and now/And I'm meditating/I'm still suffering/But that's my problem...wake up.&quot; The rest of the album becomes a suite, with these themes underscored everywhere through an ethereal blend of sonic atmospheres and carefully crafted melodies that seem to come from the oblique shadow of the soul as it wanders, discovers, and sheds its trappings, still seeking. There's the folksy Irish folk-pop of &quot;So Quiet in Here&quot; and the dramatic yet elegiac regality of &quot;Avalon of the Heart,&quot; where the ghosts of Keats, Shelley, and Yeats all meet to confer and wail. These songs are kissed further down the road by the contemplative jazz in &quot;See Me Through,&quot; a sung prayer that is partially obscured by its chant-like melody. Morrison also does his trademark evocation of memory in the sprightly gospel of &quot;Youth of 1,000 Summers.&quot; Jazz returns in the Friday night strut of &quot;Start All Over Again,&quot; where sadness and hope mix inextricably. &quot;She's My Baby,&quot; with its nylon-string guitars and taut snares, is breezy Celtic soul at its best, expressing an adult lovesickness in song. Enlightenment, like Avalon Sunset, marks one of Morrison's best productions, if not albums. Its sound is warm, enveloping, and humid. If the songs seem to bleed together a bit, that's on purpose; it's meant to be taken as a whole. It's an overlooked gem.  Thom Jurek, All Music Guide\n\n\nPersonnel\n\nJohn McCarthy   Choir Master\nVan Morrison   Guitar, Keyboards, Producer, Vocals, Saxophone\nBrian Odgers   Bass\nSteve Pearce   Bass\nFrank Ricotti   Vibraphone\nFiachra Trench   Vocal Arrangement, Horn Arrangements, String Arrangements\nGavyn Wright   Strings, Leader\nSteve Waterman   Flugelhorn\nPaul Durcan   Voices\nAmbrosian Singers   Choir, Chorus\nDave Bishop   Saxophone\nNeil Drinkwater   Arranger\nDave Early   Drums\nAlex Gifford   Keyboards\nMick Glossop   Engineer\nSteve Gregory   Saxophone\nMalcolm Griffiths   Trombone\nBernie Holland   Guitar\nMichael O'Suilleabhain   Piano\nGeorgie Fame   Organ, Piano (Electric), Vocals (Background)\nHenry Lowther   Trumpet\n\n\nCD Track Listing\n\n\n1 Real Real Gone 3:43\n\n2 Enlightenment 4:04\n\n3 So Quiet in Here 6:09\n\n4 Avalon of the Heart 4:45\n\n5 See Me Through 6:13\n\n6 Youth of 1,000 Summers 3:45\n\n7 In the Days Before Rock 'n' Roll 8:13\n\n8 Start All Over Again 4:10\n\n9 She's My Baby 5:14\n\n10 Memories 4:14\n","torrent":{"xt":"urn:btih:ef5e0e43d8e4432b8c17227e37b1de220e4682a1","amp;dn":"Van+Morrison+-+Enlightenment+%5B1980%5D+%5B+%5BRobbie60%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef5e0e43d8e4432b8c17227e37b1de220e4682a1","infoHashBuffer":{"type":"Buffer","data":[239,94,14,67,216,228,67,43,140,23,34,126,55,177,222,34,14,70,130,161]},"announce":[],"urlList":[]}}