{"title":"POTHS - Nuclear Hell in The USA","uid":5505240,"size":578643535,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:f03add1da19f7af9a0581d31a68ee12092668c3e&amp;dn=POTHS+-+Nuclear+Hell+in+The+USA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"awaken888","files":21,"time":1271778618,"description":"\tPOTHS  -- Picking Out The Hellish Scumbags -- POTHS -- Pointing Out The Hovering Sausers -- POTHS -- Pouring Out The Holy Spirit -- POTHS -- Pointing Out The Hopeless Socialists -- POTHS -- Pour Out The Holy Spirit -- Upload POTHS  Everywhere -- POTHS -- Pointing Out The Hellish Scumbags -- POTHS -- Partaking Of The Holy Scriptures -- POTHS -- Prosecute Only The Highest Scoundrels -- POTHS -- Pouring Out The Holy Spirit -- POTHS -- Prosecute Obama The House &amp; Senate -- POTHS -- Plant Only The Heritage Seeds -- POTHS -- Plant Our Treasured Hemp Seeds -- POTHS -- Passing Over The Harmful Sins.\n\nNUCLEAR HELL -- Coming to an American City? That is what Bill Clinton said this weekend.\n\nMore Torrents in this series at \n\nI am using a SEED BOX that uploads at rates of up to 2mb/s per leecher. The Seed Box can be identified by this IP address perf029c.xirvik.net. If you hook up with this server open up your client for maximum download speed. Be patient, it takes a awhile to hook up to it and build up speed. Not all leechers hook up and get high download speeds, so it is important to seed long.  \n\nBy Now we all should know that The Government of The United States is no longer a Government of The People, by the People and for The PEOPLE. The United States was founded One Nation, under God. But THEY neglected to mention which god THEY were referring to. It IS NOT YAHWEH the Creator of The Universe.It is Lucifer or Satan or The Son of Perdition or the Prince of The Air.\n\nThe Nuclear Bomb was thought up and the idea came together at The Bohemian Grove north of San Francisco. A real HELL HOLE. Here are 11 short videos on Nuclear Explosions. Bill Clinton says The Tea Parties will be the cause of the upcoming Nuclear Explosion. How the Hell does he know there is going to be a Nuclear Explosion in America? If he does know and doesn't stop it, who is really responsible. He is and he should be tried FOR TREASON. You bet it is the BANKSTERS. The Money Changers. Jesus kicked um out once and HE will do it again!!\n\nThe More You share the More shares you will receive, may Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.    \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.[/b]\n\nGet info on the Take Over by The New World Order Below &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt; &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;\nListen to Alex Jones &lt;a href=&quot;\nhttp://bibledatabase.com/html_bibles.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bibledatabase.com/html_bibles.html&lt;/a&gt;\n\nSeed long and Prosper.\n\nEphesians 5:11 KJV  \n\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove them.","torrent":{"xt":"urn:btih:f03add1da19f7af9a0581d31a68ee12092668c3e","amp;dn":"POTHS+-+Nuclear+Hell+in+The+USA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f03add1da19f7af9a0581d31a68ee12092668c3e","infoHashBuffer":{"type":"Buffer","data":[240,58,221,29,161,159,122,249,160,88,29,49,166,142,225,32,146,102,140,62]},"announce":[],"urlList":[]}}