{"title":"LE TROIANE - EURIPIDE[TNTVILLAGE]","uid":5176584,"size":117666,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f03fe55db844abc79de399a26dd0bf24180a9883&amp;dn=LE+TROIANE+-+EURIPIDE%5BTNTVILLAGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1259008442,"description":"[b][color=RED]LE TROIANE \n\n[/color][color=green] EURIPIDE[/color][/b]\n\n[color=red][b]Il gruppo SPG ÃƒÂ¨ lieto di presentarvi:[/b][/color]\n\n[b][color=green]:::-&gt;LOCANDINA&lt;-:::[/color][/b]\n\n[IMG]http://img82.imageshack.us/img82/3153/troianelocqg4.jpg[/IMG]\n\n[b][color=green]:::-&gt;Dettagli&lt;-:::[/color][/b]\n[color=teal]\n[b]Autore: Euripide [/b]\n[b]Titolo: Le Troiane[/b]\n[b]Pagine: 23[/b]\n[b]Anno: 415 a.C.[/b]\n[b]NazionalitÃƒÂ : Grecia[/b]\n[b]Genere: Tragedia Greca[/b]\n[b]Dimensione del file: 146 Kb [/b]\n[b]Formato del file: PDF[/b]\n[/color]\n[b][color=green]:::-&gt;Biografia di Euripide&lt;-:::[/color][/b]\n[color=teal]\n\nNacque, secondo la tradizione, a Salamina lo stesso giorno in cui avvenne la famosa battaglia, da una famiglia ateniese rifugiata sull'isola per sfuggire ai \n\nPersiani. Il suo nome verrebbe dal'Euripe, il canale dove si svolse la battaglia. Aristofane suggerisce a piÃƒÂ¹ riprese nelle sue commedie la bassa estrazione \n\ndel poeta, confermato da Teofrasto. Tuttavia, la sua cultura dimostra una educazione raffinata, acquisita dallo studio presso sofisti come Protagora, che non \n\nsarebbe stata possibile senza una condizione agiata. Avrebbe messo insieme una ricca biblioteca, una delle prime di cui si faccia menzione. Euripide \n\npartecipÃƒÂ² anche a giochi ginnici, venendo incoronato almeno una volta.\nContemporaneo di Socrate, ne divenne amico. Si propose pubblicamente come tragediografo a partire dal 455 a.C.. La sua prima opera, Peliadi, ottiene il terzo \n\npremio. Diviene presto popolare. Plutarco racconta, nella vita di Nicia, come nel 413 a.C., dopo il disastro navale di Siracusa, i prigionieri ateniesi in \n\ngrado di recitare una tirata di Euripide venissero rilasciati. Verso il 405 a.C., Euripide si ritira a Magnesia, poi in Macedonia, alla corte di Archelao, \n\ndove muore, si dice, sbranato dai cani. Solo dopo la sua morte la Grecia lo riconosce e le sue opere divengono famose. Gli ateniesi gli dedicarono nel 330 \n\na.C. una statua di bronzo nel teatro di Dioniso.\n[/color]\n[b][color=green]:::-&gt;Introduzione&lt;-:::[/color][/b]\n\n[color=teal]\nLe Troiane (o Le TrÃƒÂ²adi) ÃƒÂ¨ una tragedia di Euripide. Fu rappresentata per la prima volta nel 415 a.C..\n\nL'opera faceva parte di una trilogia legata alla guerra di Troia:\n\n    * Alessandro e Palamede\n    * Le Troiane (o Le TrÃƒÂ²adi)\n    * Sisifo\n\nIl dramma rappresenta il momento estremo dell'immensa tragedia: morti tutti gli uomini, le donne di Troia costituiscono il coro, aspettando il loro destino \n\nnel campo dei vincitori.\n \nL'opera\n\nLa struttura del dramma ÃƒÂ¨ molto semplice, ma geniale. In tutto il dramma la presenza viva ed acuta del dolore, si congiunge con la convinzione dell'eroicitÃƒÂ  \n\ne della bellezza della sventura di fronte all'apparente vittoria dei distruttori. Risulta evidente la centralitÃƒÂ  del punto di vista dei vinti e non dei \n\nvincitori: questo tipo di prospettiva era giÃƒÂ  stato adottato da Eschilo ne I Persiani con un fine non troppo diverso, rappresentÃƒÂ² infatti, non il trionfo \n\nateniese, non il valore militare dei greci ma la disperazione dei persiani sconfitti. Anche Euripide punta i riflettori sui vinti, in particolare sulle \n\ndonne, con lo scopo di gettare luce sulle sofferenze e sul dolore portati dai conflitti armati. Il poeta, in ogni sua tragedia, mostra sempre il mondo dei \n\ndeboli e dei reietti, ma in questo caso l'analisi impietosa delle conseguenze della guerra ÃƒÂ¨ da ricollegare con il momento storico in cui l'autore si \n\nmuoveva, la decadenza di Atene durante la guerra del Peloponneso che culminerÃƒÂ  con la definitiva sconfitta della grande cittÃƒÂ  greca.\n[/color]\n[b][color=green]:::-&gt;Trama&lt;-:::[/color][/b]\n[color=teal]\n\nLe donne troiane vengono consegnate come schiave ai vincitori Greci. Cassandra viene data ad Agamennone e predice le sventure che li attendono in patria \n\ndell'eroe. Andromaca subisce la tragedia della perdita del figlio Astianatte, che i Greci gettano dalle mura di Troia. Ecuba ed Elena \n\nhanno..................................\n[/color]\n\n\n\n\nTNTVILLAGE.SCAMBIOETICO.ORG","torrent":{"xt":"urn:btih:f03fe55db844abc79de399a26dd0bf24180a9883","amp;dn":"LE+TROIANE+-+EURIPIDE%5BTNTVILLAGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f03fe55db844abc79de399a26dd0bf24180a9883","infoHashBuffer":{"type":"Buffer","data":[240,63,229,93,184,68,171,199,157,227,153,162,109,208,191,36,24,10,152,131]},"announce":[],"urlList":[]}}