{"title":"10 Reflexiones Sobre Menopausia Climaterio  Y Terapia Hormonal","uid":6262632,"size":876466,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f1627d9f734b542ac416356785fb88b44a041d56&amp;dn=10+Reflexiones+Sobre+Menopausia+Climaterio++Y+Terapia+Hormonal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gatasalvaje","files":-1,"time":1300798920,"description":"Las diez reflexiones plasmadas en este libro estÃƒÂ¡n dirigidas a mÃƒÂ©dicos que cuidan de la salud de mujeres, que no necesariamente son especialistas o expertos en los temas de menopausia, climaterio y terapia hormonal. Las diez reflexiones realizadas por el Doctor Alvaro Monterrosa Castro nos informan y actualizan de una manera didÃƒÂ¡ctica y amena sobre temÃƒÂ¡ticas extensas y complejas. El esfuerzo creativo y la rigurosa selecciÃƒÂ³n bibliogrÃƒÂ¡fica, nos recrean mientras nos muestran los temas controversiales sobre la atenciÃƒÂ³n de la mujer en esta ÃƒÂ©poca de la vida, ofreciÃƒÂ©ndonos un panorama completo y actualizado.\n\nCon el planteamiento de los hechos cientÃƒÂ­ficos claves se observa la evoluciÃƒÂ³n de la terapia hormonal hacia un tratamiento individualizado. Como lo puntualiza el autor a lo largo y ancho del texto, todavÃƒÂ­a es momento propicio para aclarar definiciones relacionadas con la menopausia, el climaterio y la transiciÃƒÂ³n menopÃƒÂ¡usica, pasos necesarios y fundamentales para poder realizar el correcto abordaje mÃƒÂ©dico, un abordaje que debe ser de tipo preventivo, inmerso en la atenciÃƒÂ³n primaria donde se apunte hacia la preservaciÃƒÂ³n de la calidad de vida. Coherente con lo anterior, se hace necesario que todos los profesionales de la salud se tornen diestros en el manejo de los factores de riesgo que durante el climaterio impactan de forma adversa a los vasos sanguÃƒÂ­neos, al corazÃƒÂ³n, al cerebro, a las glÃƒÂ¡ndulas mamarias, al endometrio, al sistema ÃƒÂ³seo, etc.\nEl Doctor Alvaro Monterrosa Castro, luego de una amplia y profunda revisiÃƒÂ³n de la literatura reciente, expone de forma detallada y densa el trasfondo cientÃƒÂ­fico, los alcances y las limitaciones de las dosis y los compuestos estrogÃƒÂ©nicos y las progestinas que estÃƒÂ¡n disponibles dentro de la terapia hormonal, una estrategia medicamentosa que considera vigente, que ha logrado crecer y posicionarse dentro de las controversias, mientras se plantean modificaciones conceptuales.\n\n\nTenemos pues que agradecer al autor la realizaciÃƒÂ³n de una obra cuyo objetivo central es informar, orientar y educar a mÃƒÂ©dicos en la toma de decisiones prÃƒÂ¡cticas para el manejo de las pacientes. Las orientaciones plasmadas en estas pÃƒÂ¡ginas, sin duda repercutirÃƒÂ¡n sobre la atenciÃƒÂ³n de la salud integral de miles de mujeres en edad de menopausia y son valiosa contribuciÃƒÂ³n\nContenido del libro\n\n\nIntroducciÃƒÂ³n: A los apreciados lectores\nPrimera reflexiÃƒÂ³n\nCreciendo entre crisis: se definen mejor los beneficios\nSegunda reflexiÃƒÂ³n\nLa menopausia y el climaterio: Mirados desde la atenciÃƒÂ³n primaria\nTercera reflexiÃƒÂ³n\nMenopausia y terapia hormonal: Definiendo sus entornos\nCuarta reflexiÃƒÂ³n\nPerimenopÃƒÂ¡usia y Postmenopausia: Diferencia que se debe seÃƒÂ±alar\nQuinta reflexiÃƒÂ³n\nLa terapia hormonal: El impacto cardiovascular\nSexta reflexiÃƒÂ³n\nLa Terapia Hormonal: La relaciÃƒÂ³n con el cÃƒÂ¡ncer de seno\nSÃƒÂ©ptima reflexiÃƒÂ³n\nLos estrÃƒÂ³genos y el estudio HOPE: en la apertura a las bajas dosis\nOctava reflexiÃƒÂ³n\nLas nuevas progestinas: ya estÃƒÂ¡n disponibles\nNovena reflexiÃƒÂ³n\nAlternativas a la terapia hormonal. Una mirada detenida\nDÃƒÂ©cima reflexiÃƒÂ³n\nLa terapia hormonal: Una estrategia vigente\nEpilogo: Las cifras escrituradas en tablas\n","torrent":{"xt":"urn:btih:f1627d9f734b542ac416356785fb88b44a041d56","amp;dn":"10+Reflexiones+Sobre+Menopausia+Climaterio++Y+Terapia+Hormonal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1627d9f734b542ac416356785fb88b44a041d56","infoHashBuffer":{"type":"Buffer","data":[241,98,125,159,115,75,84,42,196,22,53,103,133,251,136,180,74,4,29,86]},"announce":[],"urlList":[]}}