{"title":"Battlestar Galactica - Stagione 3 - DVD Rip ITA [CR-Bt]","uid":6152289,"size":8621520429,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f218df8278552450104fa2a15dd7511063aaa596&amp;dn=Battlestar+Galactica+-+Stagione+3+-+DVD+Rip+ITA+%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":42,"time":1296915183,"description":"Le vicende della serie seguono quelle della miniserie televisiva omonima, in cui il rappresentante coloniale incontra la delegazione cylone, che dopo quarant'anni si presenta alla Stazione dell'Armistizio. Con grande sorpresa dell'ufficiale umano fanno l'ingresso nella sala dell'incontro due avveniristici - rispetto alle documentazioni in suo possesso - robot; questi hanno il compito di scortare quella che sembra essere una donna estremamente attraente, ma che in realtÃƒÂ  ÃƒÂ¨ anch'essa un cylone. La portavoce dei cyloni, un istante prima che la stazione spaziale venga completamente distrutta, rivela semplicemente al coloniale queste parole: Ã‚Â«ÃƒÂ¨ cominciataÃ‚Â».\n\nIl Galactica ÃƒÂ¨ un'astronave da guerra pronta per il pensionamento; l'armistizio con i cyloni dura ormai da decenni e rende pressochÃƒÂ© inutile per l'economia del governo delle Dodici Colonie (con capitale sul pianeta Caprica) un ampio dispiegamento di forze militari. Molte navi da guerra come il Galactica sono destinate a diventare dei musei in ricordo di periodi oscuri per la vita coloniale, durante i quali la pace era funestata dalla guerra con i cyloni. A capo del Galactica vi ÃƒÂ¨ il comandante William Adamo, che a suo tempo aveva combattuto contro i robot ribelli.\n\nDopo 40 anni di armistizio i cyloni decidono infine di attaccare gli umani ed annientare l'intera popolazione dei pianeti coloniali. Per fare tutto ciÃƒÂ² con un singolo attacco sfruttano le debolezze del dottor Gaius Baltar, un vero e proprio genio nello studio e sviluppo di intelligenze artificiali e nella programmazione, ma sensibile al fascino femminile e caratterizzato da uno spiccato egocentrismo, che mette in dubbio la sua integritÃƒÂ  morale. Ignaro del fatto che i cyloni possano abilmente confondersi con i normali esseri umani, il dottor Baltar, incaricato dal governo dello sviluppo dei programmi di gestione dei sistemi difensivi, concede loro indirettamente accesso alla rete difensiva dei pianeti e della flotta militare, instaurando una relazione con un'androide (una copia perfetta della portavoce che ad inizio serie si era presentata scortata alla Stazione dell'Armistizio). L'agente cylone (Numero Sei), incaricata di sedurre il dottor Baltar, accede cosÃƒÂ¬ a tutte le informazioni necessarie a rendere impotenti i sistemi di difesa umani al momento dell'attacco, determinando la Caduta delle Dodici Colonie. Quando si rende conto di ciÃƒÂ² che ÃƒÂ¨ successo, lo scienziato riesce solo a preoccuparsi di non essere accusato della morte di miliardi di esseri viventi in seguito all'attacco portato dai cyloni ai pianeti coloniali.\n\nSoltanto 47.875 persone, la maggior parte delle quali al momento dell'attacco era nello spazio, si salvano dallo sterminio. Tra queste navi superstiti vi ÃƒÂ¨ anche il Galactica, unica nave da guerra ad essere sopravvissuta alla ferocia dei cyloni in quanto, per espressa richiesta del comandante Adamo, ÃƒÂ¨ la sola a non essere completamente dipendente da computer collegati alla rete planetaria.\n\nI resti della civiltÃƒÂ  umana raggruppati in poche navi spaziali e scortati dal Galactica cominciano cosÃƒÂ¬ la loro fuga dal sistema solare conquistato dai cyloni, e, sebbene nessuno sappia dove trovarla o se davvero esista, le navi si dirigono verso quella che tutti chiamano la 13Ã‚Âª colonia: il pianeta Terra. A guidare i superstiti vi ÃƒÂ¨, a bordo della nave ribattezzata Colonial One, il nuovo presidente del governo coloniale, l'ex sottosegretario all'Istruzione Laura Roslin che, in seguito alle morti del presidente, del vice-presidente e di vari ministri, si ritrova costretta a prendere le redini del comando e a vincere i dubbi sulle sue capacitÃƒÂ  governative che nutrono gli ufficiali militari.\n\nNel dramma del genocidio della civiltÃƒÂ  coloniale e della fuga verso la Terra, si sviluppano le vicende umane dei vari personaggi e l'evoluzione psicologica degli androidi.","torrent":{"xt":"urn:btih:f218df8278552450104fa2a15dd7511063aaa596","amp;dn":"Battlestar+Galactica+-+Stagione+3+-+DVD+Rip+ITA+%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f218df8278552450104fa2a15dd7511063aaa596","infoHashBuffer":{"type":"Buffer","data":[242,24,223,130,120,85,36,80,16,79,162,161,93,215,81,16,99,170,165,150]},"announce":[],"urlList":[]}}