{"title":"The Other Me 2000 NL Dutch Subtitled SDTV DVDR-5 PAL - Disney Ch","uid":6171933,"size":3349409792,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f2c43bc93487c2ed01ca884de8e48862cc4db2be&amp;dn=The+Other+Me+2000+NL+Dutch+Subtitled+SDTV+DVDR-5+PAL+-+Disney+Ch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DisneyChannel-DutchNL","files":-1,"time":1297615097,"description":"DCOM DISNEY CHANNEL ORIGINAL MOVIE\n\nThe Other Me 2000 NL Dutch Subtitled SDTV DVDR-5 PAL - Disney Channel Netherlands NL\nRecorded from Analog TV from Disney Channel Netherlands with Samsung DVD-HR753\nDVDR-5-Video files based on a Single VOB file that you can direct burn on DVD 4,7GB Disc, or watch them without breaks on your PC/Mac!\n\nSize: 3,11GB\nCompression: MPEG2 \nExtension: VOB\nAudio Language/Taal: English/Engels Stereo AC3 384kbps\nSubtitles/Ondertitels : Dutch/Nederlands Nederlandse\nOndertiteld Subtitled Subs NL Ondertiteling\nAlone Hard Coded subs\nRegion/Regio: 4:3 Normal PAL free/vrij\nIMDB: http://www.imdb.com/title/tt0246834/\nRapid.Share: http://freetexthost.com/dkzrh02gml\nPass: dfgvg (Only to see links, Rars don't have password)\n(With this service you can download this movie at maximum speed without seeding, but it required paying, and this download can be blocked by Disney)\n\nUnited States\nComedy/ Family\n90 Minutes\n\ndirected by Manny Coto\nwith Andrew Lawrence, Mark L. Taylor and Lori Hallier\n\nWill Browning is a slacker student who needs a good grade in science, or he has to go to a military camp for the summer. Attempting to get a good grade by ordering a product called &quot;Ocean Pets&quot; for his project. Accidently, some clone formula leaked into his package. When stirring the ocean pet (and clone) mixture with a comb, he accidently creates a clone of himself. He sends the clone to school, because the clone is a lot smarter than him. Everyone likes the clone better than Will...\n\nSlechte schoolcijfers en een gedwongen verblijf in een militair kamp zetten de 13-jarige Will ertoe aan zijn luiheid het hoofd te bieden. Om leraren en z'n ouders van zijn genie te overtuigen wijdt hij zich aan een wetenschappelijk experiment. Het resultaat verrast Will behoorlijk, want hij blijkt een dubbelganger van zichzelf te hebben gecreÃƒÂ«erd. Dit komt prima uit, want zo kan Will zich weer aan het nietsdoen wijden en de kloon alles laten doen. De gevolgen zijn echter niet te overzien.\n\nPlease seed to a minimum of 1.000 to keep the torrent online!\nThank you!\t","torrent":{"xt":"urn:btih:f2c43bc93487c2ed01ca884de8e48862cc4db2be","amp;dn":"The+Other+Me+2000+NL+Dutch+Subtitled+SDTV+DVDR-5+PAL+-+Disney+Ch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2c43bc93487c2ed01ca884de8e48862cc4db2be","infoHashBuffer":{"type":"Buffer","data":[242,196,59,201,52,135,194,237,1,202,136,77,232,228,136,98,204,77,178,190]},"announce":[],"urlList":[]}}