{"title":"Cecilia Bartoli - A Portrait","uid":5121960,"size":333489262,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f320ccf5d2147aa1f1c7c46c7dd94429a66aae28&amp;dn=Cecilia+Bartoli+-+A+Portrait&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dougietrotter","files":-1,"time":1255394636,"description":"Cecilia Bartoli has a wonderfully rich, textured mezzo voice. This CD shows her skills to good effect. Some illustrative cuts. . . .\n\n&quot;Voi che sapete&quot; from Mozart's &quot;Le Nozze di Figaro&quot; is richly sung. She displays a lush mezzo voice. This aria is smoothly sung; a very nice version. Her sumptuous voice interprets this piece nicely. A very satisfying version.\n\nFrom &quot;Don Giovanni,&quot; we have &quot;Batti batti, o bel Masetto.&quot; Her rich voice does justice to this piece. There is also a nice characterization in play. Poignantly sung.\n\nRossini's &quot;Belta Crudele&quot; is smoothly sung; her rich voice does well by this piece. An effecting version. She notes of Rossini that he is &quot;a composer to whom I feel particularly close, and in whose coloratura writing I have found a new and different expressive mode.&quot;\n\nShe takes a crack at Rossini's &quot;Bel raggio lusinghier,&quot; normally sung by sopranos. And this does not disappoint. This work, sung by a mezzo, provides an interesting interpretation. She demonstrates agility in her technique; she shows good ornamentation. There is even a decent trill in this work, something that some current coloratura sopranos would long to equal, from my listening.\n\nThe final cut on the CD is from Rossini's &quot;La Cenerentola,&quot; &quot;Nacqui all'affano. . .Non piu mesta.&quot; Very well done. Her coloratura technique is rock solid. A trill during this cut would fill many sopranos with envy. She clearly shows a good coloratura sensibility. This is great stuff!\n\nThis is a good introduction to the range of skills possessed by Bartoli. A nice CD indeed.","torrent":{"xt":"urn:btih:f320ccf5d2147aa1f1c7c46c7dd94429a66aae28","amp;dn":"Cecilia+Bartoli+-+A+Portrait","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f320ccf5d2147aa1f1c7c46c7dd94429a66aae28","infoHashBuffer":{"type":"Buffer","data":[243,32,204,245,210,20,122,161,241,199,196,108,125,217,68,41,166,106,174,40]},"announce":[],"urlList":[]}}