{"title":"Batman Beyond","uid":5077296,"size":311899092,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f32a883481dc1087e9fa340677eeebc2281baa03&amp;dn=Batman+Beyond&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1251974448,"description":"Comic book series published by DC Comics based on the Warner Bros. Animation of the same name that ran for three seasons between January 10, 1999, and ended its run on January 6, 2002.  Batman Beyond is set in the chronological future of the DC animated universe.  The series is said to exploit the darker side of many Batman projects, playing basically on such key elements as emotions, personal relations, the fear of the unknown, and technological malfunctions. As such, it was considerably darker than most other children's programs at the time, ironic as producer Bruce Timm recalls it was originally conceived as a kid-friendly Batman cartoon.\n\nBatman Beyond follows the adventures of Terry McGinnis, a troubled teen who takes on the mantle of Batman to avenger his fathers murder.  Bruce Wayne, now an old man, acts as Terry's mentor, training him and assisting him on his various missions.\n\nAfter an initial 6-issues limited series released in March 1999, Batman Beyond had its own comic book series, running through November 1999 until October 2001, for a total of 24 issues. They were set in the same world of the show and aimed at younger readers.\nOriginally, Batman Beyond #3 (the monthly series) was to focus on the Terrific Trio from the episode &quot;Heroes.&quot; The story would have 2-D Man and Magma trying to revive their former teammate, Freon. It was rejected due to their resemblance to the Fantastic Four.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:f32a883481dc1087e9fa340677eeebc2281baa03","amp;dn":"Batman+Beyond","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f32a883481dc1087e9fa340677eeebc2281baa03","infoHashBuffer":{"type":"Buffer","data":[243,42,136,52,129,220,16,135,233,250,52,6,119,238,235,194,40,27,170,3]},"announce":[],"urlList":[]}}