{"title":"Jordan Maxwell - Project Camelot Interview","uid":5513641,"size":283095775,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f350e24d84d7c7c99557c0fa55dc42db731d1387&amp;dn=Jordan+Maxwell+-+Project+Camelot+Interview&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"G4Life321","files":1,"time":1272165146,"description":"Jordan Maxwell is a guy who has been researching occult (hidden) knowledge for the last 45-50 years. His knowledge, facts and opinions are ones not to be unknown and should most definantly be acknowledged by everyone seeking the truth. This is just one of many, many videos up on the internet. I posted this one because not many people have uploaded his interview by Project Camelot. But please for all who are interested in the truth about how things REALLY work in our world... Jordan's work must be looked into. I HIGHLEY recomend searching for his lectures and videos on a torrent search engine.. I'll try uploading as much as i can as i have 10 gig worth of video material...\n\n\nAccording to Jordan, the picture is not pretty: the Earth is not controlled by human beings; that the human race is currently being mutated; and, to put it mildly, we are all in some degree of trouble.\n\nThe dire conclusions Jordan has reached are mitigated by his own fascinating personal story: that he was groomed and prepared for his current role by nothing less than a group of benevolent ETs - one of whom he met in person in the guise of the father of a girl he met when he was just 19. He was explicitly told by this remarkable (but very ordinarily human-looking) man - who told him details of his life that no-one could possibly know - that he would have a very important job to do later, in years to come. It is very clear that he is doing that job right now.\n\nIn this video Jordan goes places in his testimony that he has not spoken about publicly before in any venue. The reptilians are real, he states: to support this, he recounts a fascinating and extraordinary story told to him of one woman's first-hand experience as a young girl on a US Air Force base. He talks about the reality (and return) of the Anunnaki. And he cites Masonic symbolism, that is to be found in ancient texts, the former USSR, Nazi Germany, and the Obama administration - as well as in the forthcoming TV remake of the classic Sci-Fi series 'V' - that shows the interconnectedness of all these themes and cultures: that something or someone is expected to return, and that this event may or may not be in humanity's best interests. \n\nFOR PEOPLE BEING EXPOSED TO THIS TYPE OF MATERIAL FOR THE FIRST TIME...PLEASE KEEP AN OPEN MIND ABOUT WHAT JORDAN MAXWELL HAS TO TELL YOU\n\n\n\n\n-----------------------------------------------------------------------------------\n\nDOWNLOAD VLC PLAYER WHICH YOU CAN USE TO WATCH THIS VIDEO. IT CAN PLAY ANY VIDEO FILE FORMAT UNDER THE SUN\n\nLink: http://www.videolan.org/mirror-geo.php?file=vlc/1.0.5/win32/vlc-1.0.5-win32.exe\n\n-----------------------------------------------------------------------------------\n\n\n\n\nTHANKS FOR DOWLOADING\n\n\n===================================================================================\n-----------------------------------------------------------------------------------\nMy Other Torrents...\n\n1) Proof Of the existence of the Illuminati:\nhttp://thepiratebay.se/torrent/5512911/Proof_Of_The_Existence_Of_The_Illuminati\n\n2) Bush/Nazi Relations during WW2:\nhttp://thepiratebay.se/torrent/5514388\n-----------------------------------------------------------------------------------\n===================================================================================\n\n\n\n\n\n\nRead, and free your mind..... \n","torrent":{"xt":"urn:btih:f350e24d84d7c7c99557c0fa55dc42db731d1387","amp;dn":"Jordan+Maxwell+-+Project+Camelot+Interview","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f350e24d84d7c7c99557c0fa55dc42db731d1387","infoHashBuffer":{"type":"Buffer","data":[243,80,226,77,132,215,199,201,149,87,192,250,85,220,66,219,115,29,19,135]},"announce":[],"urlList":[]}}