{"title":"BBC The planets (2000) DvdRip XviD Documentaire DutchReleaseTeam","uid":6186719,"size":4938036727,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f37e2447c8fc2aae89d18b6beac7ff8f392520e4&amp;dn=BBC+The+planets+%282000%29+DvdRip+XviD+Documentaire+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"DutchReleaseTeam","files":-1,"time":1298132307,"description":"The Planets is een 8-delige documentaire-serie van de BBC. Het is een erg geslaagde serie die in iedere afleveringe ÃƒÂ©ÃƒÂ©n aspect van de planeten en de ruimtevaart belicht. Alles wordt zeer duidelijk gebracht maar het blijft niet op een dummie-niveau: De wat interessantere feitjes worden ook genoemd! Door de logische opbouw en een interessante manier van vertellen, boeit de serie continue. Het introverhaaltje van iedere aflevering doet het speeksel al lopen als je belangstelling hebt in astronomie en aanverwante wetenschappen. Uit oogpunt van geschiedenis is het ook de moeite waard. Hieronder licht ik de 8 afleveringen kort toe!\n\n1. Different Worlds\nDeze aflevering gaat over de vroegste jaren van de ruimtevaart. In de tijd dat men dacht dat er maar 8 planeten bestonden! Nasi-Duitsland was de eerste die met rocketry begon. Alle planeten worden kort toegelicht.\n\n2. Terra Firma\nOver de zoektocht naar vulkanisme op andere planeten en hoe men aanvankelijk dacht dat de andere planeten totaal geen levendige aardschors had maar hoe uiteindeiljk het tegenovergestelde bleek op veel planeten. En dat vulkanen ook heel anders kunnen werken dan op aarde!\n\n3. Giants\nOver de gas giants Jupiter, Saturnus, Uranus en Neptunus die pas veel later van dichtbij zijn bekenen toen Voyager de enorme afstand overbrugde.\n\n4. Moon\nOver de spacerace tussen Russland en Amerika naar de maan en hoe men enorm veel over deze sateliet te weten kreeg en daardoor ook over veel andere dingen in de ruimte.\n\n5. Star\nDeze aflevering gaat over de zon en de sterren. Hoe men aanvankelijk alleen tijdens zonsverduisteringen de zon kon bestuderen, maar later betere methodes ontdekte en tot het besef kwam dat de zon een ster is!\n\n6. Atmosphere\nUitleg over hoe atmosfeer ontstaat, welke planeten ook atmosfeer hebben en hoe deze atmosferen opgebouwd zijn. Zijn er planeten waar mensen wellicht kunnen leven?\n\n7. Life\nOp welke planeten zou er mogelijkerwijs leven kunnen zijn of kunnen ontstaan? Is het mogelijk dat er leven buiten aarde bestaat, of is het juist onmogelijk dat er geen leven buiten onze aarde bestaat? Een theorie is dat leven zich verspreidt via cometen.\n\n8. Destiny\nOver de toekomst van ons zonnestelsel: Hoe de zon zal uitdijen en alle planeten opslokken. Vervolgens exploderen en een zwarte bol worden.\n\nhardcoded dutch subs\n\nmeer info: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0283775/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0283775/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.bbcshop.com/science+nature/the-planets-dvd/invt/bbcdvd1003&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbcshop.com/science+nature/the-planets-dvd/invt/bbcdvd1003&lt;/a&gt;\n\nDeze documentaire wordt u aangeboden door het DutchReleaseTeam\nvoor de reviews van de nieuwste films, muziek, series , games etc\nga dan eens naar  &lt;a href=&quot;\nhttp://www.hetmultimediacafe.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hetmultimediacafe.nl&lt;/a&gt;","torrent":{"xt":"urn:btih:f37e2447c8fc2aae89d18b6beac7ff8f392520e4","amp;dn":"BBC+The+planets+%282000%29+DvdRip+XviD+Documentaire+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f37e2447c8fc2aae89d18b6beac7ff8f392520e4","infoHashBuffer":{"type":"Buffer","data":[243,126,36,71,200,252,42,174,137,209,139,107,234,199,255,143,57,37,32,228]},"announce":[],"urlList":[]}}