{"title":"Jess Klein...Bound to Love(2009)[FLAC]","uid":6146631,"size":330949963,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f508545ca4daa7bddc4178cc97c5b4d95205bd15&amp;dn=Jess+Klein...Bound+to+Love%282009%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":18,"time":1296714778,"description":"ttp://static.rateyourmusic.com/album_images/7744ef7bd3c9d2152efd6b920732cce7/2491923.jpg\n\n2009 Bound to Love   CD  UFO Music UFO1019\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n  1  When the Time Comes -Klein 3:37 \n  2  Don't Wanna Say It -Addison, Klein, Newcomb 3:41 \n  3  Bound to Love -Klein 3:32 \n  4  I Just Want to Know Your Name -Klein 3:38 \n  5  Postcard -Klein 4:03 \n  6  Before I Go -Hiatt 3:47 \n  7  Fool -Klein, Tapia 4:35 \n  8  Putty -Klein 3:55 \n  9  It Will Come to Me -Klein 4:13 \n  10  Travelin' Woman -Klein 4:30 \n  11  Rosalie Klein -4:37 \n  12  What For Klein -4:15 \n\nThe front and back covers of Bound to Love find Jess Klein sporting a new look. Wearing a ten-gallon hat, brown cowboy boots, a denim jacket, and a giant belt buckle, Klein is obviously going for a good ol' gal look -- which is definitely a departure from the East Coast singer/songwriter look that the former Boston, New York City, and Rochester, NY resident favored on previous CD covers. That change of appearance, according to a press release, reflects the fact that Klein moved from the East Coast to Austin, TX in 2008. If 2006's City Garden illustrated Klein's desire to get in touch with the feeling of the blues, Bound to Love underscores her desire to connect with the feeling of country. But this is by no means a hardcore honky tonk outing; nor is Klein offering the sort of contrived, ultra-slick corporate country or &quot;mall country&quot; that Nashville's musical assembly lines are famous (or infamous) for. Klein moved not to Nashville, but to Austin -- a city with an abundance of great roots music -- and the Americana factor and the alt country factor are slightly stronger on this late-2008/early-2009 recording than they were on City Garden or 2005's Strawberry Lover. But the alt country overtones one hears on Bound to Love are exactly that: overtones. Klein still sounds like herself, and she still favors a folk-rock/adult alternative orientation. So when longtime fans hear rootsy gems such as &quot;Rosalie,&quot; &quot;Putty,&quot; &quot;Travelin' Woman,&quot; or &quot;Postcard,&quot; there will be no doubt in their minds that this is a Jess Klein album -- and it is an excellent one at that. If the move to Austin inspired her creatively, she probably did the right thing by leaving the East Coast. But this 48-minute CD -- despite Klein's new cowgirl attire -- isn't a radical change of direction for the singer/songwriter, whose high standards are alive and well on Bound to Love. \n\ncd ripped by dBpoweramp\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2011/01/27/jess-klein/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2011/01/27/jess-klein/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f508545ca4daa7bddc4178cc97c5b4d95205bd15","amp;dn":"Jess+Klein...Bound+to+Love%282009%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f508545ca4daa7bddc4178cc97c5b4d95205bd15","infoHashBuffer":{"type":"Buffer","data":[245,8,84,92,164,218,167,189,220,65,120,204,151,197,180,217,82,5,189,21]},"announce":[],"urlList":[]}}