{"title":"A Doll's House (Norway)  Divx  English subtitles 700MB","uid":5180066,"size":742792722,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f5565fb82f85ae3227b03d91bac2e34452e99353&amp;dn=A+Doll%5C%27s+House+%28Norway%29++Divx++English+subtitles+700MB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mrizzo2","files":-1,"time":1259189046,"description":"We finally found the right formula for a conversion offering of\nthis movie - we bring it in now at 700Megs, just a tad more than\nthe XVID offering from which we first learned of its existance\nas it isnt anywhere for sale that we have looked before now.\n\nThe DivX subtitles appear mid screen when viewed with DivX player\non a PC, and on nicely the lower part of the picture when viewed with\na DivX capable DVD player as just tested here.\n\nThis is one of the most important of our movies. We ask that you\nseed, in the interests of mankind, and that of Nora the main character\nwhose plight is told of here by the Playwright Mr. Henrik Ibsen of Norway.\n\n\nThis is my review of this production - entitled &quot;Et Dukkehjem&quot; when\nin its original Norwegian.)\n\nA dolls house is an important movie for the world. Its ramifications couldn't\npossibly be overstated. It is about the most crucial decisions ahead of us and\nthat have been perennially divisive. Its about what value are real, and most\nworth defending, and who should our leaders be in discerning them for us, given\nthat the world has a psychological dichotomy of sorts that has always been\nunbridgeable between opposite psychological types as are presented in the\nmarriage shown in this movie - and needless to say, cannot be sustained when\nthe facts of these differences are brought to light with sufficient force of\nemotion.\n\nIt needs to be noted that the rendition starring Anthony Hopkins couldn't have\nbeen more miscast, in a way as to altogether retard the basic argument. The\ncontrast between the characters involved. In fact the woman who plays Kristine\nin this Norwegian original work is essentially the type of person that was\npicked to play Nora in the Hopkins version as it were although the comparison\nis only fundamentally valid and I don't go beyond that except to say the\ndifferences are quite apparent when comparing these women to our Nora in this\nNorwegian true to the book version. In fact for those viewing this movie in\nAmerica, or Ireland etc, you will find it hard to see Nora here as anything but\nan Irish woman as that is in fact precisely who she is to you, if you have\nstudied some of the history of the peoples of Ireland and where it is that they\nbroadly originate from, and so I hope your very special interest is altogether\ncaptivated in her plight and your concern for her in our world.\n\nAt the end, the debauchery of the emotions brought about by a forceful\ndisclosure to one another that these two types of beings are so fundamentally\ndifferent brings the character of Nora to see her husband in the movie play\n&quot;Torvald&quot; as a devil in disguise, no less, to her own mindset while he sees her\nas a fallen woman of sorts, lacking a type of virtue as it were, given that she\nhas broken his code, misguided and inane as that viewpoint is by comparison.\n\nYet they will never come to terms with these differences of opinions as they\nare born with different minds on the matter although some would apply the\nnature versus nurture argument to suggest they might be closer brought in the\nfuture. This is both misguided and foolhardy in fact. All that can be done is\nto protect Nora better in that what she brings to our world is in fact the\ngreatest care and nurturing of a real Christianly spirit - and we must see that\nshe is never assailed in her life as she is in this movie for being a good soul\namong men.\n\n\nMichael Rizzo Chessman\nReviews: moviesbyrizzo.info","torrent":{"xt":"urn:btih:f5565fb82f85ae3227b03d91bac2e34452e99353","amp;dn":"A+Doll%5C%27s+House+%28Norway%29++Divx++English+subtitles+700MB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5565fb82f85ae3227b03d91bac2e34452e99353","infoHashBuffer":{"type":"Buffer","data":[245,86,95,184,47,133,174,50,39,176,61,145,186,194,227,68,82,233,147,83]},"announce":[],"urlList":[]}}