{"title":"And the Fans Roared  -The Sports Broadcasts That Kept Us on the ","uid":5058460,"size":25940365,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f584cda56eb0d667fde99879b9ba3f2412ad3ce7&amp;dn=And+the+Fans+Roared++-The+Sports+Broadcasts+That+Kept+Us+on+the+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":44,"time":1250546493,"description":" &lt;a href=&quot;http://bayimg.com/baDmDAace&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/baDmDAace&lt;/a&gt;\n\nAnd the Fans Roared by Joe Garner\nAudiobook | English | Sourcebooks 2000 | ISBN: 1402200315 | MP3 22050Hz 32kbps | 2 hours \n\nThe Sports Broadcasts That Kept Us on the Edge of Our Seats\n\nIn a split second, an athlete or a team makes a decisive move and the crowd roars in the stadium; simultaneously, the sports announcer captures the play and the moment and the noise, sending the fans at home, listening on the radio or watching on television, to their feet. Garner knows that great sports moments are as personal as they are universal, and the most memorable are almost too numerous to name but not quite, as he proved first with his bestselling And the Crowd Goes Wild and as he does, once again, with inimitable flair and momentum, in this spectacular companion containing more of those fateful seconds of history from the pros, the Olympics and college teams: the day Babe Ruth said goodbye to baseball, the buzzer-beating basket that Duke's Christian Laettner scored against Kentucky, the precise millisecond when Flo Jo became the fastest woman in the world, the fight in which Mike Tyson bit Evander Holyfield and 39 others. Garner Dwith popular sportscaster Costas, who narrates the two accompanying CDs with the original, spontaneous and unforgettable broadcasts of every play described in the book makes each singular experience as fresh and hair-raising as it was originally. Arranged chronologically, the book and CD work in tandem, so all readers have to do is sit back and reminisce. 500,000 first printing.","torrent":{"xt":"urn:btih:f584cda56eb0d667fde99879b9ba3f2412ad3ce7","amp;dn":"And+the+Fans+Roared++-The+Sports+Broadcasts+That+Kept+Us+on+the+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f584cda56eb0d667fde99879b9ba3f2412ad3ce7","infoHashBuffer":{"type":"Buffer","data":[245,132,205,165,110,176,214,103,253,233,152,121,185,186,63,36,18,173,60,231]},"announce":[],"urlList":[]}}