{"title":"WinRAR x64 (64 bit) v4.00 Final + KeyReg [ChattChitto RG]","uid":6228578,"size":5744168,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f5c9ca80b7e7e2d6e841c95fd067c9331613729c&amp;dn=WinRAR+x64+%2864+bit%29+v4.00+Final+%2B+KeyReg+%5BChattChitto+RG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ChattChitto","files":-1,"time":1299612790,"description":"WinRAR x64 (64 bit) v4.00 Final + KeyReg\n\n.exe File Format (Setup File - KeyReg - Instructions)\n\n***********************************************************************************\n\nWinRAR x64 (64 bit) v4.00 Final\n\nHomePage: http://www.rarlab.com/rar_archiver.htm\n\n\nWinRAR The WinRAR application was developed to be a powerful compression tool with many integrated additional functions to help you organize your compressed archives.\nWinRAR puts you ahead of the crowd when it comes to compression. By consistently creating smaller archives, WinRAR is often faster than the competition. This will save you disc space, transmission costs AND valuable working time as well.\nWinRAR supports all popular compression formats (RAR, ZIP, CAB, ARJ, LZH, ACE, TAR, GZip, UUE, ISO, BZIP2, Z and 7-Zip).\nWinRAR is ideal for multimedia files. WinRAR automatically recognizes and selects the best compression method. The special compression algorithm compresses multimedia files, executables and object libraries particularly well.\nWinRAR allows you to split archives into separate volumes easily, making it possible to save them on several disks for example.\nWinRAR is also ideal, if you are sending data through the web. Its 128 bit password encryption and its authenticated signature technology will give you the peace of mind you have been looking for. \n\n\nFeatures:\n==========\n-WinRAR introduces an original compression algorithm. It provides high compression ratios on executable files, object libraries, large text files, etc.\n-WinRAR offers an optional compression algorithm highly optimized for multimedia data.\n-WinRAR supports files and archives up to 9,223,372,036,854,775,807 bytes in size, about 9000PB. The number of archived files is unlimited for all practical purposes.\n-WinRAR provides complete support for RAR and ZIP 2.0 archives and is able to unpack CAB, ARJ, LZH, TAR, GZ, ACE, UUE, BZ2, JAR, ISO, Z, 7Z archives.\n-WinRAR supports NTFS file security and data streams.\n-WinRAR offers both a classic interactive Windows interface and the command line interface.\n-WinRAR provides functionality for creating a 'solid' archive, which can raise the compression ratio by 10% - 50% over more common methods, particularly when packing large numbers of small files.\n-WinRAR offers the ability to create and change SFX archives using default and external SFX modules.\n-WinRAR offers the ability to create a multi-volume archive as SFX.\n-WinRAR offers a number of service functions, such as setting a password, adding archive and file comments. Even physically damaged archives may be repaired and an archive may be locked to prevent further changes.\n\n\nWhat's New In v4.00:\n=====================\n    1. RAR decompression speed is improved. Depending on data type,\n       decompression can be up to 30% faster than in previous versions.\n \n       Both the general RAR algorithm and most of special RAR multimedia\n       methods benefit from this improvement. The only module of RAR\n       algorithm, which is not affected, is &quot;Text compression&quot; method.\n   \n    2. Changes in ISO support:\n   \n      a) UDF support is upgraded to UDF 2.50 revision. It makes possible\n      to unpack most of Blu-ray ISO files;\n\n      b) when browsing UDF ISO file, UDF revision number is displayed\n         after the &quot;UDF&quot; format name in WinRAR address bar\n         and in archive information dialog;\n\n      c) WinRAR sets the folder modification date when unpacking folders\n         stored in UDF and ISO9660 files.\n   \n   3. Changes in password dialog:\n\n      a) WinRAR uses the same format of password dialog both when archiving\n         and extracting, so &quot;Show password&quot; option is available also\n         when extracting;\n\n      b) &quot;Organize passwords...&quot; button in password dialog provides\n         access to password organizer interface, where you can specify\n         your frequently used passwords. You will be able to access these\n         saved passwords using the drop down list or autocomplete feature\n         in password dialog.\n\n         It is important to know that saved passwords are not encrypted\n         and anybody having access to your computer can view them.\n         Use &quot;Organize passwords&quot; feature only if your computer is\n         protected from unauthorized access;\n\n      c) &quot;Use for all archives&quot; option is available in password dialog\n         when unpacking several archives at once. You can utilize it\n         to apply an entered password to all archives.\n\n         If you use this option with an empty password, WinRAR will skip\n         all encrypted archives;\n\n      d) Unlike previous versions, the password from default compression\n         profile is not used for extraction.\n         \n         If you wish to use the same password for all extracting archives,\n         press &quot;Organize passwords...&quot; button in the password dialog\n         and define a new password entry, specifying &quot;*&quot; file mask \n         in &quot;Select for archives&quot; field.\n   \n   4. In Windows 7 WinRAR will display the total operation progress\n      also on WinRAR icon on Windows taskbar. You can disable it using\n      &quot;Taskbar progress bar&quot; option on &quot;General&quot; page of WinRAR settings.\n\n   5. Numerous Unicode support improvements allow to process non-English\n      file names more smoothly. These improvements include:\n\n      a) better Unicode handling in WinRAR in &quot;Rename&quot;, &quot;Convert&quot;,\n         &quot;Find&quot; and other commands, in folder tree panel, in password \n         request dialog and in many other parts of WinRAR interface;\n\n      b) correctly displayed Unicode names in WinRAR items in Explorer\n         context menus;\n\n      c) Unicode support in .lng files, making WinRAR localization\n         possible for Unicode only languages.\n   \n   6. Changes in -x switch syntax. Now you can specify a wildcard\n      exclusion mask for folders. Such mask must have the trailing '\\'\n      character, like -x*tmp*\\ or -x*\\temp\\\n\n   7. New &quot;Extract relative paths&quot; option in &quot;Advanced&quot; part of extraction\n      dialog. If you browse some archive subfolder in WinRAR shell\n      and enable &quot;Extract relative paths&quot; option, the path part up to\n      and including the current subfolder will be removed from extracted\n      file paths.\n      \n      For example, if you are inside of &quot;Backup\\MyData&quot; archive folder\n      and extract &quot;Images&quot; folder, it will be extracted as &quot;Images&quot;,\n      not as &quot;Backup\\MyData\\Images&quot;.\n\n      This option is the new default extraction mode, but you can change\n      the default back to WinRAR 3.x style. Just select &quot;Extract full paths&quot;\n      and then press &quot;Save settings&quot; in &quot;General&quot; part of extraction dialog.\n   \n   8. Windows 98, Windows Me and Windows NT are not supported by WinRAR\n      and WinRAR self-extracting modules anymore. Minimum Windows version\n      required for WinRAR 4.0 is Windows 2000.\n      \n      If you need to run WinRAR on older Windows, you can download\n      previous WinRAR versions from ftp://ftp.rarlab.com/rar\n\n   9. If TAR, TAR.GZ or TAR.BZ2 archive contains symbolic or hard links\n      and if destination file system is NTFS, WinRAR will create these\n      links when unpacking such archive. WinRAR will create symbolic links\n      as symbolic and hard links as hard in Windows Vista and newer\n      and it will create all links as hard in older Windows.\n\n      If destination file system is FAT32 or any other not supporting\n      file links, WinRAR will skip links when unpacking TAR, TAR.GZ\n      and TAR.BZ2 archives.\n   \n  10. Recovery volume processing involves less disk seek operations\n      resulting in higher performance.\n\n  11. You can select Windows 7 library in tree panel in extraction dialog\n      and WinRAR will use its default save location as the destination path.\n\n  12. &quot;Report&quot; command allows to select HTML, Unicode text and usual text\n      as output format for report file. Unlike previous WinRAR versions,\n      now WinRAR preservers Unicode characters in reports when using HTML\n      or Unicode text format. So non-English characters in file names\n      will be displayed properly in such reports.\n   \n  13. Message list in GUI SFX archives displays only operation status\n      and error messages. It does not contain names of all extracted files\n      anymore. This change improves the speed and reduces memory requirements\n      for SFX archives containing a large number of files. Also it makes\n      easier to locate error messages, because they are not hidden among\n      extracted file names.\n\n  14. GUI SFX archives display &quot;Extract&quot; button instead of &quot;Install&quot;\n      if no &quot;Setup&quot; or &quot;Presetup&quot; commands are present in the archive\n      comment. If you prefer &quot;Install&quot; button, but do not need to\n      execute any setup programs, you can add &quot;Setup=&lt;&gt;&quot; command.\n  \n  15. WinRAR displays the current percent above the operation progress bar\n      when repairing an archive containing the recovery record\n      and when processing recovery volumes.\n\n  16. WinRAR limits the maximum possible volume size to 4 GB minus 1 byte\n      when creating RAR volumes on a disk with FAT or FAT32 file system\n      in volume size autodetecting mode. These file systems do not support\n      4 GB and larger files.\n\n  17. If &quot;Wait if other WinRAR copies are active&quot; option is enabled\n      and WinRAR waits for another copy, you can press &quot;Continue&quot; button\n      in command progress window to force WinRAR to stop waiting.\n      So now &quot;Continue&quot; button allows to override the state of\n      &quot;Wait if other WinRAR copies are active&quot; option for current operation.\n\n  18. WinRAR displays one password request instead of two, when saving\n      an encrypted file back to RAR or ZIP archive after modifying it\n      in some external editor. Previous WinRAR versions usually requested\n      the password twice, both when extracting the original file\n      and archiving its modified copy. Only RAR archives with encrypted\n      file names were processed with the single password prompt.\n\n  19. New error code 10 (&quot;no files&quot;) is added to list of error codes\n      returned in command line mode by RAR and WinRAR. This new code\n      can be returned by archive, extract, delete and repair commands.\n      It means that RAR did not find any files matched the specified\n      file or archive mask.\n  \n  20. File name area in file overwrite dialog occupies several lines now.\n      It makes possible to display much longer names.\n  \n  21. Now switch -ep3 converts not only disk letters, but also UNC paths.\n      So \\\\server\\share will be converted to __server\\share when archiving\n      and restored to the original \\\\server\\share when extracting with -ep3.\n\n  22. New &quot;Background extraction&quot; option in &quot;Advanced&quot; part of extraction\n      dialog places WinRAR into background, when extracting files.\n      You can save its default state with &quot;Save settings&quot; button in &quot;General&quot;\n      part of extraction dialog, just like for other extraction options.\n\n      &quot;Background archiving&quot; option from the default compression profile\n      does not affect the extraction behavior anymore.\n\n  23. &quot;Mode...&quot; button in operation progress window is enabled also\n      when extracting or testing archives. It provides access to \n      &quot;Command parameters&quot; dialog, where you can set &quot;Turn PC off when done&quot;\n      option for extraction and test operations.\n\n      Previously this dialog was accessible only when archiving.\n\n  24. Bugs fixed:\n\n      a) renaming a file in archive could also rename all other files\n         with the same name in other folders of the same archive;\n\n      b) previous versions displayed the wrong total packed size\n         in &quot;Info&quot; command for multivolume CAB archives;\n\n      c) in ZIP archives 'U' (update) and 'F' (fresh) commands could\n         erroneously update even files not specified in the command line.\n         It happened only for files in current folder which names matched\n         files in ZIP archive. This bug was not present in usual 'A' (add)\n         archiving mode.\n\n***********************************************************************************\n\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n\n(If You Found Something &quot;Un-Clean&quot; In Any Of My Torrents, Consider That It May Be A False Positive(Alert) And If you Are Sure Please Report It To Me So I Would Remove It)\n\n[Please Leave A Comment Confirming This Pack]","torrent":{"xt":"urn:btih:f5c9ca80b7e7e2d6e841c95fd067c9331613729c","amp;dn":"WinRAR+x64+%2864+bit%29+v4.00+Final+%2B+KeyReg+%5BChattChitto+RG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5c9ca80b7e7e2d6e841c95fd067c9331613729c","infoHashBuffer":{"type":"Buffer","data":[245,201,202,128,183,231,226,214,232,65,201,95,208,103,201,51,22,19,114,156]},"announce":[],"urlList":[]}}