{"title":"Severed Ways - The Norse Discovery of America DVDRip 2007","uid":5619971,"size":1463476224,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f5e9f3d22fe8bc9f670148eea84d3866c9e2e036&amp;dn=Severed+Ways+-+The+Norse+Discovery+of+America+DVDRip+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"adakaboom","files":2,"time":1276225032,"description":"Seth Feingold says:\n\n&quot;Severed Ways is a film that reminds me of a fable, of the story books I read as a child, the ones with big images of a dark and imposing forest spilling out across the page, split by the spine of the book. Before the forest is the hero. He might be walking into it or standing at the edge, but the implication was always this: his destiny lay in the woods, the weird wilderness. The narrative was always straight, speaking of determined and unrelenting action rendered in simple typeface &quot;He traveled on...&quot; or &quot;Once into the woods....&quot; And, upon turning the page, there would be a sudden shift, an amazing passage of indeterminate time would find the hero suddenly confronted by a fantastic witch full of temptation and secrets or he might just as well be forced to fight a strange enemy upon an empty place.\n\nThere is no new story to tell, the fables, the allegories stay with us. The Sagas, folk tales, the Baba Yaga, Aesop, Grimm. In these disparate branches of allegory lie the template for Severed Ways.\n\nIn many ways, what we see in this film is at once the most happenstance and anthropological examination of an event that never was, it feels as if the drive of the narrative is to paint large, language-free landscapes of simple action. Travel. Eat. S#@t. F#@k. Fight. Die. And yet, there is a subtler language operating, one that doesn't speak in words, forsaking speech for the language expressed in the mountains, streams, trees and sounds of the forest, a forest that once stretched unbroken from the Atlantic coast to the Mississippi River, from south of Hudson's Bay to the Gulf of Mexico. A forest that had no name, no history in written words.\n\nTravel. Eat. S#@t. F#@k. Fight. Die. That is the simple ethos of this film.\n\nWatch this film like you are reading a fable and get over your clichÃƒÂ©d expectations already. &quot;\n\nLanguage: N/A\nFile Type: AVI - XviD 1.1.2 Final\nFile Size: 1.36 GB\nFile Duration: 01:49:03\nKBPS: 1286\nFPS: 23.976\nResolution: 640 x 272","torrent":{"xt":"urn:btih:f5e9f3d22fe8bc9f670148eea84d3866c9e2e036","amp;dn":"Severed+Ways+-+The+Norse+Discovery+of+America+DVDRip+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5e9f3d22fe8bc9f670148eea84d3866c9e2e036","infoHashBuffer":{"type":"Buffer","data":[245,233,243,210,47,232,188,159,103,1,72,238,168,77,56,102,201,226,224,54]},"announce":[],"urlList":[]}}