{"title":"Atonement (2007 NL subs) 2Lions-Team","uid":5123344,"size":4676460876,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f614d9f82abab69be16ad97626818f92036cb9f8&amp;dn=Atonement+%282007+NL+subs%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rocco64","files":-1,"time":1255471654,"description":"Verenigd Koninkrijk / Frankrijk\nDrama / Oorlog\n123 minuten\n\ngeregisseerd door Joe Wright\nmet Keira Knightley, James McAvoy en Romola Garai\n\nZomer 1935. De 13-jarige, uit een gegoede familie afkomstige, Briony Tallis (Saoirse Ronan) is een ontluikende toneelschrijfster. Ze wil dat haar nichtje Lola en de tweeling Jackson en Pierrot een toneelstuk uitvoeren gebaseerd op ÃƒÂ©ÃƒÂ©n van Briony's verhalen, maar het lijkt nergens op. Die dag echter ziet ze hoe Robbie, de zoon van de bediende van het huis, Briony's zus Cecilia laat strippen en nadat ze daarna een obscene brief van Robbie aan Cecilia leest, trekt ze haar eigen conclusies. Wanneer haar nichtje Lola de volgende dag wordt verkracht, beschuldigt ze zonder veel bewijs Robbie van de misdaad. Iedereen gelooft haar behalve haar zus Cecilia, die nog steeds hopeloos verliefd is op Robbie. Robbie, echter, belandt door toedoen van Briony in de gevangenis en raakt spoedig als jonge soldaat in Frankrijk betrokken in de slag om Duinkerken. Een en ander zorgt nog jarenlang voor de nodige strubbelingen in de familie Tallis.\n\n\n\nEngels:\n\nWhen Briony Tallis, 13 years old and an aspiring writer, sees her older sister Cecilia and Robbie Turner at the fountain in front of the family estate she misinterprets what is happening thus setting into motion a series of misunderstandings and a childish pique that will have lasting repercussions for all of them. Robbie is the son of a family servant toward whom the family has always been kind. They paid for his time at Cambridge and now he plans on going to medical school. After the fountain incident, Briony reads a letter intended for Cecilia and concludes that Robbie is a deviant. When her cousin Lola is raped, she tells the police that it was Robbie she saw committing the deed when in fact it was a visitor to the estate\n\n\n\n******************************************\n\nBrought to you by Rocco van\n2Lions-Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n******************************************\n\n\n","torrent":{"xt":"urn:btih:f614d9f82abab69be16ad97626818f92036cb9f8","amp;dn":"Atonement+%282007+NL+subs%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f614d9f82abab69be16ad97626818f92036cb9f8","infoHashBuffer":{"type":"Buffer","data":[246,20,217,248,42,186,182,155,225,106,217,118,38,129,143,146,3,108,185,248]},"announce":[],"urlList":[]}}