{"title":"Army Of Lovers - Le Grand Docu-Soap - Greatest Hits + [320 kbps]","uid":5017521,"size":586162284,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f65fadbbe6689f958ec4b18b89d79b7a2b31ddaf&amp;dn=Army+Of+Lovers+-+Le+Grand+Docu-Soap+-+Greatest+Hits+%2B+%5B320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"musicalibera","files":62,"time":1248294757,"description":"ARMY OF LOVERS  - Le Grand Docu-Soap / Le Remixed Docu-Soap + (2001)\n\nCodec: mp3.\nDescription: MPEG-1 Audio Layer 3.\nBit rate: 320 kbps.\nSample rate: 44100 Hz joint stereo.\nTags: ID3V1 &amp; ID3V2.\nSource formats: CD.\nNumber of tracks 44.\nPlaylists: Le Grand Docu-Soap, Le Remixed Docu-Soap, Le Remixed Docu-Soap +, Le Grand/Remixed Docu-Soap, Le Plus Grand Docu-Soap Du Monde\n\nArmy Of Lovers's second official &quot;best of&quot; album, released in 2001. \n\nWhen Alexander Bard at the peak of Army of Lovers' international career once was asked by a reporter who he thought their fans were, on a strictly demographic basis, he instantly replied: &quot; - I know exactly who they are. They're the ones who sat at the very back in the classroom and sometimes came to school wearing a feather boa. And their best friends were always girls who later turned out to be fag hags.&quot; The reporter laughed at his reply - but as usual there was a certain truth in his thesis. There usually is when Alexander Bard speaks. Not always, but often. \n\nIt therefore came as no surprise that when Army Of Lovers in 2001 announced that they were to reunite for an updated greatest hits album plus one single live performance -  just the one - that the venue they chose was that year's Stockholm Pride, the annual Gay Pride Festival. They may have played to considerably larger audiences before, apparently once to some 300 000 in Volgograd... or was it Sverdlovsk... either way.... And they may have had their famous so called Army Tabernacle Choir backing them in the studio, some of whom actually were classically trained opera singers, others well-known gospel singers, others members of well-known (Real) accapella Groups, while some, for reasons best known to themselves, preferred to remain anonymous.... I'm digressing.... But that late August night at Tantolunden in 2001 Army Of Lovers most likely had their strongest and loudest vocal backing ever. Some 10 000 Swedish gays, lesbians, bisexuals, transgenders, bears, drag queens, leather hunks, drag kings, muscle marys, some stray heterosexuals and everybody else who were there joined forces with the Army and sang &quot;I'm crucifiiiiiiiiied! Crucifiiiiiiiiied! Like my saaaaaaaaaviour!&quot; as one. It was eardeafening I tell ya! The band &quot;played&quot; all their greatest hits, one pop pearl after the other, &quot;Obsession&quot;, &quot;Ride The Bullet&quot;, &quot;Give My Life&quot;, &quot;Sexual Revolution&quot; and we all knew the lyrics by heart and the rapturous applauds never seemed to end. But after an hour or so, it was all over. The Army Of Lovers reunion sadly ended just as quickly as it had begun, but for those of us who were lucky enough to be there that night it's a memory for life.\n \nArmy Of Lovers' updated &quot;best of&quot; included three new recordings, all cover versions and all carefully chosen. The first was Ottawan's 1980 disco ditty &quot;Hands Up&quot;. The second was &quot;Let The Sunshine In&quot; from the musical &quot;Hair&quot;. The third was &quot;Everybody's Gotta Learn Sometime&quot;, the Korgis' heartbreaking ballad whose lyrics take on an entirely different meaning and become both poignant, relevant and political when sung by Army Of Lovers. Just listen to Jean-Pierre's spoken part in the middle eight:  &quot;Les panthÃƒÂ¨res grises dÃƒÂ©testent les enfants terribles.... Les gens d'ÃƒÂ©glise dÃƒÂ©testent les enfants terribles....&quot;. But &quot;everybody's gotta learn sometime&quot;.\n\nThe album was entitled &quot;Le Grand Docu-Soap&quot; and naturally there was a thought behind that specific title. Army Of Lovers had at that point in time been an extended family for well over a decade and they had really done it all; in the early days they had used psedonyms like Barbie (Alexander in drag), Farouk (Jean-Pierre) and Katanga (La Camilla). They had released a whole series of singles and albums that went straight to the bargain bins. They had played gigs to both large and very _very_ small crowds alike. They had quite unexpectedly conquered the charts. They had gone from being ridiculed underdogs to mainstream media darlings. They and Alexander's plastic toy guitar had travelled the world widely and they had suffered fools together. But never gladly. They had been declared the new ABBA and consequently geniuses. They had been dismissed as sad second rate ABBA copycats and consequently absolute rubbish. \n\nTheir record company had spent stupendous sums of money on videos which were only aired once or twice in their home country and which were completely banned by both MTV US and MTV Europe. All according to plan. They had been viciously attacked by homophobes, racists and mighty Men of God, but they had found strength in each other to continue their love crusade regardless. They had had a chart hit that went &quot;Evenu shalom aleichem&quot; (translated: &quot;We brought peace unto you...&quot;) in Germany. Just think about that for a second. I repeat; in Germany. Get it? (In Hebrew, for those of you who don't.) They had said &quot;thanks, but no thanks&quot; to ludicrously lucrative offers from major American record companies who in return wanted them to make videos with less references to indiscriminate sex, religion, enemas, mental disorders, death, billionaire Turkish-Saudi Arabian arms-dealers, various phallic objects and lobotomies (read: dumb down for the Mid-West.....ooooooooh, the irony). \n\nThey had still made millions of kronor, D-marks and rubels and for that they loved each other. They had released one song in which they actually played all instruments and sang all vocals themselves. It was horrific. No really. Tinnitus-inducing stuff. They had rebelled against their self-appointed head of family, a man with a king-sized ego who never is wrong, just occasionally misinformed. Some of them had carelessly wasted most of their kronor, D-marks and rubels on hotel bills, champagne and heavy-duty jewellry. They had released songs with religious undertones that went whooooosh over the heads of their strictly Lutheran Swedish audiences. They had very discretely hinted that a certain Swedish rap star and former dentist actually was a &quot;battyman&quot; in denial. Most of the time they had put up with each other. They had been accused of milking the pink pound, dollar and zloty for all it was worth. \n\nThey had occasionally quarelled. They had actually fought like bitches from hell. At times they had downright hated each other. But they had also managed to put their petty differences aside and they had returned to that extended but slightly dysfunctional family which went by the name of Army Of Lovers. Again and again. And - most importantly - everything had been caught on camera. Every event/non-event and every nasty comment had been carefully reported, documented and thoroughly analysed in the media, who were monitoring their every move. All five members were headstrong, opinionated and, unlike the average Swede, never hesitated to speak their minds, a fact that journalists like Stina Dabrowski were well aware of. They were simply the original docu-soap, or reality television show if you prefer, long before Endemol came up with &quot;Big Brother&quot;, &quot;The Real World&quot;, &quot;Survivor&quot; and all the others. They had schemed and made secret pacts and they had voted each other out, by firing members of the band, and they had done more than their fair share of backstabbing. Had they ever. \n\nThe main difference between Army Of Lovers and the other docu-soaps was that they in the midst of their loving bitch fest with the assistance of among others Emil Hellman, Magnus Frykberg, Anders Hansson, Tim Norell, Ola HÃƒÂ¥kansson (Oson), Thomas Wollbeck, Per Adebratt, Max Martin and the late Denniz Pop also had churned out a staggering number of anthemic pop singles. Songs that had shifted millions of &quot;units&quot; worldwide. All with hook-laden choruses that you just couldn't get out of your head, no matter how hard you tried. When hearing a classic orgiastic, orgasmic Army Of Lovers chorus sung by that glorious Tabernacle Choir  &quot;Heaven is near, heaven is near, glory hallelujah, heaven is near&quot;, to quote just one of them.\n \nSo; all rise and salute the greatest army of them all, the Army Of Lovers - and let their sunshine in......L'amour de Dieu n'a pas de frontiÃƒÂ¨res....\n\n....simply....\n\nTRACK LIST\n\nLe Grand Docu-Soap\n===================\n01. Ride The Bullet (1992 Remix)\n02. Crucified\n03. Obsession\n04. Give My Life\n05. Sexual Revolution\n06. Israelism\n07. I Am\n08. Lit De Parade (Radio Edit)\n09. Let The Sunshine In\n10. Life Is Fantastic (The 1995 Remix)\n11. Venus &amp; Mars\n12. King Midas\n13. My Army Of Lovers\n14. La Plage De Saint Tropez\n15. Candyman Messiah (Single Remix)\n16. Hands Up\n17. Everybody's Gotta Learn Sometime\n18. Supernatural (1991 Remix)\n\nLe Remixed Docu-Soap +\n=======================\n01. Ride The Bullet (Tren De Amor Mix)\n02. Crucified (The Nuzak Remix)\n03. Obsession (Schizoperetta Mix) \n04. Give My Life (Sound Factory Mix) \n05. Sexual Revolution (Latin Club Mix)\n06. Israelism (Goldcalfhorahhorror Mix) \n07. I Am (Post Modern Dance Vocal Mix)    \n08. Lit De Parade (Plaisir De Nirvana Mix)\n09. Let The Sunshine In (M12 Maximum Long Club Mix)\n10. Candyman Messiah (Tolstoy Farm Mix)\n+\n11. Life Is Fantastic (Scatman, John Long Club Remix)\n12. Venus &amp; Mars (Antiloop Club Mix)\n13. King Midas (Manhattan Massacre Mix)\n14. My Army Of Lovers (Concrete Ghetto Mix)\n15. La Plage De Saint Tropez (Cancanpourbonbondepapa Mix)\n16. Hands Up (Earthbound's Long House Up Mix)\n17. Judgement Day (GÃƒÂ¶tterdÃƒÂ¤mmerung Mix)\n18. Everytime You Lie (Extended Mix)\n19. Supernatural (Disco Extravaganza Mix)\n20. Baby's Got A Neutron Bomb (Disco Extravaganza Mix)\n21. Love Me Like A Loaded Gun (Disco Extravaganza Mix)\n22. When The Night Is Cold\n23. Let The Sunshine In (Extended Mix)\n24. Let The Sunshine In (M12 Maximum Short Club Mix)\n25. Hands Up (Extended Mix)\n26. Hands Up (Earthbound's Short House Up Mix)\n\nEnjoy - and thanks in advance for seeding.","torrent":{"xt":"urn:btih:f65fadbbe6689f958ec4b18b89d79b7a2b31ddaf","amp;dn":"Army+Of+Lovers+-+Le+Grand+Docu-Soap+-+Greatest+Hits+%2B+%5B320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f65fadbbe6689f958ec4b18b89d79b7a2b31ddaf","infoHashBuffer":{"type":"Buffer","data":[246,95,173,187,230,104,159,149,142,196,177,139,137,215,155,122,43,49,221,175]},"announce":[],"urlList":[]}}