{"title":"Angel_1x08.-.Il.ritorno.di.Buffy(ITA)[CR-Bt].avi","uid":5170656,"size":524060672,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f6bb302478820be86a7a61883dcbc8ff1c0b898a&amp;dn=Angel_1x08.-.Il.ritorno.di.Buffy%28ITA%29%5BCR-Bt%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CR-Bt","files":1,"time":1258666781,"description":"Alla serie, concentrata sull'attivitÃƒÂ  di Angel a Los Angeles, ÃƒÂ¨ stato dato un tono piÃƒÂ¹ tetro rispetto a Buffy l'ammazzavampiri. Il telefilm tratta la storia di Angel, un vampiro che dopo una serie di aberranti omicidi e torture contro le sue vittime, ÃƒÂ¨ tormentato dal ritorno della sua anima.\nDurante le prime quattro stagioni ÃƒÂ¨ a capo di un'agenzia investigativa (la &quot;Angel Investigations&quot;); Angel lavora quindi come detective privato in una versione romanzata di Los Angeles, California, dove lui e i suoi collaboratori si impegnano ad &quot;aiutare gli indifesi&quot; e a &quot;salvare le anime&quot; di coloro che hanno perso la strada. In genere, questa missione comporta la lotta contro il Male o demoni alleati con l'uomo (in primo luogo lo studio legale Wolfram &amp; Hart).\nCome sfondo alla serie c'ÃƒÂ¨ la sfida che Angel deve affrontare: la consapevolezza della sua natura oscura (il suo alter-ego Angelus) e la possibilitÃƒÂ  di ridiventare umano grazie all'adempimento di un'antica profezia (la Shanshu). Nella quinta stagione, i Soci Anziani della Wolfram &amp; Hart affidano ad Angel il controllo dello studio di Los Angeles della loro societÃƒÂ , nel tentativo di corrompere i suoi buoni propositi. Angel accetta, consapevole che l'accordo costituirÃƒÂ  un'opportunitÃƒÂ  per la lotta contro il male dal suo interno. Una scelta che avrÃƒÂ  perÃƒÂ² conseguenze catastrofiche per il suo gruppo, con la morte di alcuni dei suoi piÃƒÂ¹ cari amici e lo scontro finale con le Armate Infernali sullo sfondo di un mondo sul baratro dell'Apocalisse.","torrent":{"xt":"urn:btih:f6bb302478820be86a7a61883dcbc8ff1c0b898a","amp;dn":"Angel_1x08.-.Il.ritorno.di.Buffy%28ITA%29%5BCR-Bt%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6bb302478820be86a7a61883dcbc8ff1c0b898a","infoHashBuffer":{"type":"Buffer","data":[246,187,48,36,120,130,11,232,106,122,97,136,61,203,200,255,28,11,137,138]},"announce":[],"urlList":[]}}