{"title":"Marvel Ultimate Alliance 2 [ENGLISH][XBOX360][REGIONFREE]","uid":5084867,"size":6963996889,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:f6fb14428c5449199efdf1ba20fedadea72891cb&amp;dn=Marvel+Ultimate+Alliance+2+%5BENGLISH%5D%5BXBOX360%5D%5BREGIONFREE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"laurinha","files":72,"time":1252633080,"description":"El ejercito mas grande de superheroes esta de regreso en Marvel: Ultimate Alliance 2\n\nLos poderes chocan cuando los superheroes se dividen en dos grandes bandos: los que aceptan transformarse en agentes pagados por el gobierno. Los que pretenden seguir manteniendo su independencia sobre todo lo demas, su identidad secreta lo mas lejos posible del conocimiento publico. Deberas elejir entre el grupo de los Pro-Registration y Anti-Registration y armar tu dream team de 4 personajes, de un total de 24 heroes y villanos jugables. Hazte poderoso como nunca con mas de 250 fusiones (poderes combinados), destrucciones masivas en escenarios completamente interactivos, nuevos personajes y customizacion de equipos.\n\nEl destino del Universo Marvel esta ahora en tus manos!\n\n- Crea y customiza tu super equipo: Arma tu dream team del Universo Marvel, selecciona integrantes entre mas de 24 personajes jugables, cada cual con poderes especializados.\n- Coopera con los de tu alianza: Aprovecha al maximo el Universo Marvel jugando en modo cooperativo online/offline con hasta cuatro amigos.\n- Elije bando en la impredecible Civil War de Marvel: Elije bando en esta guerra ideologica que podria traer consecuencias irreparables para la comunidad. Apoya la causa de los que quieren registrarse, o los que estan totalmente en contra del registro y pelean por sus libertades individuales.\n- Pelea contra el miedo con fusiones: Combina poderes para resultados realmente devastadores. Forma equipo con La Antorcha Humana y Thor para crear un terrible tornado ardiente. Mas de 250 fusiones en total y un arsenal inimaginable para combates sin precedentes.\n- Maneja super poderes en ambientes totalmente destruibles: Demuele e interactua con todo lo que te cruces por el camino. Tirale a tus enemigos con todo lo que tengas a tu alrededor, sean autos destrozados, postes de luz, maquinaria, y cualquier otra cosa que puedas encontrarte por el camino.","torrent":{"xt":"urn:btih:f6fb14428c5449199efdf1ba20fedadea72891cb","amp;dn":"Marvel+Ultimate+Alliance+2+%5BENGLISH%5D%5BXBOX360%5D%5BREGIONFREE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6fb14428c5449199efdf1ba20fedadea72891cb","infoHashBuffer":{"type":"Buffer","data":[246,251,20,66,140,84,73,25,158,253,241,186,32,254,218,222,167,40,145,203]},"announce":[],"urlList":[]}}