{"title":"Blender Foundation's Chaos and Evolutions - Digital Painting Co","uid":6292226,"size":8455522304,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f744a6b8a3c4fd99684c529717b19e6ab4a571f2&amp;dn=Blender+Foundation%5C%27s+Chaos+and+Evolutions+-+Digital+Painting+Co&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"BR_pirate_sam","files":1,"time":1301860977,"description":"Digital painting course using free/open source software.\n\nCreated by David Revoy, art director and concept artist of project Durian, Sintel.\n\nThis DVD covers all aspects to create advanced digital paintings, concept art, character design, creature design, environments, illustrations and model sheets. Seven main tutorial videos are devoted to teach the best tips and tricks about digital sketching, drawing, Alchemy, coloring, painting, finishing and creating model sheets. And eight additional videos will present you more than 20 hours of full timelapse in HD (1440x896) minimalisticly commented to let you free to explore and learn the part you are interrested in.\n\nThe DVD assumes you already got a tablet and know the basic of drawing from imagination, 2D painting software and image manipulation. It is especially targeted at people who look for a a strong workflow to create 2D project from A to Z in a collaborative or professional environment.\n\nChaos &amp; Evolutions includes Alchemy and GIMP 2.6.6 patched with GIMP-painter for Windows, Mac OSX and Linux, as well as a customized brush kit, and all WIP files. it also includes MyPaint for Windows and Linux.\n\nAll the examples have been done with only free and open source software, mainly GIMP. You can follow the tutorials with your own 2D application too; like Photoshop / Painter / TVPaint / Krita / etc... ( Note: one bonus video uses Mypaint!).\n\nThe DVD tutorials use a music soundtrack, without voice over. Non-obtrusive simple English labels will guide you, which makes it especially targeted at an international public.\n\nThe videos are in 1440x896 and play well in the free VLC player.\n\nBy purchasing this DVD you support the Blender Foundation projects.\n\nThe Blender Open Movie Workshop DVD series is a Blender Institute product, targeted at spreading the knowledge of previous participants in Open Projects. The videos and all files on the DVD are freely licensed as Creative Commons. DVD revenues will be used to support current and future Open Blender projects.\n\nContents:\n01 Sketching\n02 Drawing\n03 Alchemy\n04 Coloring\n05 Painting\n06 Finishing\n07 Model Sheet\n08 Character Design (Full timelapse) : Shain the Ogre\n09 Character Design (Full timelapse) : Lia Turtle\n10 Character Design (Full timelapse) : Cendrea\n11 Creature Design (Full timelapse) : A Sci-fi waterhorse\n12 Environement Design (Full timelapse) : Lia Planet\n13 Digital painting (Full timelapse) : Shain against the Dragon.\n14 Digital painting (Full timelapse) : Portrait of Cendrea\n15 Model Sheet (Full timelapse) : Steampunk Lia\n16 Bonus : Quetzalcoat\n\n_______________________________________________________\n\nIF YOU LIKE THIS, GO TO THE SITE, BUY THE DVD OR SOMETHING ON THE STORE, AND SUPPORT BLENDER FOUNDATION AND OPEN SOFTWARE!\n","torrent":{"xt":"urn:btih:f744a6b8a3c4fd99684c529717b19e6ab4a571f2","amp;dn":"Blender+Foundation%5C%27s+Chaos+and+Evolutions+-+Digital+Painting+Co","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f744a6b8a3c4fd99684c529717b19e6ab4a571f2","infoHashBuffer":{"type":"Buffer","data":[247,68,166,184,163,196,253,153,104,76,82,151,23,177,158,106,180,165,113,242]},"announce":[],"urlList":[]}}