{"title":"Martin Solveig Ft Dragonette - Boys &amp; Girls.mpg","uid":5119118,"size":76699652,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f766cde56946571b41cb6e62210db4b2dda425ff&amp;dn=Martin+Solveig+Ft+Dragonette+-+Boys+%26+Girls.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"claudeq","files":1,"time":1255222909,"description":"Martin Solveig (born Martin Picandet) is a French house music DJ and producer from Paris. He also does a program on 98.2 Radio Colboite (FG DJ Radio) on Tuesday nights between 10pm and 11pm. He is signed to Defected Records.\n\n\nMartin Solveig was born in 1976 in the city of Paris in France. He was raised on classical music by his parents. However, at the age of 13 he was given a turntable set as a present, which drew his attention to the musical genre of electronica. His first residency was at the Le Palace club where he was mentored by Claude Monnet. After his stay at Le Palace, he moved on to another night club, Les Bains Douches. There, he worked alongside DJs such as Todd Berry, Roger Sanchez and Bob Sinclar. \n\n\nIn 2002, Martin Solveig released the album Sur La Terre, which contains both &quot;Heart of Africa&quot; and &quot;Edony&quot;. The album was released internationally through Universal Music. The album was released in 2004 in the US. &quot;Madan&quot; and &quot;Rocking Music&quot; have both been featured in his second album, Suite.\n\nMadan was remixed as the French World Cup song &quot;Zidane Il Va Marquer!&quot; (&quot;Zidane, he's going to score!&quot;) prior to the 2006 final between Italy and France. Following singles included &quot;I'm A Good Man&quot;, and &quot;Everybody&quot;. Solveig was one of the producers for Bob Sinclar's album Western Dream.\n\n\nEnjoy\n\n","torrent":{"xt":"urn:btih:f766cde56946571b41cb6e62210db4b2dda425ff","amp;dn":"Martin+Solveig+Ft+Dragonette+-+Boys+%26+Girls.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f766cde56946571b41cb6e62210db4b2dda425ff","infoHashBuffer":{"type":"Buffer","data":[247,102,205,229,105,70,87,27,65,203,110,98,33,13,180,178,221,164,37,255]},"announce":[],"urlList":[]}}