{"title":"The Sound of Trumpets - John Mortimer","uid":5118851,"size":133992831,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f7a8b02791fbaeeb5c42bdb6e71980c28a6d32cb&amp;dn=The+Sound+of+Trumpets+-+John+Mortimer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eddie1969","files":-1,"time":1255207416,"description":"John Mortimer - The Sound Of Trumpets - read by Rik Mayall - BBC Audiobook\n\n\n\nJohn Mortimer's novel is set in Blair's Britain, with Terry Flitton standing as New Labour's candidate for the safe Conservative seat of Hartscombe and Worsfield South. The by-election has been caused by the mysterious death of the sitting MP (wearing a leopard skin bikini, his hands manacled behind his back and a ping-pong ball in his mouth)...\n\nRead by Rik Mayall, and abridged by Neville Teller\n\nTen episodes of approx 15 minutes each.\n\n\n\n\nEpisode 1:\nAn MP is found dead. A by-election is called. And Lord Titmuss gets involved.\n\nEpisode 2:\nTerry Flitton meets Agnes Simcox, owner of `The Dust Jacket', Hartscombe's local independent bookshop. And what is the mystery surrounding Slippy Johnson, current at the Skurfield Young Offender's Institute?\n\nEpisode 3:\nIn a surprise development, a Tory runs the Labour campaign in a forthcoming by-election.\n\nEpisode 4:\nTerry Flitton goes horse-riding with Agnes Simcox and canvassing with his beautiful wife Kate, as his appearance on a local radio chat show has not been favourably received.\n\nEpisode 5:\nTerry Flitton is unintentionally caught up in the Hartscombe Hunt and is embarrassed to find his photograph on the front page of `The Sentinel'.\n\nEpisode 6:\nLord Titmuss is up to his usual skullduggery as he discovers the New Labour candidate in an embrace with Agnes Simcox and the truth surrounding the mysterious death of the former MP for Hartscombe and Worsfield South.\n\nEpisode 7:\nLord Titmuss has brought Terry to the brink of victory but now he could bring him disaster. Blackmail and political manoeuvring abound as polling day looms.\n\nEpisode 8:\nLabour candidate Terry Flitton takes his seat and meets his old flame.\n\nEpisode 9:\nWill Terry Flitton become Labour MP for Hartscombe and Worsfield South? Will his affair with Agnes Simcox be exposed? All this and much more is revealed in this penultimate episode.\n\nEpisode 10:\nThe political shenanigans in the constituency of Hartscombe and Worsfield South come to a climax in this final episode from John Mortimer's novel.\nWill Lord Titmuss still be king of his local area, or has his crown been usurped?\n\n\n\nType : mpeg 1 layer III\nBitrate : 128\nMode : joint stereo\nFrequency : 44100 Hz\nEncoder : Lame 3.95\nSize: 127 MB\n\n\n\nRipped from the audio torrent site radioarchive.cc - Registration is FREE!!\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:f7a8b02791fbaeeb5c42bdb6e71980c28a6d32cb","amp;dn":"The+Sound+of+Trumpets+-+John+Mortimer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7a8b02791fbaeeb5c42bdb6e71980c28a6d32cb","infoHashBuffer":{"type":"Buffer","data":[247,168,176,39,145,251,174,235,92,66,189,182,231,25,128,194,138,109,50,203]},"announce":[],"urlList":[]}}