{"title":"ESET NOD32 Antivirus 4.2.71.2 Business Edition (x86/x64)","uid":6165214,"size":94051477,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f8aeec07b097ee8da2dbfd66691ad1d67dfc8a4b&amp;dn=ESET+NOD32+Antivirus+4.2.71.2+Business+Edition+%28x86%2Fx64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fairooz80","files":1,"time":1297361683,"description":"Antivirus System that provides well balanced, state-of-the-art protection against threats endangering your PC\nNOD32 provides well balanced, state-of-the-art protection against threats endangering your PC and enterprise systems running various platforms from Microsoft Windows through a number of UNIX/Linux, Novell, MS DOS operating systems to Microsoft Exchange Server, Lotus Domino and other mail servers.\n\nTrojans, viruses, worms and other malware using NOD32 are kept out of striking distance of your valuable data. Advanced detection methods implemented in the software even provide protection against the future threats from most of the new worms and viruses.\n\nThe fourth generation of the NOD32 Antivirus System features a fully integrated software suite characterized by an unprecedented detection track record, the fastest scanning rates and extremely low utilization of system resources.\n\nNOD32's detection efficiency combined with 2-50 times faster hard disk scanning rate earned the product many international prestigious awards.\n\nNOD32 is the world leader of the Virus Bulletin 100% Awards having won more awards (21) than any competing product. Since its first submission for testing in May 1998, NOD32 was the only tested product that has never missed a single In the Wild virus.\n\nHere are some key features of &quot;ESET NOD32 Antivirus&quot;:\n? ThreatSense technology - a single optimized anti-threat engine for analyzing code to identify malicious behavior, such as viruses, spyware, adware, phishing and more\n? Unprecedented heuristic analysis capable of discovering new malware threats as they emerge\n? Powerful virtual PC emulation technology enables unpacking and decryption of all types of archives and run-time packing\n? Able to clean active malware running in memory\n? Protects at multiple infiltration points, including HTTP, POP3, SMTP and all local and removable media\n? Removes infections from files that are locked for writing (e.g., loaded DLL file)\n? Prevents infected files from being opened and executed, and warns on creation of infected files\n? Automatic execution on system startup\n? Supports multiple Terminal Server environments\n? Supports scanning of mapped network disks\n\nSystem Requirements\nProcessor Architecture: i386(Intel?80386) AMD?64 (x86-64)\nOperating Systems: Microsoft?Windows? 7/ 2000/ XP/ Vista?\nMemory: 44 MB\n\nWhat's new in ESET NOD32 Antivirus 4.2.71.2:\nFix: Lockups on certain system configurations\nFix: Memory leaks when gui stays maximized for a longer period of time\nFix: Mail saved as Draft is scanned with antispam and moved to the Junk folder in Windows Live Mail\nAdded: Button for adding applications to the list of applications excluded from content filtering\nAdded: Support for scanning SSL in Firefox 4\nAdded: Support for SAGETECH Enterprise Right Management\nAdded: Support for Cisco ASA WebSSL Smart Tunnel\nAdded: Support for Parallels Virtuoso\n\n\nESET NOD32 Antivirus 4 (32-Bit)\nMicrosoft Windows 7/Vista/XP/2000\n\nESET NOD32 Antivirus 4 (64-Bit)\nMicrosoft Windows 7/Vista/XP (64-bit)\n\n\nInstallation Notes:\n1. Extract and Install x64 or x86 Eset Nod32 AV.\n2. Use The Fix of your Choice (Read the Appropriate ReadMe.txt)\nEnjoy !!!","torrent":{"xt":"urn:btih:f8aeec07b097ee8da2dbfd66691ad1d67dfc8a4b","amp;dn":"ESET+NOD32+Antivirus+4.2.71.2+Business+Edition+%28x86%2Fx64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8aeec07b097ee8da2dbfd66691ad1d67dfc8a4b","infoHashBuffer":{"type":"Buffer","data":[248,174,236,7,176,151,238,141,162,219,253,102,105,26,209,214,125,252,138,75]},"announce":[],"urlList":[]}}