{"title":"Cawthorne-Bamboo Cage(American POWs in Vietnam)(1991)","uid":5006564,"size":942185,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8ae0c84316b83c33b52b41c7c534ffea58d08bb&amp;dn=Cawthorne-Bamboo+Cage%28American+POWs+in+Vietnam%29%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"red_gonzo","files":1,"time":1247755993,"description":"This is Nigel Cawthorne's shocking book The Bamboo Cage - The True Story of American POWs in Vietnam (1991) which cracks open the biggest cover-up since the Watergate scandal - (still) missing American soldiers in Vietnam. 20 years ago, the war in Vietnam grounds to a bloody halt. But now, long after the boys were officially sent home, evidence remains that over 2,000 American soldiers are still missing in Southeast Asia. What happened? Where are they? And why has the government kept this evidence secret from the American people? In this shocking expose, Cawthorne is not afraid to point fingers. He reveals all the evidence - from the CIA documents and Pentagon files to war-ravaged Hanoi. The author spent three years tracking down missing American soldiers, traveling extensively in America, Australia and Southeast Asia. Americans have long believed that US prisoners of war were held in Southeast Asia after the end of the Vietnam war. Rambo went to get them but the American government denied they were there. You will be stunned after learning the dirty secrets behind the American government's cruel, illegal withholding of crucial information. Read the true story of the men held in The Bamboo Cage. 300 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:f8ae0c84316b83c33b52b41c7c534ffea58d08bb","amp;dn":"Cawthorne-Bamboo+Cage%28American+POWs+in+Vietnam%29%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8ae0c84316b83c33b52b41c7c534ffea58d08bb","infoHashBuffer":{"type":"Buffer","data":[248,174,12,132,49,107,131,195,59,82,180,28,124,83,79,254,165,141,8,187]},"announce":[],"urlList":[]}}