{"title":"Deep Purple - In Rock (1970) WMA320","uid":6293001,"size":134726388,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f8d0ce023c306748291b094fd9df2f6a15ea668c&amp;dn=Deep+Purple+-+In+Rock+%281970%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1301892429,"description":"In the spring of 1970, Deep Purple released a milestone in the history of hard rock/heavy metal with their fourth studio album 'In Rock'. Except for the first two Black Sabbath records that sandwiched the release of this one, there was no more important lp in the history of metal then this momunment to aural destruction. This album changed the future of heavy music and defined the difference between late '60's hard rock and '70's metal. Purple's new lineup with singer Ian Gillan and bass player Roger Glover had particpated in the previous year's recording with the Royal Philharmonic so this was their debut proper with the band. And what a debut!!!! Demolishing what was an eccentric classical-psychedeilic sound into a guitar dominated sonic assault, Ritchie Blackmore effectively took musical control of the band and cemented his name among rock's guitar immortals. Highlights include the album opener &quot;Speed King&quot; and for some bizarre reason the opening minute and a half of the song was edited out for US release. Are you kidding me??? Thank God it's now available on this edition. The crash and burn into followed by Lord's piece set you up for the dynamics of the song and the entire record! &quot;Child in Time&quot; is a flawless display of virtuousity as both Gillan and Blackmore pull out all the stops. &quot;Hard Lovin' Man&quot;, &quot;Into the Fire&quot;, &quot;Bloodsucker&quot;, &quot;Living Wreck&quot; and &quot;Flight of the Rat&quot; (great solo from Ian Paice!) fill an album with no filler! Seven cuts and they all count. Purple would conquer their homeland with this record and pre-release single &quot;Black Night&quot; which appears along with several bonus cuts on this 25th anniversary issue. Many people feel that 'Machine Head' is better but I think that's nonsense!. 'In Rock' rips your head off and stomps it into the ground! Mercy!\n\nby Mark H. &quot;mrh&quot; \n\nTRACKLIST:\n\n01 - Speed King.wma                                              \n02 - Bloodsucker.wma                                             \n03 - Child In Time.wma                                           \n04 - Flight Of The Rat.wma                                       \n05 - Into The Fire.wma                                           \n06 - Living Wreck.wma                                            \n07 - Hard Lovin' Man.wma\n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!","torrent":{"xt":"urn:btih:f8d0ce023c306748291b094fd9df2f6a15ea668c","amp;dn":"Deep+Purple+-+In+Rock+%281970%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8d0ce023c306748291b094fd9df2f6a15ea668c","infoHashBuffer":{"type":"Buffer","data":[248,208,206,2,60,48,103,72,41,27,9,79,217,223,47,106,21,234,102,140]},"announce":[],"urlList":[]}}