{"title":"Caza.a.la.espia.BRScreener.Castellano.avi","uid":6139494,"size":1552354968,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f90baafea3601acace4d307e9d28f0a75a46bdd7&amp;dn=Caza.a.la.espia.BRScreener.Castellano.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"erato99","files":1,"time":1296441173,"description":"Calidad de video: Blu-Ray Screener\nPeso: 1500 mb\nIdioma del audio: Espanol\n\nComo agente secreta de la Division de Anti-proliferacion de la CIA, Valerie Plame (Naomi Watts) dirige una investigacion sobre la existencia de armas de destruccion masiva en Irak. Su marido, el diplomatico Joe Wilson (Sean Penn), acaba colaborando con ella. La investigacion no confirma la venta de uranio enriquecido por parte de la Republica de Niger. Pero, cuando la administracion de la Casa Blanca ignora sus conclusiones y utiliza el asunto para respaldar la entrada de Estados Unidos en la guerra de Irak, Joe escribe un editorial en el New York Times haciendo publicos los resultados de la investigacion, lo cual desencadena una encendida polemica. Poco despues, un periodista de Washington desvela la identidad de Valerie. En estas circunstancias, la protagonista tendra que afrontar una dura batalla para sacar a la luz la verdad, salvar su impecable reputacion, su carrera y su vida privada.\n\nNarra la historia real de Valerie Plame, una agente de la CIA cuya identidad fue desvelada por miembros de la Casa Blanca, supuestamente para desacreditar a su marido, que en el ano 2003 habia escrito un polemico articulo en el New York Times. En dicho articulo, el marido de Plame acusaba a la administracion Bush de haber manipulado a la Agencia Central de Inteligencia con respecto a la existencia de armas de destruccion masiva por parte del regimen de Sadam Hussein, para poder asi justificar la invasion de Irak. \n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:f90baafea3601acace4d307e9d28f0a75a46bdd7","amp;dn":"Caza.a.la.espia.BRScreener.Castellano.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f90baafea3601acace4d307e9d28f0a75a46bdd7","infoHashBuffer":{"type":"Buffer","data":[249,11,170,254,163,96,26,202,206,77,48,126,157,40,240,167,90,70,189,215]},"announce":[],"urlList":[]}}