{"title":"Jeff Buckley - Live in Chicago (2000) DVD-R","uid":6132316,"size":8163860527,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f930b2086f0b93a0cba780ee5e362b0c758d7c2d&amp;dn=Jeff+Buckley+-+Live+in+Chicago+%282000%29+DVD-R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bludStain","files":-1,"time":1296172574,"description":"Amazon.com\nSinger, songwriter, and guitarist Jeff Buckley's untimely death gives this 108-minute live performance inevitable poignancy and power as a rare, complete document of his passionate writing and playing style. At the time of Buckley's ascendance in the mid-'90s, both his high-flying vocal attack and his edgy poetic sense struck older listeners as genetic markers from his father, folk-rock legend Tim Buckley. Yet Buckley fils pursued a much more electric, rock-ribbed style, nodding toward behemoths like Pearl Jam and even Led Zeppelin.\n\nThis 1995 concert is a single, complete show from the tour that yielded the posthumous Mystery White Boy live album. It likewise impresses, both for Buckley's own songs and the bold cover choices included, here including songs associated with Nina Simone and the MC5 (a range that explains the emotional epics that Buckley favors).\n\nVisually, the unadorned lighting scheme casts an often harsh light on the pale, dark-haired frontman, but a generally solid performance is sonically captured with satisfying detail, and the 5.1 surround sound mix gives the DVD version an appropriate club ambience. The DVD also includes two bonus acoustic performances. --Sam Sutherland\nProduct Description\nStudio: Sony Music Release Date: 09/10/2002 Rating: Nr ","torrent":{"xt":"urn:btih:f930b2086f0b93a0cba780ee5e362b0c758d7c2d","amp;dn":"Jeff+Buckley+-+Live+in+Chicago+%282000%29+DVD-R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f930b2086f0b93a0cba780ee5e362b0c758d7c2d","infoHashBuffer":{"type":"Buffer","data":[249,48,178,8,111,11,147,160,203,167,128,238,94,54,43,12,117,141,124,45]},"announce":[],"urlList":[]}}