{"title":"NoMeansNo -[1988]- The Day Everything Became Isolated And Destro","uid":5074781,"size":444057707,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f9459504618aef0dfddcfda116514954246702a4&amp;dn=NoMeansNo+-%5B1988%5D-+The+Day+Everything+Became+Isolated+And+Destro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kislithepothead","files":20,"time":1251731236,"description":"NoMeansNo are a bass-led 3-piece from Canada. Forming in 1979 with brothers Rob (bass and vocals) and John Wright (drums, keyboards and vocals) they made their first recordings in their parents' basement. Musically their influences originated from jazz and prog-rock as much as from punk - which their music is often labeled. The music press described their earliest recordings as &quot;Devo on a jazz trip, MotÃƒÂ¶rhead after art school or Wire on psychotic steroids.&quot;\n\nAndy Kerr of Infamous Scientists joined the band in 1984 on guitar and vocals, leaving in 1993 to be replaced by guitarist Tom Holliston from Showbusiness Giants and The Hanson Brothers, this final three-piece line-up has stood the test of time and the band continue to record and tour, most recently Southern Records released the 2006 album All Roads Lead To Ausfahrt.\n\nSmall Parts Isolated And Destroyed was their third full-length first released in 1988 compiled together with the EP The Day Everything Became Nothing, aptly titled The Day Everything Became Isolated And Destroyed. These recordings show NMN at the height of their creativity and their early obsession with social order in its many strands. The band's trademark genre-defiance is in full effect, with blistering punk/hardcore tracks like &quot;Dead Souls&quot; and &quot;Teresa Give Me That Knife&quot; to the long, noisy jazzcore of &quot;Small Parts Isolated And Destroyed&quot; and the amazing &quot;Brother Rat/What Slayde Says&quot;, the latter functioning almost like a spoken word piece. Lyrically, NMN are treating the ups and downs of everyday life itself as the epic rigours, odysseys and iliads that we must struggle to survive. Why sing about evil celestial visitors and battles between God and Satan when we actually have to live with the real-life evils of willful ignorance, sorrow, filth, alienation, defeat, loneliness and dishonesty?\n\nUnavailable for many years, Wrong Records finally bring us this classic album in all its glory.\n\n\nEAC rip, has log and cue; NMR, splitted, tagged (incl RG)\n\nEnjoy and seed","torrent":{"xt":"urn:btih:f9459504618aef0dfddcfda116514954246702a4","amp;dn":"NoMeansNo+-%5B1988%5D-+The+Day+Everything+Became+Isolated+And+Destro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9459504618aef0dfddcfda116514954246702a4","infoHashBuffer":{"type":"Buffer","data":[249,69,149,4,97,138,239,13,253,220,253,161,22,81,73,84,36,103,2,164]},"announce":[],"urlList":[]}}