{"title":"Rosamunde Quartett - Haydn - The Seven Words TQMP","uid":5124034,"size":279403507,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f951576e0218a4ecdec5c21ac2511788e26638ea&amp;dn=Rosamunde+Quartett+-+Haydn+-+The+Seven+Words+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"zootallure","files":14,"time":1255517710,"description":"When I uploaded 15 Mike Oldfield in a row, I was accused of transforming TQMP and TPB in a Mike Oldfield...bah, whatever, heh, heh! \nSince I have a lot more Zappa than Mike to up, I decided to take a break and up this one for a classic intermezzo and for my friend Breezin.\nEnjoy!\n\nThe Rosamunde Quartett is a German string quartet ensemble formed in 1992. It is named after Franz Schubert's String Quartet No.13 D.804 and the incidental music Rosamunde on which the slow movement of this piece is based. Its members consist of Andreas Reiner (violin), Diane Pascal (violin), Helmut Nicolai (viola), and Anja Lechner (cello).\n\nSince the  debut at the Berlin Festival in 1992 and Munich in 1993, the Rosamunde Qartet took the successful &quot;leap to the top&quot; and membership in the elite quartet of high-guild &quot;. The ensemble has since been considered one of the most important and innovative quartets established. Performances in major music centers such as   the Hercules Hall in Munich, at the Schwetzingen Festival, in Amsterdam's Concertgebouw, London's Wigmore Hall, the Zurich Tonhalle, the Megaron in Athens, and the Berlin Philharmonic had an amazing  response from critics and audiences. New view of the large, well-known masterpieces, but also the special move to as yet unknown masterpieces of our time to determine the repertoire - from Purcell and Haydn to Silvestrov, Mansurian, Larcher and the music of Bandoeneon legend Dino Saluzzi with which they worked together with their project &quot;Kultrum.\n\n\nSince 1997, the Rosamunde Quartet records exclusively for ECM NEW SERIES. After the German Record Critics Prize for the first CD on ECM, a Grammy nomination for Silvestrov CD  and many other records of the predicate &quot;reference recording&quot; (Haydn 7 words), the CD with the quartets of the Austrian composer Thomas Larcher brought the prize of the German Record Critics award again. In the fall of 2009 they will release the latest recording on ECM, a nocturne by Othmar Schoeck with Christian Gerhaher. To a wider audience, the quartet has been known by the world's ARD broadcast production &quot;Celibidache Heritage - with the Rosamunde Quartet on the road.&quot; The first violinist of the Quartet, Andreas Reiner, plays on the famous &quot;King Max Joseph&quot; Stradivarius from 1702.\n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:              &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:f951576e0218a4ecdec5c21ac2511788e26638ea","amp;dn":"Rosamunde+Quartett+-+Haydn+-+The+Seven+Words+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f951576e0218a4ecdec5c21ac2511788e26638ea","infoHashBuffer":{"type":"Buffer","data":[249,81,87,110,2,24,164,236,222,197,194,26,194,81,23,136,226,102,56,234]},"announce":[],"urlList":[]}}