{"title":"Neil Gaiman's A Short Film About John Bolton","uid":5043080,"size":333625815,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f9c4fc5ef1eab5bf73e8532cf03dffca87751033&amp;dn=Neil+Gaiman%5C%27s+A+Short+Film+About+John+Bolton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ZmBLivi0N","files":5,"time":1249488314,"description":"I hope everyone enjoys this. There seemed to be an obnoxious A SHORT FILM ABOUT JOHN BOLTON-shaped hole in the scene so I thought I'd fill it. \n\nMr. Gaiman is my all-time favorite author. SANDMAN is my all-time favorite comic. The bastard can really weave a tale. I may have the slightest of man-crushes on him.\n\nIf you enjoy this film and you're so inclined, look for the full DVD version I'm also uploading. It includes &quot;over 2 hours of additional material,&quot; including a making-of interview with Neil, commentary track with Neil and actor Marcus Brigstocke, and a 1hr 43min &quot;feature-length benefit performance by Neil: LIVE AT THE ALADDIN.&quot; \n\n---------------------------------------------------------\n\nNeil Gaiman's A Short Film About John Bolton\n    \nGenre..........: (fake) Documentary \nRuntime........: 27 mins \nLanguage.......: English \nCountry........: UK\nSize...........: 318mb\nSource.........: NTSC DVD\nIMDB Rating....: 7.2/10 (149 votes)\nIMDB URL.......: http://www.imdb.com/title/tt0420181/\n\n---------------------------------------------------------\n\nFrom the DVD case:\n\n&quot;Gaiman is, simply put, a treasure house of story.&quot;\n -Stephen King\n\n&quot;Gaiman is on a plane all his own. His stories are unlike anyone else's.&quot; \n -Peter Straub\n\n&quot;Gaiman is a star.&quot; \n -Clive Barker\n\nFrom the cult author and filmmaker Neil Gaiman - the endlessly creative genius behind the otherworldly film fantasy MirrorMask, The Sandman graphic novels, the BBC-TV series Neverwhere, and the U.S. adaptation of Princess Mononoke - comes A SHORT FILM ABOUT JOHN BOLTON, a darkly hip and hilarious film which explores the quesetion that torments artists of every medium: &quot;Where do your ideas come from?&quot;\n\nRenowned artist John Bolton's paintings of voluptuous she-vampire nudes have earned this quiet eccentric a reputation for having a &quot;damaged imagination.&quot; BBC radio personality Johnathan Ross buys his pieces, which leads interviewer extraordinaire Marcus Brigstocke to find out what the appeal is in Bolton's beautiful (but terrifying) artwork. Why does Bolton demand that his gallery &quot;monsterpieces&quot; speak for themselves? What does he do with that ornamental knife that he carries everywhere? Will Marcus ever learn how to operate the camera?\n\nSmart and stylish, writer/director Neil Gaiman's A SHORT FILM ABOUT JOHN BOLTON is an unforgettable oddity. And, also, for the first time on DVD Live at the Aladdin - a feature-length recording of Gaiman's October 2000 benefit performance, including interviews with Gaiman's colleagues and fans. ","torrent":{"xt":"urn:btih:f9c4fc5ef1eab5bf73e8532cf03dffca87751033","amp;dn":"Neil+Gaiman%5C%27s+A+Short+Film+About+John+Bolton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9c4fc5ef1eab5bf73e8532cf03dffca87751033","infoHashBuffer":{"type":"Buffer","data":[249,196,252,94,241,234,181,191,115,232,83,44,240,61,255,202,135,117,16,51]},"announce":[],"urlList":[]}}