{"title":"Indubious- Cosmic Seed , Fresh Leaves","uid":5193064,"size":122646123,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fa3df9c057d758cfcc069f5db03ea64df092c9a9&amp;dn=Indubious-+Cosmic+Seed+%2C+Fresh+Leaves&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"djdank000","files":29,"time":1259792806,"description":"Rising up out out of the fertile soil of Southern Oregon's Rogue Valley, the group of Intergalatic Reggae Revolutionaries known as Indubious come straight from the heavens above to spread the word of love and light through their epic sound. Leaving audiences stunned, and downright amazed, this genre-bending reggae power trio comes pumping a positive message, and wielding impressive instrumental skill. Their infectious reggae driven sound has exploded both national and international markets, igniting a revolution, and leaving in the wake a mob of loyal fans, affectionately called Indubians.\n\nThe band is comprised of bass virtuoso and lyrical acrobat, Spencer &quot;Skip&quot; Wicked  Burton, the exceptional keys, songwriting, and lyrical ability of his brother Evan &quot;Evton B&quot; Burton, and the newest addition, the drum phenom, Matthew T. Wells. They blend together a mix of authentic dancehall and new roots reggae tracks, visionary lyrical messages, and insane electro funk fusion jams to create a sound destined to change the face of music. \n\n&quot;Cosmic Seed,&quot; The highly anticipated followup album, is an undeniable powerhouse of a record. Released exclusively through Righteous Sound Productions, &quot;Cosmic Seed&quot; features 15 new tracks and some heavyweight guest artists such as the legendary Prezident Brown and Righteous Sound new-comer, Alcyon Massive. Cosmic Seed has a little bit for everyone in all age groups and for all musical tastes. Upliftment is eminent.","torrent":{"xt":"urn:btih:fa3df9c057d758cfcc069f5db03ea64df092c9a9","amp;dn":"Indubious-+Cosmic+Seed+%2C+Fresh+Leaves","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa3df9c057d758cfcc069f5db03ea64df092c9a9","infoHashBuffer":{"type":"Buffer","data":[250,61,249,192,87,215,88,207,204,6,159,93,176,62,166,77,240,146,201,169]},"announce":[],"urlList":[]}}