{"title":"V/A - American Primitive Vol. II [MP3-192Kbps/VBR] Vol. 2 !!!","uid":5068037,"size":204154206,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fac94fe9c4f945adadcdc18db6c560642039c2f9&amp;dn=V%2FA+-+American+Primitive+Vol.+II+%5BMP3-192Kbps%2FVBR%5D+Vol.+2+%21%21%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"frostyfreeze","files":50,"time":1251107738,"description":"taste the love of all things children, i have to admit this makes all love honest and to desire the feeling of socialism - ahh, so fine &amp; f*ck capitalism - frosty\n\nto all who have been trying in vain to get this little baby i don't know, the torrent was like a busted mule &amp; i've been out - re-ripped in what i feel is a more suited format and dear godds, i hope we got er goin this time !!\n\nbetter list below at any rate (haha) you can see where i jacked the list from and check audio samples here: http://www.emusic.com/album/Various-Artists-Revenant-Records-Koch-Dist-American-Primitive-Volume-2-Pre-war-Revenants-MP3-Download/10912743.html\n\nplease enjoy &amp; you'll just have to deal with the way my thing named the files because, damn that's a lot of typing... i noticed that i had it spelled as 'primative', in the previous torrent which is just wrong... sorry about that one folks.\n\nseed seed till your eye dem bleed !!\n\nVARIOUS ARTISTS - \nAMERICAN PRIMITIVE VOL. II:\nPRE-WAR REVENANTS (1897-1939)\nREVENANT [RVN 214]\n\nDISC I\n01. I Want Jesus to Talk with Me - Homer Quincy Smith 2:51\n02. Deal Rag - Walter Taylor 2:51\n03. Motherless Child Blues - Elvie Thomas 3:21\n04. Big Bed Bug (Bed Bug Blues) - Tommy Settlers and His Blues Moaner 2:37\n05. I Got Your Ice Cold Nugrape - Nugrape Twins 2:55\n06. Molly Man - (Red Hot) Old Mose 3:08\n07. Black Dog Blues - Bayless Rose 3:09\n08. Workhouse Blues - Mattie May Thomas 2:00\n09. Bo-Lita - Kid Brown and His Blue Band 2:42\n10. My Mama Always Talked to Me - John Hammond 2:30\n11. Ballin' the Jack - The Salty Dog Four 3:06\n12. Friday Moan Blues - Alfred Lewis 3:15\n13. Pick Poor Robin Clean - Geeshie Wiley 3:14\n14. It's Cold in China Blues - The Mississippi Moaner 2:50\n15. Black Sheep Blues - Pigmeat Terry 3:08\n16. Old Hen Cackle - The Two Poor Boys/Joe Evans &amp; Arthur McClain 2:43\n17. Frisco Blues - Bayless Rose 3:08\n18. Hot Time Blues - WIlliam Harris 2:56\n19. Take a Look at That Baby - The Two Poor Boys/Joe Evans &amp; Arthur McClain 3:17\n20. Skinny Leg Blues - Geeshie Wiley 3:13\n21. Little Birdie - John Hammond 2:47\n22. Little Girl in Rome - Otto Virgial 2:37\n23. Dangerous Blues - Mattie May Thomas 1:35\n24. Mean Low Blues - Blues Birdhead 3:14\n25. Be My Kid Blues - Elizabeth Johnson 3:01\n\nDISC II\n01. Last Kind Words Blues - Geeshie Wiley 3:02\n02. Poor Mourner - Cousins &amp; DeMoss 1:59\n03. Jamestown Exhibition - Bayless Rose 2:48\n04. There's a City Built of Mansions - Nugrape Twins 2:58\n05. Cairo Blues - Henry Spaulding 2:40\n06. Two White Horses in a Line - The Two Poor Boys/Joe Evans &amp; Arthur McClain 2:51\n07. Shrimp Man - (Red Hot) Old Mose 2:54\n08. Don't Mistreat Your Good Boyfriend - The Bubbling Over Five 3:16\n09. Bull Frog Blues - WIlliam Harris 3:10\n10. Purty Polly - John Hammond 3:08\n11. Go Down Moses - Homer Quincy Smith 3:05\n12. Over to My House - Wiley and Thomas 3:28\n13. Shaking Weed Blues - Tommy Settlers and His Blues Moaner 2:42\n14. Big Mac from Macamere - Mattie May Thomas 2:38\n15. Moaning the Blues - Pigmeat Terry 2:50\n16. Original Blues - Bayless Rose 2:46\n17. John Henry Blues [Take 3] - The Two Poor Boys / Joe Evans &amp; Arthur McClain 2:46\n18. Sobbin' Woman Blues - Elizabeth Johnson 3:18\n19. Bad Notion Blues - Otto Virgial 2:43\n20. Eagles on a Half - Geeshie Wiley 3:04\n21. Mississippi Swamp Moan - Alfred Lewis 3:17\n22. Red Cross the Disciple of Christ Today - Moses Mason 3:10\n23. Kansas City Blues - WIlliam Harris 3:03\n24. As Free a Little Bird as Can Be - John Hammond 2:32\n25. No Mo' Freedom - Mattie May Thomas 0:51\n\n\nREVIEW\nby Richie Unterberger, All Music Guide\n\nIn the early days of the recording industry, many folk performers made just a few records, or only one record, before vanishing, their life stories and basic biographical data untraceable to this day. American Primitive, Vol. 2 assembles 50 tracks from such performers on this two-disc set, most from the late '20s and early '30s (the sole cut predating 1926 is Cousins &amp; DeMoss' &quot;Poor Mourner,&quot; from 1897). On one level, then, this is an incredibly valuable compilation for serious collectors of early American folk and blues music -- &quot;names too obscure even for Harry Smith&quot; (overseer of the revered Anthology of American Folk Music collections), as the liner notes declare. That's true -- not a one of these names will be familiar outside the hardcore collector circle. Mississippi blueswoman Geeshie Wiley is about the most &quot;famous,&quot; and that's about as much for the unavailability of hard information about her as for her music. On a more general level, however, the anthology's of great value to anyone with an interest in such material, not just serious collectors, on several accounts. The level of the performances is almost up to par with those of the more famous early blues and folk musicians. The variety, from rural blues and Appalachian folk to gospel, ragtime, and minstrel-ish novelty, is much greater than it is on most such anthologies. The mastering, courtesy of the fine folks at Revenant, is about as good as it'll get for such aged discs, and the whole lot is given Revenant's usual scrupulous yet entertaining annotation. What you'll find particularly engaging will depend upon your particular tastes, but some of the more ear-opening digs into this archive include the sharp, pinching acoustic blues guitar of Henry Spaulding's &quot;Cairo&quot;; Homer Quincy Smith's penetratingly funereal &quot;Go Down Moses&quot;; the disconsolate humming of Pigmeat Terry; and the masterful blues-folk guitar picking on Bayless Rose's instrumental &quot;Frisco Blues.&quot; Overall, it's a testament to the variety of expression picked up on record at a time when deciding what to record, and how to perform what was recorded, was a much more spontaneous exercise than it would usually be in later eras.","torrent":{"xt":"urn:btih:fac94fe9c4f945adadcdc18db6c560642039c2f9","amp;dn":"V%2FA+-+American+Primitive+Vol.+II+%5BMP3-192Kbps%2FVBR%5D+Vol.+2+%21%21%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fac94fe9c4f945adadcdc18db6c560642039c2f9","infoHashBuffer":{"type":"Buffer","data":[250,201,79,233,196,249,69,173,173,205,193,141,182,197,96,100,32,57,194,249]},"announce":[],"urlList":[]}}