{"title":"Katy Perry - Thinking Of You (2nafish)","uid":5186155,"size":156928004,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:facaaeb5ff790d9e8854a141dd4949f1823407a7&amp;dn=Katy+Perry+-+Thinking+Of+You+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1259480422,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Thinking of You&quot; is the third single of Katy Perry from her 2008 album One of the Boys. It is one of three tracks from the album written solely by Perry and the first single since Ur So Gay to be produced by another producer (Butch Walker), besides Dr. Luke. Perry performed the song as the official single of her hit album, One of the Boys for the first time on MuchMusic HQ's MuchOnDemand on December 15, 2008.\n\n&quot;Thinking of You&quot; also features on the compilation CD's Now That's What I Call Music! 72 and Now That's What I Call Music! 30 of the UK and US respectively. The song was included in the international soundtrack to India, A Love Story, an Emmy-winning Brazilian telenovela, which helping to propel &quot;Thinking of You&quot; up the charts in both Brazil and Portugal, where the telenovela is shown.\n\nPerry revealed on her blog that she had already started filming a second and official music video in the first week of December 2008, directed by Melina. The video premiered exclusively on iTunes on December 23, 2008.\n\nThe music video is presented as a flashback montage with a young woman (played by Perry) whose lover is killed in France during the Second World War. Perry is clearly not pleased with her new love and longs for her deceased lover to be back. It features actor Matt Dallas as Perry's true love and model Anderson Davis as Perry's second love in the video. The music video for song has received more than 15 million views on\n\n&quot;Thinking of You&quot; debuted in the Bubbling Under Hot 100 chart at 5, a couple of weeks later it finally charted in the Hot 100 at 79, and within three weeks it rose to its current peak position of 29 and stayed in this position for 3 consecutive weeks. The song debuted on the Canadian Hot 100 at 58, on the following week it rose twenty four places to its current peak position of 34. In Ireland the song debuted at 50 but the next week dropped out of the top 50. The song debuted at 63 in the UK despite minimal airplay on music channels and radio. The song peaked at #27 on the UK Singles Chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:facaaeb5ff790d9e8854a141dd4949f1823407a7","amp;dn":"Katy+Perry+-+Thinking+Of+You+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"facaaeb5ff790d9e8854a141dd4949f1823407a7","infoHashBuffer":{"type":"Buffer","data":[250,202,174,181,255,121,13,158,136,84,161,65,221,73,73,241,130,52,7,167]},"announce":[],"urlList":[]}}