{"title":"Scud - The Disposable Assassin [ADULT]","uid":5505913,"size":591218894,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:facbd87b4b32068ce6ec30fba1e8fafde3e72363&amp;dn=Scud+-+The+Disposable+Assassin+%5BADULT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1271807303,"description":"Scud: The Disposable Assassin is a humorous, hyperkinetic science fiction comic by Rob Schrab about a world in which one can buy weapons out of vending machines, the most popular of which are intelligent robots that kill a specified target and then self-destruct.\n\nThe series centers on Scud, an average Heart Breaker Series 1373 model assassin. On his first mission, he is sent to kill Jeff, a rampaging female mutant with mousetraps for hands, an electrical plug for a head, and a squid for a belt.  During the mission to kill Jeff, Scud glances in a mirror and sees the warning label on his back explaining how he will self-destruct upon completion of his mission. Realizing that he doesn't want to die, Scud mortally wounds Jeff, shooting off her arms and legs and then takes her to a hospital placing her on life support ensuring their mutual survival.  The main plot follows Scud's career as a freelance mercenary and assassin, working to pay off Jeff's medical bills.\n\nIssue, #20, leaves the series with a cliffhanger. Schrab was growing dissatisfied with the direction the story was taking, and stepped back from the book rather than allow things to get worse.  In 2007 Schrab announced that he planned to finish Scud in four parts.  Issues #21-24 were released by Image Comics in 2008.\n\nAlso included;\n\n\nScud: Tales from the Vending Machine \nAn anthology of sorts, with each issue about a different Scud model. Each issue is created by a different creative team, including artists such as Trent Kaniuga  (Creed), Jim Mahfood (Clerks), and Doug TenNapel (creator of Earthworm Jim). \n\n\nLa Cosa Nostroid\nChronicles the rise and fall of Tony Tastey as he takes over the cyborg mafia. As he eliminates his enemies, he becomes increasingly paranoid and starts to kill off his allies and friends.  Nine issues were released with the final issue ending on a cliffhanger.  \n\n\nDrywall: Unzipped\nTells the origin of Scud's multi-zippered sidekick.\n\n\nThe Drywall and Oswald Show\nFollows the continuing adventures of Drywall and Oswald. \n\n\nDue to mature content this torrent comes with an ADULT rating.\n\n\nReleased on http://ComicPirates.info\t","torrent":{"xt":"urn:btih:facbd87b4b32068ce6ec30fba1e8fafde3e72363","amp;dn":"Scud+-+The+Disposable+Assassin+%5BADULT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"facbd87b4b32068ce6ec30fba1e8fafde3e72363","infoHashBuffer":{"type":"Buffer","data":[250,203,216,123,75,50,6,140,230,236,48,251,161,232,250,253,227,231,35,99]},"announce":[],"urlList":[]}}