{"title":"The Accused Dvdrip H264 Bookerdog.mp4","uid":4986495,"size":832254304,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fae2ededfe8fe790f6d99a65538fcf77c40af5a7&amp;dn=The+Accused+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookerdog","files":-1,"time":1246735703,"description":"Category\tDramas, Recommended, Essential Cinema, True Story, Vengeance, Injustice, Law/Lawyers, Rape\nStarring\tJodie Foster, Kelly McGillis, Steve Antin, Leo Rossi, Bernie Coulson\nDirector\tJonathan Kaplan\nScreenwriter\tTom Topor\nSoundtrack English; Soundtrack French; Dolby Digital 5.1 Re; Sensor Matic; CD Included\nA film inspired by the notorious barroom rape that occurred in New Bedford, Massachusetts in 1983. An evening at a local bar turns violent when three men push a woman onto a pool table and rape her -- as many of the bar's patrons cheer them on. When she learns that the rapists have plea-bargained their way into a lesser charge (meaning that the rape never officially occurred), the woman and her lawyer take a novel approach: they prosecute the &quot;spectators&quot; for encouraging the criminals.\n\nJodie Foster won deserved acclaim for her performance as Sarah Tobias, a hard-living, fiercely independent woman is gang raped in the back of a local bar. She finds herself battling the legal system not once but twice, as she and her attorney Kathryn Murphy (Kelly McGillis) go after her attackers and the onlookers whose cheering fueled and encouraged the assault. Based on a true story which occurred in New Bedford, Massachusetts. Academy Awards: Best Actress--Jodie Foster.","torrent":{"xt":"urn:btih:fae2ededfe8fe790f6d99a65538fcf77c40af5a7","amp;dn":"The+Accused+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fae2ededfe8fe790f6d99a65538fcf77c40af5a7","infoHashBuffer":{"type":"Buffer","data":[250,226,237,237,254,143,231,144,246,217,154,101,83,143,207,119,196,10,245,167]},"announce":[],"urlList":[]}}