{"title":"India Arie - Ready For Love","uid":5014346,"size":144400388,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fb812c3018b933895259cb8fe24c4b1df0ded450&amp;dn=India+Arie+-+Ready+For+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1248148064,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nThis video has no logos.\n\nAcoustic Soul is the debut album by American soul/R&amp;B singer India.Arie, released in 2001. It was nominated for seven Grammy Awards in 2002, including &quot;Album of the Year&quot; and &quot;Best R&amp;B Album&quot;.\n\nAcoustic Soul was released on March 27, 2001 and debuted at number ten on the U.S. Billboard 200 and number three on the Top R&amp;B/Hip-Hop Albums. Within months, without the concentrated radio airplay that typically powers pop and rap albums, Acoustic Soul was certified double platinum, selling 2.18 million copies in the U.S. and 3 million worldwide. While Arie and the album were nominated for seven Grammy awards in 2002, they won no awards, losing in five of seven categories to Alicia Keys. She closed the ceremony with a performance of her song &quot;Video&quot;.\n\nIndia.Arie (born India Arie Simpson on October 3, 1975) is a Grammy Award winning American soul, R&amp;B, and neo soul singer-songwriter, record producer, guitarist, and flautist.\n\nArie was born in Denver, Colorado. She absorbed musical skills early in life as she was encouraged by both parents. Her mother Joyce is a former singer (she was signed to Motown as a teenager and opened for Stevie Wonder and Al Green) and is now her stylist. Her father is former ABA and NBA basketball player Ralph Simpson. She has an older brother named J'On. After her parents divorced, Arie's mother moved the family to Atlanta, Georgia when she was thirteen. Arie had taken up a succession of musical instruments throughout her schooling in Denver, but her interest in the guitar while attending the Savannah College of Art and Design, in Savannah, led to a personal revelation about songwriting and performing. &quot;When I started tapping into my own sensitivity, I started to understand people better. It was a direct result of writing songs&quot;, she said at the press release of her debut album, Acoustic Soul.\n\nCo-founding the Atlanta-based independent music collective Groovement EarthShare (Groovement was the collective artists' name and EarthShare was their independent label name), her one-song turn on a locally-released compilation led to a second-stage gig at the 1998 Lilith Fair. In 1999, a Universal/Motown music scout spotted her and made an introduction to former Motown CEO Kedar Massenberg.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:fb812c3018b933895259cb8fe24c4b1df0ded450","amp;dn":"India+Arie+-+Ready+For+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb812c3018b933895259cb8fe24c4b1df0ded450","infoHashBuffer":{"type":"Buffer","data":[251,129,44,48,24,185,51,137,82,89,203,143,226,76,75,29,240,222,212,80]},"announce":[],"urlList":[]}}