{"title":"Boinx FotoMagico v3.7.3 + sn","uid":6309658,"size":58298035,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:fb8f3366723c3821daf70dea6a0a37d88754b64d&amp;dn=Boinx+FotoMagico+v3.7.3+%2B+sn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1302492344,"description":"Official Web SIte:  &lt;a href=&quot; http://www.boinx.com/fotomagico/overview/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.boinx.com/fotomagico/overview/&lt;/a&gt;\n\nFotoMagico lets you create professional slideshows from your photos and music with just a few, simple mouse clicks. It sports a very clean and intuitive yet powerful user interface. High image quality, fast performance, and user flexibility were some of the design goals for this application.\n\nCreate the most spectacular slideshows:\nScale, move, rotate, zoom or pan around your images to highlight that part that matters the most.\n\nYour slides fit together perfectly with the new, gorgeous transitions.\nProvide more meaning with subtle titles here and there.\n\nPerform a breathtaking show:\n\nYour slideshow uses the best possible resolution of your presentation device.\n\nUse large displays, HDTV screens and other high resolution devices.\nEven on a VGA projector, your photos will look better with FotoMagico.\n\nYour audience will want to take it home:\nBurn DVDs of your slideshow with iDVD or Roxio Toast.\nPut your slideshow on the new iPod.\nExport in almost any QuickTime format.\n\nVersion 3.7.3 Home and Pro - February 1, 2011\nThe FXPack now supports rendering slideshows with motion blur.\nNumerous fixes for crashing bugs in iMedia Browser.\n\nImages from Lightroom can once again be dragged from iMedia Browser to a FotoMagico document. You no longer get a placeholder image. For those cases where the processed image is truly missing, the placeholder image has been improved to provide a better explanation of how to fix the situation.\n\nBugfix for Aperture plugin failing to export because of missing slideshow notes.\n\nBugfix for black frames rendered by the Final Cut Pro plugin (FxPack).\nAnimations in looped slideshows now render correctly at the loop-around point in the Final Cut Pro plugin (FxPack).\n\nModifications to the demo slideshow can no longer be saved, as this would corrupt the application if it was bought from the App Store.\nDVD sharing plugin now selects the best format (NTSC or PAL) upon first use.\n\nVarious small fixes\n\nDon't get alarmed if the spinning ball comes up a lot - just wait until it finishes and add your next file to the slide show.\n\nTo get different transitions, you must select one for each photo in the slide show under the &quot;options&quot; menu below the photos.\n\nI'm sure you'll be able to figure out the rest of the program...\n\nSystem Requirements:\n\nMac OS X 10.5 or later\nIntel processor G5\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:fb8f3366723c3821daf70dea6a0a37d88754b64d","amp;dn":"Boinx+FotoMagico+v3.7.3+%2B+sn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb8f3366723c3821daf70dea6a0a37d88754b64d","infoHashBuffer":{"type":"Buffer","data":[251,143,51,102,114,60,56,33,218,247,13,234,106,10,55,216,135,84,182,77]},"announce":[],"urlList":[]}}