{"title":"Aerosmith - Rockin' The Joint (2005) 320 vtwin88cube","uid":6185826,"size":145294331,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fb90a4f86e60c7c60766604eb3494b4fdf9f5b70&amp;dn=Aerosmith+-+Rockin%5C%27+The+Joint+%282005%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1298106066,"description":"\n\nAerosmith\nRockin' The Joint\nLive At The \nHard Rock Hotel\nLas Vegas (2005)\n\n\nAerosmith was one of the most popular hard rock bands of the '70s, setting the style and sound of hard rock and heavy metal for the next two decades with their raunchy, bluesy swagger. The Boston-based quintet found the middle ground between the menace of the Rolling Stones and the campy, sleazy flamboyance of the New York Dolls, developing a lean, dirty riff-oriented boogie that was loose and swinging and as hard as a diamond.\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tRock\nSource:\t\t\tFlac Conversion\n\nA year after the 2004 live DVD You Gotta Move, Aerosmith unleashes another live release with Rockin' the Joint. This 11-track album was recorded live on January 11, 2002 at the Las Vegas Hard Rock Hotel &amp; Casino as the quintet was pushing their 2001 album Just Push Play. The band offers perfunctory treatments of two tunes from that album -- the crawling opener &quot;Beyond Beautiful&quot; and the vaguely psychedelic &quot;Light Inside&quot; -- and they not only halt momentum here, their careful, market-tested nature doesn't sit well in a set that otherwise draws very heavily from the group's classic '70s work (with the notable exception of &quot;I Don't Want to Miss a Thing,&quot; which sounds even more turgid in a live setting, sandwiched between &quot;Draw the Line&quot; and &quot;Big Ten Inch Record,&quot; than it does in the studio). Since this set list does largely date from the mid-'70s, it's easy to hope that this is a stripped-down, lean, mean live record, but setting makes a big, big difference, and the Las Vegas Hard Rock Hotel isn't some dingy club, or even a good-sized hall. It's a place for slick, flashy, professional entertainment, and Aerosmith delivers accordingly, turning in a polished yet energetic performance that's just this side of pat schtick. Certainly, the band sounds good, arguably tighter than they ever have, but this comes close to sounding like an Aerosmith revue instead of an Aerosmith concert. And while that doesn't make for a bad listen -- apart from the newer songs, the material is all good and the band performs them like the seasoned veterans they are -- it never makes for a compelling one, either.\n\n01.Good Evening Las Vegas\n02.Beyond Beautiful\n03.Same Old Song And Dance\n04.No More No More\n05.Seasons Of Wither\n06.Light Inside\n07.Draw The Line\n08.I Don't Want To Miss A Thing\n09.Big Ten Inch Record\n10.Rattlesnake Shake\n11.Walk This Way\n12.Train Kept A Rollin'\n\n\nCheers!","torrent":{"xt":"urn:btih:fb90a4f86e60c7c60766604eb3494b4fdf9f5b70","amp;dn":"Aerosmith+-+Rockin%5C%27+The+Joint+%282005%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb90a4f86e60c7c60766604eb3494b4fdf9f5b70","infoHashBuffer":{"type":"Buffer","data":[251,144,164,248,110,96,199,198,7,102,96,78,179,73,75,79,223,159,91,112]},"announce":[],"urlList":[]}}