{"title":"Blood and Guts - A History of Surgery COMPLETE","uid":6185157,"size":2530353152,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fbcd4589d60641f1697ddbc7bbfdce51d506f719&amp;dn=Blood+and+Guts+-+A+History+of+Surgery+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"froggykodok","files":5,"time":1298094098,"description":"Blood and Guts: A History of Surgery (in 5 parts)\nDocumentary series looking at the brutal, bloody and dangerous history of surgery.\n\n\nPart 1: Into the Brain:\n\nDocumentary series looking at the brutal, bloody and dangerous history of surgery begins with the area of the body where it has been most frightening - the brain.\n\nJust over 100 years ago, cutting into the brain was a terrifying prospect for both patient and surgeon. They could expect the result to be the surgeon bloodied and defeated, and the patient dead. From freak accidents involving crowbars through the skull to notorious lobotomies with icepicks, this programme reveals how, through mishap and misadventure, brain surgery has become the life-saving discipline it is today.\n\n\nPart 2: Bleeding Hearts:\n\nSeries about the brutal, bloody and dangerous history of surgery continues with a look at the development of heart surgery, which produced some extremely reckless experiments.\n\nWith a family history of heart problems, presenter Michael Mosley takes a personal interest in these pioneers, who teetered on the scalpel-edge between saviour and executioner. Michael has a go at heart surgery, meets a man with no heartbeat and witnesses an operation where the patient is cooled until their brain stops and has all of their blood sucked out.\n\n\nPart 3: Spare Parts:\n\nDocumentary series about the brutal, bloody and dangerous history of surgery continues with a look at the development of transplant surgery, from a Nazi sympathiser to the latest miraculous life- and limb-saving operations.\n\nThese days, transplant surgery saves thousands of lives every year and almost everything, from heart to eyes, can be replaced. But in the beginning, transplants killed rather than cured, because surgeons didn't understand that they were taking on one of the most efficient killing systems we know of - the human immune system.\n\n\nPart 4: Fixing Faces:\n\nDocumentary series about the brutal, bloody and dangerous history of surgery continues with a look at the development of plastic surgery.\n\nThought of as a modern phenomenon, it actually started over 400 years ago with a spate of botched nose jobs. Since then, surgeons have been entranced with the idea that not only could they fix the body, but could even fix our sense of self-esteem.\n\nPresenter Michael Mosley undergoes both 16th-century bondage and 21st-century botox in his journey of discovery.\n\n\nPart 5: Bloody Beginnings:\n\nDocumentary series about the brutal, bloody and dangerous history of surgery concludes with a look at how surgery dragged itself kicking and screaming out of the dark ages, transforming itself from butchery into a science.\n\nPresenter Michael Mosley finds out how the early days of surgery were dark and barbaric, when the surgeon's knife was more likely to kill you than save you, and invasive medicine generally meant being bloodlet by leeches to within an inch of your life.\n\n","torrent":{"xt":"urn:btih:fbcd4589d60641f1697ddbc7bbfdce51d506f719","amp;dn":"Blood+and+Guts+-+A+History+of+Surgery+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbcd4589d60641f1697ddbc7bbfdce51d506f719","infoHashBuffer":{"type":"Buffer","data":[251,205,69,137,214,6,65,241,105,125,219,199,187,253,206,81,213,6,247,25]},"announce":[],"urlList":[]}}