{"title":"STILL GAME-THE CHRISTMAS AND NEWYEAR SPECIALS IN XVID BY KIDZCOR","uid":5490553,"size":1738310529,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fc6aa5d6e723f60f6fa65ffce307596119fb0b50&amp;dn=STILL+GAME-THE+CHRISTMAS+AND+NEWYEAR+SPECIALS+IN+XVID+BY+KIDZCOR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alanwatson","files":-1,"time":1270974050,"description":"Christmas special (2005)\n\nCold Turkey - Jack and Victor fear for their Christmas dinner after being nasty to Isa and Winston gets to grips with his turkey. Meanwhile Frances gives Tam a ton of Christmas cards for him to deliver.\n\n\n\nThe Party - On 31 December 2006, a Hogmanay special of Still Game aired on BBC One Scotland - the show's first Scotland-only broadcast since Series 3. This was the first year that a Hogmanay special of Still Game was shown as in previous years, Chewin' The Fat was aired in its stead; the producers have now stopped working on Chewin' The Fat.[1] The plot, which is similar to the previous stage play (see History) in which Jack, Victor and Winston (also Isa in this version) are stuck in the Osprey Heights lift on their way to a Hogmanay party. The episode, called &quot;The Party&quot;, involved flashbacks to Hogmanay 1975.[2][3] Jack and Victor's wives, Jean and Betty, respectively, appeared in the episode.[4]\n\n\n\nPlum Number - Jack and Victor join the choir. Winston gets a job as a lollipop man. Boaby gets a new puggy for The Clansman with a jackpot of Ã‚Â£1000. Tam enlists the help of Shug and Eric to intercept the slot machine's pay-out ratio but soon, they are joined by Jack and Victor who want their slice of the action.\n\nHootenanny - Jack, Victor, Winston and Tam decide to spend their Hogmanay in a cottage on the remote island of Tighnahulish. Their celebrations are short-lived though when Jack and Victor manage to upset the island's few residents. Meanwhile, in Craiglang, Navid's wife Meena has gone on holiday to India, leaving Navid to enjoy a brief taste of single life.","torrent":{"xt":"urn:btih:fc6aa5d6e723f60f6fa65ffce307596119fb0b50","amp;dn":"STILL+GAME-THE+CHRISTMAS+AND+NEWYEAR+SPECIALS+IN+XVID+BY+KIDZCOR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc6aa5d6e723f60f6fa65ffce307596119fb0b50","infoHashBuffer":{"type":"Buffer","data":[252,106,165,214,231,35,246,15,111,166,95,252,227,7,89,97,25,251,11,80]},"announce":[],"urlList":[]}}