{"title":"The kids are allright (2010) (DVD5)(NL SUBS) Jack TBS","uid":6154189,"size":4687458148,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:fcb165dd3e2f54a6266980bf110d1c5dea30ea33&amp;dn=The+kids+are+allright+%282010%29+%28DVD5%29%28NL+SUBS%29+Jack+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Betty-Boop","files":-1,"time":1296987359,"description":"The kids are allright (2010) (DVD5)\n\n[img]http://img33.imageshack.us/img33/4107/thekidsareallright2010w.jpg[/img]       \n\nTHE KIDS ARE ALLRIGHT\nRegie: Lisa Cholodenko\nMet o.a: Julian Moore, Annette Bening en Mark Ruffalo\n\n\nEigenlijk moet je The Kids Are All Right gewoon beoordelen zoals je dat bij elke Amerikaanse familiefilm zou doen. Complicerende factor is echter dat de film aan het hoofd van het gezin geen vader en moeder heeft staan, maar een moeder en nog een moeder, waardoor je al snel aan eventuele politieke statements begint te denken. Het fijne aan de film van regisseur Lisa Cholodenko is echter de vanzelfsprekendheid van de situatie in dit gezin. Ja, dit is een gezin met twee lesbische vrouwen aan het hoofd. Nou en? Het is ook gewoon een familie zoals elke andere.\n\nNic en Jules zijn al van middelbare leeftijd en hebben niet meer te maken met eventuele vooroordelen van mensen over hun relatie. Ze zijn al jaren getrouwd en gaan, net als zo veel getrouwde koppels, door een dip. De zweverige Jules heeft zich jaren weggecijferd voor haar gezin en voelt zich in haar pogingen een eigen bedrijf te starten niet serieus genomen door haar partner, die op haar beurt last heeft van een alcoholprobleem dat ze weigert onder ogen te zien. \n\nDe zaken worden pas echt gecompliceerd als hun twee kinderen Joni en Laser op zoek willen naar hun biologische vader. Die vinden ze in de persoon van de relaxte Paul, een levensgenieter die het in eerste instantie geestig vindt dat hij twee kinderen blijkt te hebben, maar naarmate de tijd verstrijkt merkt dat hij de afwezigheid van een eigen gezin ervaart als een gemis in zijn leven. Paul trekt steeds meer op met de twee kinderen, tot onvrede van Jules die bang is dat ze haar zorgvuldig opgebouwde leventje begint kwijt te raken.\n\nThe Kids Are all Right is de jaarlijkse feelgoodverrassing uit Amerika. Vergelijkingen met Juno en Little Miss Sunshine zijn zeker op zijn plaats, omdat ook deze film zware onderwerpen op een zeer luchtige toon aan de kaak stelt. Maar meer nog dan die twee films is The Kids Are All Right vooral ontzettend grappig. Het scenario van Lisa Cholodenko en Stuart Blomberg behoort tot het beste dat dit jaar uit Hollywood is komen overwaaien en dat is met name te merken aan de scherpe, hilarische dialogen die je om de oren vliegen. Ook in het creÃƒÂ«ren van ongemakkelijke situaties, bijvoorbeeld als Paul zijn biologische zoon voor het eerst ontmoet en niet goed weet hoe hij daarmee moet omgaan, zijn de twee scenaristen meesterlijk.\n\nMaar The Kids Are All Right zal vooral herinnerd worden door de geweldige cast. De jonge Mia Wasikowska (bekend uit Alice in Wonderland) is uitstekend als dochter Joni evenals Mark Ruffalo in een atypische rol, maar de film gaat natuurlijk om de twee moeders, gespeeld door de altijd betrouwbare Julianne Moore en Annette Bening. Moore heeft de meer dankbare rol als de zweverige, excentrieke Jules die de perfecte belichaming is voor het leven in Los Angeles, maar het is Annette Bening die het meeste indruk maakt met haar vertolking als vrouw die werk en privÃƒÂ© (vergeefs) in balans probeert te houden. Bening heeft al drie onverzilverde Oscarnominaties op haar naam, maar met deze rol zou het weleens goud kunnen worden\n\n\nEnglish\n\nStoryline\nNic and Jules are in a long term, committed, loving but by no means perfect relationship. Nic, a physician, needs to wield what she believes is control, whereas Jules, under that control, is less self-assured. During their relationship, Jules has floundered in her &quot;nine to five&quot; life, sometimes trying to start a business - always unsuccessfully - or being the stay at home mom. She is currently trying to start a landscape design business. They have two teen-aged children, Joni and Laser, Nic who is Joni's biological mother, and Jules who is Laser's biological mother. Although not exact replicas, each offspring does more closely resemble his/her biological mother in temperament. Joni and Laser are also half-siblings, having the same unknown sperm donor father. Shortly after Joni's eighteenth birthday and shortly before she plans to leave the house and head off to college, Laser, only fifteen and underage to do so... \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0842926/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0842926/&lt;/a&gt;\n\nThe kids are allright\nDVD5\n\nSpeelduur: 106 min.\nGenre: Komedie/Drama\nBron: Retail\nBeeld: 16.9\nAudio: 2.0\nDVD-Video\nDolby Digital\nPAL\nOndertiteling: Nederlands\nMenu: Ja\nExtra: Nee\nCover en label: Ja \nThanks : Rene56\n\n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Komedie\nDrama\nRomantiek\n \nWeblink : http://www.filmtotaal.nl/recensie.php?id=19974 \n\nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt0842926/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0842926/&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.moviemeter.nl/film/62380&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/62380&lt;/a&gt;\n\nTBS\n\nBlack-sam\n\n","torrent":{"xt":"urn:btih:fcb165dd3e2f54a6266980bf110d1c5dea30ea33","amp;dn":"The+kids+are+allright+%282010%29+%28DVD5%29%28NL+SUBS%29+Jack+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcb165dd3e2f54a6266980bf110d1c5dea30ea33","infoHashBuffer":{"type":"Buffer","data":[252,177,101,221,62,47,84,166,38,105,128,191,17,13,28,93,234,48,234,51]},"announce":[],"urlList":[]}}