{"title":"Four Rooms (1995) DD5.1 Retail NL Subs --TBS","uid":6260340,"size":4080280322,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:fd4f93a1d69f25cb4e84d303a8927f37a145c5be&amp;dn=Four+Rooms+%281995%29+DD5.1+Retail+NL+Subs+--TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Saggin","files":-1,"time":1300729424,"description":"Four Rooms (1995) DD5.1 Retail NL Subs\n\n\nNederlands:       \n\nVerenigde Staten\nKomedie / Actie\n98 minuten\n\ngeregisseerd door Allison Anders, Alexandre Rockwell, Robert Rodriguez en Quentin \n\nTarantino\nmet Tim Roth, Madonna en Antonio Banderas\n\nOp oudjaarsavond in hotel Mon Signor in Los Angeles staat bediende Ted (Tim Roth) er \nhelemaal alleen voor. \nPlotseling raakt hij dan verwikkeld in vier vreemde situaties. \nAls eerste komt hij in een kamer waar een groep heksen een ritueel willen uitvoeren, maar ze \nmissen sperma. \nVervolgens komt Ted in een kamer terecht waarin een gewapende man zijn vrouw op het bed heeft vastgebonden. \nDaarna wil een gangster dat Ted voor zijn vervelende kinderen zorgt terwijl hij en zijn vrouw naar een feest zijn en als laatste wil Hollywoodster Chester Rush de hotelbediende gebruiken voor een nogal vreemd spelletje.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/269&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/269&lt;/a&gt;\n\nEnglish\nThe film begins with Ted the Bellhop (Tim Roth) in a room filled with hotel memorabilia \ntalking to Sam the Bellhop (Marc Lawrence) about what a bellhop is. It's New Year's Eve.\n\n&quot;The Missing Ingredient&quot; begins with a bunch of women (including Madonna and Lili Taylor) \nconverging in the Honeymoon Suite. There's a huge cauldron in the room's center. The women \nsend Ted to get a bunch of ingredients, mostly from the kitchen. With the ingredients in \nhand, the women enact a ritual, some of them topless. They are witches. One woman says \nthey intend to reverse the spell that turned their goddess Diana into stone in this very \nroom 40 years ago.\n\nThe witches dance around. Then they begin putting ingredients into the huge cauldron. \nAlas, Eva (Ione Skye) has swallowed one of the ingredients - a man's fresh semen. Ted \nreturns to the room. A witch gives him a $50 tip, telling him he has to make Eva smile. \n\nThe witches leave Ted alone with Eva. Ted tries to entertain Eva by acting silly. She says \nit doesn't matter if she smiles or not. She explains the women are a coven of witches and \ntheir situation with Diana. Ted resists Eva's advances. She then places a spell on him, \ncausing him to be swept away with her. Ted kisses Eva.\nLater, we see them kissing some more. Ted leaves the suite as the witches plus one more \nreturn. Eva says she's &quot;a woman now,&quot; telling them that she and Ted did it in the \ncauldron. The witches continue the ritual. Diana rises from the cauldron, in physical \nform. \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0113101/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0113101/&lt;/a&gt;\n\n\nSpotinformatie\n\nCategorie      : Beeld \nFormaat        : DVD5\nAudio          : English DD 5.1\nBron           : Retail\nOndertitels    : NL\nMenu           : Ja\nGenre          : Komedie / Actie\nCover          : Ja\n\n\nBought by TBS","torrent":{"xt":"urn:btih:fd4f93a1d69f25cb4e84d303a8927f37a145c5be","amp;dn":"Four+Rooms+%281995%29+DD5.1+Retail+NL+Subs+--TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd4f93a1d69f25cb4e84d303a8927f37a145c5be","infoHashBuffer":{"type":"Buffer","data":[253,79,147,161,214,159,37,203,78,132,211,3,168,146,127,55,161,69,197,190]},"announce":[],"urlList":[]}}