{"title":"Niente.Velo.Per.Jasira.2007.iTAL.MD.DVDRip.XviD-SiLENT[volpebian","uid":5011509,"size":692566016,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fd6753920b52d7d4425200ef8daca2c5184a3672&amp;dn=Niente.Velo.Per.Jasira.2007.iTAL.MD.DVDRip.XviD-SiLENT%5Bvolpebian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Volpebianca","files":1,"time":1248019076,"description":"::: Info :::\nTitolo: Niente velo per Jasira\nTitolo originale: Towelhead\nAnno: 2007\nGenere: Drammatico\nDurata: 111\nData Di Uscita: 17 Luglio 2009 (cinema)\nRegia: Alan Ball\nCast: Aaron Eckhart, Toni Collette, Maria Bello, Peter Macdissi, Summer Bishil, Eugene Jones III, Matt Letscher, Robert Baker, Lisa Catara\n\n::: Trama :::\nNiente velo per Jasira segue l'oscura, ardita e a volte esageratamente bizzarra vita di Jasira, tredicenne arabo-americana alle prese con il confuso e a volte spaventoso percorso adolescenziale alla scoperta della sessualitÃƒÂ . Quando la madre la costringe a vivere con l'austero e violento padre libanese a Houston, l'adolescente scopre che la sua famiglia ÃƒÂ¨ considerata strana ed esotica dal vicinato. E peggio ancora, la sua femminilitÃƒÂ  in erba mette a disagio il padre collerico e tradizionalista. Sola, in un ambiente ostile, Jasira cerca di instaurare un legame con i vicini e finisce col trovare conforto e crudeltÃƒÂ  allo stesso tempo. Le regole morali e la sessualitÃƒÂ  la trasformano nell'obiettivo di attacchi di razzismo ed ipocrisia, sia a casa sia a scuola. La ragazza ÃƒÂ¨ attratta da Mr. Vuoso, il riservista dell'esercito, vicino di casa, che l'attira con quantitÃƒÂ  ingenti di riviste maschili e confuse chiacchiere sdolcinate. Tentando di tenere sotto controllo gli ormoni che imperversano, Jasira stringe un'amicizia con relativa intimitÃƒÂ  fisica con un compagno di scuola piÃƒÂ¹ grande, Thomas. Anche questo rapporto maldispone il padre quando scopre che il ragazzo ÃƒÂ¨ nero. Desiderando ardentemente un po' di affetto e accettazione, Jasira incarna la voce principale tra i tanti impegni politici, sessuali e razziali degli uomini della sua vita, cosÃƒÂ¬ diversi fra loro: il padre con le sue idee all'antica sulle donne; Mr. Vuoso, il vicino pericolosamente affascinate; e Thomas che le promette amore nel sesso. Quando Melina, una vicina preoccupata e incinta tenta di aiutarla, l'esplosiva situazione di Jasira giunge a una svolta. Con uno sguardo angoscioso sull'esplorazione fuorviata e confusa dei giovani delle casette a schiera, delle scuole pubbliche e della desolata periferia americana, Jasira vaga per questo mondo e si sorprenderÃƒÂ  nel trovare non solo una vigorosa capacitÃƒÂ  di recupero ma anche un nuovo potere di redenzione.\n\nQualitÃƒÂ  audio 6.5 Video 9.","torrent":{"xt":"urn:btih:fd6753920b52d7d4425200ef8daca2c5184a3672","amp;dn":"Niente.Velo.Per.Jasira.2007.iTAL.MD.DVDRip.XviD-SiLENT%5Bvolpebian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd6753920b52d7d4425200ef8daca2c5184a3672","infoHashBuffer":{"type":"Buffer","data":[253,103,83,146,11,82,215,212,66,82,0,239,141,172,162,197,24,74,54,114]},"announce":[],"urlList":[]}}