{"title":"Norse By Norsewest Return of the Lost Vikings (PSX) (PS1) ePSXe","uid":6226633,"size":116945556,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ffbbda0f67f06fd3f474ad471f0634448e1a843e&amp;dn=Norse+By+Norsewest+Return+of+the+Lost+Vikings+%28PSX%29+%28PS1%29+ePSXe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FuCtUpPuNk","files":7,"time":1299538285,"description":"INSTALLATION:\nUse an Emulator to run the games.\nRecommended: ePSXe 1.6 or 1.7\n\nI have also uploaded the emulator to run this game on the following link:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6174621/ePSXe_1.7.0_%28with_working_gameshark__codebreaker__action_replay%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6174621/ePSXe_1.7.0_%28with_working_gameshark__codebreaker__action_replay%29&lt;/a&gt;\n--------------\n--------------\n--------------\n\nPLOT:\nAfter escaping from Tomator in The Lost Vikings, Eric, Olaf, and Baleog have lived joyous and fruitful vikings lives. Then one day, after returning home from a fishing trip, the vikings get captured by Tomator again. Tomator then calls upon a robotic guard to send them into the Arena, which unfortunately falls short when a system failure happens. During the blackout, the three vikings dismantle the robot piece by piece and wear its parts on their body, thus granting them new abilities. The three vikings are then sent through time once again when Olaf pulls the switch on the time machine that says &quot;Do Not Touch&quot;, which he mistakes for Donuts. Equipped with the new robotic gear from the robot guard they destroyed earlier, Eric, Olaf, and Baleog must fight their way through time once again in order to find their way back home. Along the way, they befriend a werewolf named Fang (Whom they often humorously mistaken for a different animal continuously) and a dragon named Scorch.\n\nCharacter abilities:\n    * Erik now has turbo boots which allow him to jump much higher than before and can smash certain overhead walls with his turbo jump. The helmet also allows him to swim (he is the only of the five characters with this ability).\n    * Baleog's bow and arrow has been replaced with a bionic arm which can smash enemies from distance. The range is somewhat limited compared to his arrows from the first game, but the bionic arm also allows Baleog to swing in the air using special hooks and to grab some items inaccessible to others.\n    * Olaf can release gas that propels him upward, giving him limited aerial range, as well as the power to destroy certain floors. In addition to his hang-gliding abilities, he can also shrink and squeeze through tiny gaps.\n    * Fang can jump, climb walls by clinging to them with his claws, and slash enemies with the claws from close range.\n    * Scorch has a fireball attack which damages enemies and can trigger certain switches. He can also fly until he gets exhausted, at which point he can glide softly down, like Olaf.\n\nGraphics and sound:\nThe sequel was originally released for the SNES in 1994, shortly after the first game. The SNES version used technology very similar to the original installment, with the same cartoonish graphics and basic 16-bit sound and music. Later releases (PC, PlayStation, Saturn) featured significantly altered graphics, CD music and extensive voice acting provided by Rob Paulsen (Erik), Jeff Bennett (Baleog &amp; Fang), Jim Cummings (Olaf, Tomator), and Frank Welker (Scorch).\n\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\nHELP ME SEED MY LOW-SEEDED TORRENTS SO I CAN UPLOAD MORE AND NOT WORRY ABOUT THE OLD ONES!\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\n\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\n\nI HAVE A FEW ONLINE PLAYABLE TORRENTS SO FAR:\nLand of the Dead\nPostal 1 and Postal 2 Share The Pain (All Mods)\nSniper Elite\nSerious Sam: The First and Second Encounter\nNexuiz\nDoom Collection (all the older doom games)  NOTE: This Requires a mod to play online (skulltag), it's free, google it\nOTHERS CAN MOST LIKELY BE PLAYED VIA HAMACHI\n\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:ffbbda0f67f06fd3f474ad471f0634448e1a843e","amp;dn":"Norse+By+Norsewest+Return+of+the+Lost+Vikings+%28PSX%29+%28PS1%29+ePSXe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffbbda0f67f06fd3f474ad471f0634448e1a843e","infoHashBuffer":{"type":"Buffer","data":[255,187,218,15,103,240,111,211,244,116,173,71,31,6,52,68,142,26,132,62]},"announce":[],"urlList":[]}}