{"title":"Kickboxer 2 - The Road Back (1990) - Hyperdrive25","uid":6306890,"size":472794706,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ffcafb07b9989e14c020c1fc3adab10f892758e7&amp;dn=Kickboxer+2+-+The+Road+Back+%281990%29+-+Hyperdrive25&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hyperdrive25","files":4,"time":1302368804,"description":"                  Kickboxer 2: The Road Back (1990) Eng Subs \n               ---==========================================---\nThis sequel continues from the original Kickboxer. Kurt and Eric Sloan have been killed in revenge by Tong Po, under instructions from his manager Sanga. David Sloan (Sasha Mitchell), the youngest and last of the great Sloan dynasty, struggles to keep the family kickboxing gym afloat. His hopes rest on his pupil Brian Wagner (Vince Murdocco) who is a talent for the future and David hopes to get him into the big fights soon.\n\nFinancial problems eventually force Sloan to fight again in a new organization run by a crooked promoter (Peter Boyle). His surprising comeback ultimately attracts the attention of Tong Po who, having been disgraced by Sloans older brothers, seeks to lure their younger sibling back into the ring.\n\nDavid defeats opponent Neil Vargas (Matthias Hues) and retains his title.\n\nBut when Sloan announces his retirement after the bout, Sanga (Cary-Hiroyuki Tagawa), who manages Tong Po, hires a group of thugs to burn down the gym, injuring Sloan and killing one of his young students.\n\nWhile recovering in the hospital, Sloan is visited by Xian Chow (Dennis Chan), who trained his brother Kurt in Thailand. Though David initially wants nothing to do with him, he finally relents and allows Xian to nurse him back to health. Meanwhile, one of Sloan's most promising students (Vince Murdocco) has secured a championship bout and invites Sloan to watch the fight. However, his slated opponent is unexpectedly replaced by Tong Po, who brutalizes the young man and kills him in the ring. Now with no other recourse, Sloan is forced to accept the fight between him and Tong Po. \n\nIt matters to be seen who will be the last man standing... \n\n\nI consider this to be Albert Pyuns best film and his greatest contribution. Just by looking at the fight-photography in this film, you know that he is an A-Grade director among the best of them.\n\nHad Albert Pyun consulted Jean-Claude Van Damme for the fight choreography, this film would have been even more better.\n\nI particularly like the song played in the opening credits: Suns will set and suns will rise, But I still see my brothers eyes, Suns will set and suns will rise, But I.... will always see my brothers eyes...\n\n...................................................................................\n\nThis file can be played with any DIVX/MP4 compatible DVD/VCD Player. \nJust burn the files onto a CD using Nero or Ashampoo Buring Studio by making a DATA CD.\n\nPlayback guide for PC: To play this video make sure you have VLC media player \n                       (VideoLAN) or SMplayer installed on your PC.\n\n\nDownload VLC Media Player: http://www.videolan.org/\n\nDownload SMPlayer: http://smplayer.sf.net/\n\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\nRemember To Keep Seeding. A little seeding goes a long way...\n\n***************************ITS TIME TO GO HYPER!!!**********************\n\nI love to share,\nI love to care,\nI like to sing,\nSo that I can bring,\nA ray of sunshine in your life.\n\n\nRemember: its YOUR WORLD. I just live in it. :) \n\n          *** A BIG THANK YOU FOR ALL YOU SEEDERS OUT THERE! *** \n                            \n                        KEEP UP THE GOOD WORK!\n\n                            I LOVE U ALL!\n\n\n\nP.S. Please put in some comments if you liked this film. Thank you.  \n\n\n\n\n\n","torrent":{"xt":"urn:btih:ffcafb07b9989e14c020c1fc3adab10f892758e7","amp;dn":"Kickboxer+2+-+The+Road+Back+%281990%29+-+Hyperdrive25","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffcafb07b9989e14c020c1fc3adab10f892758e7","infoHashBuffer":{"type":"Buffer","data":[255,202,251,7,185,152,158,20,192,32,193,252,58,218,177,15,137,39,88,231]},"announce":[],"urlList":[]}}