{"title":"Boogie Nights(1997)DVDRip.AC3(ENG)-DROCK","uid":6150440,"size":735482240,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fff7092bc634d4c7e4113ab6374e5ae0d15178a7&amp;dn=Boogie+Nights%281997%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1296858649,"description":"While set within the milieu of the Los Angeles adult film industry, Boogie Nights is less a film about pornography than the serio-comic story of a group of misfits, losers, and lost souls who are embraced by Jack Horner (Burt Reynolds), a director who makes &quot;adult films, exotic motion pictures.&quot; In 1977, while hanging out at a disco, Jack spots Eddie (Mark Wahlberg), the new busboy at the club, and tells him he's convinced &quot;there's something wonderful inside those jeans waiting to get out.&quot; Jack knows his business well and his expert eye has not betrayed him; Eddie is a pornographer's dream -- good looking, remarkably endowed, and willing and able to do as many takes as might be needed. The product of a woefully dysfunctional upbringing, Eddie is not terribly bright but is very ambitious and eager to prove he has a &quot;special something&quot; to share with the world. Eddie changes his name to Dirk Diggler and quickly becomes the biggest star in hardcore. Working alongside &quot;Dirk&quot; in Jack's films are Amber Waves (Julianne Moore), a porn actress who applies her misplaced maternal instincts to anyone who needs nurturing; Rollergirl (Heather Graham), a cheerful but blank-faced high school drop-out who never removes her roller skates; Reed Rothchild (John C. Reilly), a none-too-bright actor, aspiring magician, and failing songwriter; Buck (Don Cheadle), a black actor fascinated with cowboy iconography who wants to open a stereo shop; Scotty J (Philip Seymour Hoffman), a stocky and awkward soundman infatuated with Dirk; Little Bill (William H. Macy), Jack's assistant director, who has trouble dealing with his wife's brazen infidelity; and Colonel James (Robert Ridgely), Jack's backer, who has a weakness for young girls. In the brief, late-'70s moment when porn was chic and sex films seemed poised to break into the mainstream, Dirk becomes a star and Jack a respected name. But a few years later, drugs and pride have taken their toll on Dirk and many of his friends, while the advent of the VCR radically changes the adult movie business; Jack goes from being a &quot;filmmaker&quot; to manufacturing and wholesaling videocassettes, a wealthy but emotionally broken man. In his second film, wunderkind director Paul Thomas Anderson juggled a broad range of characters in a manner reminiscent of Robert Altman's ensemble films, making Boogie Nights a sad but funny story of a makeshift family of damaged people and what happens before and after their brief moment in the sun. \n\nRipped with Handbrake\n","torrent":{"xt":"urn:btih:fff7092bc634d4c7e4113ab6374e5ae0d15178a7","amp;dn":"Boogie+Nights%281997%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fff7092bc634d4c7e4113ab6374e5ae0d15178a7","infoHashBuffer":{"type":"Buffer","data":[255,247,9,43,198,52,212,199,228,17,58,182,55,78,90,224,209,81,120,167]},"announce":[],"urlList":[]}}